{"title":"Jazzbox - Jazz Is The Grass I Cut","uid":4280892,"size":70576304,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:01d9cbeeecc415d83279cb73651a705f9c10e02c&amp;dn=Jazzbox+-+Jazz+Is+The+Grass+I+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xmurik","files":10,"time":1215415559,"description":"Release Date.: 12/23/2007\nStore Date...: 10/15/2007\nSource.......: CDDA\nPacker.......: 0.49g\nStyle........: Electronic / Jazz / Nu-Jazz\nRecord Label.: Music For Dreams*\nCat Nr.......: zzzcd0031\nEncoder......: Lame\nQuality......: VBRkbps\n\nJazzbox - Jazz Is The Grass I Cut                           07:33\nJazzbox - How To Build A Chameleon                          07:21\nJazzbox - Later Than I Thought                              08:51\nJazzbox - Smiling Feat. Louis Armstrong                     06:34\nJazzbox - Spyes Underground                                 06:14\nJazzbox - EIA                                               07:23\nJazzbox - Cars On Film                                      06:21\n                                                           ------\n                                                          50:17 min\n                                                          67,30 mB\n\n\nrelease notes\n\nAnother really nice release from the Music for Dreams crew!\n\n&quot;In a small village with open spaces sits a man isolated from the outside world. A background from Heavy metal, house and electronica gives him an unreligious aproach to jazzmusic. The love for jazz started early and the time was right to challenge this genre off improvisation and mix it with electronic elements. He made the basic tracks and sessions was arranged. Then came the cutting, abusing and reinturpretation off the musical inputs from the cream off the danish jazzscene. A melting pot off improvisation, electronic music and pulsating grooves. A playground with no limits, stretching genre definitions with energi and curiosity.\n\nIt has been an importend guideline to improvise on the computer as well as on the traditional instruments, creating a challenge to the brilliant solos performed by Nikolaj Hess, Kasper Tranberg, Jacob Fisher, Hans Ulrik, Gustaf Ljundberg, Mikkel Hess and Eliel Williams Lazo Linares. The electronic jazzgrooves should be more than just backing, revialing a life off its own by sampling and prosessing small parts of the solos to ekspand the experience off jazz. Each track is an instrumental and energetic journey, with stunning improvisation in both arrangement, composition and performance.\n\nThe only track with vocals is &quot;Smiling&quot; featuring Louis Armstrong. Unpoluted by outside influence the record is Per Ebdrups personal mindtrip with the competance of Kenneth Bager as co-producer.\n\nJazzbox aka. Per Ebdrup aka. Gauzz has produced and remixed for the likes off Camille Jones (The creeps plus full album), Ida Corr, Ike and Tina Turner, Steve Miller band, Kenneth Bager and many others.\n\nYou can&amp;#039;t beat that JAZZZZ! Maybe just a little beat.&quot;","torrent":{"xt":"urn:btih:01d9cbeeecc415d83279cb73651a705f9c10e02c","amp;dn":"Jazzbox+-+Jazz+Is+The+Grass+I+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d9cbeeecc415d83279cb73651a705f9c10e02c","infoHashBuffer":{"type":"Buffer","data":[1,217,203,238,236,196,21,216,50,121,203,115,101,26,112,95,156,16,224,44]},"announce":[],"urlList":[]}}