{"title":"History.Channel.How.The.Earth.Was.Made.XviD.AC3.avi","uid":4243568,"size":1363136512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:03cab071e4cf2217b9f7aaf5da0b91fe435b52d2&amp;dn=History.Channel.How.The.Earth.Was.Made.XviD.AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"heretic576","files":1,"time":1213671248,"description":"There&amp;#039;s a lot of information in How the Earth Was Made, but perhaps the most interesting relates to time. Quite often, the numbers are so staggering that scientists refer to it as &quot;deep time,&quot; an appropriate term when one grapples with the notion that our planet is 4.5 billion years old, or that the oceans were formed by rainfall that lasted literally millions of years, or that 700 million years ago, Earth was completely covered by ice that was a mile thick, with surface temperatures reaching minus 40 degrees Fahrenheit. On the other end of the scale are numbers that seem surprisingly small: for instance, it wasn&amp;#039;t until 220 years ago that the accepted church doctrine regarding the planet&amp;#039;s age (no more than 6000 years, according to the Bible) was seriously challenged and that the key to its past was found in rocks, not scripture, while the discovery that dinosaurs once ruled the Earth came considerably later than that. Using a combination of computer graphics and animation, various drawings and diagrams, photos, location footage, and expert commentary, this fascinating, 94-minute History Channel production takes us from the very beginning, when the planet was formed by meteors colliding in space, through numerous major events (including the appearance of water, granite, and oxygen) and mind-boggling catastrophes (such as mass extinctions caused by volcanic eruptions or the enormous meteor that wiped out 75% of all living things, including the dinosaurs, some 65 million years ago), right up to the present; there&amp;#039;s even a glimpse into the future, when Earth will likely end up as barren and lifeless as Mars (no need to hit the panic button yet, though--a few billion more years will pass before that happens).\n\nFile Name ..........: History.Channel.How.The.Earth.Was.Made.XviD.AC3.avi\nTotal Size (MB) ....: 1,299.99 MB\nTotal Streams ......: 2 Stream(s)\n\nVideo Length .......: 01:30:48\nVideo Codec Name ...: XviD MPEG-4 codec\nVideo Bitrate ......: 1777 KB/s\nResolution .........: 640 x 352\nAspect Ratio .......: 1.81:1\nFramerate ..........: 23.976 FPS\nQuality Factor .....: 0.329 B/px\n\nAudio Codec Name ...: FAST Multimedia AG DVM (Dolby AC3)\nAudio Bitrate ......: 224 KB/s (CBR)\nChannels ...........: 2 Ch\nSampling Rate ......: 48000 Hz\n","torrent":{"xt":"urn:btih:03cab071e4cf2217b9f7aaf5da0b91fe435b52d2","amp;dn":"History.Channel.How.The.Earth.Was.Made.XviD.AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03cab071e4cf2217b9f7aaf5da0b91fe435b52d2","infoHashBuffer":{"type":"Buffer","data":[3,202,176,113,228,207,34,23,185,247,170,245,218,11,145,254,67,91,82,210]},"announce":[],"urlList":[]}}