{"title":"Cowboy Junkies 2001-02-10 @ Grand Theater - Kingston, ON","uid":4057738,"size":482738172,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:040d232b1d8f4260b3f91ef88c940f7d1739fad4&amp;dn=Cowboy+Junkies+2001-02-10+%40+Grand+Theater+-+Kingston%2C+ON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":25,"time":1204458358,"description":" After my first year as archivist in 2000, I started to look for ways to do more for the band. I knew of what the taping community called &quot;matrixing,&quot; where you take a soundboard source of a show and an audience source of a show and time-align them using an audio editing program like Pro Tools. By doing this, you get the solid sound of the soundboard as well as the resonance of the hall from the audience source. Most soundboard tapes sound too dry on their own; blending solves this. As a matter of fact, another band I really like, Widespread Panic, discovered this when they were getting ready to release their double-live CD &quot;Light Fuse, Get Away.&quot; The soundboard tapes were too dry, so they put a call out to tapers for audience recordings of the shows they had multi-tracked to get some of the &quot;live&quot; feel in.\n\nIn early 2001, I proposed the idea to Michael, and he decided it would be an interesting experiment. The band was doing a short three show tour in Canada in February, and we tested it there. Michael had the soundboard taped to 2-track DAT, and I arranged for tapers to be there for audience recording. Jean-Pierre Thibault taped the show on the 10th for me.\n\nAfter receiving both sources, I got a lesson in matrixing from a sound engineer I know named Chris Mickle, who has done some webcasting and live recording for bands like Sonia Dada. Using a program called Saw Pro (Software Audio Workshop), I blended the two sources together, using about 65 percent to 70 percent of the soundboard source and the rest from the audience source. By expanding the waveforms to the smallest time platform, I was able to align them perfectly, a neat trick when neither source has time-code. I had to time-align each track to compensate for &quot;drift,&quot; caused by having the audience recording about 100 feet back from the stage. The results came out quite well. Michael liked the tapes, but ultimately it was decided not to pursue this on a regular basis.\n\nThis show was the first time the band played all three parts of their &quot;River Waltz&quot; trilogy, though they didn&amp;#039;t play them in order. Several months later, at a show in Albany on June 28, 2001, the band finally did play all three in order.\n\nTo this day, the 2001 tour remains one of my favorites in terms of overall song selection and quality of playing.","torrent":{"xt":"urn:btih:040d232b1d8f4260b3f91ef88c940f7d1739fad4","amp;dn":"Cowboy+Junkies+2001-02-10+%40+Grand+Theater+-+Kingston%2C+ON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"040d232b1d8f4260b3f91ef88c940f7d1739fad4","infoHashBuffer":{"type":"Buffer","data":[4,13,35,43,29,143,66,96,179,249,30,248,140,148,15,125,23,57,250,212]},"announce":[],"urlList":[]}}