{"title":"VirtuMonde ( Vundo ) Trojan Remover","uid":4105010,"size":115200,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0467c5dbbfd550e76107f14bc51ebfa833dfe0fa&amp;dn=VirtuMonde+%28+Vundo+%29+Trojan+Remover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheRipster","files":1,"time":1206759116,"description":"VundoFix is a freeware removal tool for many of the known variants of Trojan.Vundo, Trojan.Conhook and other similar infections.\n\nGenerally an updated version is released once a week and in some special cases sometimes 2 or 3 times in a week. The tool has had great success removing the infection from over 1 million computers to date and I hope to continue with that same success into the future.\n\nSigns of infection:\n\nUsually when infected with Vundo the user is bombarded with popups for WinFixer, Amaena, WinAntiVirus, ErrorSafe, SystemDoctor and DriveCleaner. Downloading and running these Fraudware applications will result in a fake scan telling you that you are infected with malware then telling you that you need to buy their program to remove the malware that it found. DO NOT BUY THESE PROGRAMS. They are scams and will not remove anything but could possibly make your infection worse. \n\nA slowdown in PC performance may also be noticed when Vundo is running as well as the possibility of random BSOD&amp;#039;s. \n\nNormal Usage for Removal:\n\n&quot;Download VundoFix&quot; to your desktop. \n\nDouble-click VundoFix.exe to run it. \nWhen VundoFix opens, click the Scan for Vundo button. \nOnce it&amp;#039;s done scanning, click the Remove Vundo button. \nYou will receive a prompt asking if you want to remove the files, click YES \nOnce you click yes, your desktop will go blank as it starts removing Vundo. \nWhen completed, it will prompt that it will reboot your computer, click OK. \n\nIf you encounter a variant of Vundo that VundoFix does not detect or cannot remove please let us know on our forum located at http://www.atribune.org/forums/ in the HijackThis and Malware Removal section. The forum staff is always happy to help with removal of Vundo and other malware as well. ","torrent":{"xt":"urn:btih:0467c5dbbfd550e76107f14bc51ebfa833dfe0fa","amp;dn":"VirtuMonde+%28+Vundo+%29+Trojan+Remover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0467c5dbbfd550e76107f14bc51ebfa833dfe0fa","infoHashBuffer":{"type":"Buffer","data":[4,103,197,219,191,213,80,231,97,7,241,75,197,30,191,168,51,223,224,250]},"announce":[],"urlList":[]}}