{"title":"Meet.The.Spartans.[2008].Spanish.Subtitles","uid":4164301,"size":733528414,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:051f906f0f4c9c555850b7bab18e2a42ec2d3d91&amp;dn=Meet.The.Spartans.%5B2008%5D.Spanish.Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Don.Pablone","files":3,"time":1209529645,"description":"Writers/producers/directors Jason Friedberg and Aaron Seltzer (DATE MOVIE, EPIC MOVIE) use the film 300 as the basis for their latest spoof. Born to be the perfect Spartan, Leonidas (Sean Magiure) faces numerous trials en route to becoming a man, including a face-off with the penguin from HAPPY FEET. Once he has proven himself, Leonidas not only becomes king, but also marries superhot (and slightly slutty) Margot (Carmen Electra). When Leonidas learns that Persia&amp;#039;s King Xerxes (Ken Davitian, BORAT) plans to make Sparta his own, he has his captain (Kevin Sorbo, HERCULES) recruit Sparta&amp;#039;s finest and prepare them for battle against invading Persian forces. Unfortunately, that amounts to only 13 half-naked men with painted-on abs who literally prance to their destination. To make matters worse, Spartan councilman Traitoro (Diedrich Bader) is, well, a traitor. Still, Leonidas and his men face their enemy in battle, riffing on STOMP THE YARD, GHOST RIDER, TRANSFORMERS, and numerous other films along the way, as well as the video game GRAND THEFT AUTO. Freidberg and Seltzer poke fun at virtually every recent cultural phenomenon and pop culture personality, including Britney Spears, Kevin Federline, Paris Hilton, DANCING WITH THE STARS, AMERICAN IDOL, and DEAL OR NO DEAL. Even UGLY BETTY makes an appearance. Be prepared for an abundance of gross-out humor, spurts of bodily fluids, some sexual innuendo, and multiple jokes about homosexuality. Stick around after the musical finale as the credits start to roll: the deleted scenes prove to be some of the most amusing in the film.\n","torrent":{"xt":"urn:btih:051f906f0f4c9c555850b7bab18e2a42ec2d3d91","amp;dn":"Meet.The.Spartans.%5B2008%5D.Spanish.Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"051f906f0f4c9c555850b7bab18e2a42ec2d3d91","infoHashBuffer":{"type":"Buffer","data":[5,31,144,111,15,76,156,85,88,80,183,186,177,142,42,66,236,45,61,145]},"announce":[],"urlList":[]}}