{"title":"Dragon Ball Z: Los Mejores Rivales","uid":4139530,"size":348553216,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:053990c2cbeab33f8fd375b1b1f23c5292c176f7&amp;dn=Dragon+Ball+Z%3A+Los+Mejores+Rivales&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cazomdb","files":1,"time":1208424831,"description":"Como respuesta ante la muerte de Freezer, su hermano mayor, Coola, que posee unos 200 planetas, se dirige a la Tierra con sus soldados Thouser, Naise y Doure. Coola muestra un aspecto muy parecido al de su hermano pequeÃƒÂ±o, aunque a diferencia de ÃƒÂ©ste tiene cuatro tranformaciones (Freezer sÃƒÂ³lo llegÃƒÂ³ a tres). En estos dÃƒÂ­as, Son Gohan es obligado por ChichÃƒÂ­ a estudiar durante largas pero provechosas horas. Pronto, Son Gohan, Gokuu y Krilyn se ven sorprendidos mientras comen. Goku resultÃƒÂ³ bastante herido, aunque Son Gohan consigue llegar a la Torre de Karin para traer las habichuelas mÃƒÂ¡gicas.\nA la vuelta, se encuentra con dificultades, el ejÃƒÂ©rcito de Coola. En este momento apareciÃƒÂ³ Piccolo dispuesto a ayudar a Gohan, con quien un dÃƒÂ­a compartiÃƒÂ³ mucho dÃƒÂ­as, entrenÃƒÂ¡ndolo cuando los guerreros del espacio amenazaban con llegar a la Tierra.AsÃƒÂ­ Gohan, Piccolo y Krilyn se ocupan de Naise, Thouser y Doure, mientras que Goku inicia un duro combate contra Coola, deseoso de acabar con ÃƒÂ©l. Es en esta pelÃƒÂ­cula la primera vez que consigue transformarse en un Super SaiyajÃƒÂ­n, sorprendiendo a su enemigo. Con un poco de energÃƒÂ­a lo envÃƒÂ­o al sol, muy lejos de la Tierra... Piccolo consiguiÃƒÂ³ acabar con uno de los secuaces de Coola con una onda de energÃƒÂ­a, aunque se fue rÃƒÂ¡pidamente sin necesitar el reconocimiento de sus compaÃƒÂ±eros.","torrent":{"xt":"urn:btih:053990c2cbeab33f8fd375b1b1f23c5292c176f7","amp;dn":"Dragon+Ball+Z%3A+Los+Mejores+Rivales","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053990c2cbeab33f8fd375b1b1f23c5292c176f7","infoHashBuffer":{"type":"Buffer","data":[5,57,144,194,203,234,179,63,143,211,117,177,177,242,60,82,146,193,118,247]},"announce":[],"urlList":[]}}