{"title":"Iron Man 2008 (SUBBED) cam READ NFO DivX-KingBen","uid":4168579,"size":779780698,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05552156001472cbc2e62b788664e957849d1141&amp;dn=Iron+Man+2008+%28SUBBED%29+cam+READ+NFO+DivX-KingBen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":4,"time":1209739346,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0371746/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0371746/&lt;/a&gt;\n\n\nPlot:\nWhen wealthy industrialist Tony Stark is forced to build an armored suit after a life-threatening incident, he ultimately decides to use its technology to fight against evil.\n\nIron Man 2008 (SUBBED) cam DivX-KingBen.avi (743.64 megabyte)\n\n\n\nRelease Title Iron Man 2008 (SUBBED) cam READ NFO DivX-KingBen (Kingdom-Release)\nRelease Date 2 May 2008 (UK)\nRelease Length 01:53:16\nStoryline When wealthy industrialist Tony Stark is forced to build an armored suit after a life-threatening incident, he ultimately decides to use its technology to fight against evil.\n\nCast\nRobert Downey Jr. ... Tony Stark / Iron Man\nTerrence Howard ... Jim Rhodes\nJeff Bridges ... Obadiah Stane / Iron Monger\nGwyneth Paltrow ... Pepper Potts\nLeslie Bibb ... Christine Everhart\nShaun Toub ... Yinsen\nFaran Tahir ... Raza\nSayed Badreya ... Abu Bakaar\nBill Smitrovich ... General Gabriel\nClark Gregg ... Agent Phil Coulson\nTim Guinee ... Major Allen\nWill Lyman ... Award Ceremony Narrator\nMarco Khan ... Insurgent #4\nKevin Foster ... Jimmy\nGarrett Noel ... Pratt\n\nGenre Action | Adventure | Drama | Sci-Fi | Thriller\nLanguage English\nOriginal Source Iron Man SUBBED CAM XviD-PreVail\nVideo DivX / 640 x 296 / 25 FPs\nAudio MP3 / 48000Hz 128 kb/s tot , Joint Stereo\nSize 743 MB\n\nNOTE Ok 1st things 1st this is a first cam and it aint the best i have done the usual stuff to it bit more color and stuff i also did some croping as there was a chair in the picture and resized the video looks better but it is a 1st cam so dont bitch and moan i have warned you\n\nscreens &gt;&gt;\n\nDelivers Intelligence &amp; Great Acting with its Fun, 23 April 2008\n\nAuthor: sacflyzone from United States \n\nRest assured, Iron Man is an absolutely amazing movie. I won&amp;#039;t dare spoil any of this remarkable movie for you but I do recommend it as highly as I possibly can. Marvel needed to get in to the solo movie making business long ago. Instead of leasing out their characters to other studios, they&amp;#039;re making movies themselves. Most everyone knows Iron Man is their first effort and what a great lead off film! This movie helps take the comic book genre to the highest level. Just like they did in the books, they reinvent standard epic adventure by &quot;Marvelizing&quot; characters and making them more believable. The Spider-Man and the X-Men movies did this to a degree but only as far as their respective studios wished to stay true to the source material. Anything added or amended was for the benefit of the live action adaptation. Director Sam Raimi pulled this off by talking to the summer crowd, not down to them with the Spider-Man series. Jon Favreau has done the same thing here but I think he&amp;#039;s done it even better. Raimi intentionally threw in a little cheese. Favreau adds nice bits of humor but not too much. He also grounds the action and the suit of armor in firm reality. I&amp;#039;ve said it before but it&amp;#039;s brave to reach for the highest common denominator with a big budget film and Favreau delivers a movie with as much feeling as it has action and intensity. Needless to say, Robert Downey Jr. and company deliver the goods. It&amp;#039;s a movie that has a wonderful balance that delivers intelligence with its fun.\n\nThe amazing yet realistic action is paced by the plot and characters that keep you interested from start to finish. What absolutely blew me away were the phenomenal special effects. I know they built a practical, working armor. What I loved is the use of CGI was used to augment the real life armor and not create something from scratch. Most all CGI constructs feel fake somehow but the stuff in Iron Man didn&amp;#039;t seem fake even for an instant. As great as everything looked, what really drives the movie is the emotional resonance and down to earth nature of the plot. Sure the concept is wild but it&amp;#039;s all presented so that you really believe it could happen. I doubt anyone will find fault with this movie unless they went in trying to dislike it.\n\nThis is, without a doubt going to be one of my top 10 movies of 2008, quite possibly the number one film.","torrent":{"xt":"urn:btih:05552156001472cbc2e62b788664e957849d1141","amp;dn":"Iron+Man+2008+%28SUBBED%29+cam+READ+NFO+DivX-KingBen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05552156001472cbc2e62b788664e957849d1141","infoHashBuffer":{"type":"Buffer","data":[5,85,33,86,0,20,114,203,194,230,43,120,134,100,233,87,132,157,17,65]},"announce":[],"urlList":[]}}