{"title":"Picket Fences - Season 4 SatRip","uid":4270859,"size":5183911936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05c03adec1864417cdfb5d0e0f6974c91b5730e9&amp;dn=Picket+Fences+-+Season+4+SatRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":21,"time":1214934743,"description":"Picket Fences Season 4 SatRip-snowden\n\nPicket Fences deals with life in a small town - in this case the town of Rome, Wisconsin; it centres around the Brock Family. Jimmy Brock is the Sheriff of the town and likes to think he&amp;#039;s the centre of attention. His wife Jill is the town doctor; they have three children: Kimberly, 18, Matthew, 13 and Zachary, 10. A lot happens in this small town from bizarre murders to rape, assault, drunk driving, kidnapping &amp; spontaneous human combustion. It seems that all the crimes that have occurred in the whole of the United States have at one point or another happened in Rome and they have to deal with it in their own quirky way. \n\nThe town of Rome is a short distance from Green Bay, Wisconsin - close enough to hear the games on Sunday afternoons, but not close enough to keep normalcy from infiltrating the town. A lot of the usual happens in Rome, but in unusual ways. Home invasions are nothing new, but in Rome, the perpetrator leaves behind dirty bathwater, women&amp;#039;s underwear and a rubber duck. Potatoes and household appliances become instruments of violence and death, the mayor is a bank robber sentenced to serve her term in office, the coroner likes his work a little too much and cows incubate human embryos. In the middle of all this weirdness is Sheriff Jimmy Brock (&amp;#039;Tom Skerritt&amp;#039;), wife Jill (&amp;#039;Kathy Baker&amp;#039;) their children and a frequently bewildered and endearingly eccentric supporting cast that somehow manages to cope with the bizarre series of events that is day-to-day life in Rome.\n\n( http://picketfences.sytes.net/ )\n\nVideo: 608x464 XviD AVI\nAudio: VBR 128kpbs","torrent":{"xt":"urn:btih:05c03adec1864417cdfb5d0e0f6974c91b5730e9","amp;dn":"Picket+Fences+-+Season+4+SatRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c03adec1864417cdfb5d0e0f6974c91b5730e9","infoHashBuffer":{"type":"Buffer","data":[5,192,58,222,193,134,68,23,205,251,93,14,15,105,116,201,27,87,48,233]},"announce":[],"urlList":[]}}