{"title":"Darkness - John Saul","uid":4276229,"size":64269122,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:05ecb4542045b3ab9ef626f0f2b61d20209db535&amp;dn=Darkness+-+John+Saul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"captainelliotspencer","files":5,"time":1215199563,"description":"                         Darkness\n                       - John Saul -\n\n\nThe prologue of veteran horror writer Saul&amp;#039;s ( Second Child ) new novel is wonderfully scary: A pregnant teenage &quot;swamp rat&quot; of the Everglades, spying on a secret meeting of &quot;the Dark Man&quot; and &quot;his children,&quot; sees a friend offer up her newborn baby, whereupon the masked Dark Man plunges a knife into the infant. Right after that, the teenager&amp;#039;s husband promises to deliver his own child &quot;the night he&amp;#039;s born.&quot; The story proper begins when 16-year-old Kelly Anderson, all her life having suffered nightmares of a menacing old man and now sure she&amp;#039;s pregnant by him, tries to kill herself. She recovers and moves from Atlanta with her adoptive parents to her grandfather&amp;#039;s house just north of the Everglades. Kelly becomes friends with Michael, her age and also adopted, who admits to similar nightmares and a sense of dread. Michael&amp;#039;s adoptive mother, meanwhile, feels a strange kinship to Kelly. The secrets of the Dark Man--his identity and his fountain-of-youth formula--are revealed halfway through the book, and thenceforth the story slides into descriptions of relatively tame to-and-fro-ing, mostly in the swamp, and the revolting revenge of &quot;the children&quot; on a group of nasty but well-preserved old men. Saul&amp;#039;s ending is cozily sentimental.\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!","torrent":{"xt":"urn:btih:05ecb4542045b3ab9ef626f0f2b61d20209db535","amp;dn":"Darkness+-+John+Saul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05ecb4542045b3ab9ef626f0f2b61d20209db535","infoHashBuffer":{"type":"Buffer","data":[5,236,180,84,32,69,179,171,158,246,38,240,242,182,29,32,32,157,181,53]},"announce":[],"urlList":[]}}