{"title":"Shaun Ryder - Amateur Night in the Big Top","uid":4048504,"size":43886986,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:060fa70913063d399b86a0ac6dc2e508aadeeb4d&amp;dn=Shaun+Ryder+-+Amateur+Night+in+the+Big+Top&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uluday","files":8,"time":1204045352,"description":"Shaun Ryder is a legend but his Mondays (and the other days of his week) have not been very happy. He is the man from Manchester and the man from Happy Mondays and Black Grape. After many fall-outs with family members, record labels, managers, and who knows who else, his cousin, Pete Carroll always stood by his side. Pete Carroll began the dance label Off World Sounds in Australia.\n\nJust when people (besides his fans) were forgetting about Shaun Ryder, the movie 24 Hour Party People refreshed everyoneÃƒÂ¯Ã‚Â¿Ã‚Â½s love for Manchester. Even though Shaun Ryder is a legend, his problems were massive. While he always had a drug problem, these days, his main problem was money. A dispute with his former manager froze all of his assets. He cannot collect one dollar (or pound) from any Black Grape music or Happy Mondays profit. Besides the money problem, he is not on speaking terms with his brother or the members of the Mondays or Black Grape.\n\nShaun Ryder flew out to Australia and chilled out with his cousin, Pete Carroll. Together, their love of music prevailed. They recorded the Amateur Night In The Big Top LP. As a group, Amateur Night In The Big Top is more of an experiment. There is nothing commercial about the album. Each song is longer than 6 minutes. As Pete Carroll and Shane made the music, Shaun Ryder basically free-styled his lyrics. Every new project by Shaun Ryder has been different from the next. Black Grape was very different from the music of Happy Mondays, and Amateur Night In The Big Top is just as different again. The street credibility, the nonsense, the drugs, the humour, and the cleverness are all maintained. This is something different. These are not tightly packaged pop songs with choruses that repeat.\n\n\nEnjoy.","torrent":{"xt":"urn:btih:060fa70913063d399b86a0ac6dc2e508aadeeb4d","amp;dn":"Shaun+Ryder+-+Amateur+Night+in+the+Big+Top","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"060fa70913063d399b86a0ac6dc2e508aadeeb4d","infoHashBuffer":{"type":"Buffer","data":[6,15,167,9,19,6,61,57,155,134,160,172,109,194,229,8,170,222,235,77]},"announce":[],"urlList":[]}}