{"title":"Rambo 4.WS.2008.XviD.HHI","uid":4268113,"size":734053102,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06517fa3a3e5f7b4d2e8f64b9135c369f35402a2&amp;dn=Rambo+4.WS.2008.XviD.HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"raidy","files":3,"time":1214796159,"description":"Happy Hacker Industries-RAMBO 4.DVDRIP.XVID                       \n                                                                              \nReLeaSe         Rambo 4                                                       \n     TyPe            Action                                                   \n     LaNGuaGe        English                                                  \n     ReLeaSe DaTe    January 25th, 2008                                       \n     STReeT DaTe     June 15th, 2008                                          \nWideScreen                                                                    \n     auDio           MP3 128Kbps                                              \n     CoDeC           XviD                                                     \n     FRaMe RaTe      23.976 (NTSC)                                            \n     ReSoLuTioN      640 x 272                                                \n\n                     Rogue Marble(2008). Length : 91min                       \n\n\n Vietnam veteran John Rambo has survived many harrowing ordeals in his        \n lifetime and has since withdrawn into a simple and secluded existence in     \n Thailand, where he spends his time capturing snakes for local entertainers,  \n and chauffeuring locals in his old PT boat. Even though he is looking to     \n avoid trouble, trouble has a way of finding him: a group of Christian human  \n rights missionaries, led by Michael Burnett and Sarah Miller, approach       \n Rambo with the desire to rent his boat to travel up the river to Burma. For  \n over fifty years, Burma has been a war zone. The Karen people of the         \n region, who consist of peasants and farmers, have endured brutally           \n oppressive rule from the murderous Burmese military and have been            \n struggling for survival every single day. After some inner contemplation,    \n Rambo accepts the offer and takes Michael, Sarah, and the rest of the        \n missionaries up the river. When the missionaries finally arrive at the       \n Karen village, they find themselves part of a raid by the sadistic Major Pa  \n Tee Tint and a slew of Burmese army men. A portion of the villagers and      \n missionaries are tortured and viciously murdered, while Tint and his men     \n hold the remainder captive. Concerned by their disappearance, the minister   \n in charge of the mission gathers a group of mercenaries and pleas Rambo      \n transport them with his boat, since he knows their last exact location. But  \n Rambo can&amp;#039;t stay behind: he joins the team where he belongs, to liberate     \n the survivors from the clutches of Major Tint in what may be one of his      \n deadliest missions ever                                                      \n                                                                              \n\n\n                           Happy Hacker Industries                            \nThis movie should play fine on most DVD/DivX Certified settop\ndvd players. Feel free to copy and distribute to friends!\n\nHHI thanks you.\n\n","torrent":{"xt":"urn:btih:06517fa3a3e5f7b4d2e8f64b9135c369f35402a2","amp;dn":"Rambo+4.WS.2008.XviD.HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06517fa3a3e5f7b4d2e8f64b9135c369f35402a2","infoHashBuffer":{"type":"Buffer","data":[6,81,127,163,163,229,247,180,210,232,246,75,145,53,195,105,243,84,2,162]},"announce":[],"urlList":[]}}