{"title":"T.T.13","uid":4281020,"size":4324083712,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:065e2ec43c04d2d9ab6a55296a54b3873eb1a89c&amp;dn=T.T.13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Oboz","files":27,"time":1215423872,"description":"La serie mÃƒÂ¡s costosa de la temporada 1966 en la TV norteamericana fue THE TIME TUNNEL, una producciÃƒÂ³n de Irwin Allen, se emitiÃƒÂ³ por vez primera el 6 de septiembre de 1966 a travÃƒÂ©s de la cadena ABC. En EspaÃƒÂ±a la estrenÃƒÂ³ la ÃƒÂºnica televisiÃƒÂ³n que tenÃƒÂ­amos en aquel momento: TVE, en el aÃƒÂ±o 1966. La serie era en blanco y negro y alcanzÃƒÂ³ un ÃƒÂ©xito muy importante en nuestro paÃƒÂ­s, aunque permaneciÃƒÂ³ sÃƒÂ³lo una temporada en TelevisiÃƒÂ³n EspaÃƒÂ±ola. Sus efectos especiales ganaron un Emmy en 1967. La serie fue creada por Irwin Allen, un productor con un gran prestigio en Estados Unidos dentro del campo de la ciencia-ficciÃƒÂ³n.\n\nSu argumento tenÃƒÂ­a al Dr. Tony Newman (James Darren) y al Dr. Douglas Phillips (Robert Colbert), dos cientÃƒÂ­ficos que trabajan para el TÃƒÂºnel del Tiempo, un proyecto secreto del gobierno en un laboratorio subterrÃƒÂ¡neo en Arizona. Pero por un error se ven atrapados en el TÃƒÂºnel errando a travÃƒÂ©s de distintos momentos de la Historia Universal. Del otro lado, en la sala de mandos, permanentemente estÃƒÂ¡n asignados el General Heywood Kirk (Whit Bissell), el Dr. Raymond Swaim (John Zarembra) y la Dra. Ann McGregor (Lee Meriwether).\n\nInteresante fue el aspecto que los protagonistas nunca tenÃƒÂ­an escenas junto al resto del reparto regular. Solo tenÃƒÂ­an que espetar algÃƒÂºn &amp;#039;Ã‚Â¡Tony!&amp;#039; o &amp;#039;Ã‚Â¡Doug!&amp;#039; de vez en cuando a la vez que pulsaban los botones y rodaban los potenciÃƒÂ³metros de los computadores que constituÃƒÂ­an el decorado principal de la sala, siempre bajo la presiÃƒÂ³n de regresar a los cientÃƒÂ­ficos al presente y siempre con alguna explosiÃƒÂ³n (al parecer el TÃƒÂºnel nunca estuvo bien calibrado).\n\nLa premisa de la serie era bastante interesante y pronto acaparÃƒÂ³ la atenciÃƒÂ³n de un pÃƒÂºblico mayoritariamente joven que se fascinaba con la idea de Irwin Allen sobre ciencia ficciÃƒÂ³n, los mismos que anteriormente habÃƒÂ­an seguido VOYAGE TO THE BOTTOM OF THE SEA (Viaje al Fondo del Mar) emitida por TVE una aÃƒÂ±o antes y los que dos aÃƒÂ±o despuÃƒÂ©s disfrutarÃƒÂ­an de otra serie mÃƒÂ­tica &quot;Los Invasores&quot;.\n \nLa visual del TÃƒÂºnel era lo bastante fascinante como para justificar el interÃƒÂ©s: el ojo hipnÃƒÂ³tico que lo representaba fue tambiÃƒÂ©n un sÃƒÂ­mbolo de los psicodÃƒÂ©licos aÃƒÂ±os &amp;#039;60 (aunque la serie no tenÃƒÂ­a mucho de psicodÃƒÂ©lico).\n\n","torrent":{"xt":"urn:btih:065e2ec43c04d2d9ab6a55296a54b3873eb1a89c","amp;dn":"T.T.13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065e2ec43c04d2d9ab6a55296a54b3873eb1a89c","infoHashBuffer":{"type":"Buffer","data":[6,94,46,196,60,4,210,217,171,106,85,41,106,84,179,135,62,177,168,156]},"announce":[],"urlList":[]}}