{"title":"Coast to Coast Radio Program! Commercial Free! Jun 12th thru Jun","uid":4256637,"size":606028922,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:073d66ec4158afe614461e372fb9c7856347cabb&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jun+12th+thru+Jun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":55,"time":1214272119,"description":"Here we are again! I know, I am getting later every time! Anyway, I just wanted to upload this torrent before I forgot. Well, here are eleven more broadcasts of the #1 late night radio program in the history of radio! Thanks in advance to those loyal fans out there who continue to spread these torrents to other sites. Spread the knowledge my friends. I will see you all next week, hopefully..... Stokeman Out....\n\nThursday June 12th, 2008\nThe William Shatner Interview\nDuring the first two hours, actor William Shatner shared stories from his remarkable career including his roles in Twilight Zone, Star Trek, and Boston Legal. He got his start doing radio plays in his native Canada, before moving on to acting for the... \nHost: George Noory\nGuest(s): William Shatner, Seth Shostak, Laurance Doyle\n\nFriday June 13th, 2008\n&amp;#039;Friday the 13th&amp;#039; Open Lines\nDuring Open Lines, George offered a special &amp;#039;Friday the 13th&amp;#039; line. A caller from Beaumont, TX who was born on Friday the 13th said as a child he became convinced he was doomed because of society&amp;#039;s negative view of &amp;#039;13.&amp;#039; He thought his fate was certain... \nHost: George Noory\nGuest(s): Pat Boone, Christian Wilde, Anne Serling, Marc Zicree, Richard C. Hoagland, Open Lines\n\nSaturday June 14th, 2008\nChinese Impact on Western Culture\nRetired British Royal Navy submarine commander and author Gavin Menzies discussed his work chronicling the Chinese discovery of the Americas, and how their technology sparked change in Europe in the 15th century. Menzies argues that the Chinese...\nHost: Ian Punnett\nGuest(s): Gavin Menzies\n\nSunday June 15th, 2008\nReplay: Christopher Moon 10/20/07\nA replay from 10/20/07 was featured with paranormal investigator Christopher Moon talking about his work with &amp;#039;Frank&amp;#039;s Box.&amp;#039; The first hour guest was Charles Ostman. Note: George Knapp will return next Sunday for his originally scheduled interview... \nHost: Ian Punnett\nGuest(s): Christopher Moon, Charles Ostman\n\nMonday June 16th, 2008\nChemtrails, Cell Phones &amp; Air Ships\nAuthor and investigative reporter Will Thomas presented his latest research on chemtrails and cell phone risks, as well as discussed his interest in an emerging air ship technology. A new lab analysis of chemtrail samples (from aerial spraying) done...\nHost: George Noory\nGuest(s): William Thomas, Glynis McCants\n\nTuesday June 17th, 2008\nNessie &amp; Bigfoot\nWriter and producer Lee Frank discussed his expeditions in search of the Loch Ness monster (Nessie), as well as his investigations into the Bigfoot mystery. Sightings of Nessie date back to 565 AD when a Celtic monk reported seeing the creature. Though... \nHost: George Noory\nGuest(s): Lee Frank, Joyce Riley\n\nWednesday June 18th, 2008\nThe Hubble Telescope\nAppearing during the first three hours, author Robert Zimmerman talked about his new book The Universe in a Mirror, which covers the history and discoveries of the Hubble Telescope. Astrophysicist Lyman Spitzer proposed the concept of a telescope in... \nHost: George Noory\nGuest(s): Robert Zimmerman\n\nThursday June 19th, 2008\nProphecy &amp; the Coming Deception\nResearcher L.A.Marzulli discussed how a recent string of events validates notions of a coming great deception, as foretold in ancient prophecies. He cited the Myanmar cyclone, the Chinese earthquake, and other natural disasters, along with the Middle... \nHost: George Noory\nGuest(s): L. A. Marzulli, Dr. Claude Swanson\n\nFriday June 20th, 2008\n&amp;#039;Hope&amp;#039; Line\nDuring Open Lines, George offered a special &amp;#039;Hope&amp;#039; hotline in honor of Coast producer Tom Danheiser&amp;#039;s uncle, who passed away recently. Anthony in Illinois recounted the unusual circumstances surrounding the time his mom was diagnosed with a large brain... \nHost: George Noory\nGuest(s): Open Lines, Wayne Dyer\n\nSaturday June 21st, 2008\nPopulation Control\nDuring the first half of the program, Ian was joined by author Matthew Connelly, who shared his research into the history of world population control and the underlying misconception that all of the world&amp;#039;s big problems (poverty, war, pollution, etc.)... \nHost: Ian Punnett\nGuest(s): Matthew Connelly, Donna Dickenson\n\nSunday June 22nd, 2008\nFlying Saucers and Science\nGeorge Knapp (email) welcomed Ufologist Stanton Friedman for the full four hours, as he discussed his forty years of research on UFOs. &quot;I&amp;#039;ve never seen a flying saucer ... I&amp;#039;ve never seen an alien. My approach is based on collecting, reviewing, and... \nHost: George Knapp\nGuest(s): Stanton Friedman","torrent":{"xt":"urn:btih:073d66ec4158afe614461e372fb9c7856347cabb","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jun+12th+thru+Jun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"073d66ec4158afe614461e372fb9c7856347cabb","infoHashBuffer":{"type":"Buffer","data":[7,61,102,236,65,88,175,230,20,70,30,55,47,185,199,133,99,71,202,187]},"announce":[],"urlList":[]}}