{"title":"ScreenFlow 1.0 [k'ed]","uid":4034116,"size":5086244,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:07f5589117364d21b377ac3a82852c8aa3df00fd&amp;dn=ScreenFlow+1.0+%5Bk%5C%27ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zal91","files":1,"time":1203322791,"description":"Record Everything\nYou don&amp;#039;t need to pick an area of the screen for capture, ScreenFlow has advanced algorithms that only encode areas of change on your screen. The application is powerful enough to simultaneously record from your iSight or DV camera at the same time as your screen (and your microphone and computer&amp;#039;s audio!).\t\n\nThe Best Capture\nScreenFlow has the best screen capture available. Using a custom multithreaded SSE &amp; Altivec accelerated, 64-bit enabled compression system, ScreenFlow can handle everything from capturing DVD video &amp; audio to fast moving Keynote presentations.\nEdit\nOnce your screen capture is complete, you&amp;#039;re transported to the ScreenFlow editor. Using a familiar timeline interface, ScreenFlow lets you easily add zoom &amp; pan effects, trim clips, add drop shadow &amp; reflection, adjust audio levels etc. You can even combine existing media into your screencast.\t\n\nHighlight\nDuring your screen capture ScreenFlow tracks where your mouse cursor is, when you click and when you press a key. This allows you to add mouse click effects (both visual and audible), an overlay showing your key strokes and even let&amp;#039;s you zoom the mouse pointer up &amp; down.\n\nCallout\nCallouts let you highlight &amp; focus in on the mouse or frontmost window. Want to circle the area around the mouse? What took an experienced user minutes or hours in Final Cut Pro or After Effects is now a couple of clicks away.\t\n\nMotion\nScreenFlow introduces actions to the editing interface. These make it very quick &amp; easy to modify parameters of your screencast over time. For example, adding a video action lets you put zoom &amp; pan effects on your clips, while the audio action lets you adjust volume at different points in your screencast.\n\nExport Quality\nWhen resizing high resolution screen content into a QuickTime movie, ScreenFlow uses custom GPU algorithms to give your finished movie the best possible quality. You&amp;#039;ll find even small text suddenly becomes legible for your viewers.\t\n\nLeopard Only\nScreenFlow was designed for Mac OS X Leopard. It makes extensive use the best of Mac OS X technologies: Core Animation, QuickLook, Spotlight, QTKit, Quartz Composer, OpenGL, Core Data and many others.\n   &lt;a href=&quot;\nhttp://www.varasoftware.com/products/screenflow/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.varasoftware.com/products/screenflow/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:07f5589117364d21b377ac3a82852c8aa3df00fd","amp;dn":"ScreenFlow+1.0+%5Bk%5C%27ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07f5589117364d21b377ac3a82852c8aa3df00fd","infoHashBuffer":{"type":"Buffer","data":[7,245,88,145,23,54,77,33,179,119,172,58,130,133,44,138,163,223,0,253]},"announce":[],"urlList":[]}}