{"title":"Daryl Hall -Live from Daryl's House Part 4.WebRip.[PSoul].flv","uid":4030311,"size":241052543,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0810acbe205c49c22096028585a7849317bd3418&amp;dn=Daryl+Hall+-Live+from+Daryl%5C%27s+House+Part+4.WebRip.%5BPSoul%5D.flv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PhillySoul","files":1,"time":1203143173,"description":"Live from Daryl&amp;#039;s House Part 4 (WebRip)\n\nThis Month&amp;#039;s Guests:\n&quot;Especial guest&quot; Travis McCoy from Gym Class Heroes\n\nTom &quot;T-Bone&quot; Wolk (Guitars, Background vocals)\nEliot Lewis (Keyboards, Background Vocals)\nZev Katz (Bass)\nSteve Holly (Drums)\nEverett Bradley (Percussion, Background Vocals)\n\nSet List:\n1) Uncanny\n2) Queen &amp; I\n3) Be Thankful for What You Got\n4) I can&amp;#039;t Stop Dreaming\n5) Wake Up Everybody\n6) Don&amp;#039;t Let Me Be Misunderstood/Adult Education\n7) Everytime You Go Away\n8) Valentine (Debut Song)\n\nDescription:\nTravis McCoy, lead vocalist from Gym Class Heroes, is the special guest of Daryl Hall on the fourth installment of his live webcast, Live From Daryl&amp;#039;s House.\n\nThe two collaborate on a version of the Daryl Hall-penned &quot;Everytime You Go Away,&quot; #1 U.S. and Top 5 U.K. hit in 1985 for  Paul Young, and a brand-new take on &quot;You Make My Dreams,&quot; mashed up with the Gym Class Heroes&amp;#039; track &quot;The Queen and I,&quot; off  of their RIAA-certified Gold release, As Cruel As School Children.\n\nLive From Daryl&amp;#039;s House debuted last Nov. 15, featuring Hall&amp;#039;s longtime collaborator T Bone Wolk, while partner John Oates  guested on the second installment, a holiday special highlighting their Home for Christmas album in December.\n\nHailing from Geneva, NY, Gym Class Heroes&amp;#039; alternative hip-hop style and use of live instruments in favor of canned beats and looped samples caught the attention of Fall Out Boy&amp;#039;s Pete Wentz, who signed them to his Decaydance imprint. The band&amp;#039;s  breakthrough album, As Cruel as School Children, featured one of the biggest hits of 2007, the #1 smash single &quot;Cupid&amp;#039;s Chokehold/Breakfast in America.&quot; Gym Class Heroes also took home the 2007 MTV Video Music Award for &quot;Best New Group&quot;, beating  out the likes of Lily Allen, Peter Bjorn &amp; John, Carrie Underwood, and Amy Winehouse.\n\nMcCoy has long expressed his admiration for Daryl, even going so far as to name one of the band&amp;#039;s previous headlining concert jaunts the Daryl Hall for President Tour &amp;#039;07.\n\nGym Class Heroes is currently in the studio working on the highly anticipated, follow-up to As Cruel As School Children. Hall  guests on the forthcoming, as-yet-untitled album, slated for release this summer.\n\nSaid McCoy of his relationship with Daryl: &quot;Part of me was horrified before working with Daryl to be honest. There are 2  people I hold high on my caste system of people I think are cooler than me, my father being the other. I grew up on Daryl&amp;#039;s  voice. I am forever grateful for the chance to work with and befriend someone I&amp;#039;ve looked up to all these years.&quot;\n\nCommented Daryl: &quot;Words fail to express the fun and creative fulfillment that I had recording and playing with Travis. I  think the combination of his poetry and my musicality came together in a very historic way, and I don&amp;#039;t say that lightly.&quot;\n\nAdds Hall: &quot;I haven&amp;#039;t felt this way since the Apollo Theater, back in the day, when I worked with the Temptations, except now the roles have been reversed.&quot;\n\nEach new edition of Live From Daryl&amp;#039;s House will take place at one of Daryl&amp;#039;s homes in either upstate New York, Maine, London or the Bahamas.\n\n&quot;Daryl&amp;#039;s House is a state of mind,&quot; he says. The latest edition, with Gym Class Heroes&amp;#039; Travis McCoy, is a meeting of musical minds.\t\t\t","torrent":{"xt":"urn:btih:0810acbe205c49c22096028585a7849317bd3418","amp;dn":"Daryl+Hall+-Live+from+Daryl%5C%27s+House+Part+4.WebRip.%5BPSoul%5D.flv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0810acbe205c49c22096028585a7849317bd3418","infoHashBuffer":{"type":"Buffer","data":[8,16,172,190,32,92,73,194,32,150,2,133,133,167,132,147,23,189,52,24]},"announce":[],"urlList":[]}}