{"title":"Bob Kincaid Show - July 02, 2008 (24kbs Audio).mp3","uid":4273947,"size":32467456,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:082d437226493855cbdddde588993de77cd0af8c&amp;dn=Bob+Kincaid+Show+-+July+02%2C+2008+%2824kbs+Audio%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DBaum23","files":1,"time":1215086202,"description":"The Democratic National Committee released a video Wednesday documenting the numerous times presidential candidate Sen. John McCain (R-AZ) has admitted his ignorance on the economy.\n\n\nHere&amp;#039;s McCain, in his own words about himself:\n\nOn ABC News July 2, 2008:\nQ: You have admitted that you&amp;#039;re not exactly an expert when it comes to the economy and many have said -- MCCAIN: I have not. I have not. Actually, I have not.\n\nMcCain campaign town hall meeting in Concord, NH, Dec. 17, 2007:\nMCCAIN: I am not an expert on Wall Street, I am not an expert on some of this stuff.\n\nBefore the Keene Sentinel editorial board, Dec. 4, 2007, regarding the housing crisis in New Hampshire:\nMCCAIN: I can&amp;#039;t come down now and give you a specific solution because I don&amp;#039;t claim to be smart enough.\n\nCNBC Republican Debate, Oct. 9, 2007:\nQ: Has Ben Bernanke cut rates aggressively enough?\nMCCAIN: I don&amp;#039;t have that kind of expertise to know exactly whether he has cut interest rates sufficiently or not.\n\nIn an extended conversation with Tim Russert:\n(In a debate)\nRUSSERT: Senator McCain, you have said repeatedly, &quot;I know a lot less about economics than I do about military and foreign policy issues. I still need to be educated.&quot; Is it a problem for your campaign that the economy is now the most important issue, one that by your own acknowledgement is something you&amp;#039;re not well versed on?\nMCCAIN: Actually, I don&amp;#039;t know where you got that quote from. I&amp;#039;m very well versed in economics.\n(Later, on Meet The Press, Jan. 27, 2008)\nMCCAIN: Now I know where you got that quote from. Now I know where you got that quote.\nRUSSERT: I will show you where I got that quote from. I got it from John McCain, And here it is: &quot;[McCain] is refreshingly blunt when he tell[s] me: &amp;#039;I&amp;#039;m going to be honest: I know a lot less about economics than I do about military and foreign policy issues. I still need to be educated.&quot; [quoted from The Wall Street Journal]\n\nWhile it&amp;#039;s widely accepted that the commander-in-chief can&amp;#039;t directly control the economy, it&amp;#039;d be good to elect someone who at least understands how it works. And with many polls showing the economy as voters&amp;#039; number one issue, McCain would do well to hit the books.\n\nAlso try listening to Thom Hartmann,  Randi Rhodes,  Ed Schultz and Mike Malloy","torrent":{"xt":"urn:btih:082d437226493855cbdddde588993de77cd0af8c","amp;dn":"Bob+Kincaid+Show+-+July+02%2C+2008+%2824kbs+Audio%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082d437226493855cbdddde588993de77cd0af8c","infoHashBuffer":{"type":"Buffer","data":[8,45,67,114,38,73,56,85,203,221,221,229,136,153,61,231,124,208,175,140]},"announce":[],"urlList":[]}}