{"title":"BANACEK 101 Lets Hear It For A Living Legend [retr?tv]","uid":4049486,"size":733085743,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:086e83c61cc88a6e4c0b1862f4fd831cf230ff99&amp;dn=BANACEK+101+Lets+Hear+It+For+A+Living+Legend+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":2,"time":1204086850,"description":"BANACEK (1972)\nBanacek (George Peppard) is a Boston Brahmin who maintains his lifestyle by locating or recovering stolen or missing items for insurance companies for 10% of their insured value. He is assisted by his friend, Felix Mulholland (Murray Matheson). He is also not liked by Henry Dewitt (linden Chiles), the insurance company rep who doesn&amp;#039;t like being beholden to him. And during the second season, he had a rival-love interest in Carlie Kirkland (Christine Belford), an insurance investigator who also works for DeWitt.  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068044/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068044/&lt;/a&gt;\n \n\n1. Let&amp;#039;s Hear it for a Living Legend 9/13/1972\n\nWhen a professional football player vanishes from the field of play before a large crowd and millions of TV viewers, leaving only his helmet behind, Banacek is called in by the owner of the team to solve the mystery of the bizarre disappearance.\n\nGuest star: Stefanie Powers (Angie Ives), Madlyn Rhue (Holly Allencamp), Robert Webber (Jerry Brinkman), John Brodie (Ritchie Mulligan), Deacon Jones (Joe Fabian), Anitra Ford (Susan), Russell Arms (Ambulance Attendant), Bart Burns (1st Reporter), Colby Chester (Corliss), John Finnegan (Lt. Hallohan), Chris Forbes (Debbie), Bud Furillo (2nd Reporter), Curt Gowdy (Himself), Marty Ingels (Himself), Conrad Janis (Video Technician), Charlie Jones (Himself), Michael Lerner (Bartender), Tom Mack (Ed Wolinski), Jock Mahoney (Albert Bates), Chuck Morrell (Hank Ives), Byron Morrow (Grant), Peggy Walton (Dr. Judy Forrest), Gene Washington (Clay Mills) AVI File Details\n\n\nXviD/1.2Mbps/416x304/29.96fps\nmp3/124Kbps/48KHz/Stereo/72min \n\nSo far, I&amp;#039;ve only found 4 episodes covering 2 seasons.\nLeave a comment if you&amp;#039;re interested in seeing them. :)","torrent":{"xt":"urn:btih:086e83c61cc88a6e4c0b1862f4fd831cf230ff99","amp;dn":"BANACEK+101+Lets+Hear+It+For+A+Living+Legend+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"086e83c61cc88a6e4c0b1862f4fd831cf230ff99","infoHashBuffer":{"type":"Buffer","data":[8,110,131,198,28,200,138,110,76,11,24,98,244,253,131,28,242,48,255,153]},"announce":[],"urlList":[]}}