{"title":"MilkDrop for XBMC Preset Update Pack 2005-06-15 (5110 Presets!).","uid":3346594,"size":1097094,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:092510c0568c06b0cc3c20aa7e4214d474b3388c&amp;dn=MilkDrop+for+XBMC+Preset+Update+Pack+2005-06-15+%285110+Presets%21%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KevinSartori","files":1,"time":1119246860,"description":"MilkDrop rocks!\n\nOver at the MilkDrop Resource Website &lt; http://www.milkdrop.co.uk/ &gt; there are 3601 additional presets available for download.  The last preset update package is from 8th October 2003, but Rovastar, the website's maintainer, promises updates after he finishes Winamp plug-in v1.05.  \n\nNow that XBMC supports zipped preset packs, I have decided to repackage this Update Pack.  I know that with my set up, transferring over 3600 little files from my PC to Xbox took almost ten minutes.  Because the 42 character filename limitation of the Xbox doesn't apply to files packaged in a zip file, I decided to go back to the original unmodified preset names.\n\nI took the 3601 presets from the MilkDrop Resource Website and placed them in a folder.  The 435 presets included with XBMC were taken from Winamp.  There was one extra preset not included with XBMC (Rovastar - twisted bytes.milk).  I copied the 436 presets from the current Winamp 5.092 build into that folder, allowing duplicates to be overwritten.  This gave a total of 3657 presets.  Based on the number of presets in my old Update Pack, I suspect there are probably 10 or so duplicate presets in the lot with slighly different filenames.  Based on how much effort it would be to find and eliminate these duplicate presets, I decided to leave them.  If someone wants to try to hunt them down, they are welcome to!  Just let me know which ones they are ;-)  Then I compressed all of the presets together into a Milkdrop.zip archive.  As per instructions on the XBMC forums &lt; http://www.xboxmediaplayer.de/cgi-bin/forums/ikonboard.pl &gt;, I've compressed this .zip archive in &quot;store&quot; mode.  This allows XBMC quicker access to the presets.  As an added advantage for anyone who wants to include this Update Pack in their XBMC builds, compressing the Milkdrop.zip archive with WinRAR in &quot;best&quot; mode brings the file size from 9.33MB to 651KB.  This huge compression savings doesn't work using any other zip mode besides &quot;store&quot;.\n\nWhat's really nice about MilkDrop is how fast it runs on XBMC.  The problem is that it really runs too fast.  MilkDrop for XBMC now supports configuration through a milkdrop.xml.  This Update Pack also includes a modified milkdrop.xml.  After a lot of experimenting, these are the changes I made:\n\nI have &lt;AnisotropicFiltering&gt; set to true.  I have &lt;MeshSize&gt; increased from 32 to 48.  These two settings produce a noticably higher quality image with minimal speed decrease.  Having a &lt;MeshSize&gt; of 64 looks beautiful, but runs very slow.  I have &lt;TimeBetweenPresets&gt; increased from 8 to 14 and &lt;TimeBetweenPresetsRand&gt; increased from 5 to 6.  This way, each effect lasts from 15-20 seconds, instead of 9-14.  Occasionally the current effect changes sooner because of the &lt;HardCutLoudnessThresh&gt; setting.  I increased &lt;BlendTimeAuto&gt; from 1 to 3.  I think the transition from one preset effect to another is one of the most interesting features of MilkDrop and I think the transitions work better at a longer 3 seconds.  I played around a lot with &lt;MaxFPS&gt; and decided that 36 (instead of 50) runs quickly, but is not as insane (or nausea-inducing).  Incidentally, the default &lt;MaxFPS&gt; is set on Winamp to 30, but I found 30 to be a bit too slow.\n\nI also wanted to mention that when MilkDrop for XBMC was first released, there was a problem with &quot;too many presets.&quot;  This problem was fixed when milkdrop.xml was created and the default setting for &lt;enablerating&gt; was set to false.  This eliminated the slowdown and repeating preset problem that came with having too many presets.  There are still XBMC builds that mention in their build notes that you shouldn't use any extra presets because this causes problems, slowdowns, etc.  This is not true and refers to the old issue that has been corrected.  Now, granted, some of the presets in this Update Pack are complex and will run slower than 36 fps, but I estimate that this affects 1-2% of the included presets, possibly less.  Considering how infrequently this slowdown happens, I definitely think it's a worthwhile trade-off for the sheer variety of effects you gain.  I'm definitely taking a &quot;quantity over quality&quot; stance here.\n\nInstallation:\nExtract the visualisations folder into your XBMC folder and you're good to go!  You will be replacing milkdrop.xml and Milkdrop.zip.  This Milkdrop.zip includes the 435 presets from the normal XBMC build, the one extra preset taken from Winamp 5.092, plus the 3221 extras from the MilkDrop Resource Website, for a total of 3657 presets.\n\n*UPDATE 2005-06-15:\nThere have been some nice changes to the XBMC port of MilkDrop that I think are worth detailing.\n\n14-06-2005 added: Pixel ratio parameter added to the visualisation Create function and more Direct X exports.\n14-06-2005 changed: Milkdrop - now renders with correct aspect ratio.\n\nFor users that have widescreen TVs, MilkDrop is no longer stretched from 4:3 to fill the 16:9 screen.  Finally, circular effects don't look oval anymore!\n\n14-06-2005 added: Visualisation settings, and ability to show, select and lock vis presets.\n\nIf you tap the Display button on the remote or the Start button the controller, you will bring up a menu control.  In addition to being able to play or pause, fast-forward or rewind and go to the next or previous track, you can control many aspects of the vis.  You can now lock which preset is running, choose which vis to run, select a preset directly from a pageable list and open a nice configuration menu that lets you change all of the settings in the MilkDrop.xml file.  Nice!  If you tap the Black button on the controller or the Back button the remote, you will be able to see which preset is currently running.  Tapping the Back button on the remote more than once gives you the ability to lock (or unlock) the preset, preventing the preset from changing.  For some reason, this doesn't work with the controller.  Tapping the yellow Y button on the remote will bring up the pageable preset list.  Tapping the D-Pad on the controller up or down will change the preset.  There doesn't seem to be a way to do this on the remote.\n\nIn browsing the Winamp MilkDrop forums &lt; http://forums.winamp.com/forumdisplay.php?forumid=81 &gt;, I found a couple of nice preset packs.  On 2005-06-12, Aderrasi 0.24 posted a complete collection of his 896 presets.  Assuming that these would be the most &quot;current&quot; versions, I copied the presets in allowing overwrites.  This added 717 presets to this Update Pack.  On 2005-06-02, Eo.S. posted a collection that adds a total of 736 presets.  I left file.dat from the pack in, simply because I don't know what the file is for and it is only 2K.  Eo.S. notes in his post:  &quot;that zip file contains about 750 [weeded down from about 4000] presets by myself, Phat, Fishbrain, Zylot, Shifter, and Yin. Those are the authors we know the best so those are who we focused on. We tried to keep only the hottest stuff.&quot;  Hot stuff indeed!  These presets are complex and tend to run in the area of 20-30 fps, but are incredible to look at.  With these two packs added, our Update Pack is now up to 5110 presets!\n\nAlso, I mentioned this back in the info file for the G-Force for XBMC Config Update Pack, but since I haven't mentioned it here, I figure I should.  Using filters for the GUI also affects MilkDrop.  On the XBMC home screen, select Settings and then Appearance.  Choose GUI Filters, set Flicker Filter to 0 and make sure Soften is not selected.  This will sharpen up the graphics in MilkDrop and also increases the speed by a few fps.  This is helpful for the more complex presets.\n\nEnjoy!\nKevin Sartori","torrent":{"xt":"urn:btih:092510c0568c06b0cc3c20aa7e4214d474b3388c","amp;dn":"MilkDrop+for+XBMC+Preset+Update+Pack+2005-06-15+%285110+Presets%21%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"092510c0568c06b0cc3c20aa7e4214d474b3388c","infoHashBuffer":{"type":"Buffer","data":[9,37,16,192,86,140,6,176,204,60,32,170,126,66,20,212,116,179,56,140]},"announce":[],"urlList":[]}}