{"title":"TibiabotNG Crack","uid":4160259,"size":7972965,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:0932045849874b6c1a253d2fe97fc735da678996&amp;dn=TibiabotNG+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"doggelito0","files":1,"time":1209338518,"description":"TibiaBot NG is a professionally crafted client modification for the massive multiplayer online role playing game called Tibia. It is the first product around to offer the benefits of full integration into the Tibia client, making any addition to it both natural and powerful.\n\nIt originally started out as a personal project designed for personal use. Even though it lacked a usable user interface, it was later on released for public enjoyment and, nonetheless, quickly won its approval. With the continuous dedication and frequent updates of the maker, it succeeded in becoming one of the most trusted and used tools out there.\n\nWith so much consent, the bot has now taken a different course in development. It will be made for the people, by the people. Users will now be able to have an active role in the development stage, by suggesting and discussing new features and improvements which they would like to see implemented.\n\nAnd it gets even better: TibiaBot NG is the only program you can really trust. It is our main focus to be able to provide a safe product free of hacking concerns. By being a legal company, you can rest assured that no fraudulent attempts at your belongings will be made through the use of our software.\n\nThis is the CRACKED version of the latest NG BOT. You DONT have to pay for it.\nIt contains a lot of nice features and it can also use the new potions now!\n\n--WARNING--This Program might be detected as a trojan by your Antivirus Software, because this tool will modify your Tibia Client and also change your registry (to get the program cracked). It won&amp;#039;t harm your PC in any way.--WARNING--\t\n\n\n-&gt;IF NO ONE IS SEEDING YOU CAN STILL GET THE PROGRAM AT:http://www.speedyshare.com/133270980.html&lt;-\n\n","torrent":{"xt":"urn:btih:0932045849874b6c1a253d2fe97fc735da678996","amp;dn":"TibiabotNG+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0932045849874b6c1a253d2fe97fc735da678996","infoHashBuffer":{"type":"Buffer","data":[9,50,4,88,73,135,75,108,26,37,61,47,233,127,199,53,218,103,137,150]},"announce":[],"urlList":[]}}