{"title":"Cowboy Junkies 2003-10-02 @ Paramount Theater - St. Paul, MN","uid":4057829,"size":577700915,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bfb659df8b55930fe0c31f4a1806144a294f772&amp;dn=Cowboy+Junkies+2003-10-02+%40+Paramount+Theater+-+St.+Paul%2C+MN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":30,"time":1204463157,"description":"I have to admit, I sometimes wish the band would play two sets more often. Rush started doing this in 1997 in their &quot;Evening With.&quot; As an completely unreformed jamband fan, it&amp;#039;s something that I get to see a lot, and it&amp;#039;s always nice. The band certainly has the material to do it, so hopefully they will go back to it.\n\n \n\nThe two sets of the 2003 tour were quite different from each other. Set 1 was the Folk Fusion Quartet, which was an acoustic set with Margo, Mike, Jeff and Jaro. Set 2 was the normal electric set. This set up a wonderful progression for the evening.\n\n \n\nThis show has some wonderful moments. Any time the band dips into the rarely played &quot;Witches,&quot; you know it&amp;#039;s a special evening. The acoustic set also has the haunting &quot;1000 Year Prayer.&quot;\n\n \n\nThe band ramps up the electric set with &quot;Crescent Moon,&quot; and also plays a few songs that they&amp;#039;ve never recorded on an album, &quot;Morning Cried&quot; and &quot;IKEA Parking Lot.&quot; They were debuting several songs on this tour that were eventually recorded on &quot;One Soul Now&quot; and &quot;Early 21st Century Blues.&quot; The set ends with &quot;Helpless,&quot; a great cover song for the band.\n\n \n\nSo pull up a chair, spend a night downloading this show, and then listen, and celebrate the New Year with 4thellamas.com, and if you haven&amp;#039;t yet registered for the 4thellamas.com message board, please do so while you&amp;#039;re waiting for your downloads to complete. That way you can vote for the download you would like to see released in February! ","torrent":{"xt":"urn:btih:0bfb659df8b55930fe0c31f4a1806144a294f772","amp;dn":"Cowboy+Junkies+2003-10-02+%40+Paramount+Theater+-+St.+Paul%2C+MN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bfb659df8b55930fe0c31f4a1806144a294f772","infoHashBuffer":{"type":"Buffer","data":[11,251,101,157,248,181,89,48,254,12,49,244,161,128,97,68,162,148,247,114]},"announce":[],"urlList":[]}}