{"title":"MSN Explorer 7.02","uid":4248284,"size":6032556,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0c421d39dae861bd22d629fedd3fcfa61baf034e&amp;dn=MSN+Explorer+7.02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"motopole","files":1,"time":1213894165,"description":"MSN Explorer is the new Internet software from Microsoft. It&amp;#039;s an all-in-one Internet service and content provider designed to be easy to use for Web newcomers and veterans alike. This service offers Microsoft&amp;#039;s integrated desktop idea, a new Web interface, integrated support for music and video, support for up to nine users, and a simple installation process. MSN Explorer is available to both Access and non-Access customers.\n\nWhen you sign in to MSN Explorer, you are automatically connected to familiar MSN features, such as MSN Hotmail, the MSN Messenger service, and MSN Calendar. The new My Stuff left-hand navigation bar provides one-click access to features important to you such as stock quotes, sports scores, weather forecasts, and almost any information you can find on the Web. Other new features include:\n\n    * My Radio with favorite presets: You can choose from thousands of radio stations throughout the world to listen to while browsing the Web\n    * Personal finance: Keep track of accounts, pay bills online, and receive financial advice with the MSN MoneyCentral service\n    * Online shopping: Research and compare products and purchase online from hundreds of online merchants using the integrated MSN eShop service\n    * Personal home page: Special MSN.com home page includes a new look, personalized content, Message Center, and one-click personalization\n    * Instant alerts: Enjoy up-to-the-minute alerts for new email, friends coming online, and instant messaging, so you are always aware of important events\n    * Member Center: An integrated page that provides information on your account, and allows you to modify your Web settings, such as which content is available on your home page or even delivered to your cellular phone\n    * Roaming: Stay connected no matter where you are using email and other features that are available from any PC, as well as Web-enabled devices such as cellular phones.\n\nThe latest version adds smart technologies such as AutoComplete for Web addresses, e-mail names and passwords, plus a new automatic update mechanism that delivers updates directly to you.","torrent":{"xt":"urn:btih:0c421d39dae861bd22d629fedd3fcfa61baf034e","amp;dn":"MSN+Explorer+7.02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c421d39dae861bd22d629fedd3fcfa61baf034e","infoHashBuffer":{"type":"Buffer","data":[12,66,29,57,218,232,97,189,34,214,41,254,221,63,207,166,27,175,3,78]},"announce":[],"urlList":[]}}