{"title":"Call of Duty United Offensive-MONEY","uid":3239125,"size":1317914415,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c4f31da76ad00ee39d3c49d76662c37fade4af9&amp;dn=Call+of+Duty+United+Offensive-MONEY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fjutte","files":92,"time":1095296282,"description":"Call of Duty: United Offensive (c) Activision              \n\nRelease Date : 9/15/2004 \nGame Type : Action          \nRelease Size : 2 CD(s)        \nProtection : Safedisc 3      \n\nGAME INFORMATION: \n------------------- \nExpanding on the award-winning, epic and cinematic first-person action of \nCall of Duty, Call of Duty: United Offensive delivers more of WWII's most \nlegendary conflicts by offering over 10 new levels in an all-new single \nplayer campaign, as well as nine new multiplayer maps. \n\n\nGAME FEATURES: \n---------------- \n\n* Cinematic Intensity: With enhanced special effects, improved graphics and \nnew character abilities, Call of Duty: United Offensive offers more realism \nthan ever before. Climb aboard authentic WWII jeeps, tanks and motorcycles, \ncall in artillery strikes, and gain aerial support from fighter planes. \nWith 14 new weapons at your disposal, you can cook off grenades, use a \nflamethrower or even bring out a deployable machine gun. Fight through snow \nand rain that impede your visibility, as you avoid spectacular explosions \nin realistically created wartime environments. \n\n* Brothers-in-arms: Bound together by the chaos of war, you and your \nsquadmates must work together as one to lay down suppressing fire and \ncoordinate attacks on entrenched positions. Your ability to accomplish \nmission objectives and eliminate enemies will rely on both individual skill \nand the tight-knit teamwork of your well-trained squad. \n\n* United Offensive: Experience the gripping combat of WWII through the eyes \nof Allied soldiers fighting for the liberation of Europe. Join the 101st \nAirborne for the climactic moments of the Battle of the Bulge. Fight as a \nBritish airman shooting down German ME-109s from the gunner position of a \nB-17 bomber, before transferring to Churchills elite S.O.E. and clearing \nthe way for the invasion of Sicily. Follow your Russian comrades to \nexperience the awesome firepower of tank warfare, both in the trenches and \naboard T-34/85 tanks during the historic 8-day Battle of Kursk. \n\n* Expanded Multi-player Combat: Go online for the ultimate battle between \nAxis and Allied powers, now including tank combat as well as tank-and-foot- \nsoldier combined arms action. Experience 8 new multiplayer maps and 3 new \nmodes -- including Tank Battle, Capture the Flag and Domination -- where \nsquads must take control of key locations while preventing enemy troops \nfrom advancing. A new ranking system lets you earn additional weaponry upon \ncompletion of objectives, and gain the respect of friends and foes alike.","torrent":{"xt":"urn:btih:0c4f31da76ad00ee39d3c49d76662c37fade4af9","amp;dn":"Call+of+Duty+United+Offensive-MONEY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c4f31da76ad00ee39d3c49d76662c37fade4af9","infoHashBuffer":{"type":"Buffer","data":[12,79,49,218,118,173,0,238,57,211,196,157,118,102,44,55,250,222,74,249]},"announce":[],"urlList":[]}}