{"title":"Conflict Vietnam PAL XBOX-CSiSO KTM","uid":3238196,"size":1679942964,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:0cf2361ca00984004a5bc7f4c397513dd1a83e21&amp;dn=Conflict+Vietnam+PAL+XBOX-CSiSO+KTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ktm","files":37,"time":1094939189,"description":"Conflict:iVietnam follows the progressiof four US soldiers,iRagman, Junior, Hoss andiCherry, cut off fromitheir unit during thei1968 Tet Offensive anditasked with fighting theiriway back to friendlyilines. A third personishooter where the playeritakes full control ofiall four squad members,iConflict: Vietnam does notiset out to depictithe course of theiwar; instead we witnessifour men struggling forisurvival in the hostileiVietnam jungle against airuthless terrain and seeminglyiever-present 'invisible' enemy.\n\n- Withi14 missions spanning aivariety of environments youimust lead your squadidown Vietnamese rivers manningithe guns on aiheavily armoured river boat,iinto local villages (withifriendly and non-friendly fire)ito rescue hostages, throughiruined temples and theiclaustrophobic jungle and intoithe ancient Vietnamese capitaliof Hue. \n\n- Armediwith an array ofiheavy artillery your squadimust also use makeiuse of transportation abandonediby the Viet-Cong oridiscarded by captured USitroops such as tanks,iboats and helicopters, iniaddition to any surplusiweaponry you acquire includingigun placements and two-mannedimortar sites. \n\n- Lastly,iand by no meansileast, keep a watchfulieye out for theiViet-Cong booby traps, fromigrenade trip wires andiwater mines to theipunji stake pit trapiand the 'Bouncing Betty'ianti-personnel mine.","torrent":{"xt":"urn:btih:0cf2361ca00984004a5bc7f4c397513dd1a83e21","amp;dn":"Conflict+Vietnam+PAL+XBOX-CSiSO+KTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cf2361ca00984004a5bc7f4c397513dd1a83e21","infoHashBuffer":{"type":"Buffer","data":[12,242,54,28,160,9,132,0,74,91,199,244,195,151,81,61,209,168,62,33]},"announce":[],"urlList":[]}}