{"title":"Ric Ocasek [The Cars] - Fireball Zone [1991]","uid":4115635,"size":52841608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d378fafe167ec9e4f552bbe5e005941354ad982&amp;dn=Ric+Ocasek+%5BThe+Cars%5D+-+Fireball+Zone+%5B1991%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"80zforever","files":12,"time":1207293486,"description":"Fireball Zone marked the beginning of the second half of Ric Ocasek&amp;#039;s solo career. His first two releases, 1983&amp;#039;s Beatitude and 1986&amp;#039;s This Side of Paradise, were really extensions of Ocasek&amp;#039;s work with The Cars; instead of sounding like grand statements made by solo albums, they both sounded like extensions of what The Cars were doing at the time. This was especially true of the latter album, which even featured a handful of hit singles that were more popular than any that The Cars would score in the remainder of their career. After the demise of that band in 1987, Ocasek went on hiatus and returned to recording in 1991 with Fireball Zone, his first post-Cars solo album. Surprisingly, however, it isn&amp;#039;t as much of a departure as one might imagine. The same elements that made The Cars music so accessible and enjoyable is still all in place, and Ocasek wrote a much stronger batch of songs this time around than was featured on the final Cars collaboration, the dismal Door to Door. Fireball Zone is also easily the sunniest Ocasek solo collaboration; much of the material is relatively sprightly and colorful, and the disc includes some musical experiments that Ocasek would never have touched when he was still with The Cars. The album is led by the uptempo &quot;Rockaway&quot; (one of the album&amp;#039;s first singles) and the first 8 tracks are nearly infallible; &quot;Touch Down Easy&quot; and &quot;Come Back&quot; are easily two of the most Cars-ish songs that Ocasek ever released.   \n\nTracks\n \n01 Rockaway \n02 Touch Down Easy\n03 Come Back \n04 The Way You Look Tonight \n05 All We Need Is Love \n06 Over and Over \n07 Flowers of Evel \n08 They Tried \n09 Keep That Dream \n10 Balance \n11 Mister Meaner \n12 Fireball Zone \n\t\n\n\n","torrent":{"xt":"urn:btih:0d378fafe167ec9e4f552bbe5e005941354ad982","amp;dn":"Ric+Ocasek+%5BThe+Cars%5D+-+Fireball+Zone+%5B1991%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d378fafe167ec9e4f552bbe5e005941354ad982","infoHashBuffer":{"type":"Buffer","data":[13,55,143,175,225,103,236,158,79,85,43,190,94,0,89,65,53,74,217,130]},"announce":[],"urlList":[]}}