{"title":"Coast to Coast Radio Program! Commercial Free! Jun 23rd thru Jun","uid":4269738,"size":388833757,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0d63d87d7c7b901930ad076903c330d4da34821e&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jun+23rd+thru+Jun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":35,"time":1214874713,"description":"Six more broadcasts of C2C for all the fans out there. I am early this week. I hope you all enjoy the shows and share them all. Thanks in advance to all the seeders and those loyal fans who continue to download my torrents. Stokeman Out....\n\nMonday June 23rd, 2008\nOccult Parallels\nAppearing during the first two hours, historian of esoterica, Peter Levenda discussed his new book Stairway to Heaven, which connects occult knowledge across time, civilizations, and secret societies. The number seven and its relation to heaven or... \nHost: George Noory\nGuest(s): Peter Levenda\n\nTuesday June 24th, 2008\nTime Travel &amp; Parallel Universes\nExpert in hypnosis and time travel, Dr. Bruce Goldberg discussed visiting parallel universes, teleportation, and time travel. Research at Stanford University regarding inflation theory supports the idea of parallel universes, he reported. Such alternative... \nHost: George Noory\nGuest(s): Dr. Bruce Goldberg, Christian Wilde, Dr. Robert Zubrin\n\nWednesday June 25th, 2008\nUFO Disclosure &amp; Mars Theories\nUFO disclosure was addressed by two guests. In the second hour, Disclosure Project witness Dan Willis shared his testimony that he presented at the 2001 conference. In 1969, he was a code operator and translated a coded message from a Navy ship off... \nHost: George Noory\nGuest(s): Douglas Hagmann, Tom Van Flandern, Dan Willis, Stephen Bassett\n\nThursday June 26th, 2008\nCrop Circles, Oceans, ETs &amp; UFOs\nInvestigative reporter Linda Moulton Howe presented reports on the Barbury Castle pattern, ocean acidity, an abductee&amp;#039;s account of non-human technologies, and the U.K&amp;#039;s recent UFO flap. She interviewed astrophysicist Mike Reed about the Barbury Castle... \nHost: George Noory\nGuest(s): Linda Moulton Howe, Gerald Celente\n\nFriday June 27th, 2008\nBloodline Conspiracy\nFilling in for George Noory, George Knapp (email) welcomed filmmakers RenÃƒÂ© Barnett and Bruce Burgess, who discussed their controversial new documentary, Bloodline, which investigates some of the key questions that frame Dan Brown&amp;#039;s The Da Vinci Code.... \nHost: George Knapp\nGuest(s): RenÃƒÂ© Barnett, Bruce Burgess, Open Lines\n\nSaturday June 28th, 2008\nAleister Crowley\nIan spoke with professor of history Dr. Richard Spence about his new book, Agent 666: Aleister Crowley, British Intelligence and the Occult. Full recap to follow...\nHost: Ian Punnett\nGuest(s): Richard B. Spence\n\nSunday June 29th, 2008\nBigfoot in Ancient Texts\nIan Punnett welcomed expert in ancient manuscripts, Glenn Kimball, who discussed evidence for intelligent &amp;#039;ape people&amp;#039; (or Bigfoot) in 2,000 year-old texts. Specifically, he cited a document written by the Essenes called &amp;#039;Dadam and Mueve,&amp;#039; which he said... \nHost: Ian Punnett\nGuest(s): Glenn Kimball","torrent":{"xt":"urn:btih:0d63d87d7c7b901930ad076903c330d4da34821e","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Jun+23rd+thru+Jun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d63d87d7c7b901930ad076903c330d4da34821e","infoHashBuffer":{"type":"Buffer","data":[13,99,216,125,124,123,144,25,48,173,7,105,3,195,48,212,218,52,130,30]},"announce":[],"urlList":[]}}