{"title":"Mosets.Mtree.v2.0.4.NULLED._MAFiASCRiPTS_.rar","uid":4022979,"size":702321,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:0ddbeef2ce63223225539d46c076c5c848c503ee&amp;dn=Mosets.Mtree.v2.0.4.NULLED._MAFiASCRiPTS_.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bbhsoft","files":1,"time":1202758005,"description":"Enjoy and seed! :)\n------------------------------------------------\nMosets Tree the perfect directory extension for Joomla!. This is the extension that powers the Joomla Extensions Directory at http://extensions.joomla.org\n\nYou can use Mosets Tree run a complex Yahoo! style directory directly inside your Joomla! website. Mosets Tree is designed to handle any data that requires a directory structure such as a Business Directory, Links Directory, Scripts Directory and more. Because Mosets Tree runs on Joomla!, you have infinite possibilities to include more features to your website by using third party extensions. The latest version, 2.0.5 has just been updated with beta support for Joomla! 1.5. Here&amp;#039;s a list of features of Mosets Tree:\n\n? Improved Custom Fields\nMosets Tree 2.0 introduces an improved Custom Fields management with the ability to add more Field types. By default, you can create the following type of custom fields - Text, Select List, Select Multiple, Radio Button, Audio Player, Date, Digg, E-mail, File, Image, Multi-line Textbox, Number, Online Video, Video Player, Web link and Year.\n\n? Extensible Field type\nIt doesn&amp;#039;t stop here. We have open up an API for developers to create additional fieldtypes which can be easily packaged and share with other user. Installation and management of the custom fields and field types are all done in the back-end interface without any programming knowledge.\n\n? Multiple image support\nYou to upload multiple images for a listing. If there are two or more images in a listing, there will be a gallery where it list all the thumbnails for additional browsing.\n\n? Improved Tree template\nSince the beginning, Mosets Tree supports template which allows developer to modify Mosets Tree&amp;#039;s layout to their hearts content. In Mosets Tree 2.0, we have built a template manager which will make it easy for admin to install and manage their template without going through the tedious task of uploading files through an FTP manager. You&amp;#039;ll feel right at home as it works similarly to Joomla! Template Manager.\n\n? Configurable template through parameters\nThere is also support for parameters to template which gives greater flexibility to template designers. Any layout-related settings can be configured here through template parameters. The Tree template has been optimized to minimize the usage of tables and increase its usage of header tag in category and listing names for SEO (Search Engine Optimization) purpose.\n\n? Spy Directory\nEver wonder which users has voted on a listing? How about the feeling that a listing owner is trying vote their listing from different accounts? Mosets Tree 2.0 now comes with an innovative feature called Spy Directory which allows you to view all activities that are going on in Mosets Tree. Activities can be viewed by listings or users. There is also a built-in tool to display potential clones and subsequently remove all votes, reviews and listings from clones.\n\n? Favourites, Reviews, Helpfuls &amp; User Pages\nMosets Tree 2.0 allows users to add listing to their favourites list which enable them quick access to those listings. This is also a great way for users to share listings with other users. The reviews system now comes with Helpful votes. Any reader who thinks a review is helpful, they can vote a Yes or if it is not helpful, they vote a No. This system allows you to sort the reviews according to their helpfulness. The user pages has also been improved to show a user&amp;#039;s listings, reviews and favourites.\n\n? Improved User experience\nAdding favourites, voting a listings, changing category, adding related categories are done within the same page without reloading through the use of Javascript technology. Spend more time browsing, less time waiting.\n\n? Language support\nMosets Tree can be configured to use other language. Simply translate the English language file and you&amp;#039;re set to go. Easy! Currently, Mosets Tree 2.0 has the following language files contributed by our users:\n\nBrazilian Portuguese\nTurkish\nGerman\nDanish\nSpanish\n\n? Beta support for Joomla! 1.5","torrent":{"xt":"urn:btih:0ddbeef2ce63223225539d46c076c5c848c503ee","amp;dn":"Mosets.Mtree.v2.0.4.NULLED._MAFiASCRiPTS_.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ddbeef2ce63223225539d46c076c5c848c503ee","infoHashBuffer":{"type":"Buffer","data":[13,219,238,242,206,99,34,50,37,83,157,70,192,118,197,200,72,197,3,238]},"announce":[],"urlList":[]}}