{"title":"Robert Plant &amp; Alison Krauss - 2008.04.19 - Louisville - Opening","uid":4145277,"size":612133171,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0df46fe367f73bb12e45a5dcd45bebd55b38bc77&amp;dn=Robert+Plant+%26+Alison+Krauss+-+2008.04.19+-+Louisville+-+Opening&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":24,"time":1208700310,"description":"Robert Plant and Alison Krauss took the stage with a roar of approval from the crowd - Robert particularly drawing cheers but gracefully diverting attention to Alison and T-Bone Burnett.  Robert enters wearing a grey-on-grey suit coat embroidered with flowers over a black/purple iridescent vest, white ruffled shirt and worn, faded jeans - he&amp;#039;s playing every bit the old codger, moving slowly and shuffling hump-backed around the stage, eyeing Alison up and down as she faces away, then he looks away when she notices and grins.  No funny business here - this is a professional relationship.  Alison is gorgeous in a spaghetti-strap red-and-white checkered dress that strikes her just below the knee - a simple country-girl cotton dress that seems to suit Robert just fine.  T-Bone is resplendent in a charcoal blazer over a Bright blue Nehru-collared vest with about fifteen buttons and gray slacks cut like 1890s pants - what a star.  The rest of the band is appropriately subdued and watching just like the rest of us as the magic unfolds.  \n\nThe ensemble tears through a gorgeous rendition of &quot;Rich Woman&quot; and a very naughty-looking Alison singing straight through &quot;Leave My Woman Alone&quot; without ever changing a lyric - Robert notices and approves.  Robert is still doing the stiff codger thing, snapping his fingers and looking very Tony Bennett.  Off comes Robert&amp;#039;s jacket at the end of the song, just as a very familiar tune comes from the banjo - the crowd erupts in recognition, and a very different Black Dog pleases the jam-packed and very fired-up Louisville crowd.  \n\nAlison treats us to a ghostly &quot;Sister Rosetta Goes Before Us&quot; with Robert singing backup, and Robert stays in backup mode for a simply crackling &quot;Through The Morning, Through The Night,&quot; Alison at her best, the heartbreak dripping from her adorable twang and Robert soaking up her tears with a very good baritone.  Robert steps out front for &quot;Fortune Teller&quot; and thrills us by just being Robert, telling us at the end that &quot;Now I gets my fortune read for free.&quot;\n\nWhat?  Surely not!  A Physical Graffiti appearance - Alison really into it as the crowd explodes at recognition of &quot;Black Country Woman.&quot;  It&amp;#039;s everything you would think it is, Alison and Robert shouting soul at each other and the outstanding band bringing wonderful rhythms out of the percussion section.  \n\nHere&amp;#039;s an oddity - a sudden, unexplained appearance of &quot;Twentynine Palms&quot; and the first time all night that Robert and Alison seem uncomfortable.  I don&amp;#039;t think Alison likes this one.  Sung well, but a bit of a flat spot.\n\nHere Robert introduces &quot;the mastermind of this whole project,&quot; T-Bone Burnett, and he and Alison leave the stage while T-Bone and band blast through an expert set with a dirty, Keith Richards feel...  &quot;Waiting For A Long Time,&quot; and &quot;Laissez Les Bons Temps Rouler (&quot;Let The Good Times Roll&quot; in French)&quot; - the music is good but the crowd is getting restless.\n\nAlison returns for a simply spot-on perfect, soaring vocal on &quot;Trampled Rose.&quot;  Angelic under white light, this amazing voice just seems to pour from her whenever she opens her mouth, effortlessly.  The band is ghostly behind her, the dark aura of the music returning and the audience silent, spellbound, erupting for a standing ovation after the song.\n\nThe crowd is silent again for a truly amazing Alison vocal (does she ever tire?) on the legendary Emmylou Harris&amp;#039; &quot;Green Pastures.&quot;  Robert on very close harmony backup, with just bassist Dennis Crouch and guitarist Stewart Duncan accompanying them, and again a very appreciative crowd erupting at the end - Alison interrupts the crowd by starting the spiritual &quot;Down In The River To Pray,&quot; acapella, as Robert gathers guitarists Stewart Duncan and Buddy Miller to hum tenor background, then full background, the singers sounding like an old-time church choir and the audience not sure how to act, wanting to cheer but right now they&amp;#039;re in church and they know they better not act up.\n\nRobert leads us through Townes Van Zandt&amp;#039;s &quot;Nothing.&quot;  Introduces the band.  So ends the first CD.\n\nAlison joins up for what&amp;#039;s become a parade of very pretty songs - who&amp;#039;d have thought?  &quot;Killing The Blues&quot; is an interesting twist for a lady you almost didn&amp;#039;t believe a few songs ago when she told you she wasn&amp;#039;t capable of killing a man.  Robert&amp;#039;s mostly in backup mode again, and deflecting attention to Alison, who&amp;#039;s polite to him and not quite sure what to make of this superstar attention and rock-and-roll crowd.  \n\nThe crowd knows what to do though, and cheers them on.  Robert and the band start playing and singing about old Rosie...  my girl...  the mournful fiddles foreshadowing what&amp;#039;s next...  can it be?  If it keeps on raining, the levee&amp;#039;s gonna break...  Only this is a funeral dirge, slow and nasty with Alison&amp;#039;s wail over Robert&amp;#039;s apparition and the thunderous drums of Jay Bellerose.\n\nMore?  Stewart Duncan strolls around behind Robert and Alison and, out of nowhere, those ethereal first chords of &quot;The Battle Of Evermore&quot; and those who ever suggested they do this one are proven right in an instant, as the spare arrangement and Alison Krauss turn this into a treat not heard since Sandy Denny herself - listen to this, Najma!  \n\nHere comes &quot;Please Read The Letter.&quot;  I&amp;#039;m so wrung out after this night that I just can&amp;#039;t write anymore.  &quot;Gone Gone Gone.&quot;  Lots of crowd noise calling for encores.  Encores.  Good God go see this show.  Beg, borrow, steal.  Or just download.  My battery runs dead thirty seconds from the end of the last encore.  Sorry.\n\nRobert Plant and Alison Krauss\nLouisville, KY - The Palace\nApril 18, 2008\nLineage: Belkin TuneTalk Stereo @ 44.1kHz &gt; iPod nano &gt; PC &gt; Sonic Foundry (EQ) &gt; FLAC (8)\n\nLineup:\nRobert Plant - Vocals\nAlison Krauss - Vocals and Fiddles\nT-Bone Burnett - Guitars and Vocals\nStewart Duncan - Guitars and Mandolins\nBuddy Miller - Guitars, Mandolins, Pedal Steel, Autoharp\nDennis Crouch - Bass, Banjo\nJay Bellerose - Drums and Percussion\n\nDisc 1\n\n1 - Rich Woman 5:30\n2 - Leave My Woman Alone 5:02\n3 - Black Dog 6:08\n4 - Sister Rosetta Goes Before Us 4:01\n5 - Through The Morning, Through The Night 4:07\n6 - Fortune Teller 4:46\n7 - Black Country Woman 5:12\n8 - Twentynine Palms 6:01\n9 - Waiting For A Long Time 3:25\n10 - Laissez Les Bons Temps Rouler 6:02\n11 - Trampled Rose 6:21\n12 - Green Pastures 3:39\n13 - Down In The River To Pray 4:16\n14 - Nothing 6:05\n\n\nDisc 2\n\n1 - Killing The Blues (4:31)\n2 - When The Levee Breaks (6:04)\n3 - The Battle of Evermore (6:21)\n4 - Please Read The Letter (6:03)\n5 - Gone Gone Gone (3:26)\n6 - Crowd Noise (3:17)\n7 - Stick With Me Baby (3:15)\n8 - One Woman Man (3:05)\n9 - Your Long Journey (2:40)","torrent":{"xt":"urn:btih:0df46fe367f73bb12e45a5dcd45bebd55b38bc77","amp;dn":"Robert+Plant+%26+Alison+Krauss+-+2008.04.19+-+Louisville+-+Opening","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0df46fe367f73bb12e45a5dcd45bebd55b38bc77","infoHashBuffer":{"type":"Buffer","data":[13,244,111,227,103,247,59,177,46,69,165,220,212,91,235,213,91,56,188,119]},"announce":[],"urlList":[]}}