{"title":"Linux Mint 5 Elyssa","uid":4242902,"size":724236288,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:0eab4d0845e77feb455a7bf39c11c10f06cfd008&amp;dn=Linux+Mint+5+Elyssa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blackangel1","files":1,"time":1213640222,"description":"Clement Lefebvre has announced the release of Linux Mint 5.0, an enhanced and user-friendly desktop Linux distribution based on Ubuntu 8.04: &quot;It is with great pleasure that I officially announce the release of Linux Mint 5 Elyssa.&quot; Among the many new characteristics of this release the most notable are: miscellaneous improvements to mintMenu, mintUpdate and mintInstall; various feature enhancements on the GNOME desktop; performance improvements through reduced memory usage; improved usability compliant with the GNOME Human Interface Guidelines; more available software and better localisation; changes in default software selection (Transmission, Rhythmbox, Brasero...); upstream improvements, including the PulseAudio sound server and a new command-line firewall configuration tool. Read the brief release announcement and check out the comprehensive release notes for further information. Download: LinuxMint-5-r1.iso (691MB, MD5). Besides the standard edition, Linux Mint 5 &quot;Light&quot;, containing no proprietary software and restricted file formats, is also available.","torrent":{"xt":"urn:btih:0eab4d0845e77feb455a7bf39c11c10f06cfd008","amp;dn":"Linux+Mint+5+Elyssa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eab4d0845e77feb455a7bf39c11c10f06cfd008","infoHashBuffer":{"type":"Buffer","data":[14,171,77,8,69,231,127,235,69,90,123,243,156,17,193,15,6,207,208,8]},"announce":[],"urlList":[]}}