{"title":"Windows XP Professional SP2 Educational CD: Stock image","uid":4030158,"size":607865923,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0ec1eb706adce98f0e45d2f4b3a8eaf57fa85c6e&amp;dn=Windows+XP+Professional+SP2+Educational+CD%3A+Stock+image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheSmokingBear","files":2,"time":1203132175,"description":"Windows XP Professional SP2\n\nThis is a dd image of an educational copy of Windows XP Professional SP2. There has been no slipstreams. No mods. No nothing. A completely &quot;clean&quot; copy.\n\nIt is an iso, so you may use whatever burning software that fancies you.\n\nThis does indeed require activation, registration, and most importantly, a valid serial key; it is not the &quot;corporate&quot; edition. And no, I will not provide a serial key or any cracks in this torrent.\n\nDISCLAIMER: THIS TORRENT OF A WINDOWS XP PROFESSIONAL SP2 CD IMAGE IS ONLY PROVIDED TO PEOPLE WHO OWN A VALID LICENSE OF WINDOWS XP PROFESSIONAL. IT IS NOT LEGAL OR MORAL FOR YOU TO USE OR BE IN POSSESSION OF THIS IMAGE IF YOU HAVE NOT PAID MICROSOFT FOR IT. IT IS ONLY PROVIDED TO YOU FOR BACKUP PURPOSES OR IF YOU HAVE LOST YOUR CD. BY DOWNLOADING AND DISTRIBUTING THIS TORRENT, YOU AGREE THAT YOU OWN A LEGAL AND VALID LICENSE OF WINDOWS XP PROFESSIONAL. IF YOU DO NOT, YOU ARE REQUIRED TO DISCONTINUE DOWNLOADING AND DISTRIBUTING THIS TORRENT AND TO DELETE ALL FILES HEREIN.\n\nNow that the above disclaimer is out, enjoy the image!","torrent":{"xt":"urn:btih:0ec1eb706adce98f0e45d2f4b3a8eaf57fa85c6e","amp;dn":"Windows+XP+Professional+SP2+Educational+CD%3A+Stock+image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec1eb706adce98f0e45d2f4b3a8eaf57fa85c6e","infoHashBuffer":{"type":"Buffer","data":[14,193,235,112,106,220,233,143,14,69,210,244,179,168,234,245,127,168,92,110]},"announce":[],"urlList":[]}}