{"title":"Mass.Effect PC Edition. BioWare","uid":4258458,"size":7758644043,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0fa6ef8474eada28787b3fdd924a7e12873def72&amp;dn=Mass.Effect+PC+Edition.+BioWare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wasp1001","files":2,"time":1214348284,"description":"Mass Effect\n-------------\n\nMass Effect is set in the year 2183 AD. Thirty-five years prior, humanity discovered a cache of technology built by a technologically advanced but long-extinct race called the Protheans. Studying and adapting this technology, humankind has managed to break free of the solar system and has established numerous colonies and encountered various extraterrestrial species within the Milky Way galaxy. Utilizing alien artifacts known as &quot;Mass Relays&quot;, the various space-faring species are able to travel at faster-than-light speeds.\n\nThe game takes place primarily in two locations: the frigate SSV Normandy, and the Citadel, a gigantic space station purportedly built by the Protheans and which currently acts as the center of galactic civilization. Throughout the game, however, the player may navigate the Normandy to various planets, moons and other destinations.\n\nWithin the game, humanity has formed the &quot;Human Systems Alliance&quot;, one of many independent bodies that make up the collective of &quot;Citadel space&quot;. Citadel space, as a whole, is ruled by a body of government known as the &quot;Council&quot;, which is made up of the three prominent alien races: the asari, salarians, and turians.\n\n\n? Innovative dialog system lets you drive the conversation\n? Incredibly realistic digital actors react with a wide range of emotions\n? Choose persuasion or force in your efforts to find Saren\n? 2 squad members at your command at all times\n? Engage in tactical combat against all manner of alien adversaries\n? Use the unique powers and weapons of your squad to devastating effect\n? Customize weapons, armor and talents to suit your play-style\n? Explore locations beyond the critical story path\n? Traverse the surface of hostile planets in a heavily armed rover\n? Discover sub-plots waiting to unfold\n\n\n\nSYSTEM REQUIREMENTS\n\nInternet Connection: Required\nOS: Windows XP/Vista (FAT 16/32 File Systems not supported for Digital Download)\nProcessor: Single Core: 2.4 GHz or faster / Multiple Cores: 2.0 GHz or faster\nMemory: XP: 1.0 GB RAM / Vista: 2.0 GB RAM\nHard Drive: 15 GB (30 GB for Digital Download)\nDVD Drive: 1 SPEED (Not required for Digital Download)\nVideo Card: 256 MB with Pixel Shader 3.0 support*\nSound Card: DirectX 9.0c compatible\nDirectX: Version 9.0c October 2006 (included on disc)\nInput: Keyboard, Mouse\n","torrent":{"xt":"urn:btih:0fa6ef8474eada28787b3fdd924a7e12873def72","amp;dn":"Mass.Effect+PC+Edition.+BioWare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fa6ef8474eada28787b3fdd924a7e12873def72","infoHashBuffer":{"type":"Buffer","data":[15,166,239,132,116,234,218,40,120,123,63,221,146,74,126,18,135,61,239,114]},"announce":[],"urlList":[]}}