{"title":"Frequency (PS2)","uid":4160876,"size":226570870,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0ff368204cdd0adff19f7cc1cb2543028d2dd1b9&amp;dn=Frequency+%28PS2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hcaaman","files":2,"time":1209373534,"description":"Frequency claims the title of best rhythm game with ease and is a thoroughly enjoyable game in its own right.\n\nRhythm games have never really enjoyed the same level of popularity in the US as they have in Japan, where they are nothing less than a staple of gaming. In an effort to prove that Americans also know how to keep the beat, Sony has brought in American developer Harmonix to produce Frequency for the PlayStation 2. The end result is a simple but challenging rhythm game with unique gameplay and one of the best game soundtracks ever.\n\nAt first glance, Frequency may not be very self-explanatory to the average layman. The game looks and functions sort of like a mix between Tempest, the classic vector-based shooter, and Dance Dance Revolution, the king of rhythm games. The game field consists of an octagonal tunnel. Each wall of the tunnel represents an element of the song, be it drums, vocals, guitar, or synthesizer. You&amp;#039;ll find a series of jewels on the right, left, and middle portions of each wall, and they represent musical notes. As you progress through the tunnel, you can activate the different notes with the square or L1 buttons for the jewels on the left, the triangle or R1 buttons for the jewels in the middle, and the circle or R2 buttons for the jewels on the right. If you successfully complete a section of a wall without any mistakes, the wall will clear out and start playing automatically, letting you move onto another wall. In the first few levels, the jewel patterns are pretty simple and sparse, but they become more difficult in the upper levels, bordering on impossible in the expert mode.\n\nThe songs are broken up into sections, and the different elements of the song are represented by different loops in each section. As you pass from one section to another, the loops will change, and any component of the music that you&amp;#039;ve successfully mimicked will drop out, forcing you to reconstruct the song all over again. This can be anticlimactic at times, as you&amp;#039;ll be near the end of a section with all of the music playing, and everything will suddenly drop out, leaving you with silence.\n\nThe game includes a remix mode, which is far less structured than the main gameplay mode. In the remix mode, you can reassemble any of the game&amp;#039;s songs as you see fit. Once you&amp;#039;ve reconstructed a song, you can save your remix for future playback. The game also comes with a few preprogrammed remixes, which serve as good examples of what can be done in this mode. Both the main gameplay mode and the remix mode can be played with up to four people as well.\n\nAside from its incredibly cheesy FMV intro sequence, Frequency has a great deal of visual polish, and it generally looks good. The flat-shaded environments and gyrating abstract geometric shapes give the game an interesting faux futuristic look, reminiscent of how the Internet looks in movies. The core octagonal game field stays the same from level to level, but the background action is dictated by a selection of preset background themes that you can choose from at the beginning of each round. It&amp;#039;s certainly not a showcase of the mind-boggling powers of the PlayStation 2, but the game&amp;#039;s simple, unique style more than makes up for it.\n\nThe backbone to any rhythm game is its music, and Frequency has one of the best game soundtracks to date. While previous endeavors in the genre have included the occasional licensed song, the Frequency soundtrack is populated almost entirely with well-known electronic artists. This all-star lineup includes BT, Crystal Method, Orbital, DJ Q-Bert, Powerman 5000, Paul Oakenfold, and more. There are 25 songs in the game, and the variety of electronic subgenres represented guarantees that Frequency will appeal to more than just the hard-core ravers. You may have one gripe, however--the last five songs are accessible only in expert mode, and considering the severe difficulty of the expert setting, only the best of the best will be able to check out these tracks. Even still, the overall quality and cohesiveness that Frequency&amp;#039;s soundtrack exudes puts it in the upper echelons of game music and sets the new standard for rhythm game music.\n\nConsidering the anemic selection of rhythm games on the PlayStation 2 right now, Frequency claims the title of best rhythm game with ease and is a thoroughly enjoyable game in its own right. The gameplay is simple enough to draw in the most casual of gamers, but the incredible difficulty of the game&amp;#039;s later levels will challenge even the most experienced Dance Dance Revolution or PaRappa vet. Fans of the genre have no excuse for not picking up Frequency, and puzzle gamers looking for a new thrill may be pleasantly surprised by the game as well.\n","torrent":{"xt":"urn:btih:0ff368204cdd0adff19f7cc1cb2543028d2dd1b9","amp;dn":"Frequency+%28PS2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ff368204cdd0adff19f7cc1cb2543028d2dd1b9","infoHashBuffer":{"type":"Buffer","data":[15,243,104,32,76,221,10,223,241,159,124,193,203,37,67,2,141,45,209,185]},"announce":[],"urlList":[]}}