{"title":"Red Hot Chili Peppers - Give It Away","uid":4251334,"size":164300804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:111e703b7dcf0f5af8a4fb3047ddc9dc3d8a1bfd&amp;dn=Red+Hot+Chili+Peppers+-+Give+It+Away&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1214022128,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 kbps\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Give It Away&quot; is a song by the Red Hot Chili Peppers released in 1991 on the album Blood Sugar Sex Magik. &quot;Give It Away&quot; was the first of five singles from the album and achieved fame around the world. It won a Grammy Award in 1992. Cleveland&amp;#039;s Rock and Roll Hall of Fame museum has &quot;Give It Away&quot; listed as one of the 500 Songs that Shaped Rock and Roll.\n\nThe music video features the members painted gold (though due to the black and white camera used in filming, the band appear silver) and dancing wildly in a desert, shot in black-and-white. The band members, otherwise scantily-clad, wear unusual clothing and eccentric hair styles.\n\nDue to its unique peculiarity and sheer frenzied energy, the groundbreaking video, directed by StÃƒÂ©phane Sednaoui, is considered by fans of the alternative rock genre to be one of the greatest if not most extreme of music videos, often ranking highly in polls. Sednaoui would later direct the videos for other of the Chili Peppers&amp;#039; singles including &quot;Scar Tissue&quot; and &quot;Around the World&quot;. The former can be seen as a sequel of sorts, as it shows the Chilis returning to the desert, while the latter&amp;#039;s visual style is very reminiscient of &quot;Give It Away&quot;.\n\nThe music video is considered to be the first from the Chili Peppers to move away from the comedic, almost camp visual style of their earlier videos (such as &quot;True Men Don&amp;#039;t Kill Coyotes&quot;, &quot;Fight Like a Brave&quot; and &quot;Higher Ground&quot;) and into works of more artistic merit.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:111e703b7dcf0f5af8a4fb3047ddc9dc3d8a1bfd","amp;dn":"Red+Hot+Chili+Peppers+-+Give+It+Away","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111e703b7dcf0f5af8a4fb3047ddc9dc3d8a1bfd","infoHashBuffer":{"type":"Buffer","data":[17,30,112,59,125,207,15,90,248,164,251,48,71,221,201,220,61,138,27,253]},"announce":[],"urlList":[]}}