{"title":"Son Of Rambow CAM XViD-CAMERA","uid":4133044,"size":740574823,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1204e8d1a1b956b4de237492e82239653b2ea9ca&amp;dn=Son+Of+Rambow+CAM+XViD-CAMERA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":3,"time":1208126895,"description":" Plot: SON OF RAMBOW is the name of the home movie made by two little boys with a big video camera and even bigger ambitions. Set on a long English summer in the early 80&amp;#039;s, SON OF RAMBOW is a comedy about friendship, faith and the tough business of growing up. We see the story through the eyes of Will, the eldest son of a fatherless Plymouth Brethren family. The Brethren regard themselves as God&amp;#039;s &amp;#039;chosen ones&amp;#039; and their strict moral code means that Will has never been allowed to mix with the other &amp;#039;worldlies,&amp;#039; listen to music or watch TV, until he finds himself caught up in the extraordinary world of Lee Carter, the school terror and maker of bizarre home movies. Carter exposes Will to a pirate copy of Rambo: First Blood and from that moment Will&amp;#039;s mind is blown wide open and he&amp;#039;s easily convinced to be the stuntman in Lee Carters&amp;#039; diabolical home movie. Will&amp;#039;s imaginative little brain is not only given chance to flourish in the world of film making, but is also very handy when it comes to dreaming up elaborate schemes to keep his partnership with Lee Carter a secret from the Brethren community. Will and Carter&amp;#039;s complete disregard for consequences and innocent ambition means that the process of making their film is a glorious rollercoaster that eventually leads to true friendship. They start to make a name for themselves at school as movie makers but when popularity descends on them in the form of the Pied Piper-esque French exchange student, Didier Revol, their unique friendship and their precious film are pushed, quite literally, to breaking point.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0845046/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0845046/&lt;/a&gt;\n\nA Fantastic Movie About the Wonders of Childhood, 29 January 2007\n\n# Director: Garth Jennings\n# Cast: Zofia Brooks, Neil Dudgeon, Tallulah Evans, Adam Godley\n# Genre: Comedy\n# Year of Production: 2007\n# Country: France / UK\n# Language: English / French\n# Runtime: 96 min\n\nAuthor: sundevil27 from Salt Lake City, UT USA \n\nI recently took this movie in at the 2007 Sundance film festival and am quite glad that I made the effort to sneak this little gem in. The movie was made by the very talented Garth Jennings of the famed music video production team Hammer and Tongs known for their visionary music videos and previously Hitcherhiker&amp;#039;s Guide to the Galaxy. Set in an average English town in 1982 the movie revolves around the interesting life of a 12-13 year old boy named Will whose family is part of a strict religious group that prohibits him from having any friends outside the group and strictly forbids him from watchings any TV or Movies. Without these usual sources of childhood entertainment Will finds other ways to pass the time, namely in drawing out his flourishing imagination that he scribbles and doodles all over the pages of his bible. One day Will unexpectedly crosses paths with the school terror Carter who also happens to be an amateur bootlegger at the local movie theater. Will, whose never seen a movie before is caught off guard when at Carters home he sees Rambo playing on the TV, the visuals of the movie explode in Will&amp;#039;s imaginative mind and from there on out Will is forever changed. An unlikely friendship begins between Will and Carter as they begin production on Carter&amp;#039;s home movie masterpiece, Son of Rambow. The two children begin coming closer before their friendship is tested by a new-wave French exchange student Didier Revolve. As the friendship between Will and Carter begins getting twisted so does his relationship with his family, as the church group starts taking notice of Wills more worldly interests. In the end Will must stay true to himself and the film must go on.\n\nThe performances by all the children were exceptional, especially Carter who is the movie&amp;#039;s sparkplug and provides comic relief frequently. As well as Didier the french exchange student who is a text book example of how absurd the whole new wave trends of the day were, his appearances are all wildly amusing. The movie also has a fair amount of quirky animations and dream sequences that offer visual pleasures for the eyes and bring childhood doodles to life. The movie is just a brilliant little idea and it plays out so very well in all the settings and the characters are extremely likable in all manners, the movie should play great for almost all ages \n\n","torrent":{"xt":"urn:btih:1204e8d1a1b956b4de237492e82239653b2ea9ca","amp;dn":"Son+Of+Rambow+CAM+XViD-CAMERA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1204e8d1a1b956b4de237492e82239653b2ea9ca","infoHashBuffer":{"type":"Buffer","data":[18,4,232,209,161,185,86,180,222,35,116,146,232,34,57,101,59,46,169,202]},"announce":[],"urlList":[]}}