{"title":"Red Dwarf Series 6","uid":4158006,"size":2592408525,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1220f6291291bfc6d405692b60e34f2915b4d01e&amp;dn=Red+Dwarf+Series+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kupcake-kid","files":19,"time":1209239660,"description":"The year is 2077. Dave Lister is a Liverpudlian caretaker working on-board &quot;Red Dwarf&quot; a gigantic space freighter traveling to Earth, the ship is commanded by Captain Ed Hollister. Lister is obsessed with eating curries and he irritates his pompous and cowardly boss and bunk-mate Arnold &quot;Judas&quot; Rimmer. Lister is sentenced to 6-months in suspended animation for smuggling his pet cat Frankenstine on-board. Lister awakes from suspended animation, only to find the crew have been wiped out in a radioactive disaster, he has been frozen for 3 million years and Red Dwarf is lost in the middle of deep space. But Lister is not alone on-board Red Dwarf. Also on-board Red Dwarf is: Holly, the ship's computer who has lost his intelligence after not being used for so long, A hologram simulation of Rimmer (A electronic ghost), The Cat, a humanoid that evolved from Lister's pet cat Frankenstine and Kryten, robot butler rescued from the American space cruiser 'Nova 5'. \n\nIn this series the foursome fight future versions of themselves, Lister marries a GELF and they have a western shootout. \n\nIncludes:\n\nAll 6 episodes (including Emmy-winning Gunman of the Apocalype), Deleted Scenes, Smeg ups, Documentries on the making of the series and easter Eggs from the DVD. \n\nEncoder- The Kupcake_kid\nVideo container- .mkv\nVideo Codec- h264\nAudio codec- lame mp3\nOriginal TV airing - 1993\n\n'share and enjoy'","torrent":{"xt":"urn:btih:1220f6291291bfc6d405692b60e34f2915b4d01e","amp;dn":"Red+Dwarf+Series+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1220f6291291bfc6d405692b60e34f2915b4d01e","infoHashBuffer":{"type":"Buffer","data":[18,32,246,41,18,145,191,198,212,5,105,43,96,227,79,41,21,180,208,30]},"announce":[],"urlList":[]}}