{"title":"uies.0803291109.iso","uid":4109542,"size":730621952,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:129f12f5d940580eede28018e0ed83c7f53ea20d&amp;dn=uies.0803291109.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"enriaf","files":1,"time":1206985663,"description":"UbuntuiES 7.12 is a Ubuntu based Live Linux distribution in Spanish optimized to run on a Pendrive. It incorporates an exclusive PenDrive installer that facilitates the creation of new copies in PenDrive from the system, optimizing the partition table in order to provide the maximum space for your personal data. This installer runs also from the LiveCD/DVD, the download media. Once in the LiveCD, you can double-click the icon in the desktop, and follow the guided instructions. You will get a fresh copy on a Pendrive Live ready to be used at an incredible speed. At boot time you can select some important options UbuntuiES not only provides all Ubuntu Gutsy features and applications, but it also incorporates many extra applications, ready to be used, some of them rarely found on a live system:Mscore, a powerful music notation program; DBDesigner4, a graphic tool for DB modeling; Amaya, web development environment, Cinelerra, DvdStyler, Blender, Synfig, Inkscape. In a boot menu, you can choose from three desktops: Gnome,efficient Xfce4 or the new Enlightenment e17; and also you can select to use some special drivers like bcm43xx, Nvidia or ATI, bringing full desktop effects to more users . Please visit the distribution site (in Spanish) for some more information: http://ubunties.com","torrent":{"xt":"urn:btih:129f12f5d940580eede28018e0ed83c7f53ea20d","amp;dn":"uies.0803291109.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129f12f5d940580eede28018e0ed83c7f53ea20d","infoHashBuffer":{"type":"Buffer","data":[18,159,18,245,217,64,88,14,237,226,128,24,224,237,131,199,245,62,162,13]},"announce":[],"urlList":[]}}