{"title":"Norton Internet Security 2007 Keygen For Activation By BrandonSt","uid":4264227,"size":105984,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:135f82b125bd999647c3b141987a611e66ecfdd0&amp;dn=Norton+Internet+Security+2007+Keygen+For+Activation+By+BrandonSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BrandonStrike","files":1,"time":1214608950,"description":"Hi i am BrandonStrike\n\nHere is some help for you to activate your product.\n\nYou should have no problems activating as long as you do what it says.\n\n1.DISCONNECT FROM THE INTERNET! THIS IS IMPORTANT!\n2.Run the installer, and run the keygen\n3.Copy the Product Key from the keygen to the Norton Setup then press the I Agree button..\n4.Complete installation and finally you will get to the activation, it&amp;#039;s important that you are NOT connected to the Internet! Press the Next button.\n5.A message box will come up telling you that you need Internet connectivity to continue, just press the OK Button, and then press the Next button.\n6.You will get to a part where it&amp;#039;s trying to connect to the Internet for online activation, after a while it will fail, this is fine, repeat this step again.\n7.After attempting to do online activation two times, it will fail.\n8.Select Phone Activation and press press the Next button.\n9.Now copy the 36 digit Request Code into the Request Code field in the keygen, no dashes or spaces just one long 36 digit string. Select how many years you want to license the software for, and press the Generate button to get your Unlock Code.\n10.Copy the generated Unlock Code to the Norton activation screen, then press the Next button.\n11.Enjoy a fully unlocked copy, and naturally DO NOT register this software with Norton, you can now reconnect to the Internet.\n\nCheers","torrent":{"xt":"urn:btih:135f82b125bd999647c3b141987a611e66ecfdd0","amp;dn":"Norton+Internet+Security+2007+Keygen+For+Activation+By+BrandonSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135f82b125bd999647c3b141987a611e66ecfdd0","infoHashBuffer":{"type":"Buffer","data":[19,95,130,177,37,189,153,150,71,195,177,65,152,122,97,30,102,236,253,208]},"announce":[],"urlList":[]}}