{"title":"FSX &amp; FS2004 - Horizon Sim - VFR Generation X (Ver2.0): Vol 1","uid":4267947,"size":30218977327,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1395f2b967a6c3693b78c05ee7d6141a495f572c&amp;dn=FSX+%26+FS2004+-+Horizon+Sim+-+VFR+Generation+X+%28Ver2.0%29%3A+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spiders96","files":5,"time":1214790389,"description":"Horizon Simulation VFR Generation X (Ver2.0): V1 - Southern England &amp; South Wales\n\n\nAbout VFR Generation X Version 2.0:\n\nVFR Generation X Version 2.0 includes content provided in Version 1.0 (aerial photography &amp; terrain data), as well as night-scenery, interactive inland water body updates, a new terrain mesh, and a number of other goodies that we think you'll like.\n\nUsing real aerial photography for scenery means that the views you see from your virtual cockpit are literally transformed into the real thing - you see exactly what the pilots of the survey aircraft saw when they acquired the aerial photography.\n\nExplore the UK, go sight-seeing, rehearse flights, practice VFR navigation techniques (using real aeronautical charts), or simply enjoy spectacular views from your virtual cockpit.\n\nThe resolution and accuracy of the aerial photography and terrain data alone make VFR Generation X the most detailed and accurate flight simulation scenery ever released commercially for a flight simulator - including those sceneries used by civilian and military flight training institutions that costs thousands of times the price.\n\nVFR Sceneries are currently being used by thousands of private pilots across the globe, and by commercial and military pilots from some of the world's most revered flying institutions.\n\nHigh-Definition Photographic Scenery:\n\nThe imagery of choice for the world's leading defence contractors and simulation professionals, Getmapping's aerial photography is second to none for simulation applications. This imagery is included in VFR Generation X at 16 times the detail of that used in the original Award Winning VFR Photographic Scenery for Microsoft FS2002/4.\n\nUnparalleled Terrain Detail (5m Terrain Mesh)\n\nGenerated from Intermap Technologies phenomenal NEXTMap Britain (the most detailed and accurate terrain survey ever undertaken for the UK), VFR Generation X gives users minute topographic detail that shows every lump and bump in England &amp; Wales. Never before has such a terrain mesh been released for Microsoft Flight Simulator on a national scale.\n\nCustom Night Scenery:\n\nUsing new night software and techniques created by Horizon, VFR Generation X gives users incredible scenery to enjoy even at night - you can now practice VFR Navigation at any hour.\n\nReal Water Textures (Exclusive to VFR Generation X):\n\nFlight Simulator X now provides very much more realistic water effects and allows considerably more freedom in the way that such scenery is created. Gone are the days of Caribbean blue water in UK scenery - VFR Generation X water bodies will give you very realistic water colours (individual to each water body), will provide a moving, reflective surface, will allow float aircraft operations, and will even let you see through to sub-surface features like sand bars and underwater channels. No other scenery for FSX provides this.\n\nEnhanced Performance:\n\nSmooth frame rates with crisp, sharp photographic scenery - VFR Generation X has been specifically designed to optimise performance and reduce the effects of blurry scenery textures even on lower spec systems.\n\n\nThis package is SWEET!!!\n\nHere are a few things you should know:\n\n    * This package is for both FS2004 and FSX\n    * It's over 28 GB with 4 DVD-ISO files\n    * Framerates for this package are surprisingly good!\n    * I will post the other 2 volumes once I see enough people are seeding the completed fileset","torrent":{"xt":"urn:btih:1395f2b967a6c3693b78c05ee7d6141a495f572c","amp;dn":"FSX+%26+FS2004+-+Horizon+Sim+-+VFR+Generation+X+%28Ver2.0%29%3A+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1395f2b967a6c3693b78c05ee7d6141a495f572c","infoHashBuffer":{"type":"Buffer","data":[19,149,242,185,103,166,195,105,59,120,192,94,231,214,20,26,73,95,87,44]},"announce":[],"urlList":[]}}