{"title":"Zion - 1989 - Thunder from the Mountain - 80s Geophagus series","uid":4135080,"size":35078395,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:139fbddbb763069c66891d57611a6de9292fe7f4&amp;dn=Zion+-+1989+-+Thunder+from+the+Mountain+-+80s+Geophagus+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thumbsplus","files":29,"time":1208222332,"description":"128 tpb\n &lt;a href=&quot;\nhttp://metal-archives.com/band.php?id=33355&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://metal-archives.com/band.php?id=33355&lt;/a&gt;\n\nZion (US)\nGenre(s)\nTraditional Metal\nLyrical theme(s)\nChristianity\nOrigin \tFormed in \tCurrent label \tStatus\nUnited States of America (Sioux Falls, South Dakota) \t1981 \tRetroactive Records \tActive\nCurrent line-up\nDavid Moore - Vocals\nRex Scott - Guitar, vocals, drums (on the demos) (X-Sinner)\nJeff Johnson - Bass\nTommy Bozung - Drums\nFormer/past member(s)\nGreg Sauer - Vocals, bass\nBruce Fischer - Vocals, guitar\nMarlin Saner - Bass\nRay Roeter - Bass guitar\n\n1981 in Sioux Falls South Dakota Zion forms with the original lineup of Bruce Fischer: guitar, David Moore: lead guitar, Rex Scott: drums, Ray Roeter: bass guitar. Several names are considered for the new group such as Crystal City but Zion is presented by Rex and sticks. 1982 Ray Roeter moves out of state and is replaced by Greg Sauer on bass. The band begins performing live throughout the region and record their first 4 song demo. 1983 Tommy Bozung joins the group as a drum tech for Rex and as a sound man. The band purchases an extra long converted school bus painted blue for traveling and performing. The band begins the planning of recording a full length album and gets their first &quot;big break&quot; by getting asked to perform at Sonshine 84 in Wilmar Minnesota, a huge outdoor music festival with many top professional acts. In 1984 the band completes and releases their first full length album on cassette entitled &amp;#039;Rock For Eternity&amp;#039; and begins getting press in several underground fanzines such as Heavens Metal. 1985 sees the band continue performing throughout the upper Midwest and begins to garner record label interest. They also get the opportunity to open shows for major artists, including The Sweet Comfort Band (Brian Duncan). Bruce and David record a collection of ballads titled &amp;#039;Fischer And Moore&amp;#039; to offer an alternative to those who were put off by Zion&amp;#039;s loud rock guitar sound. Late in 1986 Bruce Fischer gets a job offer in Minneapolis, Minnesota and accepts. Zion was about to call it quits but get revitalized when Rex switches to guitar front man and Tommy takes over the drumming chores. A more driving sound emerges. In 1987 Rex takes time out to go on the road with the Seattle based rock outfit Bloodgood as a sound tech. Greg Sauer leaves the band to pursue other interests. Rex is befriended by Bloodgood&amp;#039;s lead guitarist David Zaffiro, resulting in Zaffiro producing Zion&amp;#039;s next studio work . Fellow South Dakotan Marlin Saner joins Zion in Seattle to help record a four song EP called &amp;#039;Thunder From The Mount&amp;#039;. Marlin does not officially join the group however, and in 1988 a bass player is found in another South Dakotan named Jeff Johnson. Zion gets an offer from the then newly formed east coast record label Image Records, owned by Dorn Reppert and George Peper after they hear the 4 song EP. Zion accepts the recording contract, and in 1989 they go back to Seattle to record an entire album for Image Records. They spend the months of August and September finishing the record and it is released in October and is titled &amp;#039;Thunder From The Mountain&amp;#039;. Marlin officially replaces Jeff Johnson on bass and the band begins touring across the US in 1990. The album meets with critical acclaim and scores five top ten hit singles on Christian rock radio, beginning with the song &quot;Is It A Crime&quot;, a song which Myrrh Records had licensed to use on their &amp;#039;Twelve New Faces&amp;#039; compilation album. Mark Maxwell from Myrrh begins courting Image Records, Zion and David Zaffiro as producer to possibly be Myrrh&amp;#039;s first and only metal band. Unable to come to contractual terms Myrrh then goes on to sign Holy Soldier instead and utilizes David Z. as their producer in attempt to duplicate the success of Zion&amp;#039;s album musically speaking. Zion songs are being used on several Top Hits albums by other labels during this time. In 1991 some differences develop within the group on several fronts, including if David Zaffiro should produce the second album or not. At this time Rex gets a call from the Los Angeles rock outfit X-Sinner who was looking for a new singer, and painfully decides it is time to exit Zion. In 1992 he moves to LA. Tommy, Marlin and David work on and record new material, but even with Zion&amp;#039;s success Image Records runs into too many\nobstacles to overcome and close their doors. A follow up record never gets recorded. Tommy, David and Marlin all move to Washington state. On the 15th anniversary of the recording of &amp;#039;Thunder From The Mountain&amp;#039;, Rex, David, Tommy and Marlin get together for a reunion of sorts in August 2004 in Portland Oregon. They record some material and plan on working together in the future. Dave and Tommy record a full length Christmas album in 2005, consisting of various styles of music that really show the spirit of the season. Many are blessed by the effort. In 2007 Retroactive Records releases a live and studio compilation album called &amp;#039;Thrillseeker&amp;#039;, which consists of a few live cuts and other choice studio cuts from the Zion archives. Some never before released on CD! Also Image Records is resurrected from the ashes and takes the original two inch tape masters of &amp;#039;Thunder From The Mountain&amp;#039; in to be restored by baking so they can be transferred to digital format so the album can be re-mixed and remastered and re-released in a special collectors package!\n\n\nDiscography\n\n\nRock for Eternity \tDemo, 1984\t\nRoll The Rock/Less Of Me \tSingle, 1987\t\nThunder From The Mountain \tFull-length, 1989\t\nThrillseeker \tBest of/Compilation, 2007\t\n\n\nZion (US) - Thunder From The Mountain\n\nFull-length, Image Records\n1989 \t\n[add review] \t\nline up:\nRex Scott ? Lead Vocals &amp; Guitars\nDavid Moore ? Guitars\nJeff Johnson ? Bass\nTommy Bozung ? Drums\n\nMartin Saner, Charles Meserole &amp; David Zaffiro - Guitars\n\n\n\nProduced by Bloodgood guitarist David Zaffiro.\n1.\tWho Pulls The String\t04:27\t[view lyrics]\n2.\tKick In The Gates\t03:18\t[view lyrics]\n3.\tIs It A Crime\t05:28\t[view lyrics]\n4.\tHelp Me\t03:10\t[view lyrics]\n5.\tThrillseeker\t03:17\t[view lyrics]\n6.\tSold You A Lie\t04:23\t[view lyrics]\n7.\tRoll The Rock\t03:46\t[view lyrics]\n8.\tLess Of Me\t04:32\t[view lyrics]\n9.\tHe Loves You\t03:51\t[view lyrics]\nTotal playing time\t36:12\n\t","torrent":{"xt":"urn:btih:139fbddbb763069c66891d57611a6de9292fe7f4","amp;dn":"Zion+-+1989+-+Thunder+from+the+Mountain+-+80s+Geophagus+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"139fbddbb763069c66891d57611a6de9292fe7f4","infoHashBuffer":{"type":"Buffer","data":[19,159,189,219,183,99,6,156,102,137,29,87,97,26,109,233,41,47,231,244]},"announce":[],"urlList":[]}}