{"title":"Vista Romana SP1 x86 [flamandu]","uid":4270797,"size":4658890307,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:151c28c7fed6ecde9b2bb1078d8d08a7b84d97df&amp;dn=Vista+Romana+SP1+x86+%5Bflamandu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flamandu","files":11,"time":1214930955,"description":"These Vista Editions are RTM SP1 activated Vista&amp;#039;s by flamandu\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nVista Editions:\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n1\t\tBusiness-SP1 x86\n\n2\t\tHome Basic-SP1 x86\n\n3\t\tHome Premium-SP1 x86\n\n4\t\tUltimate-SP1 x86\n\n\n\nLanguage \n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nRomanian\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nUpdates and Hotfixes\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nKB905866v19 - Microsoft works to help make computing as secure as possible for our customers. As part of this effort, monthly updates are provided for the Microsoft Windows Mail Junk E-mail and Phishing Filter. These updates keep Microsoft Windows Mail up-to-date about which e-mail messages should be considered junk e-mail, and about which messages may contain phishing content.\nKB925902 - Vulnerabilities in GDI Could Allow Remote Code Execution\nKB929123 - Cumulative Security Update for Windows Mail in Windows Vista\nKB929399 - FIX: Subscription music services cannot extract metering data when the services try to synchronize metering data on a client computer that is running the Windows Media Format 11 SDK\nKB929735 - You may not find the file that you want when you use Advanced Search to search by date and you use a non-Gregorian calendar format in Windows Vista\nKB929916 - A security issue has been identified that could allow an attacker to compromise your Windows-based system running the Microsoft .NET Framework 2.0.\nKB930178 - Vulnerabilities in CSRSS Could Allow Remote Code Execution\nKB930857 - An update is available for Windows Error Reporting in Windows Vista to make sure that problem reports are sent only after you have granted permission\nKB931099 - Install this update to resolve an issue in Windows Defender where SpyNet requested samples fail to submit data to Microsoft after you consent to submitting them.\nKB931213 - A security issue has been identified that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB931573 - You may be prompted to activate Windows Vista on a computer on which Windows Vista activation was not previously required\nKB931770 - The copy process may stop responding when you try to copy files from a server on a network to a Windows Vista-based computer\nKB932404 - A folder does not open when you click the folder in the All Programs list in Windows Vista\nKB932406 - The Windows desktop may stop updating correctly after a Windows Vista-based computer has been running for a long time\nKB932471 - FIX: Error message when you try to open or to create a protected XPS document by using the XPS viewer that is included with the .NET Framework 3.0: &quot;Cannot open this document because your permissions have expired&quot;\nKB933579 - A security issue has been identified in Microsoft XML Core Services (MSXML) that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB933729 - A security issue has been identified that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB933928 - Microsoft has released this update to make the Windows Vista activation and validation process easier to understand. This update improves the user experience by providing additional information to help resolve certain identified issues during the Windows Vista activation and validation process.\nKB935509 - A software update is available for versions of Windows Vista that include the Windows BitLocker Drive Encryption feature (This is for Enterprise &amp; Ultimate and is required to install Service Pack 1)\nKB935807 - MS07-038: Vulnerability in Windows Vista Firewall could allow information disclosure\nKB936021 - A security issue has been identified in Microsoft XML Core Services (MSXML) that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB936782 - A security issue has been identified in Windows Media Player that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB936824 - The Safely Remove Hardware feature and the Windows Explorer &quot;Eject&quot; command do not work correctly with an Apple iPod that is connected to a Windows Vista-based computer\nKB936825 - Install this update to resolve issues with Secure Digital (SD) on computers running Windows Vista.\nKB937077 - Install this update to resolve an issue where a high definition audio device (HDA) may no longer work after a system running Windows Vista returns from sleep, or hibernation and then restarts.\nKB937123 - Install this update to resolve an issue where after logging on to a computer running Windows Vista, the 802.1X network authentication times out, fails and network connectivity can not be established.\nKB938127 - Vulnerability in Vector Markup Language could allow remote code execution\nKB938194 - An update is available that improves the compatibility and reliability of Windows Vista\nKB938371v2 - This is a rerelease of this update. The rereleased version includes additional performance and reliability enhancements that apply to both Windows Vista-based and Windows Vista Service Pack 1-based systems. The original update was applicable only to Windows Vista-based systems. Users who have already installed Windows Vista Service Pack 1 will only install the new components in this rereleased update.\nKB938952 - Install this update to resolve a display issue that occurs during language pack installation and when accessing the Regional and Language Options control panel.\nKB938979 - An update is available that improves the performance and reliability of Windows Vista\nKB939159 - An update to prevent a Background Intelligent Transfer Service (BITS) crash on a Windows Vista-based computer\nKB940105 - Install this update to resolve potential Graphics Virtual Address problems that may occur when running Windows Vista.\nKB941202 - Security Update for Outlook Express and Windows Mail\nKB941568 - Vulnerabilities in DirectX could allow remote code execution\nKB941569 - Vulnerability in Windows Media file format could allow remote code execution\nKB941600 - This update resolves some reliability issues in the USB core components on the Windows Vista operating system.\nKB941644 - Vulnerability in TCP/IP could allow remote code execution\nKB941649 - An update is available that improves the compatibility, reliability, and stability of Windows Vista\nKB941651 - This is a reliability update. Install this update to improve the reliability of Windows Media Player 11 for Windows Vista in certain scenarios.\nKB941693 - A security issue has been identified that could allow an authenticated local attacker to compromise your Microsoft Windows-based system and gain control over it. You can help protect your computer by installing this update from Microsoft.\nKB942624 - A security issue has been identified in SMBv2 that could allow an attacker to compromise your Windows-based system and gain control over it.\nKB942763 - December 2007 cumulative time zone update for Microsoft Windows operating systems\nKB943055 - A security issue has been identified that could allow an attacker to remotely compromise your Windows-based system using Object Linking and Embedding (OLE) Automation and gain control over it.\nKB943078 - Vulnerability in the Windows kernel could allow elevation of privilege\nKB943302v2 - December 2007 Windows Vista Application Compatibility Update. Install this update to resolve a set of known application compatibility issues with Windows Vista.\nKB943411 - This update enables Windows Sidebar to block certain gadgets from running.\nKB943729 - Multiple Group Policy Preferences have been added to the Windows Server 2008 Group Policy Management Console (which are also available through the Remote Server Administration Toolset (RSAT) for Windows Vista SP1).\nKB943899v2 - An update that improves the performance, responsiveness, and reliability of Windows Vista is available\nKB945553 - Vulnerability in DNS client could allow spoofing.\nKB946026 - Vulnerability in WebDAV Mini-Redirector Could Allow Remote Code Execution\nKB946041 - This update improves the performance, responsiveness, and reliability of Windows Vista in various scenarios. For example, this update includes the following improvements on a Windows Vista-based computer.\nKB946456 - Vulnerability in Windows TCP/IP could allow denial of service\nKB947172 - a Cumulative Update for Media Center for Windows Vista, addresses an issue introduced by KB941229 where, when watching live digital TV on an Xbox 360, changing channels may freeze the UI.\nKB947864 - Security issues have been identified that could allow an attacker to compromise a computer running Microsoft Internet Explorer and gain control over it. You can help protect your computer by installing this update from Microsoft.\nKB948590 - A security issue has been identified that could allow an authenticated remote attacker to compromise your Microsoft Windows-based system and gain control over it. You can help protect your computer by installing this update from Microsoft.\nKb948881 - Security issues have been identified in Active X controls that could allow an attacker to compromise a system running Microsoft Internet Explorer and gain control over it. You can help protect your computer by installing this update from Microsoft.\nKB949939 - Install this update to enable future updates to install successfully on all editions of Windows Vista. This update may be required before selected future updates can be installed.\nWindows Update Client 7.0.6000.381\nWindows Ultimate Extras\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n10 Dreamscene Video&amp;#039;s for Ultimate Edition included\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nsome screenshots:\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/vista_flamandu2-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/vista_flamandu2-1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu1-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu1-1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu3-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu3-1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu4-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu4-1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/Vista_flamandu5.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_005.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_005.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_006.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_006.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_007.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_007.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_008.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i125.photobucket.com/albums/p55/flamandu/flamandu_008.jpg&lt;/a&gt;\n\n\n\n30 extra themes - All Uxtheme patched\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nNote: \t1.  For the first login you have to wait about two minutes because the selected edition is activating itself, just let the installation to end.\n\t2.  If the activation fails then use the activator from the Activator folder on the disk (cdActivatorActivator.exe)\n\t3.  The theme SteelBlue is working only when AERO is enabled.\n\t\n\nEnjoy...\n\nbrought to you by flamandu","torrent":{"xt":"urn:btih:151c28c7fed6ecde9b2bb1078d8d08a7b84d97df","amp;dn":"Vista+Romana+SP1+x86+%5Bflamandu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151c28c7fed6ecde9b2bb1078d8d08a7b84d97df","infoHashBuffer":{"type":"Buffer","data":[21,28,40,199,254,214,236,222,155,43,177,7,141,141,8,167,184,77,151,223]},"announce":[],"urlList":[]}}