{"title":"Alcohol 120% 1.9.7.6221 - TeamPirateLive(TPL)","uid":4150834,"size":9087043,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:155f6d9b74acef72e8b177da208a5a8de3699584&amp;dn=Alcohol+120%25+1.9.7.6221+-+TeamPirateLive%28TPL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TeamPirateLive(TPL)","files":-1,"time":1208932136,"description":"=======================\nAlcohol 120% 1.9.7.6221\n=======================\n\nAlcohol 120% is CD/DVD emulation and recording software that allows users to copy discs. Store your most used or important CDs as images on your computer and run them at 200x speed from up to 31 virtual CD or DVD drives.\n \nAlcohol is compatible with more than 99% of drives available. It supports the latest image file types including\n - MDS, CCD, BIN, CUE, ISO, CDI, BWT, BWI, BWS, BWA and many more.\n\n\n=========\nFeatures:\n=========\n\n- Alcohol 120% enables you to make a duplicate back-up to recordable media of nearly all your expensive Game/Software/DVD titles, and/or an image that can be mounted and run from any one of Alcohol's virtual drives.\n- No other software available enables you to create up to a staggering 31 virtual drives, allowing you to run your game images at over 200x faster than from a conventional CD-ROM. Alcohol 120% is a powerful utility that uses a unique combination of options to ensure a perfect back-up every time.\n- All you need is a PC combined with a CD or a DVD burner. No more replacing your expensive original discs due to loss, theft, scratches, or other media imperfections. Your duplicate works just like the original; your entire collection can be archived and your investment protected.\n- In the home: Have you had experiences with the common conditions of CDs/DVDs? They can easily get scratched, damaged, broken, lost or even stolen. Alcohol provides you with peace of mind and protects your investment.\n- Your original games/program discs can be safely stored away. Alcohol-created images mean that you always have your expensive media stored safely on your hard drive for instant retrieval at the click of a button. No more searching for the correct game disc or software application install disc, everything is at your fingertips.\n- You can now, for instance, simultaneously play your favourite game and bring up your route planner without having to eject and reload any physical discs, The 31 virtual drive ability of Alcohol means you can have the equivalent of a staggering 31 CD-ROM drives in your Home PC, all instantly accessible. You can simply and quickly run your Disc image at around 200 times faster than that of a conventional CD-ROM drive. If you need a program or CD it is immediately there - always ready to use!\n- At the office: Program discs and many other applications generally require the original disc to be in the computer's CD-ROM drive. This restricts the amount of people in your office who can have access to the same software at the same time without the cost of additional discs. Alcohol's virtual drives resolve that problem for you. No more hunting around the offices for that elusive disc you need to run your application, everything you require is just a click away.\n- With Alcohol you can store your CD images on your office server, your colleagues and employees at their respective networked workstations will never need to come asking for a CD again, they will not even require an expensive CD-ROM drive installed in their workstation PC! A simple click is all that is required for them to have full access to any disc image they require for their day to day work. Your valuable CDs can be safely kept under lock and key.\n- Does your company have a promotional CD for it's customers? Original pressed discs are expensive, using the Alcohol 120% writing engine you can copy the original to inexpensive blank discs for distribution to your customers and keep your overheads down.\n- Alcohol software offers unrivalled usage to people from all walks of life regardless of if you are a hardened game player, busy school teacher, salesman, IT manager, student etc. Alcohol has a niche in all your everyday computer needs. Let Alcohol help you to help yourselves and give you the peace of mind you deserve when it comes to expensive PC media.\n\n\n=============\nSupported OS: \n=============\n\nWindows NT 3.x, Windows NT 4.x, Windows 2000, Windows XP, Windows Vista\n\n\n==============================\nChanges in version 1.9.7.6221:\n==============================\n\n- NEW DVD/CD Drive EDM System (Enable/Disable Manger\n- NEW Improved Dumping/Burning engine more stability and speed\n- NEW Blu-ray format (single and double sided) are supported in the Xtra Wizard\n- NEW Blu-ray format (single and double sided) are totally supported in Alcohols Burning &amp; Dumping Wizard now.\n- NEW DPM extraction and writing for more accuracy with some drives.\n- NEW Performance graphic now supports Blu-ray format (single and double sided)\n- Fixed Problem with some drives not showing correct manufacture ID of blank discs.\n- Fixed The incorrect 'Processor Info' display on some Operating systems\n- Fixed Some blacklisting problems\n- Fixed Bugs reported by some users\n- Fixed Auto play doesn't show in x64 platform problem\n- Updated Some language files\n- Updated Devsupp additional support for more drives\n\n\n==============\nInstructions:\n==============\n\n1. Uninstall previous version(s) of Alcohol 120%.\n\n2. Download CCleaner (free) and run the registry cleaner.\n\n3. Restart computer\n\n4. Run installer (Alcohol120_retail_1.9.7.6221.exe).\n\n5. Open the &quot;CRACK&quot; folder.\n\n6. Double click on 'register.reg'.\n\n7. Go to this directory:\nC:/Program Files/Alcohol Soft/Alcohol 120\n\n8. Open Alcohol 120%.\n\n9. Create Virtual Drive.\n\n10. Close Alchohol 120%.\n\n11. Open the 'CRACK' folder again.\n\n12. Copy patch (patch_ssc.exe) to installation directory (C:/Program Files/Alcohol Soft/Alcohol 120)\n\n13. Open patch file and click &quot;Patch&quot;.\n\n14. Rename the 'Alcohol.exe' file inside the installation directory to '_Alcohol.exe'\n**If you can't see the .exe extension then just rename 'Alcohol' to '_Alcohol'**\n\n15. Open the 'CRACK' folder again.\n\n16. Copy the 'Alcohol.exe' file inside the 'Loader' folder.\n\n17. Paste that file inside the installation directory.\n\n18. Right click that file and select &quot;Create Shortcut&quot;.\n\n19. Double click the shortcut.\n\n20. A message will pop up.\n\n21. Restart Alcohol 120%.\n\n22. Close Alcohol 120% again and restart computer.\n\n23. That's it, you're finally finished!\n\n--------------------------------------------------------------\n\nAll of our torrents are not .rar files, so you can clearly see what you are downloading and choose which files to download.\n\nFeel free to email us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3460515559645d46554051785d4251745359555d581a575b59&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nIf you like this torrent, please seed and comment! Thanks :)\n\n--------------------------------------------------------------\n\nPlease visit our piratebay user page for more exclusive torrents! &lt;a href=&quot;\nhttp://thepiratebay.se/user/TeamPirateLive(TPL)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/TeamPirateLive(TPL)&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:155f6d9b74acef72e8b177da208a5a8de3699584","amp;dn":"Alcohol+120%25+1.9.7.6221+-+TeamPirateLive%28TPL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"155f6d9b74acef72e8b177da208a5a8de3699584","infoHashBuffer":{"type":"Buffer","data":[21,95,109,155,116,172,239,114,232,177,119,218,32,138,90,141,227,105,149,132]},"announce":[],"urlList":[]}}