{"title":"Code 64 - Departure[FLAC - Lossless]","uid":4143381,"size":398288616,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:162e024753098de9e78d8d72cd8fd91df6f780b4&amp;dn=Code+64+-+Departure%5BFLAC+-+Lossless%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":16,"time":1208564234,"description":"FLAC files + CUE sheet + Covers\nReleased on Jul 12, 2006.\n\n\nTrack listing:\n1. Sea of Stars\n2. Leaving Earth\n3. Guardian\n4. Orbit\n5. Airborn\n6. Every Moment\n7. Run to You\n8. Echoes\n9. Go64\n10. Carry Me Home\n11. Starchaser\n\n\nReview from Release Magazine:\nIf there is one album this year that Memento Materia really should back financially and through aggressive promotion, it is, without any doubt, &quot;Departure&quot; by Swedish three-piece Code 64. This has genre-breaking potential. I applauded their surprisingly strong debut &quot;Storm&quot;, in all its thumping dancefloor glory, but &quot;Departure&quot; is vastly superior when it comes to technical know-how.\nThe move from tiny Angel Productions (hey, guys, I&amp;#039;m still waiting for the debut album from X:Machina!) to Memento Materia has proven clever indeed. The refreshingly professional production and mixing, aided by otherworldly hypnotic sounds lifts this eleven-track disc way above, for instance, the latest, less than satisfying, offering from VNV Nation. Now it is just a matter of getting people to realise it!\n&quot;Departure&quot; holds all pieces of the puzzle so eagerly sought for by countless electro bands all over the world. Fantastic programming, refined melodies, classy varied vocals and enough punch and edge to light up the universe. The two majestic singles &quot;Leaving Earth&quot; and &quot;Sea of Stars&quot; show you what you get on this, the best electropop album of 2006? The club pop bonanza of the mentioned singles, as well as &quot;Run to You&quot;, &quot;Echoes&quot; and &quot;Starchaser&quot; will send you into blizzards of joy and dance, wondering why someone hasn&amp;#039;t managed to come up with this intriguing formula before. &quot;Guardian&quot;, &quot;Every Moment&quot; and &quot;Carry Me Home&quot; are held back in tempo, but not in quality. They effectively deepen the appeal of &quot;Departure&quot;, giving some much needed relief from the frantic catchiness.\nSo, the only dilemma now seems to be what track to choose for the next single. Personally, I would go for another club smasher, preferably melodic wonder &quot;Run to You&quot; or the utterly charming spacepop of &quot;Starchaser&quot;.\n\nEnjoy!","torrent":{"xt":"urn:btih:162e024753098de9e78d8d72cd8fd91df6f780b4","amp;dn":"Code+64+-+Departure%5BFLAC+-+Lossless%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162e024753098de9e78d8d72cd8fd91df6f780b4","infoHashBuffer":{"type":"Buffer","data":[22,46,2,71,83,9,141,233,231,141,141,114,205,143,217,29,246,247,128,180]},"announce":[],"urlList":[]}}