{"title":"Neon Genesis Evangelion: Renewal - 2003 - DVD - NTSC &gt;NO SUBS","uid":4145653,"size":82781460288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1680d52ec3283e405034fe1347137c1cf1b4589e&amp;dn=Neon+Genesis+Evangelion%3A+Renewal+-+2003+-+DVD+-+NTSC+%3ENO+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zarathus","files":274,"time":1208717070,"description":"Shin seiki evangerion\n&gt;&gt; Original post: http://asiandvdclub.org/details.php?id=3351 &lt;&lt;\n\n\nIn the year 2015, the Angels, huge, tremendously powerful, alien war machines, appear in Tokyo for the second time. The only hope for Mankind`s survival lies in the Evangelion, a humanoid fighting machine developed by NERV, a special United Nations agency. Capable of withstanding anything the Angels can dish out, the Evangelion`s one drawback lies in the limited number of people able to pilot them. Only a handful of teenagers, all born fourteen years ago, nine months after the Angels first appeared, are able to interface with the Evangelion. One such tenager is Shinji Ikari, whose father heads the NERV team that developed and maintains the Evangelion. Thrust into a maelstorm of battle and events that he does not understand, Shinji is forced to plumb the depths of his own inner resources for the courage and strength to not only fight, but to survive, or risk losing everything. [description taken from anidb.info]\n\n IMDb Link......: http://imdb.com/title/tt0112159/\n AniDB Link.....: http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=22\n                 &lt;a href=&quot; http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=202&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=202&lt;/a&gt;\n                 &lt;a href=&quot; http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=326&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://anidb.info/perl-bin/animedb.pl?show=anime&amp;aid=326&lt;/a&gt;\n                  and more in form of director cuts and bonuses\n Year.............: remastered in 2003 (original 1995-1998)\n Country..........: Japan\n Director.........: Hideaki Anno\n\n Source...........: DVD9 Retail R2\n DVD Format.......: NTSC\n DVD Size.........: DVD5 lossless DVD9 split\n Programs used....: unknown\n Screen Format....: variable\n Audio Language...: Japanese\n Audio Format.....: DD 2.0, DD 5.1\n Subtitles........: none\n\n Menu.............: [x] Untouched, intact.\n Video............: [x] Untouched, intact.\n DVD Extras.......: [x] Untouched, intact.\n\nUploader&amp;#039;s Comments: skip first paragraph if you don&amp;#039;t care about &amp;#039;perfect copies&amp;#039;, read otherwise.\nFirst off: I do not own physical DVDs which were used in creating this rip, and even never seen them. I estimate the path of the data like this: 11 disc set was imported by a group of Eva enthusiasts (to split near-600$ cost of original) in 2003 shortly after Renewal&amp;#039;s release in Japan, shared among them in some form, then split by someone to fit on dvd5&amp;#039;s as 9&amp;#039;s were a hell more expensive storage medium, then I fetched a copy of these and stored on HDD with md5 hashes for data integrity checks since then. As you see, there are multiple points at which data might get corrupt and one where it was deliberately edited out of my control. Therefore I can not guarantee that what you receive is a byte-to-byte identical to the original version. However, I have a strong reason to believe that content-wise nothing was thrown out or reencoded to be reduced in quality, as is would nullify the purpose of storing 22 discs. The split itself most probably involved duplication of the menu files and edits in dvd structures to make each layer of dvd9 separately playable as dvd5. The bad point is that we can only hope is was done entirely correct. The good point is that required storage medium (if you don&amp;#039;t like HDDs for some reason) is already dvd5. On average people are much dumber than those who were doing the split and when confronted with necessity to convert will frequently use some lossy one-button brainless &amp;#039;dvdshrimp-style&amp;#039; proggie to reencode dvd9&amp;#039;s if the storage space is an issue. I don&amp;#039;t give a flying damn if someone is turning his own personal candy into shit, but those piles of trash will start to spread through the tubes and render my own personal internets an evil and dirty place. Which is generally a Bad Thing and therefore Should Never Happen.\nThe rant is over, please read on. There are some duplicate files in the release and this is intentional. You can save yourself 5 gigs of transfer if you notice that each pair consisting of even and odd discs which belonged to the two layers of the same disc (except last bonus disc 21 and 22) has identical VTS_01_0.VOB files. These are to the best of my understanding a menu files, which have to be replicated for playability. However please do this only if your line download speed is extremely slow, otherwise I would definitely recommend leaving things as they are and go download the torrent as a whole. In any case please verify all files against a torrent hash later to confirm 100% completeness of the batch.\nThe menus are fully functional, but will not play content that resides on another layer. Switch discs instead.\nEach disc contains extra md5sum file for verification purposes. You may omit it from compilation if you need to burn dvd-video-compliant discs, otherwise it would be wise to leave it in place.\nIf you manage to find any bugs please notify me so we can search for a solution.\nMy upload is 440 kbytes/s when dedicated to one torrent and less when not. So one full copy out each two days, more if you help seeding.\nAnd yes, there are no subtitles.","torrent":{"xt":"urn:btih:1680d52ec3283e405034fe1347137c1cf1b4589e","amp;dn":"Neon+Genesis+Evangelion%3A+Renewal+-+2003+-+DVD+-+NTSC+%3ENO+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1680d52ec3283e405034fe1347137c1cf1b4589e","infoHashBuffer":{"type":"Buffer","data":[22,128,213,46,195,40,62,64,80,52,254,19,71,19,124,28,241,180,88,158]},"announce":[],"urlList":[]}}