{"title":"Coast to Coast Radio Program! Commercial Free! Mar 26th thru Apr","uid":4115413,"size":443057661,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:177b012187c5ea128cccf4682a4c5d21c0419ac6&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Mar+26th+thru+Apr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":40,"time":1207278988,"description":"Yes my friends, it is next week already which means time for another weekly installment of eight more C2C broadcasts! Short and Sweet! Download, SEED, and Enjoy! Thanks in advance to all the seeders and uploaders of these torrents! We are planting seeds of information all over the globe! Until next week! Stokeman Out....\n\nWednesday March 26th, 2008\nBermuda Triangle &amp; Coral Castle\nResearcher and investigator Joe Bullard returned for a discussion on anomalies of the Bermuda Triangle, and an update on mysterious Coral Castle and its creator Edward Leedskalnin. The anomalous &amp;#039;Triangle&amp;#039; typically thought to be bound by the coasts...\nHost: George Noory\nGuest(s): Joe Bullard, John W. White\n\nThursday March 27th, 2008\nSpace &amp; Earth Reports\nStarting in her new full-show, last Thursday of the month guest slot, investigative reporter Linda Moulton Howe presented news about Planet X, the Peruvian meteorite, and other space and earth topics. She interviewed geological sciences Prof. Peter... \nHost: George Noory\nGuest(s): Linda Moulton Howe, Charles Chafer, Robert Joling\n\nFriday March 28th, 2008\nImpossible Physics\nFilling in for George, Art Bell (email) welcomed Prof. Michio Kaku, who discussed topics from his newest book, Physics of the Impossible. According to Kaku, the basic physics of invisibility has been demonstrated sufficiently; it&amp;#039;s merely an engineering... more &gt;&gt;\nHost: Art Bell\nGuest(s): Michio Kaku\n\nSaturday March 29th, 2008\nColucci Investigations\nPrivate detective Vito Colucci discussed some of the high profile cases he has investigated over the last 20 years. Further details forthcoming... \nHost: Ian Punnett\nGuest(s): Vito Colucci, Galen Cook\n\nSunday March 30th, 2008\nET Contact &amp; Energy\nThe founder of the Disclosure Project, Dr. Steven Greer joined Art Bell for a discussion on ET contact, and new energy technology. Greer said that meetings at the UN with were held in February, and the subject of UFOs was addressed. Of the some 30... \nHost: Art Bell\nGuest(s): Steven Greer, Michael Shedlock\n\nMonday March 31st, 2008\nVisitors from Altimar\nJoining the show during the last two hours, was Dr. Richard Boylan, an anthropologist specializing in the &amp;#039;star visitor&amp;#039; phenomenon and &amp;#039;Star Seed&amp;#039; children. He shared his announcement that 12 environmental scientists from the planet Altimar arrived...\nHost: George Noory\nGuest(s): Dr. Richard J. Boylan, Glenn Kimball\n\nTuesday April 1st, 2008\nThe Path of Planet X\nResearcher Dr. Jaysen Q. Rand discussed the arrival of Planet X, an object he said is somewhere in size between Saturn and Earth&amp;#039;s moon. The body, which may be part of a brown dwarf star, is due to swing our way between 2009 and 2012, possibly in two... \nHost: George Noory\nGuest(s): Jaysen Q. Rand, John Rhodes\n\nWednesday April 2nd, 2008\nJames Earl Ray &amp; the MLK Assassination\nDuring the first three hours, the brother of convicted Martin Luther King Jr. assassin James Earl Ray, John Larry Ray joined historian Lyndon Barsten to present the case that James Earl Ray was set up as a patsy by conspirators within the U.S. govt.... \nHost: George Noory\nGuest(s): John Larry Ray, Lyndon Barsten, John Auble","torrent":{"xt":"urn:btih:177b012187c5ea128cccf4682a4c5d21c0419ac6","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Mar+26th+thru+Apr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"177b012187c5ea128cccf4682a4c5d21c0419ac6","infoHashBuffer":{"type":"Buffer","data":[23,123,1,33,135,197,234,18,140,204,244,104,42,76,93,33,192,65,154,198]},"announce":[],"urlList":[]}}