{"title":"Jason Beghe - Scientology Interview Uncut [AVI Version]","uid":4154236,"size":723733352,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:179de82b65cedeb69d8c286a61dcdc9a59a48844&amp;dn=Jason+Beghe+-+Scientology+Interview+Uncut+%5BAVI+Version%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"all.hail.xenu","files":3,"time":1209077704,"description":"Jason Beghe - Scientology Interview Uncut (XenuTV) [AVI Version]\n\nThis is an AVI version of Jason Beghe's complete and deeply revealing interview with Mark Bunker of XenuTv.com about his experiences in Scientology. Also in the room (but off-camera) is Tory Christman, a former Scientologist for 30 years who left in 2000 and has since been a vocal critic of the cult. A lower quality version of this video was previously available on YouTube before it was pulled with no explanation. This copy is a much clearer source with great audio designed to fit on a single CD. Here's hoping this copy can be shared far and wide on many torrent sites. Or copy it to CD and distribute it as much as you can. Drop it off at your local libraries and colleges. Also included in this torrent is Xenu.net's pamphlet &quot;Who Is Xenu?&quot; as a brief introduction to Scientology's bizarre beliefs. Visit XenuTV.com and Xenu.net for more important information on the truth behind Scientology. \n\n\nOriginal Info From Mark Bunker: \n\nIt was a great pleasure to meet Jason Beghe and his family a couple of weeks ago at their home in Malibu. Jason has a long list of acting credits in film and TV and has done extensive voice-over work through the years. His talents were also used in countless Scientology PR and training videos, including a recruitment video for Scientology?s Sea Org. \n\nHe is the first celebrity to leave Scientology and publicly discuss his involvement and then disillusionment with the group. He made it to OT V on Scientology?s ?Bridge to Total Freedom? and discovered the best way to get free was to get up and walk out the door. \n\nI think you?ll greatly enjoy this interview. That is, unless your name is David Miscavige. \n\n\nJason Beghe: How I Got Into Scientology And Why I Got Out\n","torrent":{"xt":"urn:btih:179de82b65cedeb69d8c286a61dcdc9a59a48844","amp;dn":"Jason+Beghe+-+Scientology+Interview+Uncut+%5BAVI+Version%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"179de82b65cedeb69d8c286a61dcdc9a59a48844","infoHashBuffer":{"type":"Buffer","data":[23,157,232,43,101,206,222,182,157,140,40,106,97,220,220,154,89,164,136,68]},"announce":[],"urlList":[]}}