{"title":"NIN Ghosts I-IV Widescreen Wallpaper Rescale Pack","uid":4061212,"size":10783847,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:17d559ddb9c8540d111a5a50c3ac67dc0efe9ea6&amp;dn=NIN+Ghosts+I-IV+Widescreen+Wallpaper+Rescale+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"njiska","files":1,"time":1204610356,"description":"NIN Ghosts I-IV Widescreen Wallpaper Rescale Pack\n\nThe original digital download of Nine Inch Nails Ghosts I-IV came with a set of highly detailed, highly artistic wallpapers. Unfortunately they were only presented in one aspect ratio. In the interest of saving time, and just having a bit of fun, I&amp;#039;ve cropped, resized and in some cases GIMPed around with the wallpapers to make what i feel ar proper 16x10 renditions.\n\nMost wallpapers were a simple crop job as there was a lot of &quot;space&quot;, however several required the use of a Liquid Resize inorder to preserve what i felt was the original artists intended vision and Wallpaper2 was a royal bitch to fix. I Had to crave out the NIN logo, clone over the hole, crop down the top and then fit the logo back in, in order to avoid butchering the birds. I&amp;#039;m not happy with the position of the Logo in terms of it&amp;#039;s relationship to the background gradient, but hey, this is what i got. Maybe i&amp;#039;ll fix it later.\n\nAll images edited using GIMP 2.4.\n\nGhosts I-IV is available now from http://ghosts.nin.com in 320 kbps MP3, FLAC Lossless and Apple Lossless for only $5. You owe it to yourself to check it out.\n\nAll Images released under the Creative Commons Attribution-Noncommercial-Share Alike 2.5 Canada License. This license fully complies with the requirements of the original artworks original license.\n\nCut by Njiska.","torrent":{"xt":"urn:btih:17d559ddb9c8540d111a5a50c3ac67dc0efe9ea6","amp;dn":"NIN+Ghosts+I-IV+Widescreen+Wallpaper+Rescale+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d559ddb9c8540d111a5a50c3ac67dc0efe9ea6","infoHashBuffer":{"type":"Buffer","data":[23,213,89,221,185,200,84,13,17,26,90,80,195,172,103,220,14,254,158,166]},"announce":[],"urlList":[]}}