{"title":"Eoin Colfer - Artems Fowl, The Artic Incident (Book 2, unabridge","uid":3346795,"size":178203030,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:180f9c9b72f623b70c115879c6e2660cb7f783a6&amp;dn=Eoin+Colfer+-+Artems+Fowl%2C+The+Artic+Incident+%28Book+2%2C+unabridge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"psychobabble111","files":153,"time":1119296358,"description":"Title: The Artic Incident\nAuthor: Eoin Colfer\nNarrated by: Nathaniel Parker\nUnabridged, 6 Hours\n64kbps, mono, 44kHz\n\nBook 2 in the Artemis Fowl series.\n\nFrom Amazon:\nEoin Colfer's bestselling antihero is back in Artemis Fowl: The Arctic Incident--the superb sequel to the hyper-hyped Artemis Fowl, shortlisted for the Whitbread Children's Book of the Year. The Arctic Incident sees the slightly older, perhaps slightly more mellow arch-criminal Artemis recovered from his last adventure, richer now that he has his half of a hoard of fairy gold, and happier since the Clarice Starlingesque superfairy Captain Holly Short of the LEPrecon returned his mother's ailing mind to full health.\nBut there is still much unfinished business: Artemis Fowl Sr. disappeared when a daring escapade designed to free his family from their criminal--not to mention deeply lucrative--past and move the family's assets into legitimate enterprises went horribly wrong. Held captive by the Mafiya (the Russian organized crime syndicate) for over two years, he has been declared officially dead, but Artemis Jr. knows in his heart (yes, he does have one) that his beloved father is still alive, and he is determined to find him. Meanwhile Captain Short is temporarily on assignment to Customs and Excise as punishment for letting Fowl separate her and her People from their gold and is finding her stakeout duties a little dull. It soon becomes obvious that the pair have need of each other's considerable skills, and before long they are on track for an adventure that will ultimately have far-reaching consequences for both of them.\n\nIf you enjoyed the first book, you won't be disappointed by the second. Initially the pace is a little slower, and the slightly more mellow Artemis is certainly a tad unnerving at first (particularly as one of the things that made him such an unusual character was the fact that there was something distinctly unlikable about him), but once the sparks between Holly and Artemis begin to fly, and the adventure that tests their endurance to their emotional, physical, and intellectual limits begins, the pages just keep on turning.\n\nThe high-tech hocus pocus, the complex underworld, and the James Bond-style storyline will keep even the most reluctant reader enthralled. Add to the mix a fair dollop of humor, the occasional sprinkling of right-on commentary about the state of the planet, and enough hooks in the story to ensure you will be clamoring for the next book. This chilling, thrilling adventure is a seriously cool (in more ways than one!) must-read for anyone age 9 and older.\n","torrent":{"xt":"urn:btih:180f9c9b72f623b70c115879c6e2660cb7f783a6","amp;dn":"Eoin+Colfer+-+Artems+Fowl%2C+The+Artic+Incident+%28Book+2%2C+unabridge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"180f9c9b72f623b70c115879c6e2660cb7f783a6","infoHashBuffer":{"type":"Buffer","data":[24,15,156,155,114,246,35,183,12,17,88,121,198,226,102,12,183,247,131,166]},"announce":[],"urlList":[]}}