{"title":"Fifth Angel","uid":4257672,"size":82760960,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1818d8b26e4ae83df6df41790dfef51835d1863f&amp;dn=Fifth+Angel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wjjohnso","files":20,"time":1214322435,"description":"Tracklisting:\n\nIn the Fallout\nShout it Out\nCall Out the Warning\nFifth Angel\nWings of Destiny\nThe Night\nOnly the Strong Survive\nCry Out the Fools\nFade to Flames\nNOTE: The 1988 album was Epic Records\\&amp;#039; re-release of Fifth Angel\\&amp;#039;s 1986 self-titled debut on Shrapnel Records. This version of the album was remixed.\n\nAlbum Lyrics: Click here.\n\nBand Members:\n\nTed Pilot (vocals) \nJames Byrd (lead guitar) \nKen Mary (drums) \nEd Archer (rhythm guitar) \nJohn Macko (bass)*\n\n* While pictured on the back cover, John Macko did not actually play bass on the album. Ed Archer played bass on half the record, while Randy Hansen played bass on the other half.\n\nOriginal Album Credits:\n\nProducer: Terry Date &amp; Fifth Angel\nEngineered by: Terry Date\nRecorded and Mixed at: Steve Lawson Productions, Seattle, Wash.\nMastered by: George Horn at Fantasy Studios\nPhoto by: Lynn DeBon\nCover Illustration: Guy Aitchison/Guilty and Innocent Productions\nCover Concept: Ed Archer\nSpecial Thanks to: Marcus, Helen Schultz, Paul, David Kyle, Vic and Sue Sein, Bob Bailey, Dr. Pilot, Paul, Kevin Jones, Tim Brannom, Paul and Jean Herbold, Michelle Courage, Carol Howell, Bruce Calder, and Stephen M. Fontano.\nAn Extra Special Thanks to: Randy Hansen, Debra Herbold, Ron Stokes, Randy Hemming, and Mike Varney.\n\n1988 Re-Release Credits:\n\nArt Direction: Stephen Byram\nPhoto Illustration: Amy Gulp\nComputer Graphics: Micha Riss\nPhotography: Joe Giron\nWorldwide Representation: Derek Simon, Bob Chiappardi and Walter O\\&amp;#039;Brien for Concrete Management\nJames Byrd plays Ibanez Guitars and uses DiMarzio pickups exclusively.\nKen K. Mary uses Pearl Drums, Zildjian Cymbals, Calato Drumsticks and Remo Drum Heads exclusively.\nVery Special Thanks to: Don Grierson, Bob Feinelgle, Diarmuld Quinn, Lisa Markowitz, Steve Byram and all at Epic Records. Derek Simon, Bob Chiappardi, Walter O\\&amp;#039;Brien of Concrete Management and Barry Slotnic of Silverman, Shulman and Slotnick, P.C.\nSpecial Thanks to: Dr. Pilot, Matt Pilot, Vic &amp; Sue Sein, Paul &amp; Jean Herbold, Debra Herbold, Helen Schultz, Alec Macko, Jane Finley, Vic Macko, Kelley Macko, Marcus Wojcik, Michele Courage and all our families and friends.\nJamie Beckett, Gayle Miller, Sasha Mikler, Eddie Javaruski, Tommy Kealty, Grace Nemergut and Andy Ingkavet of Concrete Marketing.\nCarol Radel and Ida Langsam of Public \\&quot;I\\&quot; Publicity.\nRich Lasner at Ibanez Guitars and Steve Blucher at DiMarzio Pickups.\nMike Varney, Ron Laffitte of Ron Rainey Management, Marc Reiter, Dane Venable, David Kyle, Bob Bailey, Steve Schiffman, Tim Brannom, Randy Hemming, Russ Gerroir, Carol Howell and Bruce Calder of Lawson Productions, Randy Hansen, Ron Stokes and Kevin Jones.\n\n\nTracklisting:\n\nCathedral\nMidnight Love\nSeven Hours\nBroken Dreams\nTime Will Tell\nLights Out\nWait for Me\nAngel of Mercy\nWe Rule\nSo Long\nFeel the Heat\nAlbum Lyrics: Click here.\n\nBand Members:\n\nTed Pilot (vocals) \nKendall Bechtel (lead guitar) \nEd Archer (rhythm guitar, keyboards) \nJohn Macko (bass, keyboards)\n\nAll drum tracks: Ken Mary\n\nNOTE: The band shot a video for \\&quot;Time Will Tell\\&quot; to promote the album. \\&quot;Broken Dreams\\&quot; was slated to be another video and the band\\&amp;#039;s second single, but the video was never filmed. \\&quot;Midnight Love\\&quot; was also the featured theme song to Howard Stern\\&amp;#039;s late night TV show.\n\nAlbum Credits:\n\nRecorded and Produced by: Terry Brown.\nRecorded at: The Carriage House Studios, Stamford, CT.\nDrum Tracks Recorded at: Media Sound, New York, NY.\nAdditional Vocals Recorded at: Triad Studios, Seattle, WA\nDrum Technician: Artie Smith\nMixed at: Metalworks, Toronto, Canada\nMix engineer: Noel Golden.\nRecording Assistants: Matt Lane (Carriage House), Lolly (Media Sound), L. Stuart Young (Metalworks).\nAdditional Background Vocals on \\&quot;Broken Dreams\\&quot; and \\&quot;So Long:\\&quot; Lisa Dalbello.\nKeyboard Programming: Scott Humphrey, Carol Howell.\nManagement: Derek Simon for Simon Says, Inc.\nLegal Representation: Barry Slotnick, Esq. for Silverman, Shulman and Slotnick, P.C., New York, NY; Neil Sussman, Esq., Seattle, WA.\nAccounting Services: Robbins, Spielman, Slayton &amp; Halfon, New York, NY.\nVery Special Thanks to: Our families and friends, Derek Simon, Terry Brown, Ken Mary, Carol Radel, Noel Golden, Randy Hemming and Spectradyne, Pete Andersen, Steve Backer, Dan Beck, Hannah Bolte, Steve Byram, Dave Demers, Bob Feineigle, Dave Glew, Don Grierson, Jack Isquith, Mike Jones, Harvey Leeds, Brian Lima, Peter Lopacki, Lisa Markowitz, Ben Nygaard, Lisa Orban, Vivian Piazza, Diarmuid Quinn, Mike Schnapp and all at Epic Records.\nJohn and Patty Montagnese and Phil Magnotti at The Carriage House. Tom Hall, Mike Tortorello and Dave Dysart at Triad Studios. Alex Andronache at The Metalworks. Bob Chiappardi, Russ Gerroir and all at Concrete Marketing. Barry Slotnick, Esq., of Silverman, Shulman and Slotnick, P.C. The law offices of Neil Sussman. Matt Masciandaro of ESP Guitars, Doug Goats for the Warwick Bass, Andy of Teinberger Sound, Kramer Guitars and GHS Strings. Max Norman, Andy Gould, Ron Laffitte, Brian Koppelman, Steve Schiffman, Eric Carr, Dave Bonilla, Sharon Jochimsen, Lynn Lendway, Troy Miller, Terry Hannish, Jeff Fisher, Jerry Callahan and Callahan\\&amp;#039;s For Hair.\nKen Mary appears courtesy of Simmons/RCA Records.\nArt Direction: Steve Byram. Illustration: Amy Guip\nPhotography: Max Aquilera Hellweg\n","torrent":{"xt":"urn:btih:1818d8b26e4ae83df6df41790dfef51835d1863f","amp;dn":"Fifth+Angel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1818d8b26e4ae83df6df41790dfef51835d1863f","infoHashBuffer":{"type":"Buffer","data":[24,24,216,178,110,74,232,61,246,223,65,121,13,254,245,24,53,209,134,63]},"announce":[],"urlList":[]}}