{"title":"(NEW)WSOP Poker Tool Calculatem Calculatem Pro(NEW) Full Tilt Po","uid":4246356,"size":14176484,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:187f95ae36a297e8a502258e16971c3d603c9ff5&amp;dn=%28NEW%29WSOP+Poker+Tool+Calculatem+Calculatem+Pro%28NEW%29+Full+Tilt+Po&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abdulhalftull","files":1,"time":1213806573,"description":"(NEW)WSOP Poker Tool Calculatem Calculatem Pro(NEW) Full Tilt Poker Bonus\n\nThe World Series of Poker is the largest set of poker tournaments in the world. It is held annually in Las Vegas, lasting just over a month. A bracelet is awarded to the winner of each of the fifty-plus events which include all the major varieties of poker. The series culminates with the $10,000 no-limit hold&amp;#039;em &quot;Main Event&quot;, which in recent years has attracted entry fields numbering in the thousands, with the victor receiving a multi-million dollar prize.\n\nThe original World Series of Poker was started in 1968 by Tom Moore of San Antonio, Texas, at the Holiday Hotel and Casino in Reno and was an invitational event. This inaugural event was won by Crandell Addington who went on to place in the top ten of the World Series of Poker Main Event eight times, a record that still stands as of 2007. The set of tournaments that the World Series of Poker (WSOP) would evolve into was the brainchild of Las Vegas casino owner and poker player Benny Binion, as well as his two sons Jack and Ted.\n\nJohnny Moss, Becky Binion, and Puggy Pearson at the 1974 World Series of PokerThe Binion family nurtured not only the WSOP, but poker in general. Prior to the 1970s, poker was not found at many casinos because of the difficulty of keeping cheaters out. Through better security techniques as well as the Binion&amp;#039;s tireless promotion through events like the WSOP, poker became a very popular game.[citation needed]\n\nIn 1970, the first WSOP at Binion&amp;#039;s Horseshoe took place as a series of cash games that included five-card stud, deuce to seven low-ball draw, razz, seven-card stud, and Texas hold &amp;#039;em. The format for the Main Event as a freeze-out Texas hold &amp;#039;em game came the next year. The winner in 1970, Johnny Moss, was elected by his peers as the first World Champion of Poker and received a silver cup as a prize.\n","torrent":{"xt":"urn:btih:187f95ae36a297e8a502258e16971c3d603c9ff5","amp;dn":"%28NEW%29WSOP+Poker+Tool+Calculatem+Calculatem+Pro%28NEW%29+Full+Tilt+Po","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"187f95ae36a297e8a502258e16971c3d603c9ff5","infoHashBuffer":{"type":"Buffer","data":[24,127,149,174,54,162,151,232,165,2,37,142,22,151,28,61,96,60,159,245]},"announce":[],"urlList":[]}}