{"title":"Drillbit Taylor [CAM][English][www.estrenoszt.com].avi","uid":4102156,"size":733800448,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19094ef5c5838a1dfafc7ca4b2c387012b409fd1&amp;dn=Drillbit+Taylor+%5BCAM%5D%5BEnglish%5D%5Bwww.estrenoszt.com%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":1,"time":1206633906,"description":"Drillbit Taylor looks like a film that is potentially very funny. Most films from members of the Frat Pack have proven to be very funny in the past (Anchorman has become almost legendary). Owen Wilson has given some pretty hit and miss performances lately with films like ?You, me and dupree?, but hopefully this one will be enjoyable. The IMDB rating looks very promising for a comedy film at 6.3, but the RT rating not so much at 24%. This might very well be another case of a bunch of dry reviewers without a sense of humour.\n\nQuality:  This rls by PreVail actually looks really good for being a cam. Both video and audio quality are about as good as it gets with a CAM. Might be a while until an R5 appears so if you?ve been waiting on this and don?t mind a cam, go for it.\n\nWhen three high school students tire of being harassed by bullies, they hire a bodyguard named Drillbit Taylor to save them. Owen Wilson (WEDDING CRASHERS) stars as the tough guy of the title, who poses as a teacher at their school to keep an eye on the trio. Seth Rogen (SUPERBAD) co-wrote the film, while Judd Apatow earned credit as a producer.","torrent":{"xt":"urn:btih:19094ef5c5838a1dfafc7ca4b2c387012b409fd1","amp;dn":"Drillbit+Taylor+%5BCAM%5D%5BEnglish%5D%5Bwww.estrenoszt.com%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19094ef5c5838a1dfafc7ca4b2c387012b409fd1","infoHashBuffer":{"type":"Buffer","data":[25,9,78,245,197,131,138,29,250,252,124,164,178,195,135,1,43,64,159,209]},"announce":[],"urlList":[]}}