{"title":"Collection of custom trance edits","uid":4144518,"size":122349568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:19db37ed267383a02c4c635121a94faf2bba8125&amp;dn=Collection+of+custom+trance+edits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"suikoden_buffy","files":28,"time":1208654316,"description":"A collection of trance tracks for people like me that prefer their trance in a short and &quot;radio-friendly&quot; length. This includes 28 tracks that has never been available, or atleast at the time of editing not easily available, in short format. This is not a hodgepodge job, genuine time and effort has gone into putting them together.\n\nThe tracks included are:\n4 Strings - Diving (Anders Hammar's Minimalistix Radio Edit)\nAlex Bartlett - My Angel (Anders Hammar's 2Players Radio Edit)\nAndy B - Imagination (Anders Hammar's MP Radio Edit)\nArt Of Trance feat Michele Adamsson - Love Washes Over (Anders Hammar's Radio Edit)\nCaater - Master Tune (Anders Hammar's Radio Edit)\nCaracas - Through The Barricades (Anders Hammar's Radio Edit)\nDarren Tate vs Jono Grant - Let The Light Shine In (Anders Hammar's Vocal Radio Edit)\nDT8 Project feat Andrea Britton - Winter (Anders Hammar's GD Edit)\nDT8 Project feat Andrea Britton - Winter (Anders Hammar's Ian Knowles Edit)\nEon - Pocket Damage (Anders Hammar's Radio Edit)\nFire &amp; Ice feat Edvika - Close To Me (Anders Hammar's Radio Edit)\nHi-Gate - Hurricane (Anders Hammar's Radio Edit)\nIan Van Dahl - Try (Anders Hammar's Michael Woods Radio Edit)\nJan Johnston - Am I On Pause (Anders Hammar's Trailer Trash Radio Edit)\nJan Johnston - Calling Your Name (Anders Hammar's Thrillseekers Radio Edit)\nLaguna - Unforgiven (Anders Hammar's Radio Edit)\nLange feat Leah - Don't Think It (Feel It) (Anders Hammar's Radio Edit)\nMatt Darey &amp; Marcella Woods - U Shine On (Anders Hammar's Radio Edit)\nOceanLab - Beautiful Together (Anders Hammar's Signum Radio Edit)\nOceanLab - Sky Falls Down (Anders Hammar's Radio Edit)\nRalph Fridge - Angel (Anders Hammar's Short Edit)\nScooter - Devil Drums (Anders Hammar's Short Edit)\nSystem F - Needle Juice (Anders Hammar's Radio Edit)\nTenth Planet - Walk On Water (Anders Hammar's Radio Edit)\nTerraformer - Won't Forget These Days (Anders Hammar's Radio Edit)\nThe Quest - C Sharp (Anders Hammar's Short Edit)\nUlrich Fassbinder - 20000 Miles (Anders Hammar's Silverblue Radio Edit)\nVeracocha vs Axwell - Feel the Carte Blanche (Anders Hammar's Short Edit)\n\nI hope you like them.","torrent":{"xt":"urn:btih:19db37ed267383a02c4c635121a94faf2bba8125","amp;dn":"Collection+of+custom+trance+edits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19db37ed267383a02c4c635121a94faf2bba8125","infoHashBuffer":{"type":"Buffer","data":[25,219,55,237,38,115,131,160,44,76,99,81,33,169,79,175,43,186,129,37]},"announce":[],"urlList":[]}}