{"title":"Invisible Secrets 4.6.2","uid":4165416,"size":3930572,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1adccf00381a7c244ed1e6e78e769170136aa5d7&amp;dn=Invisible+Secrets+4.6.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"slugger00001","files":3,"time":1209587451,"description":"Invisible Secrets not only encrypts your data and files for safe keeping or for secure transfer across the net, it also hides them in places that on the surface appear totally innocent, such as picture or sound files, or web pages. These types of files are a perfect disguise for sensitive information. Nobody, not even your wife, boss, or a hacker would realize that your important papers or letters are stored in your last holiday pictures, or that you use your personal web page to exchange messages or secret doFP.infoents.\nInvisible Secrets 4 not only encrypts your data and files for safe keeping or for secure transfer across the net, it also hides them in places that on the surface appear totally innocent, such as picture or sound files, or web pages. These types of files are a perfect disguise for sensitive information. Using our file encryption software nobody, not even your wife, boss, or a hacker would realize that your important papers or letters are stored in your last holiday pictures, or that you use your personal web page to exchange messages or secret doFP.infoents. With Invisible Secrets 4 - File encryption software you may encrypt and hide files directly from Windows Explorer, and then automatically transfer them by e-mail or via the Internet.","torrent":{"xt":"urn:btih:1adccf00381a7c244ed1e6e78e769170136aa5d7","amp;dn":"Invisible+Secrets+4.6.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1adccf00381a7c244ed1e6e78e769170136aa5d7","infoHashBuffer":{"type":"Buffer","data":[26,220,207,0,56,26,124,36,78,209,230,231,142,118,145,112,19,106,165,215]},"announce":[],"urlList":[]}}