{"title":"Frost Over The World ~Morgan Tsvangirai, Zimbabwe 2008 03 28 (Al","uid":4109706,"size":50584356,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:1b28caa7a298e4c22a2a3fe1ee37e788619f3c9e&amp;dn=Frost+Over+The+World+%7EMorgan+Tsvangirai%2C+Zimbabwe+2008+03+28+%28Al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shunster07","files":1,"time":1206992312,"description":"Frost Over The World ~Morgan Tsvangirai, Zimbabwe 2008 03 28 (Al-Jaz)\n\n42.8 mgs\n12 mins\nxvid\nMorgan Tsvangirai explains why he is optimistic of success in Zimbabwe&amp;#039;s elections\n\nThis week Zimbabwe goes to the polls to elect its next president.\n\nMorgan Tsvangirai, Simba Makoni and Robert Mugabe, the incumbent president, will contest the vote.\n\nHowever, there are serious concerns that the election will be rigged in favour of Mugabe.\n\nMany foreign journalists and election observers have been banned from entering Zimbabwe and previous polls have been marred by allegations of electoral fraud.\n\nMugabe has ruled Zimbabwe since independence in 1980 but the country&amp;#039;s economy lies in ruins. Inflation is currently running at over 100,000 per cent a year.\n\nSir David is joined by Morgan Tsvangirai, the leader of the Movement for Democratic Change, to discuss the forthcoming election.\n\nTsvangirai says that while the elections may not be free and fair, he is optimistic of success.\n &lt;a href=&quot;\nhttp://english.aljazeera.net/NR/exeres/192EFD11...-803DD8477D68.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://english.aljazeera.net/NR/exeres/192EFD11...-803DD8477D68.htm&lt;/a&gt;\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nCouncil on Foreign Relations\nZimbabwe Waits\nMarch 31, 2008\n &lt;a href=&quot;\nhttp://www.cfr.org/publication/15874/zimbabwe_w...%3Ddaily_analysis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cfr.org/publication/15874/zimbabwe_w...%3Ddaily_analysis&lt;/a&gt;\n\nAn uneasy quiet has followed Zimbabwe?s March 29 elections. The country?s electoral commission has yet to announce results from the presidential poll and gave scant figures from the parliamentary elections as well. The opposition MDC, led by Morgan Tsvangirai, claims unofficial tallies show him with twice as much support (SA Independent) as President Robert Mugabe.\n\nInitial official results from the parliamentary election show a small number of the seats up for grabs were equally split (BBC) between the MDC and Mugabe?s party, ZANU-PF. As the country waits in anticipation of presidential results, Zimbabweans and international observers worry that Mugabe supporters could rig the outcome and wonder what the vote might mean for the country?s future.\n\nInformal results and news reports indicate that the opposition gained ground in the presidential vote in rural areas traditionally loyal to Mugabe. Results?posted at individual polling stations for the first time?quickly circulated (WashPost) throughout the country the day following the election. As local observers learned of the numbers, many proclaimed the vote a ?tsunami for MDC? (NYT). Yet the Institute for War and Peace Reporting, an international nongovernmental organization, says sources within the electoral commission indicate Mugabe will claim victory, despite polling only 20 percent of the vote. (edit)\n\n\n\n\nCap shunster\n\n\n\n","torrent":{"xt":"urn:btih:1b28caa7a298e4c22a2a3fe1ee37e788619f3c9e","amp;dn":"Frost+Over+The+World+%7EMorgan+Tsvangirai%2C+Zimbabwe+2008+03+28+%28Al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b28caa7a298e4c22a2a3fe1ee37e788619f3c9e","infoHashBuffer":{"type":"Buffer","data":[27,40,202,167,162,152,228,194,42,42,63,225,238,55,231,136,97,159,60,158]},"announce":[],"urlList":[]}}