{"title":"Led Zeppelin 1977.06.21 - Inglewood","uid":4030293,"size":1312814759,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1b6d626340f992720878829cff6bd50ed0eef4a8&amp;dn=Led+Zeppelin+1977.06.21+-+Inglewood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":25,"time":1203141901,"description":"Led Zeppelin\nThe Forum\nInglewood, California\nJune 21, 1977\n2 source AUD\n\n1stGenCassette&gt;Remaster&gt;Flac\nAnalog unknown&gt;DAT&gt;Remaster&gt;Flac - Ten Years Gone snippet only\n\nRemaster Notes - transfered 1st gen Maxell XLII 90s &gt; Nak BX300 &gt; Echo Mia Soundcard &gt; Samplitude\nProfessional 7.2 @ 24bit 48hz. Speed corrected, slight hiss reduction(using noise samples from each Cassette)\nDown sampled to 44.1 hz using soundforge 6 prof with anti-alias.\nSamplitude Prof 7.2 with Waves plugins used for EQ &amp; Dynamics @ 24bit used to enhance the sound.\nDithered to 16bit with POW-R\n\nTitle: Mike the Mike 6-21-77\n\nCD 1\n1. The Song Remains The Same\n2. Sick Again\n3. Nobody&amp;#039;s Fault But Mine\n4. Over The Hills And Far Away\n5. Since I&amp;#039;ve Been Loving You\n6. No Quarter\n\nCD 2\n1. Ten Years Gone\n2. The Battle Of Evermore\n3. Going To California\n4. Black Country Woman\n5. Bron-Yr-Aur Stomp\n6. White Summer\n7. Black Mountain Side\n8. Kashmir\n9. Over the Top\n\nCD 3\n1. Heartbreaker\n2. Guitar Solo\n3. Achilles Last Stand\n4. Stairway To Heaven\n5. Whole Lotta Love\n6. Rock And Roll\n\n&quot;...perhaps the best audience recording of one of Zeps greatest concerts. It really does not get any better than this...&quot;\n\t--Underground Uprising\n\n&quot;...highly regarded amongst collectors not only because of the highly energetic performance by the band but also because it was captured in exceptionally good audio quality...&quot;\n\t--Wikipedia\n\n&quot;This wonderful recording, surely Mike Millard&amp;#039;s finest, is a tribute and a fitting reminder to his memory, of his sometimes troubled life, ending with his tragic suicide.&quot;\n\nThis week&amp;#039;s show is truly as good as it gets.  Folks, if this ain&amp;#039;t good enough for ya, no bootleg will ever satisfy.  I&amp;#039;m talking about June 21, 1977.  The Los Angeles Forum.  Inglewood, California.  Mike Millard allegedly taped it from the sixth row.  Legend has it that the show was named by Mike &quot;the Mic&quot; himself after hearing Eddie Van Halen criticize Jimmy Page&amp;#039;s playing in an interview.  Ladies and gentlemen, I give you &quot;Listen To This, Eddie.&quot;  In glorious Winston Remasters sound.\n\nMike Millard is, quite simply, a legend.  Because of his work, his ingenuity, and his willingness to go completely beyond the pale to capture a concert in pristine sound, some of the greatest Led Zeppelin shows ever played are recorded in several of the best audience recordings ever made.  I always feel just a little dirty listening to a Mike the Mike show - you see, the best ones were made using Mike&amp;#039;s specially modified wheelchair, with a Nakamichi stereo cassette deck built under the seat and a pair of AKG microphones rumored to have been embedded in the armrests.  Mike was reportedly not at all physically disabled, and I just can&amp;#039;t bring myself to condone that.  I felt I had to say that, as a matter of full disclosure.\n\nMike Millard was a greatly troubled person, plagued with deep depression, and committed suicide in 1990.  His methods aside, his recordings stand testament to his love of music and Led Zeppelin.  \n\nSo this recording has a special story besides.  The show was remastered by Winston from tapes acquired and donated freely by Wayne, who asked me to keep his last name private and I ask that you respect his privacy by not asking me who he is, or investigating further his identity.  Wayne acquired these tapes from a gentleman who was working at the local tape shop where Mike Millard bought high-quality blanks for taping concerts - many more bands besides Zeppelin, Mike taped almost every major concert in L.A. for a period.  The fellow had a deal with Mike - free blanks in return for copies of Mike&amp;#039;s taped shows.\n\nThis is especially significant because the tapes show no &quot;Millard Markings&quot; during the recording.  Millard Markings are the way Mike identified his recordings - he detested bootleggers and was extremely angry any time his recordings were used by them and sold for profit.  So when Mike made copies of his tapes, he marked the audio with cuts during No Quarter and the guitar solo, as well as phased-dropouts after tape flips and silent spots throughout the show.  Apparently he kept a notebook of whose copy had which markings, and if the recording showed up in the hands of a bootlegger, he then knew who to blame, and who would be getting no more groove.  Winston states that the masters are completely free of these markings and that they are the best sounding of any low-gen copy of this show he has ever heard.\n\nWhich brings us to Winston.  The Winston Remasters series is, rightfully so, legendary amongst the bootleg community.  These are reference-quality shows, made from the best tapes of excellent-sounding, excellently-played shows.  The best of the best, sounding as good as anything.  Lovingly remastered by Winston himself, these are among the best ROIOs you will ever hear.  And LTTE is probably the best of them.\n\n\n\n","torrent":{"xt":"urn:btih:1b6d626340f992720878829cff6bd50ed0eef4a8","amp;dn":"Led+Zeppelin+1977.06.21+-+Inglewood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b6d626340f992720878829cff6bd50ed0eef4a8","infoHashBuffer":{"type":"Buffer","data":[27,109,98,99,64,249,146,114,8,120,130,156,255,107,213,14,208,238,244,168]},"announce":[],"urlList":[]}}