{"title":"Grant Green - Idle Moments (BlueNote-1963)","uid":3235931,"size":101310125,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e4145f78198f8f350c94c232c3037cc1f91f1d7&amp;dn=Grant+Green+-+Idle+Moments+%28BlueNote-1963%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":8,"uploader":"magOwl","files":7,"time":1094112490,"description":"Grant Green - Idle Moments (BlueNote-1963)\n\n6 Songs - 96.6mb @ high VBR.\n\nThis languid, seductive gem may well be Grant Green's greatest moment on record. Right from the opening bars of the classic title cut, Idle Moments is immediately ingratiating and accessible, featuring some of Green's most stylish straight jazz playing. Whether he's running warm (pianist Duke Pearson's &amp;quot;Idle Moments&amp;quot;), cool (the Modern Jazz Quartet's &amp;quot;Django&amp;quot;), or a bit more up-tempo (Pearson's &amp;quot;Nomad,&amp;quot; his own &amp;quot;Jean de Fleur&amp;quot;), Green treats the material with the graceful elegance that was the hallmark of his best hard bop sessions, and that quality achieves its fullest expression here. He's helped by an ensemble that, as a sextet, is slightly larger and fuller-sounding than usual, and there's plenty of room for solo explorations on the four extended pieces. Pearson's touch on the piano is typically warm, while two players best known on Blue Note for their modernist dates mellow out a bit -- the cool shimmer of Bobby Hutcherson's vibes is a marvelously effective addition to the atmosphere, while Joe Henderson plays with a husky, almost Ike Quebec-like breathiness. That cushion of support helps spur Green to some of the loveliest, most intimate performances of his career -- no matter what the tempo, it's as if his guitar is whispering secrets in your ear. It's especially true on the dreamy title track, though: a gorgeous, caressing, near-15-minute excursion that drifts softly along like a warm, starry summer night. Even more than the two-disc set The Complete Quartets With Sonny Clark, Idle Moments is the essential first Green purchase, and some of the finest guitar jazz of the hard bop era. - from AMG.\n\nenjoy and SEED!! :]\n\n/owl","torrent":{"xt":"urn:btih:1e4145f78198f8f350c94c232c3037cc1f91f1d7","amp;dn":"Grant+Green+-+Idle+Moments+%28BlueNote-1963%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e4145f78198f8f350c94c232c3037cc1f91f1d7","infoHashBuffer":{"type":"Buffer","data":[30,65,69,247,129,152,248,243,80,201,76,35,44,48,55,204,31,145,241,215]},"announce":[],"urlList":[]}}