{"title":"Depeche Mode - 1986 - Black Celebration [UK Extended Release] [F","uid":4145573,"size":336250843,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e7c5790c000b5cabfdd6439b5553e909c62456e&amp;dn=Depeche+Mode+-+1986+-+Black+Celebration+%5BUK+Extended+Release%5D+%5BF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SickTwist","files":22,"time":1208713996,"description":"Black Celebration is the fifth proper studio album by Depeche Mode. Released by Mute Records on March 17, 1986, it further cemented the darkening sound that was initially hinted towards on their album Construction Time Again. The album didn&amp;#039;t do as well as other Depeche Mode albums did and none of the three singles were big hits. Despite (or because of) its darkness and lack of &quot;notable&quot; singles, it is often considered to be a fan-favourite.\n\nBlack Celebration has more songs with Martin Gore on lead vocals than any other Depeche Mode album: &quot;A Question of Lust&quot;, &quot;Sometimes&quot;, &quot;It Doesn&amp;#039;t Matter Two&quot;, and &quot;World Full of Nothing&quot;. The remaining tracks are sung by David Gahan. The track &quot;Fly on the Windscreen&quot; had already been released as the B-side of the &quot;It&amp;#039;s Called a Heart&quot; single. The band decided to rework the song (adding new effects and making it more stereophonic) and released it as the &quot;Final&quot; version on this album. It was later performed live, and given a slight hip hop edge during the 1993 Devotional Tour. A recorded performance of this version is featured in the live video Devotional and a special live single of &quot;In Your Room&quot;.\n\nVarious versions of the original album exist in addition to a 2007 re-release. The original UK LP contained 11 tracks whereas the 1986 UK CD release contained 3 additional bonus tracks: &quot;Breathing in Fumes&quot;, &quot;But Not Tonight (Extended Remix)&quot; and &quot;Black Day&quot;. The original US LP and CD contained the same 11 tracks as the UK LP plus &quot;But Not Tonight&quot;. However, the US version of &quot;A Question of Time&quot; has a slightly different intro (the screeching sound is repeated twice, while the original version is smooth).\n\nTrack Listing\n01 - Black Celebration\n02 - Fly On The Windscreen - Final\n03 - A Question Of Lust\n04 - Sometimes\n05 - It Doesn&amp;#039;t Matter Two\n06 - A Question Of Time\n07 - Stripped\n08 - Here Is The House\n09 - World Full Of Nothing\n10 - Dressed In Black\n11 - New Dress\n12 - Breathing In Fumes\n13 - But Not Tonight (Extended Remix)\n14 - Black Day\n\nAll tracks are DRM-free and encoded losslessly in FLAC format (16 bit, stereo, 44.1 kHz). For more information about FLAC visit http://flac.sourceforge.net/. Album summary courtesy of Wikipedia and is available under the terms of the GNU Free Documentation License.","torrent":{"xt":"urn:btih:1e7c5790c000b5cabfdd6439b5553e909c62456e","amp;dn":"Depeche+Mode+-+1986+-+Black+Celebration+%5BUK+Extended+Release%5D+%5BF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e7c5790c000b5cabfdd6439b5553e909c62456e","infoHashBuffer":{"type":"Buffer","data":[30,124,87,144,192,0,181,202,191,221,100,57,181,85,62,144,156,98,69,110]},"announce":[],"urlList":[]}}