{"title":"Seek and Find Games Collection [PC WinAll] -  [realityarcade.com","uid":4243306,"size":233573362,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1eb87d28e5a273cc6900e9d4aff0fa5c5be02937&amp;dn=Seek+and+Find+Games+Collection+%5BPC+WinAll%5D+-++%5Brealityarcade.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pullingjuices","files":11,"time":1213657009,"description":"Seek and Find Games Collection [PC WinAll] -  [realityarcade.com]\n\nAgatha Christie: Death on the Nile\n\nEmbark on a great Seek and Find adventure which brings a whole new way of enjoying the timeless Agatha Christie story of Death on the Nile! Assume the role of renowned detective Hercule Poirot, seeking clues to a mysterious murder aboard a ship, cruising the River Nile. Find hidden objects, clues and the hard evidence that you&amp;#039;ll need to question suspects and uncover the truth behind the Death on the Nile! Was it the obvious former fiance? Or the diamond thief? The answer may surprise you!\n\nAgatha Christie: Peril at End House\n\nFans of Agatha Christie and great seek and find games alike, rejoice! Hercule Poirot is at it again - Mon dieu! - in another seek and find mystery of murderous proportions! Peril at End House celebrates its 75th anniversary with an interactive retelling that remains true to the Agatha Christie classic, while delivering an unforgettable seek and find experience! There has always been an air of evil at End House and it&amp;#039;s up to the famous Poirot to unravel the mystery before it&amp;#039;s too late!\n\nLittle Shop of Treasures\n\nWelcome to Huntington, a charming little town where if you look close enough, your dreams will come true! Help Huntington&amp;#039;s shop owners find more than 1,200 unique, and cleverly hidden, items for their customers and earn enough cash to open a shop of your own! Featuring two great ways to play, an innovative hint feature, endless re-playability and more, this eye-popping challenge will bend your brain and dazzle your eyes. Find your way to fun at the Little Shop of Treasures today!\n\nLittle Shop of Treasures 2\n\nWelcome back to Huntington and an all-new adventure of seek-and-find fun! Help the shoppers of this charming little town find the items they desire and earn enough money to restore and re-open your Uncle Roy&amp;#039;s gas station. Search for well-hidden items in a wide variety of Huntington&amp;#039;s shops - including the Import Shop you opened in Little Shop of Treasures and your newly restored Gas Station. It&amp;#039;s another day and another fantastic Little Shop!\n\nDream Day First Home\n\nOnce again, Jenny and Robert need your help! They are buying their first home and are looking for your assistance in finding the perfect fit! From choosing the house, to shopping and redecorating, to solving the inevitable Homeowner Crisis, their happiness is in your hands! There are more than 2800 objects hidden throughout 36 innovative backgrounds with 12 mini-games providing non-stop fun! Find your inner decorator with Dream Day First Home, a fantastic seek-and-find adventure!\n","torrent":{"xt":"urn:btih:1eb87d28e5a273cc6900e9d4aff0fa5c5be02937","amp;dn":"Seek+and+Find+Games+Collection+%5BPC+WinAll%5D+-++%5Brealityarcade.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb87d28e5a273cc6900e9d4aff0fa5c5be02937","infoHashBuffer":{"type":"Buffer","data":[30,184,125,40,229,162,115,204,105,0,233,212,175,240,250,92,91,224,41,55]},"announce":[],"urlList":[]}}