{"title":"Orin Meditations - The Millennium Journeys by Orin - Part 3","uid":4032156,"size":106685418,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f60a21cab229358ef28a7c65b4963fbbc1e6464&amp;dn=Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SuperManny","files":14,"time":1203224989,"description":"Meditations by Orin and Sanaya Roman\n\nThe Millennium Journeys by Orin\n Volume 3:  Accelerating Your Evolution\n &lt;a href=&quot;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm030d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm030d&lt;/a&gt;\n\nProgram 1: Connecting With Spirit?Connect with spirit and draw in its light through three points of energy that form a halo above your head. With this connection you can experience greater wholeness, know and live your truth, and gain more clarity, insight, and wisdom about who you are.\n\nProgram 2: Absorbing Divine Essence?Become a wave form and travel into the light of divine essence, opening a doorway to experience directly a quality of light that can transform your being at every level. Change some of the basic patterns and harmonics of light within you into a higher frequency.\n\nProgram 3: Creating New Light Within?Work with three light beings and your soul and spirit to activate a seed of light within you that carries your potential for enlightenment and that lifts you to your next level of evolution.\n\nProgram 4: Transforming Your Awareness? Surround the electrical boundary of your soul with a cocoon of your awareness, then merge with spirit. Experience a new awareness of the light, beauty, and spirit in yourself and in all life around you.\n\nProgram 5: Strengthening the Initiating Will? Connect with a Master who transmits to you a quality of will from the Great Bear to assist you in releasing resistance and struggle, and in aligning with the goals of your soul and spirit. \n\nProgram 6: Releasing Limitations?Link with your soul, spirit, and an angel to release energy blockages so you can expand beyond previous limits. Receive transmissions of joy, expansion, courage, strength, and one that enhances your note, your truth, your unique frequency of energy.ousness from these higher levels.\n\nProgram 7: Surrender and Trust?Become a point of light traveling into the oneness, finding and surrendering to the currents of light there. Use this skill to find and surrender to the light in your daily life. Link your throat center and sacral center to enhance your ability to create and manifest.\n\nProgram 8: Exploring Dimensions of Light?Join with your soul to experience an explosion of energy that takes you to very high dimensions of light. Bring this light back into your chakras to experience greater vision, new insights and perspectives, and a new quality of feeling.\n\nProgram 9: Activating Evolutionary Codes?Meet with an Enlightened One and an angel to receive sacred codes and symbols. They will activate the seeds of potential within your DNA and cells to assist you in accelerating your evolution.\n\nProgram 10: Sirius and the Central Spiritual Sun Receive the light that is coming from Sirius to free yourself from attachments and the influence of matter. Draw in light from the Central Spiritual Sun to enhance your ability to manifest.\n\nProgram 11: Awakening Spiritual Power?Call upon the incredible power of your soul and spirit to create breakthroughs, to take a quantum leap, and to make changes you have been wanting to make. Tap into this power that can move energy, that can create matter out of light, and that can make the transition from one vibration to a higher one.\n\nProgram 12: Receiving Your Crown of Light?Let go of suffering and pain and accept joy, abundance, service, and love as you wear a crown of light.","torrent":{"xt":"urn:btih:1f60a21cab229358ef28a7c65b4963fbbc1e6464","amp;dn":"Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f60a21cab229358ef28a7c65b4963fbbc1e6464","infoHashBuffer":{"type":"Buffer","data":[31,96,162,28,171,34,147,88,239,40,167,198,91,73,99,251,188,30,100,100]},"announce":[],"urlList":[]}}