{"title":"Windows Vista Upgrade Prank :D LOL","uid":4280193,"size":1994860,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:21cc3788fd879fcbbf076015accbc1ed85c0d963&amp;dn=Windows+Vista+Upgrade+Prank+%3AD+LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sednax","files":1,"time":1215380450,"description":"The Vista Upgrade Prank starts by emulating the Windows Update service screen. Clicking the install or cancel button closes the update service window and appears to initiate the Vista Upgrade Advisor. This Upgrade Advisor scan the system (actually does nothing) to ensure the computer is ready to upgrade to Vista. If you click the Cancel button, it disables itself. You are unable to close the screen or stop the progress (don&amp;#039;t worry, its harmless). The Upgrade Advisor completes within 15 seconds or so and then informs the user their computer is able to run Windows Vista. Yippee!\n\nHere is where the fun begins. After the Upgrade Advisor our Vista Upgrade Prank will initiate a &amp;#039;fake&amp;#039; Upgrade to Vista. This part includes many flashy icons and flavor text about the joys of upgrading to Vista. The user can click next or wait a few seconds and the upgrade to Vista simulation begins. Again, clicking cancel will do nothing, the process runs until the progress bar is complete (this process does nothing either). After 30 seconds or so the fake upgrader shows that the upgrade was successful and allows the user to close the upgrade program.\n\nUpon closing the upgrade a full screen Vista logo appears with the Vista startup sound making it appear as though the system is running Vista. After some load time the user is presented with a Mac OS X desktop with a little bit of Windows flavor. After all, the visual features in Vista already exists in Mac OS X - right? Double-clicking the desktop or clicking 5 times will close the fake Vista desktop and the gag program will exit. An awesome prank for the workplace.\n\nHow to close Vista Upgrade Prank:\n\nOnce the fake Vista upgrade is completed you can double-click on the fake Vista desktop or click on the fake Vista desktop 5 seperate times. Once you click correctly the program will close and display an About Box Screen. Once you close this screen, the program will exit. Exiting the software will allow Windows to delete the file.","torrent":{"xt":"urn:btih:21cc3788fd879fcbbf076015accbc1ed85c0d963","amp;dn":"Windows+Vista+Upgrade+Prank+%3AD+LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21cc3788fd879fcbbf076015accbc1ed85c0d963","infoHashBuffer":{"type":"Buffer","data":[33,204,55,136,253,135,159,203,191,7,96,21,172,203,193,237,133,192,217,99]},"announce":[],"urlList":[]}}