{"title":"Old-World Macintosh Essentials - Shared by Smart","uid":4260703,"size":11570459,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2201a7608e81d75c1925f78780e11fb663060adc&amp;dn=Old-World+Macintosh+Essentials+-+Shared+by+Smart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Smart-The_real_one","files":2,"time":1214449676,"description":"Here's another great torrent for the rest of us.\nShared by Smart\n\nToday:\nAn nice package of tools to install (or to make it easier for you to install) Mac OS X on an Old-World machine.\n\nAlso i've packed the tools once as an Stuff-It archive to get the compatibility to the good old Macintosh systems, for Classic / Mac OS 9 and older.\n\nAnd once as zip for Mac OS X.\nTested and proved. It works.\n\nThe packages contains:\n----------------------------------------------\nApple Software Restore\n\nA software to restore an volume back from an image at low-level.\nOr to copy an cd 1:1 to an hard drive or vice versa.\nI find it very usefull to restore a Mac OS X Install-CD to a partition on a hard drive to install faster or to prevent corrupt installations or any other kind of abortet install processes cause of read-errors or something like that.\n-\nG3/G4 Cache Profiler\n\nThe software to switch the cache on and off on an unsupported Mac there's running Mac OS X.\nMac OS X don't bring any support for cpu-ugrades (nor they caches).\nThe software is for the Powerlogix and NewerTech cpu upgrades that's the most used upgrades at all.\n-\nL2CacheConfig\n\nSoftware to enable and configure (ratio, speed e.g.) of the backside L2 cache using Mac OS X for computers with G3 or G4 upgrade cards.\n-\nPCI Extreme\n\nSoftware to enable Quartz Extreme (the gpu-based graphic acceleration) on PCI.\nBy default Apple has hard-coded these acceleration only on AGP bus (with at least cards that have 16 MB VRAM or up).\nWith this software you can enable QE on PCI cards (witch have at least 8 MB VRAM or less).\nAt the 8 MB VRAM ATI Mobility Radeon on iBook's e.g.\n-\nQuartz Extreme Check\n\nWith this software you can check if Quartz Extreme is online (active).\nThe System Profiler on Mac OS X shows only if the card has the ability to support QE (at Apple's specifications; AGP - 16 MB VRAM).\n-\nShadow Killer\n\nSoftware to activate or deactivate the translucent shadows on windows.\nIf it sets to off you will get an boost in performance on slower machines.\nIt will operate without restart.\n-\nUnsupported Utility X (aka UUX)\nThe early patch to install Mac OS X on unsupported Old-World Mac's.\nHas functions that later versions don't have.\nE.g. the support to install the Mac OS X Public Beta or Developer Preview.\n-\nXPostFacto\n\nThe main utility to get (install) Mac OS X on unsupported OW-Machines.\nAs a rule of thumb:\nXPF 2 for Mac OS X 10.2 (aka Jaguar)\nXPF 3 for Mac OS X 10.3 (aka Panther)\nXPF 4 for Mac OS X 10.4 (aka Tiger)\n\nSurely depending on the used machine. ;-)\n-\nSo ...\n\nExtracted and release the wild cat out of its cage and revive your Mac a new life - give it the power. :-)\n\nJust unzip and get what you want.\nEnjoy and comment ! ;-)\n\n\nAt last like always:\n--------------------\nNo adware !\nNo dialer !\nNo programs that phoning home !\nNo keyed content !\nNo stuff that you must buy to get what you want !\n\n\nAlways clear and great.\n\nJust Smart-Torrent !","torrent":{"xt":"urn:btih:2201a7608e81d75c1925f78780e11fb663060adc","amp;dn":"Old-World+Macintosh+Essentials+-+Shared+by+Smart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2201a7608e81d75c1925f78780e11fb663060adc","infoHashBuffer":{"type":"Buffer","data":[34,1,167,96,142,129,215,92,25,37,247,135,128,225,31,182,99,6,10,220]},"announce":[],"urlList":[]}}