{"title":"TinTin en el Cangrejo de las Pinzas de Oro","uid":4030656,"size":468259127,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23aa46d2cb36a9160c4131d6c7ce7e67de2f9dfe&amp;dn=TinTin+en+el+Cangrejo+de+las+Pinzas+de+Oro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alf1122","files":2,"time":1203162925,"description":"En pos del misterio que envuelve la muerte de un marinero que investigan HernÃƒÂ¡ndez y FernÃƒÂ¡ndez, Herbert Dawes, relacionado con lo que parece ser una lata de cangrejo, TintÃƒÂ­n sube al carguero Karaboudjan, donde es capturado por una banda de criminales que ocultan en las latas de cangrejo el opio con el que trafican. TintÃƒÂ­n logra escapar del camarote en el que lo han encerrado, y da con el capitÃƒÂ¡n del barco, Haddock. El capitÃƒÂ¡n Haddock, completamente alcoholizado, ha sido vÃƒÂ­ctima de los manejos de su segundo de a bordo, Allan Thompson, y no sabe que su barco transporta opio. Cuando lo descubre se pone del lado de TintÃƒÂ­n.\n\nTintÃƒÂ­n y el capitÃƒÂ¡n logran escapar del barco en una chalupa. El capitÃƒÂ¡n bajo los ejectos del alcohol hace una hoguera con los remos de la embarcaciÃƒÂ³n. AdemÃƒÂ¡s, un hidroaviÃƒÂ³n enviado por el barco intenta matarlos. Logran hacerse con el control del aviÃƒÂ³n pero, nuevamente debido al alcohol, el capitÃƒÂ¡n hace que se estrellen en el desierto del Sahara. Tras caminar por el desierto son salvados por el teniente Delcourt (comandante de la LegiÃƒÂ³n Extranjera francesa) quien les proporciona un medio de transporte al puerto ficticio de Bagghar en Marruecos.\n\nEl Karaboudjan se cree naufragado pero el capitÃƒÂ¡n lo reconoce en el puerto y los contrabandistas lo secuestran. TintÃƒÂ­n intenta liberarlo con la ayuda de HernÃƒÂ¡ndez y FernÃƒÂ¡ndez descubriendo al jefe de los contrabandistas Omar ben Salaad y deteniendo a toda la banda.\n","torrent":{"xt":"urn:btih:23aa46d2cb36a9160c4131d6c7ce7e67de2f9dfe","amp;dn":"TinTin+en+el+Cangrejo+de+las+Pinzas+de+Oro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23aa46d2cb36a9160c4131d6c7ce7e67de2f9dfe","infoHashBuffer":{"type":"Buffer","data":[35,170,70,210,203,54,169,22,12,65,49,214,199,206,126,103,222,47,157,254]},"announce":[],"urlList":[]}}