{"title":"The Dark Aeons (Discography)","uid":4142211,"size":128945482,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:23f6f7dc383f4fcbd1d59b13468f5560b88507d4&amp;dn=The+Dark+Aeons+%28Discography%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nukeypearce","files":30,"time":1208547850,"description":"I first heard this metal band back around 8 months ago on an online radio service.\n\nThe two brothers, Shane and Jason, decided to make a music project - but never seemed to take off that well. They started selling albums on Ampcast (now defunct) but no-one brought anyway. Its a shame really because in my opinion they are quite good.\n\nIt took a very long time to locate these tracks, and I suspect theres more coming up sometime soon. But it all depends on whether they want to carry on with the project; other commitments took place which hindered any other releases.\n\nThey started playing on Second Life back a while ago, and although they arent mainstream they do have a small following. At the end of the day its all about money; if youre face isnt in hundreds of magazines and if you dont own an expensive car, no one wants to know, not even the record companies.\n\nThis torrent is being spread with permission, so this music is currently free-licenced. Remember to seed well, and if you like the music, then do a Google search on them, you might find out where to contact the two talented people who made these tracks.\n\nFinally, if you do like the music, remember to share, the music is quite high-grade, and they deserve to make it bigger. Its just a shame theres no record company to take them on. Their future is in your hands...\n\nRecommended first-listen album would be Digress &amp; Descension.\n\n\nTorrent details:\n\nDigress &amp; Descension, encoded at 160kbps, mp3 (Duration: 0:30:14)\nEcce Signum, encoded at 128kbps*, mp3 (Duration: 0:56:50)\nNocturne, encoded at 160kbps, mp3 (Duration: 0:27:13)\n\n\n*With the exception of A Dream and The Laughter Of Chickens (River) which has been encoded at 192kbps\n\n\n\nYou can see Shanes other projects at http://www.shanesemler.com","torrent":{"xt":"urn:btih:23f6f7dc383f4fcbd1d59b13468f5560b88507d4","amp;dn":"The+Dark+Aeons+%28Discography%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23f6f7dc383f4fcbd1d59b13468f5560b88507d4","infoHashBuffer":{"type":"Buffer","data":[35,246,247,220,56,63,79,203,209,213,155,19,70,143,85,96,184,133,7,212]},"announce":[],"urlList":[]}}