{"title":"Clash, Blaggers ITA, And Misfits Extras SVCD","uid":3243760,"size":641177287,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:25393bdce8266f9db88a857f2f67711c2853db93&amp;dn=Clash%2C+Blaggers+ITA%2C+And+Misfits+Extras+SVCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bandit999","files":5,"time":1096709890,"description":"Alright here's a few extras that were left off some posts by accident or in the case of the Blaggers ITA its a replacement file for a corrupted one. The Blaggers ITA-Oxygen can be easily attached to the end of the already downloaded file by using TMPGEnc and cutting and removing the incomplete version of Oxygen and then join this version in its place. Next up is The Misfits encore from the 1982 Bethlehem show i posted, i found this after i had posted the show. Then we come to the Clash who were missing some tracks from the Punk/The Way We Were post. I have put the four tracks together in one file, Capital Radio, Janie Jones, Whats My Name, and Garageland. I have also thrown in the Clash live in Munich in 1976 which was posted on punktorrents ages ago, Enjoy!\n\nBlaggers ITA CasRock Edinburgh 3 Dec 1994 Oxygen SVCD 4 minutes\n\nClash 4 Tracks So It Goes October 1977 SVCD 10 minutes\n\nMisfits Encore Bethlehem PA 31 Oct 1982 SVCD 4 minutes\n   \nClash Live Munich 1976 DVD Rip SVCD 18 minutes\n\nThis is in SVCD format and should be burned to CD and it will play in most DVD players. It will fit on 1 80min blank cd-r using nero.\n\nCome and join www.punktorrents.com for more of this kind of thing.\n\nEnjoy bandit999","torrent":{"xt":"urn:btih:25393bdce8266f9db88a857f2f67711c2853db93","amp;dn":"Clash%2C+Blaggers+ITA%2C+And+Misfits+Extras+SVCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25393bdce8266f9db88a857f2f67711c2853db93","infoHashBuffer":{"type":"Buffer","data":[37,57,59,220,232,38,111,157,184,138,133,127,47,103,113,28,40,83,219,147]},"announce":[],"urlList":[]}}