{"title":"Alex Jones Show Enhanced Edition - July 1, 2008 - Rivero, Kopelm","uid":4271866,"size":76221829,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2549e8acc07862455d0de0a7d1a2bdcb4a11c871&amp;dn=Alex+Jones+Show+Enhanced+Edition+-+July+1%2C+2008+-+Rivero%2C+Kopelm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Femacamper","files":7,"time":1214971306,"description":"The Alex Jones Show, Enhanced Edition\n\nVeteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you\nthought-provoking interviews and takes an in-depth look at the news between the\ndaily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines\nhis media presence with actual physical activism, a practice that once led to\nhim being arrested on the personal order of George W. Bush! Alex Jones has\ngained international attention for standing up for what he believes in.\n\nFrom La Prensa to the Wall Street Journal and USA Today, Jones has brought the\ninformation war to the mainstream print media worldwide, speaking out against\ntyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing\npersonalities in the world from guerrilla journalists to government officials to\nwhistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any\nother on the air. Jones is a seasoned investigative journalist who has broken\nhundreds of national stories during his career. He is an aggressive\nConstitutionalist who digs deeply into the facts to defend property rights, our\nnational borders, and the Second Amendment while he sends out a rallying call to\nthe American people to resist foreign entanglements and wars for corporate\ninterests. Jones eschews the bogus political labels of left and right and\ninstead focuses on what really matters: right and wrong.\n\nTuesday, July 1st, 2008\n\nTHE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex talks with monthly guest Mike Rivero, former Marine Lieutenant Colonel Jay\nKopelman, author of From Baghdad, With Love: A Marine, the War, and a Dog Named\nLava, the Walmart truther Nathan Moulton, Jonathan Ellinoff of We Are Change\nDenver, and Brian Peterson of We Are Change Minnesota.\n\nOriginal capture by modemho (Total Recorder 4.4 Capture in 48 kbs stereo from Ku\nsatellite feed or 56 kbs internet streaming audio with commercial edit on the\nlive stream), tags edited, added pictures and show description with Mp3Tag and\nWinamp, genre tag set to Podcast for better ipod compatibility with bookmarking\nand chapter support, re-encoded, recut and split into hourly segments with\nAudacity. Used with permission. Alex Jones authorizes you to use and\nredistribute his materials for non-profit, educational purposes:\n\nGo here if there are no seeds: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg213034#msg213034&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg213034#msg213034&lt;/a&gt;\n\nOr you can do up your own .mp3s here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=45157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=45157&lt;/a&gt;\n\nDownload the daily .mp3 here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&lt;/a&gt;\n\nOr listen live at","torrent":{"xt":"urn:btih:2549e8acc07862455d0de0a7d1a2bdcb4a11c871","amp;dn":"Alex+Jones+Show+Enhanced+Edition+-+July+1%2C+2008+-+Rivero%2C+Kopelm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2549e8acc07862455d0de0a7d1a2bdcb4a11c871","infoHashBuffer":{"type":"Buffer","data":[37,73,232,172,192,120,98,69,93,13,224,167,209,162,189,203,74,17,200,113]},"announce":[],"urlList":[]}}