{"title":"U.S.--SCOTUS To Reconsider Landmark We The People v. US case","uid":4034882,"size":67060,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:265b49bb873831c8ef1af54a88cdfc39e452cc1d&amp;dn=U.S.--SCOTUS+To+Reconsider+Landmark+We+The+People+v.+US+case&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"asc11","files":1,"time":1203374205,"description":"[2008-02-22]\nSCOTUS To Reconsider Landmark WTP v. US\n\nNext Sunday: Schulz to Speak in MA\n\nOn Friday, February 22 the Supreme Court of the United States will decide Bob \nSchulz&amp;#039;s Petition for Rehearing of its January 7th decision not to hear We the \nPeople v. United States, the case demanding a declaration by the Court of the \noriginal intent of the last ten words of the First Amendment, to wit: &quot;Congress \nshall make no law ... abridging the Freedom ... or the Right of the People ... and to Petition the Government for a Redress of Grievances.&quot;\n\n&quot;The intent of the Framers of the Constitution -- our Founding Fathers -- in \ncapping the First Amendment with those ten words is clear to all who take the \ntime to review the historical record,&quot; said Bob Schulz. &quot;The demonstrable as well \nas common sense intent was that the clause would provide individuals with a \nconstitutional guarantee of the natural Right (power) of a free People to \npeacefully hold the Government accountable to each and every provision of the \nseven Articles and Amendments to the Constitution, without harassment or \nretaliation by the Government.  That is, the exercise of Petitioning for Redress \nwould serve as the non-violent protector of all other Rights, Freedoms and \nLiberties, forestalling any necessity for individuals to resort to violence in \ndefense of the Constitution.&quot;\n\n. . .\n\nShould the Supreme Court continue to sidestep its constitutional duty to \ninterpret the meaning of the last ten words of the First Amendment by denying the \ninstant Petition for Rehearing, Bob Schulz and the We The People Congress will \nimmediately turn their attention and resources to the organization and \nimplementation of large-scale, wide-spread acts of &quot;civil disobedience.&quot;\n\nA Government that fails to listen or respond to the People is not fit to rule a \nFree People.\n\nAlthough our Natural Rights may be abridged or &quot;forgotten&quot; over time, they remain \nfundamental forces of Nature that will not be denied.  Where governments cannot \nbe held accountable, Freedom cannot exist.  As our Founders knew well, the Right \nto Petition enables the peaceful dominion of Men over the servant governments \nthey create to secure their Rights, Freedoms and Liberties.\n\nNext Sunday, February 24, from noon to 3 PM, Bob Schulz will be at the Colonial \nInn in Concord, Massachusetts to discuss the matter at hand. Everyone is \nencouraged to attend this most serious meeting. There is no charge to attend. WTP \nwill not be providing any food or beverage. The meeting will be all &quot;business.&quot;\n\nClick here\n&lt;http://www.wethepeoplefoundation.org/MISC/Events/Concord-MA-Feb-2008.pdf&gt;\nfor an event flyer (.pdf). The meeting will be held at:\n\nSunday, Feb. 24, Noon - 3 PM\n\nColonial Inn\n4848 Monument Square\nConcord, MA  01742\n(978) 369-9200\n\nIn addition, arrangements are underway for Bob to be in Texas and Idaho on \nweekends in early March for similar purposes. Details soon.\n","torrent":{"xt":"urn:btih:265b49bb873831c8ef1af54a88cdfc39e452cc1d","amp;dn":"U.S.--SCOTUS+To+Reconsider+Landmark+We+The+People+v.+US+case","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"265b49bb873831c8ef1af54a88cdfc39e452cc1d","infoHashBuffer":{"type":"Buffer","data":[38,91,73,187,135,56,49,200,239,26,245,74,136,205,252,57,228,82,204,29]},"announce":[],"urlList":[]}}