{"title":"The Alex Jones Show - Alex Jones - ALL FOUR PLUS HOURS - 22 Apr","uid":4150389,"size":69430760,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:273f45a4a601eaf077909d172002eb433d5d7078&amp;dn=The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+-+22+Apr+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anotha_modemho","files":1,"time":1208906991,"description":"THE EMPIRE IS ON THE RUN..........All 4 PLUS Hours \n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom Italy&amp;#039;s La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nTotal Recorder 4.4 Capture in 48 kbs stereo from Ku satellite feed or 56 kbs internet streaming audio with commercial edit. About 6.25 hr listening time.\n\nPM me with any of your comments.\n\nTodays gueststopic: \n\n1st HR. - News and OpenLines. Alex talks with Dr. Ibrahim Dremali, Director of Islamic Center of Greater Austin, about the &quot;suicide&quot; of Riad Hamad. \n\n2nd HR. - News and OpenLines. Alex talks with Dr. Ibrahim Dremali, Director of Islamic Center of Greater Austin, about the &quot;suicide&quot; of Riad Hamad.\n\n3rd HR. - News and OpenLines. Alex welcomes Cele Castillo to the studio and discusses the issues of the day and takes your calls. \n\n4th HR. - News and OpenLines. Alex welcomes Cele Castillo to the studio and discusses the issues of the day and takes your calls.  ","torrent":{"xt":"urn:btih:273f45a4a601eaf077909d172002eb433d5d7078","amp;dn":"The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+-+22+Apr+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"273f45a4a601eaf077909d172002eb433d5d7078","infoHashBuffer":{"type":"Buffer","data":[39,63,69,164,166,1,234,240,119,144,157,23,32,2,235,67,61,93,112,120]},"announce":[],"urlList":[]}}