{"title":"Secret Covenant of Your Owners","uid":4137465,"size":420971706,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2803b1bc83ade0f44af8fdee9b5ee7b79c25e988&amp;dn=Secret+Covenant+of+Your+Owners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ForceMultiplication","files":1,"time":1208330474,"description":"The Secret Covenant has never been openly confirmed as the covenant by which the Owners of this world operate. However, in this episode a mountain of supporting evidence is presented that the covenant is in fact a reality. The host explores who is behind the gun control lobbies, anti-male man-hating feminism that destabilizes the family unit, racism, water fluoridation, vaccines and autism, cellphone radiation, chemtrails, poisonous cookware, indoctrination through television, media control, communism, and the collapse and ultimate intended destruction of America with the torching of the Constitution. Who is behind encouraging one race to rise against another? Who encourages human beings to participate in things which kill them and their children? These questions and many others are answered patiently and lucidly. A wealth of supporting evidence is given in the form of showing that very knowledgeable and powerful men saw the same picture that is painted, to include Jesus Christ (Note: This is NOT a fundamentalist movie, nor is it intended to insight violence.). In the end, the author presents that the only answer is to prepare to survive, and that the citizen militia is a necessary component for the survival of the Republic. May we find peace and sustain our Liberty. God Bless the Republic! Stay Strong!","torrent":{"xt":"urn:btih:2803b1bc83ade0f44af8fdee9b5ee7b79c25e988","amp;dn":"Secret+Covenant+of+Your+Owners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2803b1bc83ade0f44af8fdee9b5ee7b79c25e988","infoHashBuffer":{"type":"Buffer","data":[40,3,177,188,131,173,224,244,74,248,253,238,155,94,231,183,156,37,233,136]},"announce":[],"urlList":[]}}