{"title":"Total Distortion - A Music Video Adventure Game [SiN]","uid":4040090,"size":666636444,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:298871820a28458595612a84e300f525973e0ff3&amp;dn=Total+Distortion+-+A+Music+Video+Adventure+Game+%5BSiN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sinfamous","files":1,"time":1203628698,"description":"From the initial concept to the game-over sequences, this is one of the strangest titles you&amp;#039;re likely to see. As a penniless music-video producer stranded in a bizarre alien dimension, your job is to videotape as many unearthly happenings as you can and, using your Personal Media Tower&amp;#039;s built-in video/audio editing station, sell rock videos to the finicky producers back on Earth. Yeah, okay, why not. Central to this task is the creation of music videos custom-made for the personal preferences of each bonehead music-biz exec on the other end of the interdimensional videophone--which, short ?editing demo? aside, proves to be a fairly involved task, requiring the splicing together of vast video and audio clip libraries, plus whatever alien footage the player has managed to procure. The ultimate goal of the game is to return to Earth with wealth, fame, or a combination of the two, depending upon which path you choose--but the real point of Total Distortion is to wander about and have nonlinear fun, creating strange drinks and sandwiches from blocks of unsynthesized Food Goo, browsing a library of odd books (everything from slider-puzzles which may yield game clues to guided tours of San Francisco&amp;#039;s Haight-Ashbury district), and enduring the MTV-flavored weirdness (the player&amp;#039;s first of many possible deaths results in a ?video,? cheerfully sung by his slayer, with lyrics like ?You are dead, you are so, so dead...?). Very late-80&amp;#039;s and too strange not to check out. Have a few stiff drinks first.\n\n- Requires Nero to burn\n- Or Mount with Daemon Tools\n- Enjoy!\n\n[SiN]","torrent":{"xt":"urn:btih:298871820a28458595612a84e300f525973e0ff3","amp;dn":"Total+Distortion+-+A+Music+Video+Adventure+Game+%5BSiN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298871820a28458595612a84e300f525973e0ff3","infoHashBuffer":{"type":"Buffer","data":[41,136,113,130,10,40,69,133,149,97,42,132,227,0,245,37,151,62,15,243]},"announce":[],"urlList":[]}}