{"title":"Coast to Coast Radio Program! Commercial Free! Mar 19th thru Mar","uid":4101171,"size":385090601,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:29a889cfafd43529e87993aa7dded63fc8f828de&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Mar+19th+thru+Mar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":35,"time":1206580830,"description":"Seven more broadcasts of the number one rated late night radio program in history! Yes, of course, Coast to Coast AM! Thanks in advance to all the seeders and uploaders of these torrents. I hope you all enjoy! Until next week my friends. I&amp;#039;ll see you out there in dreamland! Later All! Stokeman Out.......\n\nWednesday March 19th, 2008\nHidden Archeology &amp; Cosmic Hierarchy\nAuthor and researcher Michael Cremo returned to discuss &amp;#039;forbidden archeology,&amp;#039; ancient Sanskrit knowledge, and cosmic hierarchy. He shared evidence that humans existed on this planet millions of years ago. Examples included, a human skeleton found in... \nHost: George Noory\nGuest(s): Michael Cremo, Robert Felix\n\nThursday March 20th, 2008\nJohn Titor &amp; Time Travel\nHistorian for alleged time traveler John Titor, Oliver Williams reviewed the facts of the remarkable case, and related some of Titor&amp;#039;s past predictions to recent news stories. Titor&amp;#039;s story has been pieced together from posts he made on Internet discussion... \nHost: George Noory\nGuest(s): Oliver Williams, Jerome Corsi, Richard C. Hoagland\n\nFriday March 21st, 2008\nFull Moon Friday Open Lines\nDuring Open Lines, George offered a special &amp;#039;lost&amp;#039; line for callers who have had things vanish under perplexing circumstances. Josh from Iowa City said a buddy dropped a Reese&amp;#039;s Peanut Butter Cup under the car, searched but could not find it beneath the...\nHost: George Noory\nGuest(s): Open Lines, Helen Reddy\n\nSaturday March 22nd, 2008\nLindbergh Baby Found!?\nRaised as an orphan by strangers, Charles A. Lindbergh Jr. shared evidence gained by personal research and questioning under hypnosis to support his claim that he is in fact the grown kidnapped son of famous aviator Charles Lindbergh. Lindbergh... \nHost: Ian Punnett\nGuest(s): Charles A. Lindbergh Jr.\n\nSunday March 23rd, 2008\nThe Bond Code\nAuthor Philip Gardiner joined George Knapp (email) to discuss the life of James Bond author Ian Fleming and his associations with the world of the occult which led him to create a series of clues, ciphers and codes within his novels. Early in his... \nHost: George Knapp\nGuest(s): Philip Gardiner, Luke Fortune\n\nMonday March 24th, 2008\nThe Science of Prediction\nAppearing during the middle two hours, mathematician and author David Orrell discussed the science of prediction from ancient history until the present day. In particular, he looked at how chaos theory and complexity limit our ability to predict weather,... \nHost: George Noory\nGuest(s): David Orrell, Ron Paul\n\nTuesday March 25th, 2008\nAlternative Agriculture\nA subsistence farmer in Hawaii, Jon Biloon shared his studies of alternative agriculture, and discussed the dangers of genetically modified (GM) foods and how agri-business is robbing individuals of health and spirituality. The genetic modification... \nHost: George Noory\nGuest(s): Jon Biloon, Rob Simone","torrent":{"xt":"urn:btih:29a889cfafd43529e87993aa7dded63fc8f828de","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Mar+19th+thru+Mar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a889cfafd43529e87993aa7dded63fc8f828de","infoHashBuffer":{"type":"Buffer","data":[41,168,137,207,175,212,53,41,232,121,147,170,125,222,214,63,200,248,40,222]},"announce":[],"urlList":[]}}