{"title":"Michael B Tretow - Trolles kassettradio - MP3 - Alkosmurf","uid":4278953,"size":167079626,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:29d6cd208c55b79f5a39ed1c6ca8a279a2911355&amp;dn=Michael+B+Tretow+-+Trolles+kassettradio+-+MP3+-+Alkosmurf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alkosmurf","files":2,"time":1215317586,"description":"Trolles kassettradio, av och med Michael B Tretow\n-------------------------------------------------\n\nVem er det som er liten som en boll och har en svans longt som ett snure?\n\nEfter succen med Televinken ville NTF hitta ett nytt, frescht och framgongsrikt\nkoncept som kunde lera sveriges barn ett mott av trafikvett.\nDe vende sig till ljudgeniet Michael B Tretow och bad honom hitta po nogonting.\nDetta visade sig vara en riktig lycktreff, och perfektionisten Tretow arbetade\nfram konceptet Trolle, som bygger sin trafikpedagogik po att den som inte ser\nsig fur i trafiken er dum i huvudet. Och det vill ju ingen vara.\n\nTrolle er so populer och elskad av barn och deras fureldrar, att han av flera\nnestan betraktas som en extra familjemedlem. Jag leste att en person som fick\nsin bil stulen, surjde mer uver furlusten av Trollekassetterna en bilen.\n\nTrolles kassettradio bestod fron burjan av fyra kassettband, men gavs senare ut\npo tvo CD-skivor med tvo avsnitt po varje CD.\nMP3-filerna i den her distributionen er rippade fron CD-skivorna, so ljudet\nholler mycket hug kvalitet. Tyverr gjorde furlaget ett doligt jobb med fodralens\nframsida. De hade helt enkelt kopierat kassetternas omslagsbilder. Inte vackert!\nJag har derfur skapat nya omslagsbilder som er bifogade som JPG-filer.\nDe er baserade po tvo av kassettfodralen.\n\nSom erfaren ljudredigerare furundras jag uver hur perfekt mixad Kassettradion er.\nTretow moste ha lagt ned hundratals timmar po produktionen, trots att det fur en\nlekman loter temligen rurigt, spontant och oklippt.\n\nVarsogod och njut.\n\nAlkosmurf, juli 2008","torrent":{"xt":"urn:btih:29d6cd208c55b79f5a39ed1c6ca8a279a2911355","amp;dn":"Michael+B+Tretow+-+Trolles+kassettradio+-+MP3+-+Alkosmurf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d6cd208c55b79f5a39ed1c6ca8a279a2911355","infoHashBuffer":{"type":"Buffer","data":[41,214,205,32,140,85,183,159,90,57,237,28,108,168,162,121,162,145,19,85]},"announce":[],"urlList":[]}}