{"title":"Yamicsoft WinXP Manager v5.2.4 Thinstalled [Ali Akbar]","uid":4157201,"size":6014565,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2aa5122178a4354d98672da83e6a586d388fecbd&amp;dn=Yamicsoft+WinXP+Manager+v5.2.4+Thinstalled+%5BAli+Akbar%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AliAkbar","files":2,"time":1209205285,"description":"Works 100% and please continue seeding if you like it and please leave comments so other can know it works or not and also advice me how to make better portable apps.\nNOTE:\n=========\nI am not responsible for the performance or the behavier of this \nbackup nor its effect on your computer as its legally obtained.\nthis product and backed up for testing and educational purposes ONLY. \nDon\\\\\\\\\\\\\\&amp;#039;t complain about any release as, I\\\\\\\\\\\\\\&amp;#039;m not the original releaser.\n\nIf you like the software and want to use it - you must buy it\nand contribute to the effort &amp; time spend in the making of it.\n====================================================================================================\nDETAILS:\n============\n\n\nThe complete solution to optimize, tweak, clean up Windows XP\nWinXP Manager is a tool for setting, optimizing, diagnosing and tweaking Windows XP. It bundles more than 30 different utilities in one and help your system faster and more stable, secure and personal! WinXP Manager helps you optimize, tweak, and clean up Windows XP. It will increase your system speed, improve system security, and meet all of your expectations. \n\nYou can tweak memory and CPU settings, customize IE settings, find and remove junk files, check and repair your registry, control startup programs, optimize your connection speed, validate your Favorites and much more. It also includes an Auto-Optimization option, that allows less experienced users to easily optimize certain settings, using a wizard. The interface is easy to use and all available options are categorized into sections. Includes basic documentation and an annoying nag screen that pops up every few minutes. It\\\\\\\\\\\\\\&amp;#039;s compatible with Windows XP SP2 entirely!\n\nFeatures and Benefits of WinXP Manager:\n* Information - Get detailed system and all hardware information on your system; helps you to find out the missing Registration codes of Microsoft product; show all detailed information of running processes and threads on your machine; WinXP Manager offers optimization Wizard feature for the user without having any advanced knowledge.\n* Optimizer - Tweak your system to improve windows startup and shutdown speed; monitor and free your Physical Memory; tweak your hardware to increase system speed and performance; disable some unnecessary services which start with windows; repairs Internet Explorer and certain other System Components to restore these functions.\n* Cleaner - Find out which files or folders engross your disk space and shown with chart; Find and clean junk, unnecessary wallpaper and screen saver files to increase Hard Disk space; Duplicate Files Finder can scan your computer for files with the same size, name and modification time; Registry Cleaner can easily checks your registry and repair incorrectly linked registry entries, automatically remove invalid entries; Registry Defrag rebuilds and re-indexs your registry to reduce application response time and registry access time; smart uninstaller can uninstall and logoff installed programs neatly.\n* Customization - Control what is started on Windows startup; edit context menus of mouse Right-Clicking; customize system desktop, menus, toolbar and notifications settings, change Windows logon background; change system icons; custom OEM information; automatically change your desktop wallpaper on background.\n* Security - You can improve desktop, menus, control panel, windows logon securities, and enable numerous hidden performance options of system, disable system updates and error reports; hide and restrict to access drives, specify which applications are not allowed to be executed on your computer; encrypt/decrypt and shred files, camouflage folder to hide its content from Windows explorer, change the location of system folders; Privacy Protector can maintain your personal privacy by eliminating the tracks that you leave behind; create lots of randomization password once.\n* Network - Optimize your Internet connection speed, manage all shares items, search for and find out opened ports on your system; Tweak your Internet Explorer easily; backup all data in Outlook Express; automatically check the invalid URLs in your favorites and parse domain name; Message Sender can easily send messages to others.\n* Misc. Utilities - Show the collection of Windows utilities; control your computer when you\\\\\\\\\\\\\\&amp;#039;re not at home; apply XP visual style to any Windows applications; appoint logging on time of any account users. \n\nChanges in WinXP Manager 5.2.4, 4/25/2008:\n- Duplicate Files Finder updated to v2.0\n- Privacy Protector updated to v2.5 \n","torrent":{"xt":"urn:btih:2aa5122178a4354d98672da83e6a586d388fecbd","amp;dn":"Yamicsoft+WinXP+Manager+v5.2.4+Thinstalled+%5BAli+Akbar%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aa5122178a4354d98672da83e6a586d388fecbd","infoHashBuffer":{"type":"Buffer","data":[42,165,18,33,120,164,53,77,152,103,45,168,62,106,88,109,56,143,236,189]},"announce":[],"urlList":[]}}