{"title":"EximiousSoft GIF Creator 5.52 + keygen","uid":4145862,"size":2844068,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2b3cd935199feae7e0599215393f48eb2d7e664d&amp;dn=EximiousSoft+GIF+Creator+5.52+%2B+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goldblazer","files":1,"time":1208723026,"description":"An easy, effective and powerful aplication designed for building GIF animation.EximiousSoft GIF Creator is a kind of powerful,rapid and visual GIF design tool. With dozens of Special good effects,it can help you make out amazing animations or banners within short time.\n\nEximiousSoft GIF Creator provides many professional image-editing tools including seletion tools such as Magic wand tool and Lasso tool as well as many geometric shapes selection tools.Once you have made a selection on an animation, you can directly edit on this area without any effects to others. Moreover, you can also copy, move or delete this area according to your needs.\n\nEximiousSoft Gif Creator has strong support to vector graphics. You can use it drawing out excellent smooth straight line, rounded rectangle, ellipse and other geometric shapes.Besides, EximiousSoft GIF Creator can produce many texts or symbols with surprising quality. By adding Outline or shadow, the texts and symbols will have very strong 3d vision effects.\n\nEvery time when EximiousSoft GIF Creator output an GIF animation, it will optimize it by greatest degree at first for creating out smallest GIF file. But it&amp;#039;s still able to wholly maintain the original quality of the picture.What&amp;#039;s more, since all edits of this program are visual, you can view the edit results directly as well as cancel any operation at any time. it&amp;#039;s very easy-used and convenient.EximiousSoft GIF Creator supports inputting and outputting a great deal of different animation formats and image formats. Such as GIF, AVI, BMP, PCX, JPG, TIFF, PNG, TGA, PSD, ICO, CUR,ANI, SWF etc. ","torrent":{"xt":"urn:btih:2b3cd935199feae7e0599215393f48eb2d7e664d","amp;dn":"EximiousSoft+GIF+Creator+5.52+%2B+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3cd935199feae7e0599215393f48eb2d7e664d","infoHashBuffer":{"type":"Buffer","data":[43,60,217,53,25,159,234,231,224,89,146,21,57,63,72,235,45,126,102,77]},"announce":[],"urlList":[]}}