{"title":"cedega_4.3.2-1.i386.tgz","uid":3346698,"size":7619744,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:2bd78e255ad7a82b6b3e72126c89b89a92b221e2&amp;dn=cedega_4.3.2-1.i386.tgz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rece","files":1,"time":1119274896,"description":"Cedega 4.3.2\n\nIt can be used for all kind of linux even gentoo [can be inserted in portage tree]. Here's a howto for 4.3.1 [sry, I haven't fount newer]:\n\n\n                 TransGaming Cedega HOWTO Guide 4.3-1.1.1.1.en\n                 ===============================================\n\nThis guide provides an overview of how to use TransGaming's Cedega to run your \nfavorite games on Linux.  If you have any questions about how to use Cedega, or \nif you have other support issues, please use TransGaming's web-based support \nsystem at http://www.transgaming.org/forum/\n\n===================\nSystem Requirements\n===================\n\nThe following are the minimum requirements for Cedega 4.3:\n\nOperating System\n----------------\nCore requirements are: \n- Linux Kernel 2.2 or higher. Stock Kernels recommended over RedHat \n  7.x/8.x/9.x kernels. 2.6 kernels are not recommended due to stability\n  issues.\n- XFree86 4.0 or higher (4.2 and above recommended) \n- glibc 2.2 or higher \n- working hardware accelerated OpenGL video card\n\nCPU Type and Speed\n------------------\nRecommended minimum hardware is \n- 500 MHz or faster Pentium or Athlon CPU \n- 64MB of memory; 128 MB or higher recommended\n- 1-2 GB free hard disk space for games \n- Linux Supported 3D graphics card with 16MB of video RAM is required.  \n  Nvidia GeForce-class GPU recommended. ATI Radeon 8500 or higher with\n  working ATI FireGL drivers should work for many (though not all) games, \n  but will not perform as well for the moment.\n\nPlease note: individual requirements may be higher for certain games.\n\n====================================\nConfiguring Your Computer for Cedega\n====================================\n\nMake sure that your video card has working 3D acceleration \n----------------------------------------------------------\nMake sure that the latest drivers for your video card have been installed on \nyour system, and that OpenGL is working properly.  (NVidia card owners, please \nvisit http://www.nvidia.com.  ATI card owners, please visit http://www.ati.com)\n\nTo test your graphics card for OpenGL support execute the following command:\n\n  $ glxinfo | grep #direct rendering#\n\noutput will return &quot;direct rendering:&quot;\n\nIf this is 'Yes' or 'Enabled' then OpenGL is likely set up correctly.  If it is \nlisted as 'no' or 'disabled' then double-check your 3D setup.\n\nYou may also want to try a performance test.  Execute the following to run a \nsimple benchmark included on most popular Linux distributions:\n\n $ glxgears\n\nThe glxgears program will output an FPS (Frames Per Second) rating to the \ncommand line.  If 3D acceleration is correctly enabled for your video card,\nthen the reported FPS should be well over 500 FPS at the default window size.\nIf the output shows less than 500 FPS then you should double check your 3D \nsetup.\n\nIn some cases it is possible to have multiple OpenGL libraries\ninstalled on your system.  If you are having problems with Cedega, you may \nwish to check whether this is the case for your system.  You can easily \ndo so by executing:\n\n $ locate libGL\n\nThis will display any OpenGL libraries you have on your system.  In \nparticular, you should be cautious of having libGL in both /usr/lib \nas well as in /usr/X11R6/lib.  Sometimes, the software-only Mesa OpenGL \nlibraries are installed in /usr/X11R6/lib and hardware accelerated drivers \nare installed elsewhere.  We do not recommend removing the Mesa libraries \nfrom /usr/X11R6/lib unless you are seeing slow rendering in games running \nunder Cedega.\n\nCheck your cd devices and mount points for permissions\n------------------------------------------------------\nMany Windows games use copy protection systems that requires Cedega to have \n'read' access to your CD-ROM device, as well as 'read' and 'execute' access \nto your CD-ROM mount point.  Check your CD-ROM devices and mount points to \nensure that Cedega has appropriate permissions. \n\nIf you do not know what devices and mount points are being used by your \nsystem, you can read the /etc/fstab file for more information using the \nfollowing command:\n\n $ less /etc/fstab\n\nTo change the permissions on your CD-ROM device and mount points, execute the \nfollowing commands as 'root':\n\n # chmod a+r [CD-ROM Device]\n # chmod a+rx [CD-ROM mount point]\n\nMany distributions of Linux use symbolically linked devices.  You will also\nneed to change permissions on the linked devices as well.  To see if a device\nis linked, run the following command:\n\n $ ls -la [CD-ROM Device]\n\nThis command will return information that may resemble the following:\n\nlr-xr-xr-x    1 root     root           13 Aug 21 14:45 /dev/cdrom -&gt; cdroms/cdrom0\n\nIf the output displays a -&gt; then this device is linked.  In the above output the\ndevice /dev/cdrom is symbolically linked to the device /dev/cdrom/cdroms/cdrom0.\nBe sure to change the permissions on all linked devices.\n\nUnder some circumstances, you may need to edit your /etc/fstab file to ensure\nthat all users have access to the CD-ROM mount point.  \n\n\nCheck your X configuration file\n-------------------------------\nDepending on your distro this may be called either XF86Config, XF86Config-4 \nor xorg.conf. \n\nGames often attempt to change your screen resolution to fit their needs.\nMake sure that the 'Screen' section of your X config file has a number \nof resolutions.  The most common resolutions are: 1600X1200,  1280X1024,\n1024X768, 800X600, 640X480. If the game is not running at fullscreen properly,\ncheck the game settings to see what resolution it is attempting to use and \nmake sure that resolution is listed in your X config file.  \t\n\nNote:  You may experience improved performance with some games when running \nthe X server at 16 bit color depth.\n\nDisable Sound Servers\n---------------------\nMany Linux desktop systems such as KDE and Gnome run sound servers such as \n'ARTS' or 'esd'.  These sound servers can cause sound problems within Cedega \nby reserving exclusive access to the sound device.  If you are having sound \nproblems make sure to disable any sound servers or other applications that \nmay be using sound, such as 'xmms'.\n\nCheck free space limitations\n----------------------------\nSome systems may be set up with restrictive space quotas on the /home \ndirectory.  These limitations can cause Cedega to incorrectly report available \nfree space.  You may experience problems installing games if the \navailable space is reported incorrectly, or if there is not enough space\navailable on your system.  If you experience any error messages reporting\nthat there is not enough hard drive space to install a game, disable quotas, \nor symbolically link to a device with more free space available.\n\nPrelink, Exec-Shield and VA Layout\n----------------------------------\nAs of Cedega 4.3, there are no longer any compatability issues between prelink, \nexec-shield, the new VA layout and Cedega.  These features can be left enabled \nand will work seamlessly with Cedega.\n\nFor versions of Cedega older than 4.3 please refer to the Prelink, Exec-Shield, \nand VA Layout section in the 4.2.1 Release Notes or HOWTO Guide.\n\nExec (error = 21)\n-----------------\nSome distributions' versions of mount now run with the noexec option unless \notherwise specified.  Running games from a partition mounted with noexec can \ncause an error = 21 message.\n\nTo fix this issue, edit /etc/fstab and modify the partition line by \nchanging 'noexec' to 'exec' in the mount options.  \n\nFor example, change:\n /dev/hda1 / ext3 errors=remount-ro,no-exec,defaults 0 1\nto:\n /dev/hda1 / ext3 errors=remount-ro,exec,defaults 0 1\n\nIf neither &quot;exec&quot; nor &quot;no-exec&quot; appears in the line it is recommended that you\nadd &quot;exec&quot; to ensure that the partition can be used by Cedega.\n\nTo remount the partition run:\n $ mount -o remount /\n\n\n======================\nHow To Install Cedega:\n======================\n\nCedega is available in a variety of pre-built binary packages designed to \nsuit your Linux distribution.  Please note that TransGaming does not provide \nofficial support for packages built from source. \n\nFirst select the package that is right for you:\n\nrpm - RedHat Package Management (RedHat Linux, Mandrake Linux, etc)\n\n To install the Cedega rpm package open a console/terminal window and execute \n the following command as 'root':\n\n   # rpm  -ivh  cedega-[version].rpm\n\ndeb - Debian Package (Debian GNU/Linux, Corel/Xandros Linux, Lindows, etc)\n\n To install the Cedega deb package open a console/terminal window and execute \n the following command as 'root':\n\n   # dpkg  -i  cedega_[version].deb\n\ntgz - Tar GZipped Package (Slackware Linux, etc)\n\n To install the Cedega tgz package open a console/terminal window and \n execute the following commands as 'root':\n\n   # cd /\n   # tar -xvzf  cedega-[version].tgz \n\nSome distributions use their own package management tools, such as Gentoo and \nSlackware.  If this is so the tgz package of Cedega can be used with most of \nthese tools.\n\n\nInstalling the Font Installer Package:\n--------------------------------------\nThe font installer package is a convenience script provided by TransGaming \nfor the purposes of downloading and installing the Microsoft Core Fonts.  Please \nnote that you must accept a licencing agreement with Microsoft as part of \nthe process in installing this package.\n\nIf you've already installed Cedega using the steps in the previous section, \nthen this part should be familiar.  Otherwise, please review the steps above. \nSelect the proper package for your distribution, and install it.\n\nAfter the package is installed, each user who wishes to use the fonts will need \nto run the installer script.  At the command line, type:\n\n  $ tg-font-install\n\nFrom there, follow the on-screen instructions to complete the install.  This \nwill install the fonts in that user's ~/.transgaming_global/Fonts/ directory.\n\n\nInstalling the Mozilla ActiveX Control Installer Package:\n---------------------------------------------------------\nThe Mozilla ActiveX Control installer package is a custom win32 mozilla package \nprovided by TransGaming for the purposes of providing support for HTML content \nto games inside of Cedega.  Please note that you must accept a licencing \nagreement with Mozilla and its developers in order to download and use this \nproduct.\n\nIf you've already installed Cedega using the steps listed above, then this part \nshould be familiar.  Otherwise, please review the steps above.  Select the \nappropriate package for your distribution, and install it.\n\nAfter the package is installed, each Linux user who wishes to use the Mozilla \nActiveX Control will need to run the installer script.  At the command line, \ntype:\n\n  $ tg-mozctl-install\n\nFrom there, follow the on-screen instructions to complete the install.  This \nwill install the Mozilla ActiveX Control in that user's \n~/.transgaming_global/mozcontrol directory.\n\nOnce installed as directed above, Cedega will by default use the Mozilla \nActiveX control to render HTML content, as appropriate.  If desired, it can\nbe disabled in the [wine] section of the config file by setting:\n&quot;MozillaControl&quot; = &quot;N&quot;\n\n==============================\nInstalling a Game Using Cedega\n==============================\n\nTo install a game using Cedega open a console/terminal window, and follow \nthe following procedure:\n\n1) Insert and mount your cdrom drive.\n\n    For the following examples we will be assuming a CD-ROM mount point \n    of /mnt/cdrom; your setup may be different, depending on your Linux \n    distribution.  The mount point for your cdrom can be found in \n    the /etc/fstab file.\n\n2) Once the cd has been mounted check the contents of the disc.\n\n   $ ls /mnt/cdrom\n\n   Most installers will be named 'setup.exe' or 'install.exe'.  If this is \n   not the case, you may need to locate the install executable; it is often \n   listed in the documentation for the game, or you may need to check the \n   game information page on the TransGaming website. \n\n3) When you have located the correct installer executable, install the \n   game using:\n\n   $ cedega  /mnt/cdrom/setup.exe  \n\n   Then, follow the install instructions for the game you are installing.  \n   You may experience some graphical errors during the copying \n   process.  These are generally not harmful.  \n\nSome games require special install instructions or methods.  If you are having\nproblems installing a game please check the games database and forums found on \nthe TransGaming Website.\n\nMulti-Disc Installers:\n----------------------\nSome games that have multiple discs to install may not allow for unmounting\na CD-ROM as it may register as busy.  If this is the case, you should run the\ninstaller with the -monitor-cdrom-eject option, and then you may press the eject\nbutton on CD-RW or DVD drives and the disc will unmount and eject automatically.\nFor non RW/DVD cdrom drives you will need to run: killall -USR2 wineserver\nThis command will unmount and eject all CD-ROMs. Please note this command could \nalso cause problems if there are multiple copies of the wineserver running.\n\nThis useful functionality is off by default due to the fact that the drivers for \nsome hardware could cause problems with flash cards or degrade performance.\n\nFor more information, please see the &quot;CD/DVD Ejection System&quot; section below.\n\n===========================\nPlaying a Game Using Cedega\n===========================\n\nThere are three methods for starting a game once it has been installed.\n\nUsing the Desktop Icon:\n-----------------------\n Some (but not all) games will create a desktop icon during the installation \n process.  To start the game, simply open this icon using a click or \n double-click, depending on your window manager settings.\n\n If you wish to pass special options to Cedega or the game edit the desktop \n shortcut and add in the appropriate options.\n\nUsing the Start Menu:\n---------------------\n Some games, on some Linux distributions will add a link to the start \n menu on your desktop.  Simply click the start menu, go to TransGaming -&gt; Programs\n and then the game name/vendor and select the game icon.  \n\n Again, if you wish to pass special options to Cedega or the game edit the menu \n item shortcut.\n\nUsing the Command Line:\n=======================\n\n Open a console/terminal window and change into the game directory using the\n following commands:\n\n $ cd ~/TransGaming_Drive/Program Files/[Game Directory]\n $ cedega [wine options] game.exe [game options]\n\nOptions can be passed both to Cedega and the game using the command line.\n\nThe options for Cedega are:\n\n -bigexe  \n\tAs of Cedega 4.3 this option is now the default behaviour, and is only \n\taccepted for backwards compatibility.\n\n -use-pthreads\n        A way to override the use of pthreads. This option should be\n        automatically set by Cedega, however, if problems exist it may be useful \n        to change the pthreads option.  Acceptable values are yes or no.\n\n -winver\n        Specify the version of Windows Cedega will report: win95, win98, winme, \n        nt351, nt40, win2k, winxp, win20, win30, win31\n        The default setting is win98.\n\n -debugmsg\n        Display error information/output:\n        +all, -all, +relay, +dsound, +err are the most common options\n        -all is the default option, and will suppress any errors\n\n -use-dos-cwd\n        Specifies the Cedega working directory.  The default is the current \n        directory.   Directories may be specified using either DOS or Linux \n        filenames.\n\n -monitor-cdrom-eject\n        Enables the CD eject polling functionality.  This option is off by \n        default and typically only needs to be enabled for some multidisk \n        installers.  When enabled, the CD-ROM drives are periodically checked to \n        see if the CD-ROM's eject button has been pressed.  Even when disabled, \n        the eject can be forced by sending the USR2 signal to the wineserver \n        process.  Care should be taken when enabling this option on systems \n        which have compact flash drives.\n\n -version\n        Report the version of Cedega that you are using\n\nOptions for individual games can usually be found in the game's 'README' file.\n\n\n==================\nConfiguring Cedega\n==================\n\nCedega configuration options are located in the '.transgaming' directory found \nin your home directory. The main configuration file is '.transgaming/config'.  \nThis is an ASCII text file. The first time you run Cedega, the '.transgaming' \ndirectory will be automatically created for you, in a default preconfigured \nstate.  The default preconfigured state is copied from the \n/usr/lib/transgaming_cedega/.transgaming directory. \n\nTo edit the Cedega configuration settings open '~/.transgaming/config' in your \nfavorite text editor.\n\nDrives Section\n--------------\nThis section defines the drives that Cedega will use. New drives can be \nspecified here if necessary. Any CD-ROM or DVD drives connected to your system \nwill be automatically detected by Cedega at runtime, and new drive letters will \nbe dynamically assigned to them. You should not need to add CD-ROM or DVD drives \nmanually unless you are having configuration problems.\n\nThe format for this section is as follows:\n[Drive LETTER]     - The drive name, where LETTER is the DOS/Windows drive letter \n                     i.e. c, d, e, z\nPath = LOCATION    - The location for the drive root.\nType = TYPE        - Specifies drive type; supported types are: floppy, hd, cdrom \n                     and network\nLabel = XXXX       - Drive label, max 11 characters\nSerial = XXXX      - Drive serial number, max 8 characters hexadecimal\nFilesystem=TYPE    - Filesystem type supported file systems are: dos, fat, win95, \n                     vfat, and unix\nDevice=/dev/DEVICE - Allows you to specify a specific device if raw access is\n                     required.  It is recommend that if the device is symbolically\n                     linked than you should use the device that is not a link (the\n                     originator).\n\nwine Section\n------------\nThis section is for general options.\n\n&quot;MozillaControl&quot; = &quot;Y&quot;\nThis option defines whether or not Cedega will use the Mozilla ActiveX control \nif it is available.  The default is on.\n\nDLL Section\n-----------\nThis section defines which DLLs are used by Cedega.  The syntax is as follows:\n&quot;dllname&quot;       = &quot;builtin, native&quot;    or\n&quot;dllname&quot;       = &quot;native, builtin&quot;\n\nThe order defines which is used first. If builtin is listed first it will use \nthe Cedega builtin dll, if native is listed first Cedega will use a native \nWindows dll if it is present in the configured system directory. Occasionally,\nusing a native Windows may improve compatibility with some programs.\n\nx11drv Section\n--------------\nThis section contains the settings for interaction between Cedega and the X \nserver.  Some of the most commonly used options are: \n\n&quot;Managed&quot; = &quot;Y&quot;\nThis option changes whether the Cedega window is a managed window.  The \ndefault is yes.  Managed windows are managed by the Window Manager rather \nthan Cedega.\n\n&quot;Desktop&quot; = &quot;800X600&quot;\nThis option allows you to run Cedega within a window of the specified size.  \nThis line is commented out by default, thus allowing games to create a \ntop-level X Window for each window that is opened.  \n\n&quot;DXGrab&quot; = &quot;Y&quot;\nThis option turns mouse grab on/off.  The default is on.  When mouse grab \nis on, the application may lock the mouse cursor within a window, typically\nwhen the application wants to take over the full screen of your system.\n\n&quot;XVidMode&quot; = &quot;Y&quot;\nThis option allows applications to resize the resolution of your display.  \nBy default, this option is on, allowing applications to switch between \nresolutions listed in the XF86Config file.\n\n&quot;UseXRandR&quot; = &quot;N&quot;\nUse XRandR extension, if present, to resize the resolution of your display.\nThis option is similar to XVidMode but may provide additional functionality \nin some cases.\n\n&quot;ShowFPS&quot; = &quot;N&quot;\nThis option turns the TransGaming HUD that displays the in game FPS on/off.\nDefault is off.\n\n&quot;ShowMEM&quot; = &quot;N&quot;\nThis option toggles to display of memory statics on the TransGaming HUD.  \nYou must have ShowFPS activated for this to take effect.  Default is off.\n\n&quot;VideoRam&quot; = &quot;32&quot;\nThis is the amount of video RAM your video card has (in megabytes).\n\n&quot;AGPVertexRam&quot; = &quot;32&quot;\nThis is the amount of memory (in megabytes) that can be allocated for use \nwith accelerated vertex buffers when using NV_VAR.  A good value for this \ntypically half of your AGP aperture size. For best results using Cedega you \nshould set your AGP aperture to at least 128MB (this can be done in your \nbios) and set AGPVertexRam to 64.\n\n&quot;NV_VAR&quot; = &quot;Y&quot;\nEnable usage of the NVidia Vertex Array Range extension for Accelerated Vertex \nBuffers.  This extension is only available on NVidia cards.  The default is on.  \nThis option has precedence over the ARB_VBO option, if both are available and \nenabled. \n\n&quot;ARB_VBO&quot; = &quot;Y&quot;\nEnable the usage of the OpenGL ARB Vertex Buffer Object extension for \nAccelerated Vertex Buffers.  This extension is available on both NVidia and ATI \ncards, although support for it is still experimental at this stage and is not \nas mature or fully featured as NV_VAR.  The use of NV_VAR is recommended if \navailable, and has precedence if both are enabled.  The default is on.\n\n\nd3dgl Section \n-------------\nThis section contains the settings for advanced graphical functionality.\n\n&quot;AnisotropicTextureFiltering&quot; = &quot;N&quot;\nEnable anisotropic texture filtering, which is a method of improving the look \nof textures when viewed from an angle.  This may result in visual improvements \nin some cases, but may cause a considerable drop in FPS (up to 50%).  The \ndefault is off.\n\n&quot;VertexShaders&quot; = &quot;Y&quot;\nVertex shaders are used to add complex-to-compute graphical routines that are \noften optional. While the Cedega implementation of vertex shaders is hardware \naccelerated when the underlying OpenGL driver supports it, it may be implemented \nin software emulation on some cards.  It is impossible for Cedega to determine \nif software or hardware vertex shaders are available. When enabled, Cedega \nreports hardware vertex shaders support to applications, if the \nARB_vertex_program extension is available.  When disabled, some applications may \nrely on their own optimized software fallbacks.  Default is on.\n\n&quot;PixelShaders&quot; = &quot;Y&quot;\nPixel shaders are used to compute complex per-pixel lighting and coloring.  In \nsome games the use of pixel shaders is optional, and disabling it can result in \nfaster gameplay, although at the expense of lower quality graphics.  When \nenabled Cedega reports pixel shaders support to applications, if the \nARB_fragment_program extension is available.  When disabled, some applications \nmay rely on their own fallbacks.  Default is on.\nFor more information on this option, please see later in this document.\n\n&quot;PixelShadersLevel&quot; = &quot;1.3&quot;\nWhich version of pixel shader support to report to applications.  Valid options \nare &quot;1.0&quot;, &quot;1.1&quot;, &quot;1.2&quot;, and &quot;1.3&quot;.  The default is &quot;1.3&quot;.  Note that this has \nno effect if pixel shaders are disabled, or not supported by hardware.\n\n&quot;ClipSpaceFix&quot; = &quot;Y&quot;\nThis option allows Cedega to better emulate the differences in the graphical \ndepth component (z) between D3D and OpenGL.  As of version 4.0, this option can \nsafely be enabled at all times.  However in previous versions, it should be \ndisabled when applications make use of vertex shaders as this can result in \nincorrect graphics.  The default is on.\n\n&quot;FixedProgram&quot; = &quot;Auto&quot;\nThis option contols whether the fixed function over vertex shaders path is \nenabled or if the legacy fixed function path is used.  The use of Fixed \nPrograms requires the OpenGL ARB_vertex_program extension to be present,and\nfor optimal performance, must be implemented in hardware. Valid options are \nYes/No/Auto. The default value is Auto, which auto-detects the type of \ngraphics card used, and enables fixed programs if appropriate.  Set this \noption to &quot;No&quot; to use the legacy fixed function path.  Set this option to \n&quot;Yes&quot; to use the fixed function over vertex shader technology.\nFor more information on this option, please see later in this document.\n\n&quot;RectangleTextures&quot; = &quot;Auto&quot;\nMost recent hardware has support for non-power of two (NPOT) textures, and \nthis is exposed under OpenGL using either the XXX_rectangle_texture or \nARB_texture_non_power_of_two extensions.  This option deals with the former, \nand is used to enable/disable support under Direct3D.  Older cards are not \ncapable of handling these textures and vertex shaders at the same time, due \nto limitations of the vertex shader hardware, so if you wish to use npot \ntextures here, you may need to disable VertexShaders.  Set this option \nto &quot;Yes&quot; to use npot textures.  Set this to &quot;No&quot; to disable them.  The \ndefault is &quot;Auto&quot;, which auto-detects whether your system has sufficient \ncapabilities in the VertexShaders, and if not, disables it.\n\n&quot;FragmentOffset&quot; = &quot;Auto&quot;\nThe semantics of the the FragmentOffset option have changed in Cedega 4.3, \nwith the addition of a new type of offset.  Possible values are &quot;No&quot;, &quot;Tex&quot;, \n&quot;Auto&quot;, and &quot;Pos&quot;.  The default is &quot;Auto&quot; which automatically selects the \ncorrect type of offset depending on the game and your video card. &quot;Tex&quot; \napplies the fragment offset to the texture coordinates (this was the default \nin previous versions). &quot;Pos&quot; applies the fragment offset to the vertex \nposition (this is currently the default for most games).  &quot;No&quot; disables \nthe fragment offset for all games.\n\n\ndinput Section\n--------------\nThis section contains options that control how dinput behaves.\n\n&quot;DefaultDeadZone&quot; = &quot;1000&quot;\nThis option allows you to define the default dead zone for your joystick \nexpressed as a number between 0 and 10000. The default is 1000 which is \n10% of the range of your joystick.\n\n\njoystick Section\n----------------\nThis section contains the configuration for how joysticks should be treated \nunder Cedega.\n\n&quot;Logitech Inc. WingMan RumblePad&quot; = &quot;X,Y,slider,Z,RZ,hat,none&quot;\nControls the configuration of the function of joystick axes.  The joystick name \nand axis functions can be determined with the program 'jstest'.  The available \naxis types are:\n&quot;none&quot;, &quot;X&quot;, &quot;Y&quot;, &quot;Z&quot;, &quot;RX&quot;, &quot;RY&quot;, &quot;RZ&quot;, &quot;slider&quot;, &quot;hat&quot;, &quot;POV&quot;, and &quot;ball&quot;\n&quot;hat&quot; and &quot;POV&quot; are synonymous. Hats use two axes.\nThe name on the left should correspond to that reported by the actual joystick \ninstalled.\n\nopengl Section\n--------------\nThis section contains options that control how Windows OpenGL (WGL) behaves.\n\n&quot;FixedGLExtensionBuffer&quot; = &quot;N&quot;\nThis option present a truncated list of OpenGL extensions to the application \nrather than the full list of extensions supported by the drivers. This is useful \nin cases where the application cannot handle extremely long options. If you need \nto be able to offer specific options, rather than the fixed list that this \noffers, then you want to also the GLExtensionBuffer option. This option will \nprobably only need to be used for Medal of Honor.\n\n&quot;GLExtensionBuffer&quot; = &quot;&quot;\nThis option is a comma-separate list of extensions prefixed with + or - that \nturns on or off the reporting of individual extension to the application. This \ngives the user complete control over what extensions are enabled/disabled so \nthey can tweak/tune as necessary. Turning an option on here does not magically \ngive the card the capability to do it. The options for the list follow the \nstandard OpenGL naming convention (ie &quot;+GL_ARB_imaging,-GL_ARB_depth_texture&quot;). \nYou should only need to use this option in very extreme cases. \nIf &quot;FixedGLExtensionBuffer&quot; = &quot;N&quot; then this option will be ignored.\n\nWineserver Section\n------------------\nThis section contains options that controls how the WineServer process is run.\n\n&quot;SHMWineserver&quot; = &quot;Y&quot;\nThis option indicates if Cedega should accelerate interprocess communication (AIC) \nbetween the client and server. This value can be either &quot;Y&quot; or &quot;N&quot; and defaults \nto &quot;Y&quot;. It is suggested that you set it to &quot;Y&quot; as for some titles it can have a \nvery positive impact on performance.\n\nWinMM Section\n-------------\nThis section controls the systems that are used for sound play back.\n\n&quot;Drivers&quot; = &quot;wineoss.drv&quot;\nControls whether the Open Sound System (OSS) or Advanced Linux Sound Architecture \n(ALSA) sound system is used.  Specify &quot;wineoss.drv&quot; to use the OSS sound system \nand &quot;winealsa.drv&quot; to use the ALSA sound system.  The default is &quot;wineoss.drv&quot;.  \nNote that if neither is specified, Cedega will produce no sound.\n\n&quot;WaveMapper&quot; = &quot;msacm.drv&quot;\n&quot;MidiMapper&quot; = &quot;midimap.drv&quot;\n\nwineoss Section\n---------------\nThis section controls how the Open Sound System (OSS) system is used for sound \nplayback, if enabled appropriately in the WinMM section.\n\n&quot;UseMMap&quot; = &quot;N&quot;\nThis option allows you to configure Cedega to write directly to memory on the \nsound card rather than having to use the slower route through the kernel. This \ncan be set to either &quot;Y&quot; or &quot;N&quot;; the default is &quot;N&quot;.  Can improve performance, \nbut is not available with all sound cards.\n\n&quot;FullDuplex&quot; = &quot;N&quot;\nAllows sound to be recorded and played back at the same time. Not available on \nall sound cards.  The default is off.\n\n&quot;dsp0&quot; = &quot;/dev/dsp0&quot;\n&quot;mixer0&quot; = &quot;/dev/mixer0&quot;\nSpecify a mapping for which digital audio device to use for OSS sound playback.  \nThe default for &quot;dps0&quot; is &quot;/dev/dsp0&quot; and for &quot;mixer0&quot; is &quot;/dev/mixer0&quot;\n\nwinealsa Section \n----------------\nThis section controls how the Advanced Linux Sound Architecture (ALSA) system is \nused for sound play back, if enabled appropriately in the WinMM section.\n\n&quot;UseMMap&quot; = &quot;Y&quot;\nThis option allows you to configure Cedega to write directly to memory on the \nsound card rather than having to use the slower route through the kernel. This \ncan be set to either &quot;Y&quot; or &quot;N&quot;; the default is &quot;Y&quot;.  Cann improve performance, \nbut is not available with all sound cards.\n\n&quot;pcm0&quot; = &quot;hw&quot;\n&quot;ctl0&quot; = &quot;hw&quot;\nThese options allow you to specify what ALSA sound devices Cedega should use. \nThe default values are &quot;hw&quot; for pcm0 and &quot;hw&quot; for ctl0. Appropriate selection of \nthese options can allow you to select a secondary sound card or a plugin. It \nshould be noted that most ALSA plugins seem to be quite buggy and will not work \nwith &quot;UseMMap&quot; = &quot;Y&quot;.\n\n\n==============================================\nSharing a .transgaming Directory Between Users\n==============================================\n\nTo make your .transgaming directory available to all users on your computer, \nyou will need to create a 'transgaming' group and assign all users who will \nbe using the shared directory to this group.\n\nAs root, execute the commands described below:\n\nCopy a clean .transgaming directory to the share location.\n\n # cp  -R  /usr/lib/transgaming_cedega/.transgaming  /SHARE_LOCATION\n\nChange the ownership of this folder to the group transgaming.\n\n # chgrp  -R transgaming  .transgaming \n # chown  -R g+srwx  .transgaming\n\nMake a backup of the original .transgaming directory \n\n # mv  -R  /usr/lib/transgaming_cedega/.transgaming  /usr/lib/transgaming_cedega/.transgaming.backup\n\nCreate a logical link to the new .transgaming directory.\n\n # ln  -s  /SHARE_LOCATION/.transgaming  /usr/lib/transgaming_cedega/.transgaming\n\nEdit the /usr/bin/cedega script to take into account the new link.\nOpen /usr/bin/cedega with your favorite text editor and find the line:\n\n export WINEPREFIX=&quot;$HOME/.transgaming&quot;\n\nand change it to\n\n export WINEPREFIX=&quot;/SHARE_LOCATION&quot;\n\nIf a user on your computer has already run Cedega and has a .transgaming \ndirectory in their home directory it will need to be moved or deleted before \nthey may use the shared directory.\n\nPlease note if your shared .transgaming becomes corrupted and needs to \nbe deleted you can delete it (this will cause all installed games to be lost) \nand then copy the backup .transgaming to the share as follows:\n\n # cp  -R  /usr/lib/transgaming_cedega/.transgaming.backup  /SHARE_LOCATION/.transgaming\n\n\n\n=======================================\nConfiguring Cedega differently per Game\n=======================================\n\nYou may wish to have different Cedega settings for each game that you have \ninstalled.  This can be easily done by editing your Cedega config file, \n~/.transgaming/config\n\nTo add per game settings open this file in your favorite text editor and \nmove to the end of the file.  At the end of the file add a line:\n\n[AppDefaults\\EXECUTABLE.EXE\\SECTION]\n  AppDefaults     Sets the following as default for the application\n  Executable.exe  The game executable that is run to start the application\n  SECTION         The section you wish to modify the settings for.\n                  IE: x11drv, fonts, Drive name/locations.\n\nFor Example, Max Payne has a game executable called 'Max Payne.exe'\nIf you wish to have custom settings for Max Payne you would require \nan entry as follows:\n\n[AppDefaults\\Max Payne.exe\\x11drv]\n&quot;Desktop&quot; = &quot;1024X768&quot;\n&quot;DXGrab&quot; =  &quot;N&quot;\n\nThis would force Max Payne to run in a 1024X768 Desktop window with the \nMouse Grab feature disabled. \n\n\n\n=============================\nUnderstanding Cedega Features\n=============================\n\nFixed Function over Vertex Shaders\n----------------------------------\nFixed Function over Vertex Shaders (also called Fixed Programs) is an\nimplementation of the Direct3D fixed function vertex processing pipeline\nusing programmable vertex shaders.  There are two main benefits of this \ntechnique.  First, we can utilize the vertex data in the format as provided \nby Direct3D without the need to convert it into a format that is suitable for \nthe OpenGL fixed function pipeline.  This allows us to eliminate the copy \nand conversion overhead and store the vertex data directly in accelerated\n(AGP or video) memory.  Second, this approach allows us the flexibility of\nimplementing Direct3D functionality that is not available in, or has different \nsemantics from, the OpenGL fixed function APIs.  \n\nFixed Programs are currently auto-detected based upon the type of video card\nthat your system is running.  It is possible to override the auto-detection\nprocess with the use of the &quot;FixedProgram&quot; option in the [d3dgl] section of \nthe config file (this option is unavailable in Point2Play at this time).  \nAdvanced users may wish to experiment with this option to determine the optimal \nsetting for their system and games. In order to use Fixed Programs your graphics \ndrivers must support the OpenGL ARB_vertex_program extension. \n\nTo enable Fixed Programs, place the line:\n&quot;FixedProgram&quot; = &quot;Yes&quot; \nin the [d3dgl] section of your config file.\n\nTo disable Fixed Programs, place the line:\n&quot;FixedProgram&quot; = &quot;No&quot; \nin the [d3dgl] section of your config file.\n\nTo have Fixed Programs auto-detected based on your graphics card, place the line:\n&quot;FixedProgram&quot; = &quot;Auto&quot; \nin the [d3dgl] section of your config file (this is the default setting).\n\nCurrently Fixed Programs are enabled by default on NVIDIA GeForce FX and \nlater graphics cards, and disabled for earlier cards.  Fixed Programs do not \ncurrently work on ATI cards due to driver issues. See below \nfor the recommended settings for specific graphics cards.\n\nGeForce, GeForce2, GeForce4 MX, and GeForce4 Go series cards:\nWhile the drivers for these cards do support the ARB_vertex_program extension,\nthese cards do not have hardware support for vertex programs and as such they \nare emulated in software by the driver, resulting in very poor performance.  \nIt is STRONGLY recommended that Fixed Programs be disabled for these cards.\n\nGeForce3 and GeForce4 series cards:\nThese cards do support hardware vertex programs, but high resource requirements\nfor some games may prevent Fixed Programs from working correctly. However many\ngames are fully functional and gain a significant performance boost by using \nFixed Programs.  It is recommended that you enable Fixed Programs on a game-\nby-game basis. If you experience missing or corrupt geometry in a specific title, \nyou should disable Fixed Programs for that game.\n\nGeForce FX and later cards:\nFixed Programs can safely be enabled on these cards.\n\n\nPixel Shaders\n-------------\nPixel Shaders are a DirectX 8 and higher feature that are used by many \ngames for graphical effects. Cedega's Pixel Shaders are built on top of \nthe OpenGL ARB_fragment_program extension. ARB_fragment_program is\nmore powerful than Pixel Shaders versions 1.0-1.3, but is only\nsupported on a higher class of graphics card. Thus, while Pixel Shaders \nare available on Windows systems starting with GeForce 3 or Radeon 8500, \nARB_fragment_program is only available starting with GeForce FX and \nRadeon 9500 cards.\n\nWhat this means is that a game which may have a minimum requirement\nof a GeForce 3 may actually be making the assumption that Pixel Shaders\nare available. In these situations the game may not function correctly\nwithout them.  For example, Battlefield Vietnam requires Pixel Shaders\nto play at higher detail levels. While a GeForce 3 is capable of \nplaying the game on a Windows system, a GeForce FX is required to play\nthe game under Linux, as only the FX series supports ARB_fragment_program\non Linux.\n\n\nCD/DVD Ejection System\n----------------------\nIn the past, games that came on multiple CD-ROMs posed a problem for\nCedega users, since the Linux OS would 'lock' the CD-ROM tray in some\ncases, preventing users from ejecting a disk and inserting the\nnext disk.\n\nCedega 4.0 included a new feature that eliminated this problem in\nmany cases. Simply by pressing the eject button on one's CD-ROM drive \nand waiting a few seconds (ejecting may take as long as 10 seconds), \nthe disk would automatically be unmounted and ejected.  Then one could \ninsert a new disk, perform whatever mounting step was required by the \nLinux distribution, and seamlessly continue with an install.\n\nBeginning with Cedega 4.0.1, automatic monitoring of CD-ROM drive eject \nbuttons is off by default due to reported problems with some hardware\nsuch as compact flash readers and certain CD-ROM drive brands.  It can \nbe manually enabled by passing --monitor-cdrom-eject on the command line.  \nWhen using Point2Play, the eject monitoring feature is by default enabled\nwhile running installers, and disabled at other times to prevent in-game \nperformance problems.  It may be forced on or off in Point2Play by going \ninto Configure -&gt; CDROM Eject Monitoring and setting Always ON or \nAlways OFF\n\nWhen the monitoring option is active, it should work on most recent\nmodel CD-RW and DVD drives.  With older drives, or with the monitoring\noption disabled you can still force the ejection of an otherwise in-use\ndisc by using the Point2Play 'Unmount' button, or by manually sending a \nSIGUSR2 signal to the wineserver process using a command such as:\n\n $ killall -USR2 wineserver\n\nOf special note, please be warned that while Point2Play will unmount and \neject only the drive in question, using the command line above will unmount \nand eject all of the drives in your system.  If you have other Wine based \nsoftware running, such as CodeWeavers CrossOver Office product, you may wish \nto avoid the use of the unmount button or the killall command mentioned \nabove, as they will cause any non Cedega 4.0 based Wine process to halt.\nIn all other respects, using the Point2Play unmount feature should act the \nsame as hitting the drive's eject button.\n\nSome installers may require you to re-insert the first CD-ROM to complete \nyour install.  Depending on the title, this may not yet work successfully.\n\nPlease contact TransGaming support if you have any issues relating to CD-ROM \neject support, so that we can continue to improve this feature.\n\n\n------------------------------------------------------------------------------\nThis document, TransGaming Cedega HOWTO Guide 4.3-1.1.1.1.en,\nis Copyright(c) 2002-2005, TransGaming Technologies Inc.  \nRedistribution is permitted for non-commercial use only.","torrent":{"xt":"urn:btih:2bd78e255ad7a82b6b3e72126c89b89a92b221e2","amp;dn":"cedega_4.3.2-1.i386.tgz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bd78e255ad7a82b6b3e72126c89b89a92b221e2","infoHashBuffer":{"type":"Buffer","data":[43,215,142,37,90,215,168,43,107,62,114,18,108,137,184,154,146,178,33,226]},"announce":[],"urlList":[]}}