{"title":"Collectorz.com Movie Collector  5.6.1(with crack)","uid":4261732,"size":15595724,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2c690cbf8f69f0864227ebdfcba8a2a932e66b04&amp;dn=Collectorz.com+Movie+Collector++5.6.1%28with+crack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"aoloffline","files":1,"time":1214507218,"description":"DVD Database Software\n\nCatalog your DVDs and Blu-Ray discs\n\nCast, crew, images, episode lists for TV series, etc...\n\nDownload it all by typing title or scanning barcode\nCreate a comprehensive DVD database\n\n    * List all movie information, including cast, crew, studio, year, plot, etc...\n    * Include DVD details, like screen ratios, subtitles, audio tracks, etc...\n    * For TV Series, list all episode titles, first air-dates and plots. \n\nThen enjoy browsing your movie database on your computer\n\n    * View your DVD database as a list or as gallery of cover images.\n    * Group movies by genre, release year, format or any other property.\n    * Find movies quickly, either by title, actor or anything you want.\n    * Browse your movie database on Windows Media Center. \n\n[ Full feature list with screenshots ]\n[Movie Collector main screen images view. Showing details for the Lost TV series] [Movie Collector main screen list view. Showing details for Pulp Fiction]\nAdd movies or TV series to your database in three easy steps\n\n    * 1. Enter movie title to search our online DVD database and Amazon.\n    * 2. Select your movie from the search results.\n    * 3. Click the Add button to add it to your personal database. \n\nMovie Collector will automatically download data and images\n\n    * All movie information: cast, crew, studio, release year, running time, genre, etc...\n    * For TV Series: all episode titles.\n    * All DVD details: screen ratios, subtitles, audio tracks, region, etc...\n    * The box cover image. \n\n[Laser Barcode Scanner] [CueCat Barcode Scanner]\nWant it even easier? Try cataloging your DVDs by barcode\n\n    * No need to type movie titles, just use a scanner to scan the DVD barcode.\n    * The search results will automatically return the exact edition that you own.\n    * Try our deluxe laser scanner or the simple Cuecat scanner. \n\n\n\nBenefits of cataloging your DVD collection\nTop 3 movies last week:\n[1: Rambo (2008)] \t[2: National Treasure: Book of Secrets (2007)] \t[3: National Treasure (2004)]\n\n    * Having a complete list of your DVDs in a safe place is ideal for for insurance purposes. Protect your valuable DVD collection. Think about it, a collection of 500 DVDs is easily worth over seven thousand dollars.\n    * Ever came home with a new DVD, only to find out that you already owned it? Organizing your DVDs will prevent duplicate purchases and save money.\n    * The Loan Manager will keep track of who borrowed your DVDs, so you don&amp;#039;t lose sight of the movies you own.\n    * And it&amp;#039;s fun! Browsing your movies on screen is a great way to learn new facts about your collection and enjoy it more. You&amp;#039;ll be amazed to find some gems that you haven&amp;#039;t watched in a looooong time. \n\n","torrent":{"xt":"urn:btih:2c690cbf8f69f0864227ebdfcba8a2a932e66b04","amp;dn":"Collectorz.com+Movie+Collector++5.6.1%28with+crack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c690cbf8f69f0864227ebdfcba8a2a932e66b04","infoHashBuffer":{"type":"Buffer","data":[44,105,12,191,143,105,240,134,66,39,235,223,203,168,162,169,50,230,107,4]},"announce":[],"urlList":[]}}