{"title":"MECHCON (Mechanized Convulsions) - RetroNoise EP (2006)","uid":4271558,"size":46747072,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2cdf0810115c784c86572333b6bf9997c98a759f&amp;dn=MECHCON+%28Mechanized+Convulsions%29+-+RetroNoise+EP+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"darkmatter88","files":7,"time":1214958526,"description":"MechCon (Mechanized Convulsions) - RetroNoise EP (2006)\n\nBIO: The Mechanised Convulsions project (MechCon for short) formed in late 2001 as a hobby, due to Dave?s interest and an acute passion in industrial music. The name derives from the way that some of us feel, with the routines we have in lives, some necessary, some unnecessary but we have to pursue nevertheless, and there are times where we just break out of those routines, like a machine overheating, just goes into convulsions.\n\nAs time has progressed, and other influences have appeared in the scene worldwide, as well as noticing the industrial music scene in Adelaide diminishing, Dave has taken his sound to a different level to what it was at the beginning, with more advances on the tools used for the sounds, he has gotten to a level of music consisting of angry, distorted, industrial/powernoise rhythms, blended in with melodies and ear-bleeding noises, to deliver a mixture of emotions expressed through sound.\n\nAbrasive industrial rhythms blended in with experimental soundscapes and laced in with minimal melody.\n\nCountry:   Australia \nRelease: Uncomfortable Records\nDate: 2006\nGenre:   Alternative;  \nStyle:  Industrial; Rhythmic Noise; Power Electronics; Hardcore Techno\n\nTracklist:\n1  We Are 5:24\n2  Retronoise 5:46\n3  Mental Anguish 5:09\n4  Long Train Ride Home 3:56\n5  Running Battle Level Music 3:49 \n\nTotal Time  24:04 min:sec \n\nMechCon has performed at the Distorted 2005 Electronic Music Festival in Melbourne, Australia, and for a first performance, was given a warm response at the end of his set, which gave him the determination to continue his hobby. Dave?s major influences are extremely broad, ranging from the more harsher-EBM acts like Suicide Commando, Terrorfakt, and Dulce Liquido, to the harshest of powernoise acts, like Converter, W.A.S.T.E., Iszoloscope, Mono No Aware, Winterkalte, Hypnoskull, the list goes on!\n\nS-E-E-D =)\n\n","torrent":{"xt":"urn:btih:2cdf0810115c784c86572333b6bf9997c98a759f","amp;dn":"MECHCON+%28Mechanized+Convulsions%29+-+RetroNoise+EP+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cdf0810115c784c86572333b6bf9997c98a759f","infoHashBuffer":{"type":"Buffer","data":[44,223,8,16,17,92,120,76,134,87,35,51,182,191,153,151,201,138,117,159]},"announce":[],"urlList":[]}}