{"title":"Moskollo FM08 Background Pack June 08 Update","uid":4257450,"size":523236334,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d1b32fe688794a83be0ffa925d4d2193d84c501&amp;dn=Moskollo+FM08+Background+Pack+June+08+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moskollo","files":1,"time":1214313423,"description":"My own backgrounds and stadium pack for FM 08 reloaded,the previous version seemed to go down well. This should work with older versions of FM. It has stadiums for the leagues of over 43 different countries. If you play as a top English team in the Champions League, 98% of your matches will have background stadium, it is the anti-default background pack. If you know the Moskollo brand, I do have my detractors, I&amp;#039;m just trying to let everyone have the chance to play FM08 without having to see the boring default screen. I have not taken ANY of the photos of the stadiums, nor have I compiled all of the stadium images. What I have done is firstly put everything in one folder. I have also improved the images or configs where I can. I have also hunted down images for the remote stadiums like the South African stadiums for World Cup 2010. \n\nI have found all the club images for the team screens, all the big European clubs have 1024 x 768 screens of great moments in their history-even Tottenham has some, this is all my own work, on the editing and creating of configs for the &amp;#039;glory moments&amp;#039; backgrounds, but that&amp;#039;s not the point of this exercise, I make no secret of disliking a number of the fools on the SI Graphics Forum, so in a way this is two fingers to the idiots who have tried to nay say someone like me trying to put an all in one background pack to make life easier for everyone.\n\nPeople now know the Moskollo name for good or bad, so like it or not this pack is available for all FM08 addicts out there, I&amp;#039;m trying to put something back in, if people don&amp;#039;t like it, in the words of the bad guy in Total Recall, &amp;#039;Fuck em&amp;#039;.\n\nOnce downloaded, extract the folder using Winrar. Then put the &amp;#039;backgrounds&amp;#039; folder into your Sports Interactive/data folder on your C drive.\n\nNow I know some of those aforementioned idiots from the SI Graphics forum will probably claim that this is a bogus file or something, but would I really write all of this if I was trying to just screw over the downloader. I believe in Torrent, I love the fact the massive music and film companies are losing money everyday, it serves them right for throwing their shit films and pop groups at us(fuck off Simon Cowell). It&amp;#039;s karma folks, I&amp;#039;m trying to improve mine by doing this, so there it is, download this FM08 addicts and I&amp;#039;m sure you won&amp;#039;t be disappointed, if you listen to one of the little so and sos from the forum, you gain nothing so over to you, if you don&amp;#039;t download any of my FM08 packs, this is the one to at least try, but you will need to be patient as this is a heavy FM08 folder....\n\nIf you like this I have others on the Pirate Bay for FM08 Backgrounds and an updated to 24/6/8 player database so why not try them if you like this...\n\n\n\nPeace,\n\n\nMoskollo\t\t","torrent":{"xt":"urn:btih:2d1b32fe688794a83be0ffa925d4d2193d84c501","amp;dn":"Moskollo+FM08+Background+Pack+June+08+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d1b32fe688794a83be0ffa925d4d2193d84c501","infoHashBuffer":{"type":"Buffer","data":[45,27,50,254,104,135,148,168,59,224,255,169,37,212,210,25,61,132,197,1]},"announce":[],"urlList":[]}}