{"title":"Pixelmator 1.1.1 (MacHeist 2)","uid":4035513,"size":47641515,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2d583285f0c832cf38570f5cd364b0d398bf73bc&amp;dn=Pixelmator+1.1.1+%28MacHeist+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kantijob","files":1,"time":1203411505,"description":"Pixelmator 1.1.1 Kitten (1087)\nImage editing for the rest of us\n\nInstruments to join the creative world\nPixelmator, the beautifully designed, easy-to-use, fast and powerful image editor for Mac OS X has everything you need to create, edit and enhance your images.\n\n\n* Precise selection tools\n\nSomeone who is editing images must be able to select the right shapes, portions or objects in images. With Pixelmator?s powerful, pixel-accurate collection of selection tools you can quickly and easily select any part of your images. That means you can edit and apply special effects to portions of your pictures, remove unwanted objects or even cut out objects from one picture to put on another. Thanks to the masks palette in Pixelmator, you can even save your selections for later. Now, that?s handy.\n\n\n* Full assortment of painting tools\n\nAnother bunch of tools in Pixelmator are painting tools. The real greatness of these tools is the ability to use different brush sizes, shapes, hardness, even blending modes when painting. You can paint with Pixelmator as you would traditionally, play with beautiful gradients or even fill colors with other ones. There has never been a more satisfying way to paint. What?s more, Pixelmator?s painting tools can be used not only for any style of painting, but also for improving your selections with masks or even retouching.\n\n\n*Retouching tools\n\nIt is a snap to perfect your aging or buggy photos with Pixelmator. With its advanced retouching tools you can easily blur hard edges or sharpen fuzzy areas of your image. Or paint with a sample of an image to remove wrinkles from faces or scratches in your photos. In fact, you can use any of the adjustment or painting tools to polish or to refine your images.\n\n\n* Every tool you need\n\nThe coolest image editor comes not only with handy and powerful selection, painting and retouching tools, but it also has everything you need for typing text on your pictures, analysing colors, cropping, transforming, moving anything in your pictures or navigating through your images.\nWith Pixelmator?s easy-to-use but powerful tools you can do a lot more with your images than you ever could before.\n\n\n* Layers\n\nOf course, Pixelmator is a layer-based image editor. You can quickly create layers from your photos, other pictures, from selections or even your iSight. Yes, Pixelmator can add a layer to your composition directly from your Mac?s little camera. Not only can you link and arrange added layers, but Pixelmator allows you to blend layers, change their opacity, create clipping masks or even add layer masks to hide some portions of layer.\n\n\n* Powerful color correction tools\n\nPixelmator features a simple and elegant collection of intuitive color correction tools. Using these tools you can fine-tune hue, saturation, and luminance; adjust exposure, color levels, brightness and contrast; use automatic color corrections such as Auto Levels, Auto Color and Auto Contrast; even use Channel Mixer and much more. \n\n\n* Breathtaking filters and effects\n\nPixelmator is the real filter-machine. It has over 130 filters and special effects for your needs. Just choose any of nicely designed distortion, blur sharpen, color, stylize, halftone, tile generator, transition and Quartz Composer filters and boom -- you see the result in real-time.\n\n\n* Compatible with everything\n\nOne more thing: Pixelmator supports over 100 different file formats. You can open and save in PSD, TIFF, JPEG, PNG, PDF, EPS and scores of other image formats. Above all, Pixelmator can open and save Photoshop files with layers. You are never alone with Pixelmator.\n &lt;a href=&quot;\nhttp://www.pixelmator.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pixelmator.com/&lt;/a&gt;\n\n-------------------\n\nRegistration code included in the .dmg file after mounting.  In program update to new version 1.1.2 Kitten (1095) works perfectly.\n\n(Part of the MacHeist 2 bundle)","torrent":{"xt":"urn:btih:2d583285f0c832cf38570f5cd364b0d398bf73bc","amp;dn":"Pixelmator+1.1.1+%28MacHeist+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d583285f0c832cf38570f5cd364b0d398bf73bc","infoHashBuffer":{"type":"Buffer","data":[45,88,50,133,240,200,50,207,56,87,15,92,211,100,176,211,152,191,115,188]},"announce":[],"urlList":[]}}