{"title":"Margaret Weis Mistress of Dragons Book  1 of 3 128kpbs","uid":4160571,"size":603583169,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2dff15c3ea3c8d43cdec2616cf0174b80129dbb4&amp;dn=Margaret+Weis+Mistress+of+Dragons+Book++1+of+3+128kpbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kore64","files":13,"time":1209352228,"description":"Margaret Weis came to prominence with the original Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½Dragonlance ChroniclesÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ many years ago. In fact, her name became so synonymous with dragons that it was always surprising when she introduced a new series that didn\\\\\\&amp;#039;t feature them. She moved away from that milieu until she and her writing partner Tracey Hickman returned to the Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½DragonlanceÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ saga. Now it appears that she has given in to destiny and once more embraced dragons.\n\nMistress of Dragons kicks off a new solo trilogy for Weis, and it contains many elements familiar to any of her fans - namely dragons. Aside from that, though, the characterization and plot feel comfortable for longtime fans who may not have read one of her books in a long while. \\\\\\&quot;Familiar\\\\\\&quot; in this case isn\\\\\\&amp;#039;t a bad thing. Weis does not rewrite the same plot over and over again; rather she breaks new ground, but with the style and panache remembered from before. Mistress of Dragonsleaves readers anxiously awaiting the sequel.\n\nOne minor complaint is the advertising blurb on the inside cover of this book, just because it really annoyed me. The first sentence: \\\\\\&quot;As Anne McCaffrey is to science fiction, Margaret Weis is to fantasyÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½Ãƒ?Ã‚Â¦for she is the genre\\\\\\&amp;#039;s Mistress of Dragons.\\\\\\&quot; Is the publisher telling readers that they chose the name of this book just so they could say that? It is incredibly trite; my eyes almost fell out, they rolled so hard.\n\n\nBe that as it may. The kingdom of Seth has been protected from roving dragons for many years by a magical shield created by the original Mistress of Dragons, a post that has passed on from generation to generation. An elaborate sisterhood supports her, performing the prayers and keeping an eye on the magical portal that alerts them to any dragons trying to penetrate the shield. The society of Seth is almost matriarchal, in the sense that all of the magical and religious power is held in female hands. The monastery guards are female as well, and the population is tightly controlled. Reproduction is formalized, with selected men from the kingdom brought in to have sex (fertility drugs and aphrodisiacs included) with selected women in the monastery. Nine months later, the female births remain in the monastery while the male births are sent out to the kingdom to be raised by others. It is unclear but assumed that reproduction happens the normal way for those not secluded in the monastery.\n\nUnbeknownst to humanity, dragons are intelligent creatures - and they have a problem. A rogue dragon has established herself in Seth somehow, and interacting with humans at all is against dragon law. They send Draconas (a dragon in human form) to find out what is going on. With the aid of King Edward, the ruler of a land that is seemingly being attacked by a dragon as well, Draconas must get into Seth, find the rogue dragon, and decide what he has to do about her. Events soon spiral out of control as he discovers the true secret of Seth and has to improvise a mad plan to deal with it.\n\nArch-conservative readers, beware: if you cannot handle even a hint of homosexuality in what you read, then you might as well stop reading now. Most of the women in the monastery are lovers of other women in the Sisterhood. In fact, two of the major characters (Melisande and Bellona) are lovers. While there is no \\\\\\&quot;on-screen\\\\\\&quot; sex, they react like any other people in a romantic relationship. If such a thing offends you, then this is not the book for you.\n\nFor an \\\\\\&quot;epic\\\\\\&quot; fantasy, this is a surprisingly small book as far as characters go; there are only four main ones, with some secondary characters floating about. This makes Mistress of Dragons a very tight book that flows well. Draconas, the dragon-in-human-form, must figure out the plot while trying to stay on the right side of dragon law by not revealing himself to the humans. Melisande, the high priestess of the sisterhood, is the woman designated to be the next Mistress when the aged current one dies. Bellona, captain of the guard at the monastery, is also Melisande\\\\\\&amp;#039;s lover and confidante. And Edward, king of Idlyswylde, just wants to do the right thing and protect his kingdom from a dragon. Because the cast of characters is so small, Weis is able to delve deeply into their characters, making them truly three-dimensional.\n\nDraconas really cares for humanity, despite the aloofness that being a dragon brings. He finds himself wanting to guide and protect them, despite it being against the law. On the other hand, he can be ruthless when the situation requires it. Melisande is set in the ways of her society, and when that society breaks down, she is devastated. She is even more devastated when it appears that Bellona is trying to kill her. While a bit whiny at times, overall she is a strong character - and a bit of whining is forgivable, given what happens to her. Bellona is loyal and tough, but with a soft side when it comes to somebody she cares about. She is not above killing people whom she once named friends if she feels betrayed enough. Edward is a relatively simple man trying to get a job done who finds himself caught unawares in Draconas\\\\\\&amp;#039;s plans. He is a pawn and knows it , but he is willing to be played if it will save his kingdom, even though he doesn\\\\\\&amp;#039;t know what is in store for him.\n\nWeis weaves a tapestry around these characters that is almost beautiful but also dark and ugly underneath. A rape is briefly but sharply described, devastating the character and having harsh implications later. Other events in the book are also much darker than what constant readers are used to from Weis. One enjoys seeing the growth in her writing from previous books, with more mature subjects and a familiar yet expanded writing style. While there are a few predictable moments, events take a startling turn toward the end, and the finale is breathtaking. Weis even gives some of the predictable moments at the end of the book a subtle twist, keeping readers on their toes.\n\nAny flaws in this book are small and may be rectified in future books, though that doesn\\\\\\&amp;#039;t quite forgive this one: it is difficult to become part of this world that Weis has created. We get a description of the society in Seth, but we only see the Sisterhood. The same goes for Idlyswylde, where we only see King Edward\\\\\\&amp;#039;s court. We donÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½t get a sense of the land at all. There is no map included, so we have to go completely by Weis\\\\\\&amp;#039; descriptions to get any sense of scale. Readers may feel a bit lost as they travel from place to place.\n\nSuch flaws don\\\\\\&amp;#039;t detract too much from the book, though. Mistress of Dragons is an enjoyable epic fantasy that doesn\\\\\\&amp;#039;t feel too epic. Instead, it feels like interesting events happening to characters you care about as you watch them take on the hostile world around them. Their worlds get turned upside down as they give in to temptation and passions, leaving them fighting to save their fantasy. Weis\\\\\\&amp;#039;s first foray into fantasy without any helpers is a resounding success, and I can\\\\\\&amp;#039;t wait to find out what happens next.\n\n","torrent":{"xt":"urn:btih:2dff15c3ea3c8d43cdec2616cf0174b80129dbb4","amp;dn":"Margaret+Weis+Mistress+of+Dragons+Book++1+of+3+128kpbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dff15c3ea3c8d43cdec2616cf0174b80129dbb4","infoHashBuffer":{"type":"Buffer","data":[45,255,21,195,234,60,141,67,205,236,38,22,207,1,116,184,1,41,219,180]},"announce":[],"urlList":[]}}