{"title":"The Wizard, the Official Journal of Unconventional Truth- Issue ","uid":4044092,"size":10248555,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e2b22e6b5afbd0bc211cf96944e4bcb062a552a&amp;dn=The+Wizard%2C+the+Official+Journal+of+Unconventional+Truth-+Issue+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thewizardnewspaper","files":2,"time":1203816500,"description":"Our Second Issue,\n\nEnjoy\n\n\n\n\nOur Mission statement is as follows:\n\nThe Wizard Mission Statement:\n\n&quot;The Wizard, the official Journal of Unconventional Truth was founded upon\nthe principals of opinion and the strength of the world of the word. We are\na newspaper that is here to give you the chance to share your true opinions\non subject matter or topics not recognized as important by other devices of\ncommunication. We want you to know what others truly think, as well as to\nknow what you yourself truly feel, in an anonymous environment. Thought is\nthought, and opinion is opinion. It truly is white and black. We must first\nattribute our work to others before we can be heard, and even if we are\nheard as a singular individual, we are lost to an ever-branching tree of\npersona that we seemingly &quot;borrowed&quot; knowledge from. No profit is made,\nsimply because no respectable media organization should make profit, as it\nhinders and creates biases. What we hope to accomplish is the opposite of\nwhat our primitive standards call for. Too long have we bowed down to others\ntelling us we are not worthy only because we attempt to share our opinion.\nIn our newspaper and in our articles, will be raw anonymous ideas,\ncreativity and opinion. No harm can become of knowledge. Only advancement.\nAnd this is what we wish to spread amongst our readers.&quot; \n\nWe wish to have our paper placed on a global scale/level, and are willing to accept for publishing anything you have to say! We want the perspectives of EVERYONE and do not believe that this is happening currently, we strongly agree with the principals of free press, and are trying to have RELEVANT information released. If anyone has written work they wish to submit to our cause, then that would be GREATLY appreciated! So far we have published 2 issues and are working on \nour 3rd, this is a relatively new project, but we are hoping to collect a greater group of writers for this. Anything submitted does not have to be specifically written for our paper, it can also be something you have already published, \nthe truth knows no boundaries! Please let me know if you are interested in writing or submitting anything to us, your help is greatly appreciated!\n\n\nThe Wizard e-mail is: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;16627e73617f6c77647278736165667766736456717b777f7a3875797b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; \n\n\n\n\nOur Introductory Declaration:\n\nThe wizard, a product of like-minded individuals, has arrived in order to bring nothing but individual opinion when none is being shared. Though a sense of boredom and dissatisfaction with organization and conventionality \nas a whole gave us some sort of motivation, it was the lack of shared open every day opinion experienced in our society that sparked out creative spirits and forced us to dive into the world of the word. What we hope to do though has nothing to do with us, but rather everything to do with you, the reader. The wizard is here to give you the chance to share your true opinions on subject matter or topics not recognized as important by other devices of communication. We want you to know what others truly think, as well as to know what you yourself truly feel, in an anonymous environment. We ask you to send us your literature, your opinions, your first-hand accounts, and your philosophies in order to\nbegin the circulation of personal knowledge and the building of a universal understanding. As this is the first article of the first issue, we may as well get straight into our point. What we wish to convey requires no formalities, either within the words we think or the way we convey them. Thought is thought, and opinion is opinion. It truly is white and black. Though we all know this is true, for we all think it, maybe to others, but most to ourselves, we begin to perceive boundaries of thought. We begin to lose track of the human ambition to share\nand distribute raw knowledge. It is obvious that for anyone of us to be even remotely heard in any area of thought,might it require it or not, we must go through formal processes. We must first attribute our work to others before \nwe can be heard, and even if we are heard as a singular individual, we are lost to an ever-branching tree of persona that we seemingly ?borrowed? knowledge from. What we hope to accomplish is the opposite of what our primitive standards\ncall for. Too long have we bowed down to others telling us we are not worthy only because we attempt to share our opinion.In this paper and in these articles, will be raw anonymous ideas, creativity and opinion. And so be it if one feels it \nnecessary to criticize an opinion in a non-intelligible or productive manner. This has come only to throw the ideas we all have locked in the back of our heads into the spotlight, in hopes of bettering our lives in any way possible. No\nharm can become of knowledge. Only advancement. Let the truth prevail and the understanding emerge!\n\n\nVadum nusquam tamen verum exsisto notus\n(Shall nothing but the truth be known)\n","torrent":{"xt":"urn:btih:2e2b22e6b5afbd0bc211cf96944e4bcb062a552a","amp;dn":"The+Wizard%2C+the+Official+Journal+of+Unconventional+Truth-+Issue+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e2b22e6b5afbd0bc211cf96944e4bcb062a552a","infoHashBuffer":{"type":"Buffer","data":[46,43,34,230,181,175,189,11,194,17,207,150,148,78,75,203,6,42,85,42]},"announce":[],"urlList":[]}}