{"title":"Nero 8-Ultimate","uid":4279021,"size":194226508,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2effc97008510a0ade1d3bf811369619a4ed87a3&amp;dn=Nero+8-Ultimate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"amirthemaster","files":1,"time":1215323366,"description":"nero 8 ultimate\nThe Ultimate solution for Data, Video, Photo, Audio and BackUp!\nNero 8 is a software solution that brings the digital world to your PC with features that make it fun and easy to create multimedia projects with high-quality, professional results. Create MP3 mixes and edit vacation videos in High Definition format. Share content around the world with simple Internet upload functions. Burn a disc with just one click, and then enjoy it in any room in your house with versatile streaming features. Rest easy knowing your data is safe in the event of a system crash or a damaged disc. Nero 8 lets you live the digital life with cutting-edge technology and world-class features.\n\nNero 8 comes loaded with a number of features that enhance Windows VistaTM. With the Nero DiscCopy Gadget, you can copy a disc of any format with just one click. With Rich Preview, you can view the contents of your files without having to open a separate application. With Nero MCE Plug-ins, you can burn and stream your content on a Windows Vista? MCE powered machine.\n\n\nenjoy","torrent":{"xt":"urn:btih:2effc97008510a0ade1d3bf811369619a4ed87a3","amp;dn":"Nero+8-Ultimate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2effc97008510a0ade1d3bf811369619a4ed87a3","infoHashBuffer":{"type":"Buffer","data":[46,255,201,112,8,81,10,10,222,29,59,248,17,54,150,25,164,237,135,163]},"announce":[],"urlList":[]}}