{"title":"MicroXP v0.81 - eXPerience","uid":4251020,"size":104767488,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2f23f994575d7da3467dd4a461ff9f93fc4dec29&amp;dn=MicroXP+v0.81+-+eXPerience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eXPer1ence","files":1,"time":1214003807,"description":" _____________________________________________________________________\n\n MicroXP v0.81\n\n by eXPerience\n\n _____________________________________________________________________\n\n Thank you for trying this special MicroXP edition of Windows XP.\n\n With a WINDOWS folder that is only 199Mb and a CD size of just 99.9Mb,\n this has to be one of the smallest Windows XP installations out there.\n\n Whats more - you can use 99% of the programs you always use and up to\n now there is not one single report of any game not working in MicroXP.\n\n This installation takes only 5 Minutes 30 seconds.\n\n This install includes default XP drivers for Ethernet/Sound/SCSI/RAID\n\n It has all languages kept, except Chinese/Japanese/Korean.\n\n It has all keyboard layout choices kept.\n\n It also has Service Pack 3 final slipstreamed into it.\n\n LAN Networking is now possible - Use &amp;#039;Map Network Drive&amp;#039; and just put\n the computer name of the computer you want to network with.\n\n Digital Cameras and Scanners can also now be used.\n\n The ISO file size is the same as in the previous release - 99.9Mb\n\n _____________________________________________________________________\n\n [Statistics]\n\n Installation time, in VMware, from\n ISO file, from end of formatting .......... 5 Mins 30 Secs\n\n RAM Usage On First Installation ........... 39 Mb\n Handles ................................... 2229\n Threads ................................... 157\n Processes ................................. 15\n\n Entire Install Size ....................... 205Mb\n\n Documents and settings folder size ........ 3.32 Mb\n Program Files folder size ................. 2.79 Mb\n WINDOWS folder size ....................... 199 Mb\n\n Files In System32 ......................... 814\n\n ISO File Size ............................. 99.9 Mb\n\n _____________________________________________________________________\n\n [Services Remaining In Windows]\n\n Cryptographic Services\n DCOM Server Process Launcher\n DHCP Client\n Event Log\n Logical Disk Manager\n Logical Disk Manager Administrative Service\n Network Connections\n Plug and Play\n Print Spooler\n Remote Access Auto Connection Manager\n Remote Access Connection Manager\n Remote Procedure Call\n Server\n TCP/IP NetBIOS Helper\n Telephony\n Windows Audio\n Windows Image Acquisition (WIA)\n Windows Installer\n Wireless Zero Configuration\n Workstation\n\n All these services are enabled on installation,\n so you can start using Windows straight away.\n\n _____________________________________________________________________\n\n [eXPerience Desktop Folder Contents]\n\n Desktop Icon Layout (Lets you save your desktop icon layout)\n Driver Install Tool (Easily install all your drivers, see ReadMe)\n Keyboard Settings (Quick access to Regional and Language options)\n Networking Guide (Shows how to get connected to your networked PC&amp;#039;s)\n Registry Backup (Make a complete backup of the registry in one click)\n Services Config (Files to enable and disable functionality)\n ShrinkXP Scripts (to remove any items you do not want or need)\n Web Browser (Browzar, to download a full browser of YOUR choice)\n Windows Media Player 11 (This is just a readme file about WMP11)\n\n _____________________________________________________________________\n\n [WHAT YOU CANNOT DO]\n\n This is a greatly reduced installation of Windows XP Professional SP3\n\n Please read these notes BEFORE using this edition of Windows:\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- SINGLE USER ONLY\n\n You cannot add any additional users. Do not try to add more users,\n otherwise your main account that is used by default (Administrator)\n will become the new account and after logging in, you will not have\n any desktop theme (not even Classic) and the whole account will be\n ruined. You&amp;#039;ll probably have to install Windows again because if\n you make a new account it replaces Administrator and tries to\n log you in with Default User - the problem with this is - there\n is no Default User anymore.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO NATIVE SUPPORT FOR FTP SITES\n\n There is no built in support for downloading from FTP sites,\n try using Filezilla or WS_FTP if you need to do that. Even just\n Opera or Firefox can probably do it. This functionality is gone\n because the Application Layer Gateway service is gone, along\n with ALG.EXE that normally runs in Task Manager, taking up about\n 6Mb RAM for what amounts to no reason.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO VISITING WINDOWS UPDATE\n\n You cannot visit Windows Update with this version of Windows\n because Internet Explorer is removed. You can manually download\n updates from Microsoft and you can also use the alternative\n Windiz Update website through Opera or Firefox. Because so\n much has been removed from this edition of Windows, you are not\n likely to be any more safe installing updates for Windows.\n NOTE: Because this edition of Windows uses a patched\n winlogon.exe in order to remove the oembios.bin file,\n you really should not update Windows anyway, in case\n winlogon.exe gets replaced by an update. There are more\n details about this in the eXPerience folder on the desktop\n once MicroXP is installed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO FAST USER SWITCHING\n\n Apart from you only being able to have the one account anyway\n (Administrator) the ability to do Fast User Switching is also\n removed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO PASSWORD STORAGE/AUTOCOMPLETE\n\n Windows will not save stored passwords, however, this only really\n applied to Internet Explorer and Outlook Express, which are removed.\n You will be fine using Firefox or Opera web browsers and Thunderbird\n email client for emails. Those are self contained programs and take\n care of storing your passwords by themselves.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO CD-ROM AUTOPLAY\n\n When you insert a CD that would bring up a screen to install the\n program contained on the CD, this does not happen in this version\n of Windows, you will have to explore the CD manually and run\n whatever file it is that runs the program&amp;#039;s setup, usually\n setup.exe on the root of the CD. If the CD has a file called\n AUTORUN.INF then open that file and look at which .exe file\n is listed in AUTORUN.INF\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO SMART CARD DETECTION\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO SCHEDULED TASKS\n\n You cannot set programs, like AntiVirus or Hard Disk Defrag programs\n to run in the future IF they need the Scheduled Tasks service in\n Windows. If you are going to run those types of programs you will\n have to manually scan or defrag whenever it is convenient. Despite\n this, one program that will schedule its operations is Perfectdisk\n defrag, you do not need Task Scheduler for this program to run a\n scheduled defrag.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO REMOTE DESKTOP\n\n There is no Remote Desktop in this version of Windows\n because the Terminal Services service is removed.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO THEMES\n\n You cannot have the Luna (Blue/Olive/Silver) desktop theme in this\n version of Windows, the only theme you can choose is Windows\n Classic which it is already set to by default. You can however\n install Windowblinds if you want to and it will work fine,\n Windowblinds does not rely on the Themes service. You could even\n make MicroXP look like Vista with the Ironjer AeroGlass The\n Remix V4. Use v4 not v5 of that if you use it.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- NO UNINTERRUPTIBLE POWER SUPPLY SERVICE\n\n I always thought UPS Service delivered parcels but apparently not,\n if you have this type of device then it will not work on this version\n of Windows. A UPS is only used for emergencies like if you have\n a power cut - thats if you even have such a device.\n\n _____________________________________________________________________\n\n [WHAT YOU CAN DO]\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- PROGRAMS -\n\n You can still install and run just about all the programs and games\n that you can run on a normal installation of XP. There is a text file\n in the eXPerience folder on the desktop that has a list of programs\n that work and includes some that don&amp;#039;t work (not many). Even Office\n 2007 installs on this version of Windows\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- GAMES -\n\n Up to now, there has not been one single report of any game not\n working on MicroXP. Gaming is what this edition of Windows is all\n about, it gives better benchmarks than any other version of\n Windows I have ever tested.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- LAN NETWORKING -\n\n At last - MicroXP now has the ability to browse your local network.\n All you need to know is the computer name of the computer you want\n to connect to and thats about it, just right click My Computer and\n choose Map Network Drive. All computers can see each other even\n if every computer in the network is MicroXP v0.81.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- CAMERAS AND SCANNERS\n\n Now in MicroXP it is possible to use a digital camera (USB only,\n no Firewire) or a scanner. Tested and working with a Fuji FinePix\n 6MP camera. The Photo Printing Wizard is not included, neither\n is the wizard to download photos from the internet, but the rest\n of the functionality for cameras and scanners is as complete as\n in full Windows. My favourite saying: whats missing, you&amp;#039;re not\n gonna miss! Print photos with Photoshop or maybe even Irfanview.\n Ctrl+P to print works in every single program that supports it,\n so its not like we ever needed the photo printing wizard, which\n only ever made all images I fed through it A4, even small images,\n so it actually did not even work, unless I skipped a button but\n there really are no buttons to skip in that wizard, its useless.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- DIAL-UP CONNECTION -\n\n You can still use a Dial-Up connection (Broadband or old 56k modem).\n This is the one major flaw in other stripped out operating systems,\n a lot of UK users still use a modem with broadband... in this\n edition, RAS Dial-Up/PPPoE/DSL/ADSL connectivity is OK as well\n as old 56k modems. Yes, try this install on a Pentium II or even\n an old 486 might run it! They had 75Mhz processors and 8Mb RAM\n with 4Mb graphics cards.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- WEB BROWSER - \n\n This installation already includes a basic web browser called\n Browzar that uses a few core files left from Internet\n Explorer. No, Internet Explorer is not included, but select\n files included in this installation that come from Internet\n Explorer are vital to running Windows. Its also Internet Explorer\n related files that allow you to open CHM files, which you can do\n in this edition of Windows. This Browzar web browser is only here\n so you can at least get online and download Firefox, Opera, Netscape\n or whatever browser you want. This not only saves space on this CD,\n but you get to choose what web browser you want to use and you get\n the latest version not an old and possibly insecure version. Flash\n v9.0.124.0 for Firefox and Opera is included, so Google Video and\n YouTube work straight away in whichever browser you install.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- PASSES WGA CHECKS\n\n If you go to download for example, Windows Media Player 11 from\n Microsoft&amp;#039;s downloads section, you will need to validate windows\n by running the GenuineCheck.exe file that Microsoft asks you to\n download as part of the Windows Genuine Advantage checks. Its\n fine to do this, don&amp;#039;t be scared of your key being blacklisted.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- WINDOWS MEDIA PLAYER 11\n\n You can install Windows Media Player 11 in this edition of Windows.\n NOTE: Because the file WMPLOC.DLL is not in system32, Windows Media\n Player 11 will say that it could not complete setup or words to\n that effect. IGNORE THIS ERROR! Windows Media Player 11 is fully\n working after you install it and get that error, Windows Media\n Video type formats stream in Opera and Firefox still - so you can\n ignore that installation error. Just make sure if you install\n Windows Media Player 11 to have the Cryptographic Services\n service enabled. Windows Media Player 11 needs that service started\n to install. After installing Windows Media Player 11 you can then\n disable Cryptographic Services if you wish, like a lot of stuff\n in Windows, it doesn&amp;#039;t really do anything important.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- WMV STREAMS -\n\n Once you have installed Opera, Firefox, Netscape or the browser\n of your choice, as long as you install Windows Media Player 11,\n you can stream Windows Media Videos from websites like the BBC&amp;#039;s\n News website, or anywhere that has WMV streams. This is possible\n because there are three DLL files added to the Windows Media\n Player folder in Program Files. Don&amp;#039;t worry, theres no Windows\n Media Player there, it only contains the vital DLL files for\n streaming compatibility in Firefox and Opera if you install\n Windows Media Player 11. Note that you do need to install Windows\n Media Player 11 to view .WMV movies in web pages.\n\n *     *     *     *     *     *     *     *     *     *     *     *\n\n- FLASH -\n\n If you install Opera or Firefox web browser(s) in this special\n MicroXP edition of Windows, you can go visit YouTube or Google\n Video without even having to install Flash Player. You can just\n watch the videos right away.\n\n _____________________________________________________________________\n\n Don&amp;#039;t forget to join SnipeR&amp;#039;s Redemption Network:\n\n &lt;a href=&quot; http://www.retestrak.nl/Board/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.retestrak.nl/Board/&lt;/a&gt;\n\n _____________________________________________________________________\n\n Enjoy this fine release from eXPerience\n\n Release Date: June 20th 2008\n\n _____________________________________________________________________\n\n\n","torrent":{"xt":"urn:btih:2f23f994575d7da3467dd4a461ff9f93fc4dec29","amp;dn":"MicroXP+v0.81+-+eXPerience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f23f994575d7da3467dd4a461ff9f93fc4dec29","infoHashBuffer":{"type":"Buffer","data":[47,35,249,148,87,93,125,163,70,125,212,164,97,255,159,147,252,77,236,41]},"announce":[],"urlList":[]}}