{"title":"Wings.of.Honour.Battles.of.The.Red.Baron ","uid":4263726,"size":380207246,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f2d7f84ddbcd0e7ac820281e3d05ba503e5a1dc&amp;dn=Wings.of.Honour.Battles.of.The.Red.Baron+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hpttpe","files":28,"time":1214589918,"description":"It is 1916. Manfred von Richthofen and his squadron, Jasta 11, wreak havoc\n  during aerial engagements against the Allies. In response, the Allied\n  forces form a special squadron - The Angels of Annihilation, recruited\n  from among the best Allied pilots. The squadron&amp;#039;s priority is to down the\n  Red Baron, which would put an end to the dominance of his Flying Circus in\n  the air. Two groups of flying aces are pitted against each other. Which\n  one are you going to side with?\n\n  Regardless of your choice, you&amp;#039;re in for an action-packed campaign taking\n  place on the most important battlefields of World War One. You will take\n  the control stick of the most famous airplanes of that special era. It&amp;#039;s\n  up to you whether the Red Baron remains the king of the skies, or sustains\n  a crushing defeat...\n\n  Take the control stick of a German Zeppelin airship, or try to shoot it\n  down during a campaign full of unexpected twists and turns. The combat\n  takes place in a dynamic, action-packed world that faithfully reflects\n  the times of World War One. As you play, you&amp;#039;ll encounter your allies,\n  enemies and civilians so watch who you&amp;#039;re shooting at!\n\n  Thrilling actions in Campaign Mode, offering hours of excellent\n  entertainment - air combats, bombardments, reconnaissance and anti-aircraft\n  defence\n\n  A wide selection of 24 aircraft, faithfully reflecting the most famous\n\n  World War One fighters - you can choose between the view from the cockpit\n  or from a third-party perspective\n\n  The gaming environment is rich in details, including changing weather, the\n  presence of civilians and even domestic animals\n\n  An intuitive user&amp;#039;s interface and user-friendly menu enables you to start\n  the game without previous training","torrent":{"xt":"urn:btih:2f2d7f84ddbcd0e7ac820281e3d05ba503e5a1dc","amp;dn":"Wings.of.Honour.Battles.of.The.Red.Baron+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2d7f84ddbcd0e7ac820281e3d05ba503e5a1dc","infoHashBuffer":{"type":"Buffer","data":[47,45,127,132,221,188,208,231,172,130,2,129,227,208,91,165,3,229,161,220]},"announce":[],"urlList":[]}}