{"title":"The Evolution Fact Or Fiction?","uid":4107504,"size":7557248,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ffa74605a164a5694d0ebc6d12a7325ed2cbfee&amp;dn=The+Evolution+Fact+Or+Fiction%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"arthurj","files":1,"time":1206889508,"description":"Making a Monkey out of Darwin\n\n&quot;O Timothy, keep that which is committed to thy trust, avoiding profane and vain babblings, and oppositions of science falsely so called: which some professing have erred concerning the faith. Grace be with thee. Amen&quot; (1 Tim. 6:20-21).\n\nOne of the most important questions to face our generation is this: &quot;Are human beings simply the product of millions of years of mindless, evolutionary mutations and adaptations, or are we the creation of an infinitely wise, powerful, and loving God?&quot;\n\nThe answer to that question is critical. Why? Because it determines your attitude toward God in heaven and mankind on earth. The debate over human origin is one of the most critical issues of our times.\n\nTHE DAMAGE OF EVOLTION\n\nIt&amp;#039;s hard to measure the enormous damage inflicted by Darwinian evolution, the teaching that life arose from a spontaneous spark in a pond of primordial ooze. The amazing thing is that influential scientists themselves are now denying Darwin&amp;#039;s theory as impossible. Yet its destructive effects remain.\n\nFor instance, if man is an accident of nature, then there is no fixed standard of right and wrong. So what the Bible calls sexual perversion is now a ?lifestyle.? And a human life can be readily destroyed, whether in the womb or partially delivered.\n\nWorst of all, evolution has helped destroy belief in God for millions. Denying biblical creation, evolutionists have &quot;changed the truth of God into a lie&quot; (Romans 1:25).\n\nShould we be surprised that euthanasia is gaining widespread acceptance in our society or that the tide of abortion cannot be turned? Is it any wonder that sexual perversion is received as a valid alternative lifestyle? We have taught our children that they are just another species of animal ? and they are finally beginning to act like animals! And our children and grandchildren are still being fed this lie today.\n\nTHE DECEIT OF EVOLUTION\n\nWhat is behind this whole idea of evolution? Why is it such an emotional issue? Why can&amp;#039;t the world simply agree that there is no creation without a Creator, and out of nothing, nothing comes?\n\nHumanist Aldous Huxley expressed the answer to those questions in his book, Ends and Means. Huxley said he and his contemporaries did not want government or morality. So they chose evolution in order to shut the mouths of those who believe in special creation.\n\nFor more than 100 years, the evolutionists have succeeded in convincing people that evolution is the only logical, scientific, and intelligent theory of human origin.\n\nBut this campaign has been carried out amid deceit and slight of hand on the part of many evolutionists. We&amp;#039;ve all seen the creative drawings of supposed ancestors of mankind, built on a few teeth or a piece of a skull. And the fossil hoaxes perpetrated over the last century are well known.\n\nNo wonder in his book Darwinism: The Refutation of a Myth, the Swedish embryologist, Soren Lovtrup, suggests that he believes that some day Darwinism &quot;will be ranked the greatest deceit in the history of science.&quot;\n\nTHE DEFEAT OF EVOLUTION\n\nDespite its lack of credible evidence, evolution holds sway in our schools, the courts, and the public mind. What can we do?\n\nWe can preach, teach and defend the truth! We can set our children free from the devil&amp;#039;s lies by giving them the Truth of God&amp;#039;s Word (John 8:32) And we can point lost, confused and dying souls to Him who is the Way, the Truth and the Life!\n\nWith the steadfast support of friends like you, Love Worth Finding will continue to hold high the banner of Jesus Christ.\n\nTHREE TELLING ARGUMENTS AGAINST EVOLUTION\n\n1. The fossil record. Not only is the so-called missing link still missing, all of the transitional life forms so crucial to evolutionary theory are missing from the fossil record. There are thousands of missing links, not one!\n2. The second law of thermodynamics. This law states that energy is winding down and that matter left to itself tends toward chaos and randomness, not greater organization and complexity. Evolution demands exactly the opposite process, which is observed nowhere in nature.\n3. The origin of life. Evolution offers no answers to the origin of life. It simply pushes the question farther back in time, back to some primordial event in space or an act of spontaneous generation in which life simply sprang from nothing.\n\n? Love Worth Finding (Monday, December 29, 2003)\n","torrent":{"xt":"urn:btih:2ffa74605a164a5694d0ebc6d12a7325ed2cbfee","amp;dn":"The+Evolution+Fact+Or+Fiction%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ffa74605a164a5694d0ebc6d12a7325ed2cbfee","infoHashBuffer":{"type":"Buffer","data":[47,250,116,96,90,22,74,86,148,208,235,198,209,42,115,37,237,44,191,238]},"announce":[],"urlList":[]}}