{"title":"Game Jackal Pro v3.0.1.6","uid":4248883,"size":3636085,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:300b38144ee0c6b7bb0bf74be8954d512156cced&amp;dn=Game+Jackal+Pro+v3.0.1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1213914790,"description":"                         Game Jackal Pro\n                             v3.0.1.6\n\n\nGame Jackal Pro is the ultimate &quot;must have&quot; killer app for the PC gamer! If you, like most gamers, find it annoying looking for and inserting the CD-ROM for your favorite game each time you play it, then Game Jackal Pro is for you.\n\nKeeping your gaming investment safe: One major concern gamers have is the CD&amp;#039;s life span. The CD-ROM for a popular game may be inserted and removed many hundreds of times, this of course leads to the inevitable &quot;Unable to read&quot; error and ultimately a trip to the trash.\n\nUnleash your games and go gaming &quot;cd free&quot; in seconds: Using Game Jackal Pro eliminates the need to insert the CD-ROM before playing your favorite title, therefore allowing you to fire up your favorite game in seconds.\n\nEasy to use: Game Jackal Pro provides the user with a powerful and easy to use interface to go gaming &quot;cd free&quot;. It does this without modifying any of your game&amp;#039;s files or installing any virtual drives on your system. Simply select the game you want to play from the Game Jackal Pro interface, or create a desktop shortcut for even faster access.\n\nImage mode: Image mode adds support for games that need to stream data directly from the CD or DVD during game play.\n\nKeep young eyes from playing games that may be not right for them: Game Jackal Pro comes complete with a feature called Guardian Control, this feature allows restrictions to be placed on game profiles.\n\nYoung gamers can make short work of a game CD: Being able to pack away the game CD has proven to be extremely popular with parents of young gamers, where a game can be destroyed in weeks!\n\nThere&amp;#039;s no other product like it: The simple fact is that Game Jackal Pro stands alone. There&amp;#039;s no other product on the market that delivers the flexibility and functionality that Game Jackal Provides.\n\nGuardian Control\nOk... so Game Jackal Provides you with a way to protect game CD&amp;#039;s from the little hands of a young gamer, but how do we then stop these same young gamers from playing games that may not be appropriate?\nGame Jackal Pro contains a very unique and powerful feature called Guardian Control, this allows a game profile to be password protected thereby ensuring that only specific users (i.e. those knowing the password) can play the game. And because your CD-ROM&amp;#039;s are now put away for safe keeping, there&amp;#039;s no fear of accidentally leaving a disc in the drive for a young gamer to find.\nSo now that we have limited what a young gamer can play, wouldn&amp;#039;t it be great if we could limit when games could be played? Well once again Game Jackal Pro provides a way... Guardian Control also allows rules to be created that detail when and how long games can be played. These rules can be as simple as defining a time (i.e. between 6:30PM and 8:30PM) during the week days in which games can be played to complex rules that involve many periods in which a young person can go gaming.\nFeatures Pro Version\n\n*Create profiles right from the desktop with the new &quot;One-click&quot; profile creation option. Simply right-click any game icon on you desktop (or anywhere else for that matter) and select &quot;Convert to Game Jackal Profile&quot;, a much simplified creation wizard guides you through a 2 step process.\n\n* Unused profiles can now be moved to an archive section allowing you to keep only your current favorites in the &quot;My Game Profile&quot; section.\n\n* A new &quot;plug-in&quot; interface is now available, this allows third-party developers to create plug-ins for Game Jackal Pro.\n\n* Right-click popup menu for profiles, this provides a faster and easier way to manage profiles.\n\n* Improved reliability, support and performance for many games and hardware configurations.\n\n* Support for multi processor hardware, including the ability to specify processor(s) on each profile.\n\n* Image mode, for games that need to stream data from the CD or DVD during game play.\n\n* An easy to use interface, providing the user with a single tool for &quot;cd free&quot; gaming.\n\n* The creation of a Game Jackal Profile is performed while you are playing your favorite game!\n\n* Using the auto update feature, your version of Game Jackal Pro will always be the latest version available.\n\n* Guardian Control, this feature allows for the password protection of game profiles in addition to specifying when and how long a game can be played.\n\n* No longer do you need to find and insert the game&amp;#039;s CD-ROM.\n\n* Preserve the original game&amp;#039;s CD-ROM: one of the problems with having a favorite game is that the CD-ROM gets damaged over time.\n\n* Game load times are dramatically shortened\n----------------------------------------------------------------------------------\nSystem Requirements\n\n* IBM-compatible PC with a minimum 500 MHz Pentium-class microprocessor and 64 MB RAM\n* Windows 2000/XP/XP64/VISTA32/VISTA64\n* 2 MB hard-disk space\n\n------------------------------------\nInStRuCtIoNs:\n\nExtract with Winrar.\nInstall.\nPut patch in installation folder.\nRun Patch.\n\n-----------------------------------\n\nEnjoy!!","torrent":{"xt":"urn:btih:300b38144ee0c6b7bb0bf74be8954d512156cced","amp;dn":"Game+Jackal+Pro+v3.0.1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"300b38144ee0c6b7bb0bf74be8954d512156cced","infoHashBuffer":{"type":"Buffer","data":[48,11,56,20,78,224,198,183,187,11,247,75,232,149,77,81,33,86,204,237]},"announce":[],"urlList":[]}}