{"title":"ALFIE.mp4","uid":4144585,"size":1432028940,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:30c6f4103b5239b2c9e78b2f8af0efd503711cee&amp;dn=ALFIE.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"friendlytim","files":1,"time":1208657122,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0060086/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0060086/&lt;/a&gt;\n\nThe films begins with Alfie Elkins (Caine) ending a relationship with a married woman and getting another of his affairs pregnant. The film then follows his life for an unspecified time, documenting events that lead to the character&amp;#039;s emotional growth starting with the birth of his child.\n\nWatching his child grow brings out a more caring side of Alfie, including his having a health check in case of hereditary diseases, but his inability to commit to the child&amp;#039;s mother leads to her marrying a bus conductor. The health check reveals Alfie has shadows on his lungs. This combined with being banned from seeing his son leads him to have a small breakdown.\n\nAlfie then spends some time in a convalescence home. Here he meets Harry, who confronts him about his delusion that he is doing no harm, and Harry&amp;#039;s wife, whom he gets pregnant in a one-night stand. The subsequent abortion is a turning point for the character and the only time other than his passing out/breakdown where he exhibits real emotion - breaking down in tears at the sight of the aborted fetus.\n\nAt the film&amp;#039;s climax, Alfie decides to change his non-committal ways and settle down. He chooses Ruby (Shelley Winters), who is an older voluptuous and promiscuous American he met while working in taking holiday photos. Unfortunately the day he chooses to suggest this to Ruby, he finds a younger man in her bed, leaving him disheartened at the film&amp;#039;s end and wondering ?What&amp;#039;s it all about? You know what I mean?.","torrent":{"xt":"urn:btih:30c6f4103b5239b2c9e78b2f8af0efd503711cee","amp;dn":"ALFIE.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c6f4103b5239b2c9e78b2f8af0efd503711cee","infoHashBuffer":{"type":"Buffer","data":[48,198,244,16,59,82,57,178,201,231,139,47,138,240,239,213,3,113,28,238]},"announce":[],"urlList":[]}}