{"title":"Pro Cycling Manager 2008","uid":4276854,"size":4469229568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3147d26ff1428546eff3cea03cd09d63b4ea61ce&amp;dn=Pro+Cycling+Manager+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aurrillak","files":1,"time":1215225247,"description":"Pro Cycling Manager is much as you&amp;#039;d expect ? you take control of a cycling team, and guide them along season by season, trying to help them to as much success as possible. When you outgrow the team, or fancy a new challenge, you can move onto another team. You have to organise your various riders to go and train, enter them for the right races each season, and buy equipment for them, as well as signing new riders and organising the contracts of the existing ones and gaining sponsorship for the team. Most importantly you actually instruct all your riders about their effort levels and tactics in real time while watching the race in full 3D. The game seems to have the current cycling teams and tours in it, along with the correct coloured jerseys for the riders, but the rider names are mostly misspelt.\nThe races themselves are where you really make or break your team, and because you have tight control over how much effort cyclists should make, where they should be in the peloton (the pack), and when they should make a break or sprint, you&amp;#039;re not just the manager ? you&amp;#039;re actually the whole cycling team too. Happily (for me anyway) you don&amp;#039;t have to do any peddling yourself though. The controls that you can use on a rider are quite simple, but there&amp;#039;s no tutorial, meaning that you&amp;#039;re going to spend a few races being absolutely rubbish while you figure out how the instructions actually affect the riders ? at least there is a single race mode that allows you to experiment in one-off races without having to go through the beginning of a season. Once you get to grips with it though, the game is very rewarding ? guiding one of your riders to a race or even just a stage win is a great feeling. \n","torrent":{"xt":"urn:btih:3147d26ff1428546eff3cea03cd09d63b4ea61ce","amp;dn":"Pro+Cycling+Manager+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3147d26ff1428546eff3cea03cd09d63b4ea61ce","infoHashBuffer":{"type":"Buffer","data":[49,71,210,111,241,66,133,70,239,243,206,160,60,208,157,99,180,234,97,206]},"announce":[],"urlList":[]}}