{"title":"Fox Elipsus - Changing History (I need your support) ","uid":4060861,"size":5386202,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:317d035638ef3efaa1ba86ba42b34d24c1f05db6&amp;dn=Fox+Elipsus+-+Changing+History+%28I+need+your+support%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"namicv","files":1,"time":1204593020,"description":"BE A PART OF THE WORLD OF FOX ELIPSUS...\n\nBuy the 34-track double album CHANGING HISTORY by visiting http://http://elipsus.net/ , for only $10.\n\nChanging History by Fox Elipsus... has been described as &quot;beautiful sounds that move all of those who look for depth, truth, and beauty in music. The inspiring peace politics of the 60s, piano ballads of the 70s, the sweeping, soaring synths of the 80s, catchy radio tunes of the 90s, drenched in haunting and soothing vocals. It is just $10 right here on www.elipsus.net\n\nFrom romantic piano ballads to haunting, chilling, atmospheric epics, synth pop songs, dance songs, guitar rock songs, controversial political anthems and songs for peace, a sexy rnb track, a joke-hip-hop song, an amazing 24-page full colour booklet, it is both mellow and moving, like nothing you have ever heard, and is beloved by nearly everyone that has it in their collection.\n\nBE A PART OF THE WORLD OF FOX ELIPSUS...\n\nFANS AND FRIENDS: Sign up for my e-mail list, buy an album or two, tell all your friends about it, and enjoy the website - it was built for you! Come to one of my North America Tour Dates. Tell your friends all over the country to add my myspace, buy my album, and come to the North America Tour Dates closest to them - it REALLY helps and makes it all worthwhile!\n\nINDUSTRY PROFESSIONALS: I am ready. The crowds all over the country love this music. New fans are discovering it every day. Word is getting around. The deep, heartfelt and honest messages in the lyrics are profound and important. The passionate and stirring solo performances are captivating crowds everywhere. The ambition here is infinite and limitless. It is up to you to capture this moment, harness it, and be a part of its rise to infamy.\n\nPlease support me so I can continue to tour and bring my music around America. :)","torrent":{"xt":"urn:btih:317d035638ef3efaa1ba86ba42b34d24c1f05db6","amp;dn":"Fox+Elipsus+-+Changing+History+%28I+need+your+support%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"317d035638ef3efaa1ba86ba42b34d24c1f05db6","infoHashBuffer":{"type":"Buffer","data":[49,125,3,86,56,239,62,250,161,186,134,186,66,179,77,36,193,240,93,182]},"announce":[],"urlList":[]}}