{"title":"Alex Jones - Dark Secrets Inside Bohemian Grove DivX 5","uid":3335316,"size":728602624,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:31826ad60b1a199a560ef4f8b2b2c4b134367aa0&amp;dn=Alex+Jones+-+Dark+Secrets+Inside+Bohemian+Grove+DivX+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"ReVIsed","files":1,"time":1116879221,"description":"Nixon, Eisenhower, and Reagan were members. The Bush Family Maintains a Strong Involvement. Now, for the First Time in History, Alex Jones Brings You Video from His Infiltration of Bohemian Grove. View the Elite Compound and Witness World Leaders Conducting a Bizarre, Occult Ritual, Worshipping a Giant Stone Owl Idol.\n\n&quot;Alex Jones Has Blown Bohemian Grove Wide Open!&quot;\n\n-- John Sergeant, World of Wonder, UK Channel 4.\n\nMajor media from CBS television, magazines like People and Spy have attempted and failed to get the hard video evidence that Alex Jones and his team have gotten out of Bohemian Grove. \n\nAlex Jones: &quot;This is like something out of a Hollywood movie, where teenagers are out camping in the wilderness and come over a hill and witness some devil cult in black and red garb sacrificing some poor soul on a bloody altar&quot;.\n\nSince 1873, the Global Elite Has Held Secret Meetings in the Ancient Redwood Forest of Northern California. Members of the so-called &quot;Bohemian Club&quot;; Include Former Presidents Eisenhower, Nixon and Reagan. The Bush Family Maintains a Strong Involvement. Each Year at Bohemian Grove, Members of This All-Male Club Don Red, Black and Silver Robes and Conduct an Occult Ritual Wherein They Worship a Giant Stone Owl, Sacrificing a Human Being in Effigy to What They Call the &quot;Great Owl of Bohemia&quot;.\n\nNow, for the First Time in History, an Outsider Has Infiltrated Bohemian Grove with a Hidden Digital Video Camera and Caught the Ritual on Tape. That Man is Alex Jones, the Exclusive Digital Video is Just Part of His Shocking New Documentary: DARK SECRETS INSIDE BOHEMIAN GROVE.\n\nGenre: Documentary \nVideo Codec: DivX 5.x \nVideo: ~730 kbit/s \nRuntime: 121 Min \nAudio Format: ~64 kbit/s MP3 VBR \nAspect Ratio: 4:3 \nFrame Size: 352x240 \nFramerate: 29,970 fps \nLanguage: English\n\n* The 'used FourcCC' in the .avi header is DX50. Hence, these files will play back on MPG4 (i.e. DivX5) compatible DVD-players.\n** This files lacks the scroll text (with credits) in the end. But the movie itself is complete.","torrent":{"xt":"urn:btih:31826ad60b1a199a560ef4f8b2b2c4b134367aa0","amp;dn":"Alex+Jones+-+Dark+Secrets+Inside+Bohemian+Grove+DivX+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31826ad60b1a199a560ef4f8b2b2c4b134367aa0","infoHashBuffer":{"type":"Buffer","data":[49,130,106,214,11,26,25,154,86,14,244,248,178,178,196,177,52,54,122,160]},"announce":[],"urlList":[]}}