{"title":"Hero.2002.NTSC.R3.DVDR-COBO","uid":3229144,"size":4682379501,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:31d86c2b2ffe0d6d3322c9d511d5ad1285b4f560&amp;dn=Hero.2002.NTSC.R3.DVDR-COBO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MoonWolf","files":100,"time":1091569014,"description":"_________   ________    __________  ________   \n                  _   ___   _____     ______    _____    \n                  /      /   /   |      |    |  _/  /   |    \n                       ____ /    |      |    |    /    |    \n                   ______  / _______  /  |______  / _______  /\n                       C  /    O     /    B     /    O     / \n                                                                  \n  ::: Presents ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n                             Hero.2002.NTSC.R3.DVDR-COBO\n  :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n   - Supplier.........: COBO Team            - DVD Date..........: 11-18-2003\n   - Rip/Pack.........: COBO Team            - Release Date......: 11-21-2003 \n   - Support Files....: Sfv,Sample           - Genre.............: Action\n   - User Rating......: 8.1/10 (4,417)       - Movie Year........: 2002\n   - PLAY Time........: 98 Min.              - Size..............: 1.DiSC\n   - iMAGE............: iMG                  - Files.............: 94 x 50mb        \n\n  ::: DVD-R iNFO ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n\n    - AUDIO.........: [ ] DD 2.0       [ ] English [ ] Korean                \n                      [ ] DD 2.0 Mono  [ ] French  [ ] Japanese\n                      [ ] DD 2.1       [ ] German  [X] Chinese               \n                      [ ] DD 5.0       [ ] Spanish [ ] Norwegian    \n                      [X] DD 5.1       [ ] Danish  [ ] Swedish\n                      [ ] DTS 5.1      [ ] Dutch   [X] Directory Comentary \n                      [ ] DTS 6.1 ES   [ ] Italian [ ] Other                                                   \n\n    - VIDEO.........: [ ] Untouched                                           \n                      [X] DownSampled\n                      [ ] Re-encoded (CCE)                                          \n                      [ ] Passes [5]                                          \n                      [ ] Bitrate [3800]                                      \n                     \n    - SOURCE........: [X] DVD Retail  [ ] DVD5                             \n                      [ ] PRE DVD     [X] DVD9                           \n  \n    - DVD EXTRAS....: [ ] All Included                                        \n                      [ ] Partial Stripped                                \n                      [X] Fully Stripped                                  \n  \n    - MENU..........: [X] Untouched\n                      [ ] Some part stripped     \n                      [ ] Stripped        \n  \n    - SUBTITLES.....: [X] Korean                  [ ] Icelandic         \n                      [X] English                 [ ] Swedish       \n                      [ ] English For The         [ ] Danish        \n                          Hearing Impaired        [ ] Norwegian     \n                      [ ] French                  [ ] Finnish       \n                      [ ] German                  [ ] Netherlandic  \n                      [ ] Dutch                   [ ] Thai          \n                      [ ] Spanish                 [ ] Japanese      \n                      [ ] Portuguese              [X] Chinese\n                      [ ] Other                   [ ] (None)\n  \n    - REGION........: [X] NTSC                                           \n                      [ ] PAL                                            \n                      [X] Region Free                          \n                      [X] Macro Vision Free                    \n                                                             \n    - ASPECT RATIO..: [ ] 16:9 Letterbox                       \n                      [X] 16:9 Widescreen                      \n                      [ ]  4:3 Fullscreen                      \n                                                                     \n   \n  :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n                      http://www.imdb.com/title/tt0299977/   \n                  \n                         Directed by Yimou Zhang\n\n       \n  ::: CAST ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n            Jet Li              ....  Nameless \n            Tony Leung Chiu Wai ....  Broken Sword \n            Maggie Cheung       ....  Flying Snow \n            Ziyi Zhang          ....  Moon \n            Daoming Chen        ....  King of Qin \n            Donnie Yen          ....  Long Sky, Silver Spear \n\n   \n   \n  ::: Summary :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n     It sounded like a HK Cinema fan's ultimate wet dream... Zhang Yimou to direct \n     a martial arts epic with Jet Li, Maggie Cheung, Leung Chiu Wai, Zhang Ziyi and \n     Donnie Yen in the cast, Ching Siu-Tung doing the action, Christopher Doyle the \n     cinematography and Emil Wada the costumes. What more could you ask for? \n     (Well, Brigitte Lin coming out of retirement and Yuen Wo Ping and Sammo Hung \n     sharing the action director credits, perhaps).\n\n     I guess we have CROUCHING TIGER HIDDEN DRAGON to thank for making the wu xia \n     world bankable again, and generating the interest and investment required to \n     bring a project of this stature together. There's no doubt that the US Market\n     was a major target, and US$ went into the funding. Given this it's a tragedy \n     that Yimou let Miramax get their paws on it and effectively ruin any chances \n     it had of major US success\n\n     Apart from Zhang Ziyi and the Tan Dun soundtrack (a terrible choice no doubt \n     enforced by US investors), CROUCHING TIGER HIDDEN DRAGON is not a good reference \n     point by which to evaluate HERO. Much more appropriate is Wong Kar Wai's ASHES \n     OF TIME, with which it shares two lead actors and a cinematographer. HERO is \n     definitely more commercially oriented, but shares a beauty and philosophical \n     richness with AOT, and a certain melancholy mood.\n\n     The story of HERO starts off quite simply, as Jet Li begins to recount his \n     martial triumphs to the Emperor of Qin. The tale is told in flashbacks which \n     revisit and re-evaluate the same events, elaborating on and changing the story \n     as we learn more. It's reminiscent of Akira Kurosawa's RASHOMON, and is a great \n     ay of developing a mystery thriller. Zhang Yimou handles the building of the tale \n     expertly, as one would expect from such a master film maker.\n\n     Zhang Yimou himself is such an accomplished cinematographer he hardly needed to \n     hire somebody else for the job - but if there's anybody better than Yimou it's \n     Christopher Doyle. I wonder how much conflict there was on set though, as I am \n     sure each had very strong visions of how they wanted scenes to look. The result \n     doesn't show any signs of it if such a conflict occured though, as the visual \n     style seems exceptionally strong and focussed throughout. A large part of this is \n     Yimou's use of bold colours to delineate the different sections of the story (The \n     green, the red, the yellow, the blue, the white). With Emil Wada's stunning costumes \n     and the great choice of locations, HERO is almost as rich in stunning imagery as \n     SHES OF TIME. It's a true work of art, harking back to Yimou's older films like \n     HANGHAI TRIAD and RAISE THE RED LANTERN - I'm really pleased to see him making such \n     visual films again. The visuals are sometimes let down by some unconvincing CGI \n     effects, unfortunately.\n\n     Zhang Yimou has never directed an action movie before, so people were clearly worried \n     he wouldn't know what to do with the fight scenes that a wu xia movie needs more than \n     anything else. It's been quite a few years since Ching Siu Tung has produced any really \n     impressive work too, so I was rather worried - especially when I heard (from good authority) \n     that Yimou had Ching had clashed on set. Apparently Zhang wanted more grounded, realistic \n     kung fu, which really isn't Ching Siu Tung's thing (should have got Sammo or Yuen Wo Ping!). \n     I guess Ching got the upper hand in the end, as the fight scenes are certainly not grounded \n     or realistic - they're very much about the twirling and whirling and the graceful flying \n     that Ching Siu Tung virtually defined. They're not as manic as he usually makes the action \n     when he directs himself, though - a fact that sometimes makes the wirework look a bit awkward.\n\n     A real surprise is that the weakest fight scene of the film is that one that pits the \n     two best martial artists together. Jet Li vs. Donnie Yen opens the film with some sword vs. \n     pear action. There's some beautiful moments, but I felt the scene lacked impact and featured \n     some awkward moves too. Oddly enough, the fight I enjoyed the most featured no real martial \n     artistry at all - Maggie Cheung vs (well, you'll see) in a beautiful autumnal scene of \n     falling leaves. I guess that's because Ching Siu Tung is really not working to his \n     trengths when he tries to do &amp;quot;real&amp;quot; martial arts.\n\n     I had held off watching HERO for months, because as soon as I got the first released DVD \n     (the DVD-5 from Guang Dong Face Ah) it was announced that the extended version of the \n     film would be released in a few weeks. It's generally well known now that Zhang Yimou \n     was persuaded to cut about 20 minutes from the film by the hatchet men at MiramAXE, who \n     really must die first when the revolution comes. I figured the first time I see it \n     I should see the best possible version, for maximum impact, so I was willing to wait. \n     Well it's been 2 months now and the extended version is now indefinitely delayed due to \n     legal issues, so I finally gave in and watched the DVD I'd had lying around for so long. \n     Now that I've seen it I have to say I don't really see what another 20 minutes would add \n     to the film - it seems quite complete and well paced at about 95 minutes. A little more \n     development of Donnie Yen's character would be nice, but other than that it's hard to \n     imagine what is missing. Longer action scenes maybe? Or perhaps just 20 minutes of Christopher \n     Doyle's beautifully composed landscape shots, or close ups of Maggie Cheung dying.\n\n     I'm glad I waited to see the film anyway though, as it allowed all the hype and anticipation \n     to die down. Unfortunately, when a film is as highly anticipated as this it's inevitable \n     that there will be &amp;quot;backlash syndrome&amp;quot; as people feel let down that it wasn't the ultimate \n     movie of all time they heard/hoped it would be (it was amusing to watch the reviews on \n     CROUCHING TIGER swing between &amp;quot;incredible&amp;quot; and &amp;quot;awful&amp;quot; as hype waves ruined the experience \n     for many, and I'm sure the same will happen with HERO).\n\n     Zhang Yimou is an extremely talented director in many respects, but perhaps the greatest \n     is his ability to get incredible performances out of his cast. With such an illustrious \n     cast on board he perhaps felt he didn't need to try as much though (or they weren't willing \n     to listen), as the acting isn't as powerful as I had expected. It's still of a very high \n     quality, but doesn't evoke the same strong emotions as some of the performances in ASHES OF \n     TIME. Leung Chiu-Wai gets the top award for acting though, which will surprise few people. \n     Zhang Ziyi only has a small part, but shows a lot of talent too - nice to see such skill \n     in somebody that still has most of her career ahead of her. Of course, it was Zhang Yimou \n     that discovered and nurtured her talent in THE ROAD HOME.\n\n     There are only two disappointments in HERO, for me. One is the special effects, which aren't \n     up to the very latest standards. A little less use of CGI would have made it go a lot further \n     (like in CTHD). The other is the soundtrack, which is really just much too similar to the \n     rouching Tiger soundtrack. It doesn't fit HERO as well, but it is still pretty evocative \n     and effective - just too similar to CTHD.\n\n     I still intend to pick up the extended version of HERO when it's released, to see what Zhang \n     Yimou's ideal vision for the film was. Even running shorter than he really wanted it's a \n     mighty fine film though, and one I have no hesitation in recommending if anybody hasn't seen \n     it yet. If MiramAXE ever do get round to releasing it in the US, I hope it does well.\n\n\n\n  ::: Release Note ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n     \n    Enjoy the movie :)\n  \n  \n  ::: Greetings :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n    JBiSO \n    You might know who we are :)\n\n    \n  ::: Group Notes :::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n       \n       \n      We are looking for the following talented ppl :\n            - Experienced Rippers/Encoders            \n            - 100m+ Affil. Sites                      \n            - hardware Suppliers                         \n            - Pre DVD suppliers                          \n       \n            - &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;196d7c7874467a767b76596078717676377f6b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\n\n\n      if you like this movie, just buy dvd at your favorite store \n\n\n\n                                        ''~``\n                                       ( o o )\n  +-------------------------------.oooO--(_)--Oooo.-------------------------------+\n  |  Salut ! Ca Va !  ...................................................  Chao ! |\n  |                                  .oooO                                        |\n  | - COBO -                         (   )   Oooo.                                |\n  +----------------------------------- (----(   )--------------------------------+\n                                       _)    ) /\n                                             (_/\n  \n","torrent":{"xt":"urn:btih:31d86c2b2ffe0d6d3322c9d511d5ad1285b4f560","amp;dn":"Hero.2002.NTSC.R3.DVDR-COBO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d86c2b2ffe0d6d3322c9d511d5ad1285b4f560","infoHashBuffer":{"type":"Buffer","data":[49,216,108,43,47,254,13,109,51,34,201,213,17,213,173,18,133,180,245,96]},"announce":[],"urlList":[]}}