{"title":"Prince.of.Persia.2.Warrior.Within.PAL.PS2DVD-WpR","uid":3256310,"size":2381862599,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:32919963fa803bac4db2a83d41a8b7bd649eb3b4&amp;dn=Prince.of.Persia.2.Warrior.Within.PAL.PS2DVD-WpR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xanax","files":50,"time":1100620714,"description":"Prince.of.Persia.2.Warrior.Within.PAL.PS2DVD-WpR \n\n      Company...: UBI SOFT            -  File Count.......: 48 X 50mb         \n      Released..: 11/04               -  Media Type.......: DVD (Iso)      \n      Origin....: PAL                 -  Game type .......: U KNOW                    \n      Language..: En/Fr/Sp            -  Ripped ..........: -                          \n\n\n  \n     The Old Man said to the Prince, &amp;quot;Your fate has been written. You will die.&amp;quot;   \n     Enter the dark underworld of Prince of Persia 2, the sword-slashing sequel \n     to the critically acclaimed Prince of Persia: The Sands of Time.  \n     Hunted by Dahaka, an immortal incarnation of Fate seeking divine \n     retribution, the Prince embarks upon a path of both carnage and mystery \n     to defy his preordained death. His journey leads to the infernal core of  \n     a cursed island stronghold harboring mankinds greatest fears.  \n     Only through grim resolve, bitter defiance and the mastery of deadly new \n     combat arts can the Prince rise to a new level of warriorship - and emerge \n     from this ultimate trial with his life.  \n     \nFeatures:  \n     *The Game of the Year Returns: Prince of Persia 2 is the highly anticipated \n       sequel to the universally acclaimed Prince of Persia: The Sands of Time.\n  \n*A Warrior Reborn: The Prince has matured immeasurably since his courageous \n       fight in Prince of Persia: The Sands of Time. He returns here with deadlier \n       skills, a darker heart and a craving for battle.  \n     \n*Free-Form Fighting System: An intricate new combat system lets you wage \n       battles with no boundaries. Manipulate the environment and the enemies \n       themselves to develop your own unique fighting style. Plus, an all-new  \n       projectile attack system allows for a variety of ranged combat tactics.  \n     \n*A Violent Underworld Revealed: Explore and conquer a cursed island underworld, \n       breeding ground for the most brutal, unrelenting monsters to torment mankind.  \n     \n*Control the Ravages of Time: Ravage enemies with the devastating new combative \n       powers of the Sands of Time, opening up astounding variations in fighting \n       gameplay.  \n     \n*Fight Harder, Play Longer: Hours upon hours of action await in your fight \n       for survival, including various bonus incentives for those who finish \n       the game. \n    -----------------------------------------------------------------------------------\n\nHoppas det smakar :)","torrent":{"xt":"urn:btih:32919963fa803bac4db2a83d41a8b7bd649eb3b4","amp;dn":"Prince.of.Persia.2.Warrior.Within.PAL.PS2DVD-WpR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32919963fa803bac4db2a83d41a8b7bd649eb3b4","infoHashBuffer":{"type":"Buffer","data":[50,145,153,99,250,128,59,172,77,178,168,61,65,168,183,189,100,158,179,180]},"announce":[],"urlList":[]}}