{"title":"20081902 FSUK Manchester Talk","uid":4049027,"size":1003829280,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:32b64116b4abcefffe788b5d04f14f2ed66d2355&amp;dn=20081902+FSUK+Manchester+Talk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ajehals","files":7,"time":1204062938,"description":"About\n\nThis video is of the February 19th 2008 meeting with Stuart Langridge (also known as Aq) of LUGRadio fame joining us for a talk about his experiences with free software.  The event took place on the at 7:30pm at Manchester Digital Development Agency on Portland Street.\n\nLanguage\n\nIts all in English, transcript to follow, no subtitles.\n\nAbout the Quality\n\nThis was an off the cuff recording, so the quality may vary...\nThe lighting is bad, I have tried to correct, but hey.\nThe audio was a little quiet.\nThe battery ran out about halfway through.\nI ran out of tape after about 45 minutes.\n\nMy apologies, if there is demand then next time we can plan this properly.\n\nCopyright\n\nCurrently the video&amp;#039;s are marked as copyright fsuk.org, I figured as I currently own the copyright and have signed consent from Stuart Langridge (made out to ICTSC Ltd - [thats all I had with me]), whilst simultaneously being a member of the fsuk group, I could, with a clear conscience transfer the said copyright to fsuk, and accept it on fsuk&amp;#039;s behalf.  Any problems with that, contact me and I will do something different.  Obviously I dont want to have to sue myself, but if I have to in order to protect my rights I will.  (Copies of a written copyright transfer and Stuart&amp;#039;s consent available at request).\n\nFinally, I ended up picking the Creative Commons Attribution-Share Alike 2.0 UK : England &amp; Wales as a license for these, again, any problems contact me and I&amp;#039;ll change it if need be.\n\nThese videos are licensed under the Creative Commons Attribution-Share Alike 2.0 UK : England &amp; Wales, You are permitted to copy, distribute, transmit, publicly perform, modify or adapt this video under the following conditions: You must attribute the work by keeping any copyright and &amp;#039;created by&amp;#039; notices in place.  For any reuse or distribution, you must make clear to others the license terms of this work. If you alter, transform, or build upon this work, you may distribute the resulting work only under a licence identical to this one.\n\nAny of the above conditions can be waived if you get permission from the copyright holder The full text of the license is available at: http://creativecommons.org/licenses/by-sa/2.0/uk/ (or see LICENSE.TXT if you grabbed the torrent) Nothing in this license impairs or restricts the author&amp;#039;s moral rights.\n\nMore Info\n\nOne more thing, As some of you know I am doing a video documentary thing about ODF and standardisation, as such I thought I would road test some of my documentary credits (specifically the first 30 seconds on this video) mainly because I figured if I was going to spend the time on it I might as well draw some benefit from it, and also because this is also CC licensed (for now at least).  So any comments on that would be most welcome, I know its not much, but I&amp;#039;d appreciate it.\n\nThe Files in this torrent are: \nSize  File Created DTG File Name\t\t\t     Description\n652M  2008-02-26 10:44 FSUK_20080219_Best_Quality(PAL).ogg   The best quality OGG/Theora version.\n170M  2008-02-26 10:44 FSUK_20080219_Mid_Quality.ogg         An acceptable quality OGG/Theora version.\n98M   2008-02-26 16:11 FSUK_20080219_Mid_Quality.mp4         A decent Quality (and size) MP4 version.\n39M   2008-02-26 14:56 FSUK_20080219_Low_Quality.ogg         The lowest quality OGG/Theora version.\n\n4.2K  2008-02-26 20:10 .NFO                                  This file.\n11K   2008-02-26 20:22 LICENSE.TXT                           Full text of the license.","torrent":{"xt":"urn:btih:32b64116b4abcefffe788b5d04f14f2ed66d2355","amp;dn":"20081902+FSUK+Manchester+Talk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32b64116b4abcefffe788b5d04f14f2ed66d2355","infoHashBuffer":{"type":"Buffer","data":[50,182,65,22,180,171,206,255,254,120,139,93,4,241,79,46,214,109,35,85]},"announce":[],"urlList":[]}}