{"title":"Infernal.Affairs.III.Blu-ray.REMUX.1080P.H264.DTS-HDMA.DD51.@SIL","uid":4163413,"size":19379165072,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:32e7a00e908cfab228b29b1802aeba80147eb72d&amp;dn=Infernal.Affairs.III.Blu-ray.REMUX.1080P.H264.DTS-HDMA.DD51.%40SIL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"accpt7506_siluer","files":11,"time":1209490464,"description":"Video:           AVC/MPEG-4\n\nAspect Ratio:    2.35:1\n\nAudio:           Cantonese DTS-HD MA 6.1 ,Mandarin DD-EX 5.1 640K\n\nPlot Outline:\n\nBecause Chan (Tony Leung) was being expelled from the school in 1991, SP Yeung Kam Wing (Leon Lai) graduated, with all police reports distinctions, being the first in whole class. 12 year later, he was being sent, working to Lau (Andy Lau). 10 months after Chan (Tony Leung) die, Yeung&amp;#039;s spy had blew a case and the spy wish to kill Yeung, but Yeung took his gun and shot him to conclude this failure. Lau gave Yeung car park seat B3A6 when Yeung met Lau. Yeung asked Chan (tony Leung) who he is, but Chan didn&amp;#039;t remember him. Sam (Tsang Chi Wai) work with Yeung (Leon) and Lau is recording Yeung&amp;#039;s words so that he can sue Yeung. Yeung is a police SP, which is being sent to Sam as the spy from police. Lau doesn&amp;#039;t really know Yeung&amp;#039;s Police SP position and wish to catch Yeung to the police head. Yeung work with another inspector (Chan Dao Min) who is a good friend of Yeung himself. Lau sneaked into Yeung&amp;#039;s office, stealing the cassette, and ask the head to tell him that Yeung is the spy of the triad, Sam&amp;#039;s triad. The inspector friend of Yeung, without found by Lau, changed Lau&amp;#039;s own cassette back to Lau&amp;#039;s own player. When Yeung was talking with his staff about the event, Lau brought the head to meet Yeung, and played the tape, because it&amp;#039;s changed back with Lau&amp;#039;s tape, so Lau ashamed himself instead of able to prove that Yeung is the spy. Lau said why are the police people playing him with this. Yeung, spoke like Chan, Sorry Lau, I am a policeman. Lau said that he is also a police, and shot Yeung&amp;#039;s heart. Yeung and the inspector (Chan Dao Min) shot Lau back, but Lau succeeded to shoot Yeung&amp;#039;s forehead. Yeung was proved deceased with lots of blood. Lau was sent to hospital and met his girl (Sammi Cheng). Sammi told him that her baby is his, and she is able to call Lau as daddy. 10 months ago, when Chan (Tony Leung) die, the inspector and Yeung were talking together, Yeung told the inspector that there are still things that need both Yeung and inspector to tackle after Chan die. Inspector cried when he watched Yeung&amp;#039;s past. 10 months after, now, Psychologist (kelly Chen) talked with the inspector after she paid her tribute to Chan (Tony Leung), and the inspector paid his tribute to Yeung (Leon). Psychologist said that it may be the destiny. Inspector told her that it is chance not destiny. It&amp;#039;s always things change human, human can&amp;#039;t change things. But Chan (Tony), Yeung (Leon), Lau (Andy Lau) had changed some things themselves. Inspector ask Psychologist (Kelly) to let the things to past off, tomorrow still have to face.\n\nDirector:        Wai-keung Lau ,Siu Fai Mak\n\nCountry:         HongKong\n\nTransfer Format: 1080p \n\nYear:            2003\n\nRunning Time:    118 min\n\nIMDB:           &lt;a href=&quot; http://www.imdb.com/title/tt0374339/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0374339/&lt;/a&gt;\n\nFinalcodec Player \n\ndownload                                                                     &lt;a href=&quot;\nhttp://www.siluhd.com/soft/FinalCodecs2008sp.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.siluhd.com/soft/FinalCodecs2008sp.exe&lt;/a&gt;\n\nYou need a powerfull computer to play AVC codec HD\nRecommended: INTEL Core2 DUO or AMD X2 4800+ and ATI 2400 PRO\n\nOther movies visit                                                                          \n\n               &lt;a href=&quot;\nhttp://thepiratebay.se/user/accpt7506_siluer&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/accpt7506_siluer&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:32e7a00e908cfab228b29b1802aeba80147eb72d","amp;dn":"Infernal.Affairs.III.Blu-ray.REMUX.1080P.H264.DTS-HDMA.DD51.%40SIL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32e7a00e908cfab228b29b1802aeba80147eb72d","infoHashBuffer":{"type":"Buffer","data":[50,231,160,14,144,140,250,178,40,178,155,24,2,174,186,128,20,126,183,45]},"announce":[],"urlList":[]}}