{"title":"ElectricGirl","uid":4252109,"size":899460871,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3366f15adda7683563e276d9d7831a101af44a0a&amp;dn=ElectricGirl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"KeitaroJ","files":2,"time":1214063092,"description":"Plot\n.......\nPoor Jan Fong (Ngan) has a most unusual problem: whenever she becomes sexually excited, an electrical charge is generated, frying her partner. Swearing off men, Jan now uses light bulbs to stimulate herself (but not florescent -- too big). Her new boss, Leo (Jimmy Wong Shu-kei, who has been in almost many C-IIIers as Elvis Tsui Kam-kong and now bears a distracting resemblance to Raymond Wong Pak-ming), seems to be an ideal match for Jan, much to the delight of the other office secretaries (Teresa Mak Kar-kei, Crystal Cheung Yee-tung, and Grace Lam Nga-sze). Leo claims that he does not believe in inter-office fraternization, though he still goes out of his way to spend as much time with Jan as possible.In an effort to cure her rather unique malady, Jan visits a lecherous MD (Charlie Cho Cha-lei, another actor who has been in far too many of these things) who makes love with her, while dressed head-to-foot in rubber and wearing several condoms. His sai lo gets barbecued but Jan discovers a new ability: during orgasm, she can predict the numbers in the Mark Six lottery draw. Her desire for a stud is even more pressing now but Leo keeps turning her down because he is actually impotent. Desperate, Jan gets a job as a club girl but still cannot find the right man. Of course, he is right under her nose all along and just needs a little \\\\\\\\\\\\\\&quot;electric therapy.\\\\\\\\\\\\\\&quot;","torrent":{"xt":"urn:btih:3366f15adda7683563e276d9d7831a101af44a0a","amp;dn":"ElectricGirl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3366f15adda7683563e276d9d7831a101af44a0a","infoHashBuffer":{"type":"Buffer","data":[51,102,241,90,221,167,104,53,99,226,118,217,215,131,26,16,26,244,74,10]},"announce":[],"urlList":[]}}