{"title":"Rappelz epic 4--3d MMORPG by g-potato","uid":4168838,"size":1825164313,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3376c54f5d674e1306c00e8046c082436a4da69c&amp;dn=Rappelz+epic+4--3d+MMORPG+by+g-potato&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nisher","files":2,"time":1209750336,"description":"Rappelz is a free-to-play massively multiplayer online role-playing game. The game is developed by the Korean company nFlavor, and published by the Californian company Gala-Net Inc. Although Rappelz is free-to-play, revenue for the game is gained through sale of special items in the &quot;Cash Shop&quot;.\n\nThe game is set in a medieval fantasy world, dominated by three races: the Deva, who represent light, the Asura, who represent darkness, and the Gaia, humans that possess an affinity with nature.[2]\n\nEach major installment of the game is referred to as an &quot;Epic&quot;, similar to Lineage II&amp;#039;s &quot;Chronicles&quot;. The current installment is called &quot;Epic 4: Revolution&quot;.\n\nThe Story\nAccording to the game&amp;#039;s backstory available on gpotato&amp;#039;s site, the oldest race is the Gaia, and to assist them, the gods of Creation and Extinction brought two more races into the world. They were the Deva who represented the Light and the Asura who represented the Darkness. With this, there was a period of peace and stability in the world.\n\nAs the ages passed by, there was one among the Gaia who called herself &quot;The Witch&quot;. Over time, she grew in tremendous power and with a ruthless ambition, rallied the people of Gaia to rebel against the world.\n\nNot all the people of Gaia heeded this call however and the world was thrown into chaos. It was only through the combined efforts of the three races of Deva, Asura and Gaia that &quot;The Witch&quot; was finally captured and burnt alive. It was a victorious outcome of a unity between the three races.\n\nNow at the present time, the three races continue to co-exist with each other in the world of Rappelz but dark rumors have surfaced about the second coming of &quot;The Witch&quot; and the return of her terrible forces.\n\nThe backstory does not play a substantial role in the game itself.\n\n\n[edit] Game Features\n\n[edit] Action Icons\nGenerally most MMO&amp;#039;s have generic actions built into the mouse clicks, for example attacking and picking up loot. Rappelz however optionally provides the use of icons for those actions; thus allowing them to be assigned to a hotkey. Some other actions may also be used through the use of icons (those available in the control window[10]) such as toggling PVP. Emotes, traditionally used through the chat window via commands using the syntax /command, are optionally available through hotkey usage.[11]\n\n\n[edit] Lak and Chips\nA Lak is magical energy from monsters and can be obtained by defeating monsters while wearing the appropriate necklace. This necklace will be available fairly early in the game. Gathered Lak can be traded at any Lak Trader, for either chips or in-game currency: rupees. Lak Traders also provide the option to buy chips with rupees. However, it is more cost-efficient to obtain chips via Lak.[12]\n\nThere are three types of chips: Force Chips, Soul Chips and Luna Chips. These chips are items that characters can use to significantly affect a battle by increasing the amount of damage the target takes for a limited amount of time. They come in different ranks which allow different levels of users to use chips while not overpowering them. Force Chips increase physical damage (melee and ranged for example), while Soul Chips increase the amount of magical damage a &amp;#039;chipped&amp;#039; monster takes.[12]\n\nLuna Chips are similar to Force Chips and Soul Chips combined. Luna Chips do not &amp;#039;stack&amp;#039; with Force or Soul Chips, and casting a Luna Chip will cancel the effect of the Force or Soul Chip. Likewise, casting a Force or Soul Chip on a target previously chipped with Luna Chip, will cancel the effect of the Luna Chip.\n\n\n[edit] Items and Equipment\nEquipment in the game have their own level and can level up by means of upgrading. Items that are able to do this display a section at the bottom of their status window showing the upgraded status effects, allowing players to know ahead of time the quality of the equipment. By visiting a Blacksmith, which is available in every town, players are able to upgrade their currently equipped (and upgradeable) equipment for a fee.\n\nIn addition, combinations of equipment with the appropriate enchantment cubes can further increase its potency, and as is the case with weapons, even be reflected graphically through a glow effect. This is called &amp;#039;enchanting&amp;#039; an item. A weak weapon or armour can be formed into a stronger item without having to sell it and buy a new one.[12][13] This can also substantially increase both the item&amp;#039;s in-game market value. The only non-equipment item that can be enchanted is the skill card.\n\nItems can also be improved by &amp;#039;socketing&amp;#039; Soul Stones. This is done by visiting a Soulcrafter. Soul Stones are drop items that cannot be bought from any NPC. When socketed, they will increase one of the primary stats of one&amp;#039;s character, if three conditions are met: the equipment with the Soul Stone is equipped, the Soul Stone&amp;#039;s level is lower than or equals the character&amp;#039;s level, and the Soul Power of the equipment is charged. Soul Power can be charged at the Soulcrafter of each town, and will be payed in Lak. Most equipment has two sockets for Soul Stones, however two-handed weapons have four.\n\n\n[edit] The Abyss\nRappelz sets aside an area where players that have failed to follow the rules will be placed. However, normal players can get there, usually by accident, by attacking an auto-trap. Auto-traps are used to catch bots. If a player attacks an auto-trap for 5 sec. or more, a condition called wrath is placed on them at lv. 9. If a player attacks an auto-trap for 30 sec wrath at lv 11 will be placed upon them and they will be thrown into the abyss. Wrath lowers every stat down drastically; usually 110% less than normal. A player can only leave the abyss by e-mailing Rappelz&amp;#039;s customer service. Auto-traps have since been removed from the game(early epic 3) and replaced with bot catching animals spread through-out the land, these include things like pigs, rabbits, moose and more.\n\n\n[edit] Pet System\nOne of Rappelz&amp;#039;s defining features is its Pet system. Pets are creatures that adventure alongside players, aiding them in battle. They come in many varieties, and can be made to fulfil numerous roles. Additionally, pets have many of the properties of player characters: they gain levels alongside their owners, learn different skills, and can make use of equipment.\n\nPets can be used by all races and classes: the only requirement being two skills, Summon Creature and Creature Control, which are available early in the game. The basic classes (Rogue, Guide and Stepper) and fighter classes have little emphasis on creatures through the availability of creature affecting skills while the others, especially summoner classes (Breeder, Spell Singer and Sorcerer) can affect creatures more greatly.\n\nPets are attained by taming a pet while having the appropriate card for that pet in the player&amp;#039;s inventory. The three most basic pet cards can be bought in any town, while other cards are only found from defeated monsters. Once tamed, pets can be summoned and banished at will by their owners.\n\nUpon reaching a certain level, pets can &quot;evolve&quot; to a different type. A pet evolves twice during its lifetime. Additionally, pets can learn skills at higher levels that allow them to be used as equipment, augmenting their owner&amp;#039;s power. There is also a feature known as &quot;overbreeding&quot; which requires a somewhat longer time to achieve. Overbreeding grants pets more job points and stats than non-overbred pets. Overbreeding begins after a pet can evolve but not allowing the city tamer to evolve it.\n\n\n[edit] Current Pets\nThe Rappelz Reference Guide lists the pets in order of taming chance, using tiers. As of Epic 4, pets from tiers 1 through 3 are considered Basic, and tier 4 pets are considered Rare. Pet cards for pets from tier 1 can be purchased from NPCs, pet cards for tiers 2 through 4 are drop-only items (though sometimes they do appear in the Cash Shop as bonus items on special packages). tier 1, 2 and 3 are all listed as &quot;basic&quot; on their pet cards, however different drop rates and tame rates may put them into different tiers as shown below.\n\nTier 1 (Basic):\n\nPantera: A muscular cat-like creature. It focuses on speed and physical attack, with the ability to stun. \nPoultry: A red chicken-like creature. It focuses on speed and magic, with the ability to stun. \nTortus: A giant tortoise-like creature. It is a tanking based pet with high defense and health. It has a targetable defense buff. \nTier 2 (&quot;Common&quot;):\n\nBlue Pixie: A small fairy that glows blue. It has cleric-like healing abilities and a buff called blessing of spirits when the pixie is at a higher lvl. \nOrc: A goblin-like creature with a club. It is a very popular pet due to its high attack and defense, and also a targetable defense and attack buff. It gets a defense selfbuff at a higher level. \nRed Pixie: A small fairy that glows red. It has nuking abilities. and has low health but extremely high damage \nSiren: A beautiful humanoid female. It has abilities to debuff and trap enemies. \nSkeleton: A skeleton warrior. Famed as a highly evasive pet, it has fast physical attacks, with the ability to stun. May additionally harbor other skills to debuff enemies. \nYeti: A white bear-like creature with a mask. It is also a tanking based pet with high defense and health.it has great stun, freeze and minor debuff abilities. It has a defense selfbuff but the skill is at a very high level. It also has a minor Area of Effect healing skill. \nTier 3 (&quot;Uncommon&quot;):\n\nHawkman: An aracoix with a giant hammer. As of the 10-23-07 patch, skills are same as Yeti. \nSalamander: A red bipedal lizard. As of the 10-23-07 Patch, skill are the same as the Skeleton. \nTier 4 (Rare):\n\nAngel: An angel-like creature with wings. As of the 10-23-07 patch, skills are the same as the blue pixie. \nKentauros: A centaur equipped with a spear. As of the 10-23-07 patch, skills are same as the orc. \nLydian, Ent, White Dragon, Cerberus, Unicorn, Harpy, Astarot, Windy Pixie and the Forest Pixie are new pets planned for the future. The White Dragon and Cerberus are expected to be released in Epic 5, they are said to be their own tier, &quot;epic&quot; which are alot harder to obtain than the rare tier.\n\n\n[edit] Races\nEach of the three races in Rappelz has three classes: a warrior class, a magician class, and a summoner class whose abilities center around their pets.[14] Summoner classes typically have skills to support their pet as well as skills borrowed from both other classes for their respective race. Similar to Ragnarok Online, characters begin as a basic class with limited skills. There are no gender limitations on classes, but each race has its own classes and skill sets. Players are free to adventure anywhere in the game world regardless of race.\n\n\n[edit] Classes and Levels\nRappelz features a variety of classes, most of which can be unlocked through attaining a certain character level and job level. Character levels are attained in the traditional way, by defeating mobs and gaining experience points. Besides experience points, defeating mobs also grants the player job points. Job points are required to obtain and level up the character&amp;#039;s skills, but also to increase their job level. Most skills require a minimum job level to be unlocked.[14]\n\nAs of Epic 4, there are three class categories: starting class, first job class and second job class. After attaining level 10 and job level 10, characters can choose one of the first job specialized classes. At level 50 and job level 40, the second job class can be chosen. For example, the Gaia warrior class, Fighter, can choose between Champion, a melee-oriented battler, or an Archer, who focuses on bow skills. All classes of any race share a single &quot;racial skill&quot; in Epic 4, which grows in power with each class increase. When advancing a character&amp;#039;s job class, the job level is reset.[citation needed]\n\nIt is also possible to &amp;#039;overbreed&amp;#039; your character. This means the character is not advanced to a second job class when it reaches level 50, job level 40. Instead, job points are collected to bring the job level up to level 50 as well, before further specializing. Overbreeding gives a character a small bonus to its statistics. Opinions vary on whether overbreeding is worth the amount of time and job points spent.[citation needed]\n\n\n[edit] Deva\nThe Deva are a light-based race. They also have water- and earth-based skills. They are primarily defense-oriented, focusing on the powers of healing and buffing. Their racial skill is &quot;Minor Healing&quot;, which restores HP to the caster.\n\nGuide - The Guide is the starting class for the Deva. The basic skills Smite and Minor Healing are learned by this class. \nHoly Warrior - Holy Warriors are the game&amp;#039;s primary tank class. They have the highest natural health and defense of the first jobs. They have various skills to force monsters to attack them instead of other party members (most notably the skill Provoke). In addition, they have multiple debuffing abilities, which are continued in the two advanced job versions of this class. \nSoldier - The Soldier focuses on the offensive aspect of Holy Warriors. They get additional damage-dealing skills as well as the only two holy warrior skills of non-light element. \nKnight - The Knight focuses on the defensive aspect of Holy Warriors. Focusing on their prowess with a shield, they have additional skills for provoking enemies and the greatest natural defense in the game. \nCleric - The Cleric is the main healer/buffer of Rappelz. They have powerful healing spells as well as strong player buffs. They also have several attack and debuff spells. \nPriest - Priests expand on the Cleric&amp;#039;s partying ability. They get extensions on all heals level cap, as well as many &quot;mass buffs&quot; that can affect a whole party. However, many of these buffs are considered broken and worthless because they do not stack with standard buffs, and are nowhere near as strong. \nBishop - The Bishop expands on a cleric&amp;#039;s offensive casting ability. They get no new healing spells, and have the max level on some of the Cleric spells raised. They make up for it in several powerful debuffs and disable spells. \nBreeder - The Breeder is Deva&amp;#039;s summoner. Breeders have more defense oriented buffs and focus on raising and healing their creatures; they have limited light based damage skills also. \nSoul Breeder - The second job class of breeders mainly extends their first job skills further. \n\n[edit] Gaia\nThe Gaia are a neutral human race who generally have mix of defensive and offensive skills. Their skills revolve around manipulating the forces of nature. Unlike the Deva and Asura, they do not have a race-specific element, but they have skills utilizing all four &quot;natural&quot; elements (water, earth, wind, and fire). Their racial skill is &quot;Mental Concentration&quot;, which increases their critical attack for a short time.\n\nRogue - The Rogue is the starting class for Gaia. The basic skills Smite and Mental Concentration are learned by this class. \nFighter - The Fighter is the warrior class of the Gaia. Fighters focus on damage skills with two-handed axes, dual-wielded axes, or longbows. \nChampion- The Champion class is the continuation of the melee fighter path. They focus on melee skills. \nArcher - The Archer is the continuation of the longbow fighter path. They focus on various bow damage skills as well as trapping skills. They also have the unique ability to detect hidden enemies (assassins are currently the only character in the game that can hide). \nKahuna - The Kahuna is a melee/caster hybrid class. Their magical attack spells are mostly focused on status effects and often have long re-use times. Their melee damage ability is greater than that of other magicians. They possess a heal-over-time spell as well as several buffs; however, the heal and buff skills are not as powerful as their Cleric counterparts, but are stackable (buffs from Kahunas and Clerics are able to be in effect simultaneously). \nBattle Kahuna - The Battle Kahuna furthers the Kahuna&amp;#039;s melee and damage abilities. They have additional attack skills as well as higher levels of passive attack skills (their base damage is higher). \nDruid - The Druid focuses on the support aspect of the Kahuna class. They have more spells for disabling opponents as well as greater healing ability. \nSpell Singer - The Spell Singer is the Gaia pet class. The Spell Singer focuses on increasing the abilities of both the pet and the player, with the summoner itself becoming considerably formidable at melee upon learning to dual wield one-handed axes. It is the only class in the game which lacks a self healing ability but it can heal its pet. \nEvoker - The Evoker furthers the Spell Singer&amp;#039;s abilities. \n\n[edit] Asura\nThe Asura are the dark-element race of Rappelz. They also possess fire- and wind-based skills. They are primarily an offense-oriented race. They have lower health and defense than the other two races, but they also have greater evasion. Their racial skill is &quot;Deep Evasion&quot;, which increases their evasive ability for a short time.\n\nStepper - The Stepper is the starting class for the Asura. The basic skills Smite and Deep Evasion are learned by this class. \nStrider - The Strider is an assassin-like class that uses high evasion and attack speed, hitting fast but not particularly strong. They can specialize in blades (swords or dirks) or crossbow. \nAssassin - The Assassin specializes in twin dirks or swords, and have a large range of offensive melee skills and stealth skills to hide from their enemies. \nShadow Hunter - The Shadow Hunter is the second job class of Striders which specializes in crossbows. They have many ranged skills and debuffing abilities. \nDark Magician - The Dark Magician uses spells that drain and weaken the enemy. They have many offensive spells and debuffs. \nChaos Magician - The Chaos Magician is the second job class of Dark Magicians which concentrates on high damage spells, but has a low defense against physical attacks. \nWarlock - The Warlock is the second job class which concentrates more on debuffs and curse magic. This makes them more party-orientated because they have less attack power on their own than the Chaos Magician. \nSorcerer - The Sorcerer focuses on offense and absolute control of their pets. Sorcerers can exchange HP with their pets and leech their pets&amp;#039; strength. \nBattle Summoner - The Battle Summoner is an extension of the sorcerer. They have offensive potential in both melee and magic, and more offensive buffs for their pets. \n\n[edit] Geography\nThe world of Rappelz consists of a large island, which is the mainland, and a smaller one, which is called Trainee&amp;#039;s Island. The mainland is divided into several areas, such as Crystal Valley, Lizardman Habitat, Pyre Site and Forgotten Portal. These areas harbour monsters of generally similar levels, with few exceptions, like bosses. There are also dungeons to be found, in which monsters are stronger, and experience and job point rewards are higher.\n\nBy default, any area is &quot;player-kill area&quot;. This means that battle can be held, both between player characters and monsters (mobs), and player characters amongst each other (PK/PvP or dueling). Some small areas exist which are &quot;non-player-kill areas&quot;. These are the towns Katan, Horizon, Laksy and the city Rondo. It is not possible to hold battle within these areas.\n\nEach town holds a number of NPCs with different services. These services include a Weapon Trader, Armour Trader, Teleporter, Lak Trader, Adventure Guide, Job Supporter and Merchant. Every town provides most services, although some services are offered by more than one NPC in Rondo. Some NPCs can be found outside the town areas. These only function as quest NPCs in most cases.\n\n\n[edit] Trainee&amp;#039;s Island\nTrainee&amp;#039;s Island is the starting place of any player character. It is a place set up with NPCs and quests as a means of tutorial, as well as reaching a character level upon which the player&amp;#039;s character becomes viable in the mainland. Once a character reaches level 10, it is possible to visit a Teleporter and transport towards the home town for that character&amp;#039;s race. Once level 15 is reached, the character is unable to teleport back to Trainee&amp;#039;s Island.\n\n\n[edit] Home Towns\nThere are three home towns, one for each race:\n\nHorizon \nHome town for the Gaian race. Horizon is located towards the east of the mainland, amidst grassy plains and a hillside. Horizon is usually more crowded than Laksy or Katan due to it being located relatively close to the two lower-level dungeons Relics of Arid Moonlight and Lost Mines. \nLaksy \nHome town for the Devan race. It is a floating town off the Rappelz map that can be reached by visiting the Laksy Anchor. Laksy Anchor is located in the north of the mainland, it being a small island surrounded by and connected to the mainland by a set of bridges. \nKatan \nHome town for the Asuran race. It is set in a dark and gloomy environment in the south of the mainland, located between a formation of mountains. \n\n[edit] Rondo\nRondo is a large square city that looks like a castle. It is located at a central position in the mainland, allowing for relatively fast access to several of the dungeons and main areas. Rondo is regarded as a home town for those who have reached character level 50.\n\n\n[edit] Hidden Village\nHidden Village is a place that&amp;#039;s not on the Rappelz map. It can only be reached by purchasing a Hidden Village Ticket in the Cash Shop, and visiting a Hidden Village Teleporter in any of the other towns. Hidden Village is a place where items, such as equipment, can be bought with a discount. Some items can only be bought here.\n\n\n[edit] Dungeon System\nDungeons are isolated places reached through portals. The monsters in dungeons are stronger than normal monsters with the same level, but the experience and job point reward for killing one is also higher. There are also items that can only be obtained as a dungeon drop. Dungeons are usually entered as a party, or dungeon party. Dungeon parties consist of a variety of classes, most including a healer/buffer, a tank, and multiple damage dealers. This enables the party to efficiently kill monsters and gain experience fast. Parties in Rappelz may contain up to 8 players. Dungeons are not instanced, meaning players will be able to interact with other characters and parties inside the dungeon. This also allows for kill-stealing (attacking a monster that was first attacked by another character outside their party, with the intent to &amp;#039;steal&amp;#039; it away from them and/or receive a portion of the experience gain), and &amp;#039;training&amp;#039; (pulling a large number of monsters towards another character or party, usually with the intent to have the &amp;#039;train&amp;#039; of monsters attack them instead, often resulting in the &amp;#039;trained&amp;#039; party dying).\n\n\n[edit] Dungeon Raid\nRappelz has a feature in place that allows for guilds to &amp;#039;own&amp;#039; a dungeon. Ownership of a dungeon brings certain advantages, such as a Lak and rupee &amp;#039;tax&amp;#039; for characters using the dungeon.[citation needed] Acquiring ownership of a dungeon requires two steps. First a Dungeon Raid should be performed. Dungeon Raid is also called Time Attack, and consists of killing the two bosses that guard the specific dungeon. For example, for Relics of Arid Moonlight, these bosses are Oforia and Abhuva. During the Dungeon Raid, the dungeon is instanced, meaning no other player characters will be encountered.\n\n\n[edit] Dungeons Siege\nIf the raid succeeds, and manages to kill the bosses in the shortest amount of time compared to Dungeon Raids from others, the guild that performed the raid will move on to attempt a Dungeon Siege. Dungeon Sieges are held once a week on a set time. A Dungeon Siege is a war between a defending guild, the guild currently owning the dungeon, and the attacking guild, the guild who performed the Dungeon Raid. If the siege succeeds, ownership of the dungeon is transferred to the attacking guild. During the Dungeon Siege, the dungeon is instanced, meaning no other player characters will be encountered (with the exception of the opponent parties in the Siege).\n\n\n[edit] Current Dungeons\nThere are currently four different dungeons available:\n\nRelics of Arid Moonlight \nLocation: west of Horizon and south of Rondo. \nRecommended character level: 30 to 50. \nDungeon bosses: Oforia and Abhuva. \nLost Mines \nLocation: north of Horizon and east of Rondo. \nRecommended character level: 50 to 70. \nDungeon bosses: Primal Scream and Taranida. \nCrystal Valley \nLocation: west of Rondo. \nRecommended character level: 70 to 90. \nDungeon bosses: Crustalino and Likirius. \nPalmir Plateau \nLocation: north of Rondo and south of Laksy Anchor. \nRecommended character level: 90 to 110. \nDungeon bosses: Soulseeker and Takin. \nFor each dungeon, two instances exist, for example First Lost Mines and Second Lost Mines. Epic 5 is said to bring a new dungeon for higher-level players.\n\n\n[edit] Guilds\nRappelz features a simple guild system, where any player above level 20 can register a guild at a Guild Official (NPC) in the major towns. Guilds offer players a group to play with. Up to five guilds can also come together to form an alliance. Players cannot player-kill another guild member or alliance member.\n\nA character who has just left a guild cannot join or create a guild within 7 days. Supposedly, this was implemented to avoid guild-hopping.\n\nA guild leader cannot delete the character without first disbanding the guild.\n\nAn alliance owning a dungeon cannot add any other guild to the alliance.\n\n\n[edit] In-game administrators\nThere used to be several different versions of in-game administrators: the Game Masters, the Volunteer Game Guides and the Volunteer Quality Assurance.[citation needed] However, the latter two have been removed, leaving only the Game Masters.\n\nRappelz&amp;#039;s Game Masters are responsible for the day-to-day administration of the game, including tasks such as planning and running of events, bug tracking, testing, solving customer service issues, and answering player queries.\n\nGM&amp;#039;s can be recognized by their [GM] name tag, glowing aura, orange chat text and being able to buff themself with higher buffs than is possible to obtain in the game.\n","torrent":{"xt":"urn:btih:3376c54f5d674e1306c00e8046c082436a4da69c","amp;dn":"Rappelz+epic+4--3d+MMORPG+by+g-potato","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3376c54f5d674e1306c00e8046c082436a4da69c","infoHashBuffer":{"type":"Buffer","data":[51,118,197,79,93,103,78,19,6,192,14,128,70,192,130,67,106,77,166,156]},"announce":[],"urlList":[]}}