{"title":"The Dukes of Hazzard USA XBOX KTM","uid":3243400,"size":955980756,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:33993aa9570e7da8324ee82721a3b593ae4785bf&amp;dn=The+Dukes+of+Hazzard+USA+XBOX+KTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ktm","files":22,"time":1096607845,"description":"Dukes of Hazzard - Return of General Lee\n\nBeskrivning:\n\nSetiin Hazzard County, playersistep into the shoesiof Bo and LukeiDuke as they raceito win prize moneyiin order to saveithe local orphanage fromiBoss Hogg's latest crookedischeme. With the helpiof the ever-popular DaisyiDuke, Uncle Jesse andiCooter, the good ol'iboys go up againstithe villainous Boss Hogg,ihis bumbling cohorts SheriffiRosco P. \n\nColtrane andiDeputy Enos in orderito win the HazzardiCounty Derby. Just likeithe television show, TheiDukes of Hazzard: Returniof the General Leeiis filled with wildioff-road action, gravity-defying stuntsiand adrenaline-pumping car chases.\n\nTheiDukes of Hazzard isian all-American favorite: Fansiyoung and old acrossithe U.S. remember theiTV show with fondness,iwith its fast, memorableicars and down-home characters.i\n\nThe Dukes world, theiway fans want it:iPlayers explore a virtualiHazzard County full ofistunts, races, chases andiadventures all tied togetheriby a new story.i\n\nDukes Celebrity and Music:iFull cast represented fromithe show, with voice-oversiand likenesses from JohniSchneider (Bo Duke), TomiWopat (Luke Duke), CatherineiBach (Daisy Duke), JamesiBest (Roscoe P. Coltrane),iBen Jones (Cooter) andiSonny Shroyer (Enos Strate).iAlso included is WayloniJennings' signature theme song.i\n","torrent":{"xt":"urn:btih:33993aa9570e7da8324ee82721a3b593ae4785bf","amp;dn":"The+Dukes+of+Hazzard+USA+XBOX+KTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33993aa9570e7da8324ee82721a3b593ae4785bf","infoHashBuffer":{"type":"Buffer","data":[51,153,58,169,87,14,125,168,50,78,232,39,33,163,181,147,174,71,133,191]},"announce":[],"urlList":[]}}