{"title":"Thai Movie - Dark Heaven (Sawan Mued) 1958, Eng sub.avi","uid":4272920,"size":986800128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33c80a1354fdce6f79716525de6cd68af26092fc&amp;dn=Thai+Movie+-+Dark+Heaven+%28Sawan+Mued%29+1958%2C+Eng+sub.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rawbear","files":1,"time":1215032596,"description":"Dark Heaven(Sawan Mued)\nThai movie (1958)\nMusical,Comedy, Romance, Drama\n\nLanguage: Thai\nSubtitles: English\n\nDirected by Rattana Pestonji\n(Biography: http://www.bangkokpost.com/160508_Realtime/16May2008_real001.php )\n\nWritten by Suwat Woradilok\n\nFilmed in Ferrania color\n\nDark Heaven was Rattana Pestonji?s first color film. It was produced for Kachara Film company, and shot at Rattana&amp;#039;s own Hanuman Film studios. Written and produced by Suwat Woradilok, the story had previously been made into a television drama.\n\nAt least three of the people involved with the production went to be named Thailand National Artists: The husband-and-wife team of producer-screenwriter Suwat and singer-actress Pensri Poomchoosri, as well as Chalee Intharawijit.\n\nThe film was screened as part of a retrospective to Rattana at the 2005 Pusan International Film Festival. The Thai Film Foundation released the film on DVD, with English subtitles, in 2007.\n(This torrent version is the DVDrip)\n\nStory:\nA poor orphan girl, Nien, is on the run after stealing some food that a wealthy man had purchased to feed some dogs. She takes refuge with a singing garbage collector named Choo, who hides Nien in his garbage cart while the wealthy man and a policeman search for the girl.\n\nChoo then takes Nien back to his humble shack and gives her shelter. The pair fall in love, but their romance is cut short when he is drafted into the army and sent off to war. For a time, Nien takes over Choo&amp;#039;s job as garbage collector, until she is adopted by a wealthy woman, who treats Nien as the daughter she never had.\n\nChoo comes back from the war, blinded by an explosion, Nien, while experiencing unimagined luxuries, is tortured by the conflict between her newfound wealthy lifestyle and her simple life with Choo.\n\n\n\n\n","torrent":{"xt":"urn:btih:33c80a1354fdce6f79716525de6cd68af26092fc","amp;dn":"Thai+Movie+-+Dark+Heaven+%28Sawan+Mued%29+1958%2C+Eng+sub.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c80a1354fdce6f79716525de6cd68af26092fc","infoHashBuffer":{"type":"Buffer","data":[51,200,10,19,84,253,206,111,121,113,101,37,222,108,214,138,242,96,146,252]},"announce":[],"urlList":[]}}