{"title":"National Geographic Fighting Science","uid":4151075,"size":734062592,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:35d1716885db72d64d83b0f8ddacfd01f9f112ed&amp;dn=National+Geographic+Fighting+Science&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tanauser","files":1,"time":1208946924,"description":"They can crush a stack of concrete slabs with a bare fist, walk with catlike balance on a bamboo pole, and generate deadly kicks and punches at lightning-fast speeds.\n\nReal-life martial artists have long defied what many people would think is humanly possible, and their seemingly superpowered abilities have inspired generations of movies and television shows.\n\nBut where do the true skills end and the special effects begin? Maybe Hollywood magic doesn&amp;#039;t enter the equation as soon as you think.\n\nFor the upcoming television special, Fight Science, researchers used high-tech equipment to put real martial artists to the test. The feature will air on August 20 on the National Geographic Channel.\n\n(National Geographic News is a division of the National Geographic Society, which is part owner of the National Geographic Channel.)\n\nThe action took place inside a specially designed film studio that is part laboratory and part dojo, a school for training in the various arts of self-defense.\n\nHere world champion martial artists from diverse disciplines were pitted against a customized crash-test dummy outfitted with impact sensors.\n\nThe sensors?along with infrared, high-speed, and high-definition motion-capture cameras?allowed scientists to measure and map the speed, force, range, and impact of the fighter&amp;#039;s techniques.\n\nThe result is an unprecedented look at how martial artists generate the power and speed behind each move. ","torrent":{"xt":"urn:btih:35d1716885db72d64d83b0f8ddacfd01f9f112ed","amp;dn":"National+Geographic+Fighting+Science","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35d1716885db72d64d83b0f8ddacfd01f9f112ed","infoHashBuffer":{"type":"Buffer","data":[53,209,113,104,133,219,114,214,77,131,176,248,221,172,253,1,249,241,18,237]},"announce":[],"urlList":[]}}