{"title":"Funny.Games.DVDRip-LGLuX.mp4","uid":4099229,"size":734843218,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3686e572259e5132e4cad07bc20f97fac148f576&amp;dn=Funny.Games.DVDRip-LGLuX.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LGLuX","files":1,"time":1206485773,"description":"Title:        Funny Games\nYear:         1997\nDirector:     Michael Haneke\nStarring:     Ulrich Muehe, Susanne Lothar\nLanguage:     German (V.O)\nCodec:        H.264\nFormat:       MP4\nIMDB:        &lt;a href=&quot; http://imdb.com/title/tt0119167/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imdb.com/title/tt0119167/&lt;/a&gt;\n\n\n\n***This one sadly has NO SUBS , its really German only , but subs can be found online on the usual sources. Then i dont want any &quot;not the original&quot; because this is the only original Funny Games , the new one in english is a remake from the same director. I just tought this movie has to be shown before the Americans censor it in their version.Now follows the taditional IMDB Review******\n\n\n\n\nOkay... I just read most of the 144 user reviews.... Basically I wanted to make up my mind about this film, a film that is a very heavy load.\n\nI&amp;#039;ve seen this movie 5 years ago, the good thing is most of the time you forget about (having seen) it but now and then you recall it. I can understand that many people hate this film, it is not nice to watch, the more when you see it in a theatre where the only chance to break its spell is leaving the theatre. Regardless if you leave or stay and watch it leave it beats you one way or the other. I fully agree with many other reviewers that I have no idea whom I should recommend it too. I am tempted to watch it a second time but didn&amp;#039;t make it happen in 5 years.\n\nDon&amp;#039;t get me wrong. I think it is an excellent movie. It is also very disturbing and upsetting, I can&amp;#039;t think of the right mood to watch it cause it&amp;#039;ll take you down. And I think here is where the movie polarises. If, after watching, you find yourself deducting some message in the violence, and perhaps rethink violence - in both real life and movies - you will, well, also will have found some reason for this movies existence, if not - and it might be better if one does not - you will join in the &amp;#039;crappiest movie ever chorus&amp;#039;.\n\nI do however want to point out some achievement of this production:\n\n*) The movie catches the audience in theatre. *) It does shock the audience but most of the violence is off-screen. You see more people dying in many fast-driven action movies. Only here you care. There is minor suspense, but I, personally, wouldn&amp;#039;t put it into that category. (But then I am no horror/shocker/suspense fan and can easily err here) *) It&amp;#039;s hard to compare it with any other movie (that I have seen). I am not sure if this is an achievement, but it&amp;#039;s outstanding.\n\nThe reason I think Haneke made this movie. or, what I deducted from it is how far away violence and death are in our everyday lives today. While Hollywood - and other film productions serve them daily right in our living room, we hardly notice them anymore. Violence also sells movies, and we&amp;#039;re meanwhile pretty used to that. Haneke also serves violence, and he dishes it next-door. He turns into a moral figure that asks the audience if they want more (after all me and you consume it every day) - and while HERE we want to say &amp;#039;no please stop&amp;#039; he doesn&amp;#039;t do our silent bidding. He pushes us down the drain, forcing us to deal with aspects of the violence we don&amp;#039;t (want to) see. He even goes one step further. He offers us a &amp;#039;good&amp;#039; ending, a payback that would make it easier for us to bear the movie, only to snatch it back and rip us of any cheerful emotion, telling us like &amp;#039;no, sorry, here it doesn&amp;#039;t work that way&amp;#039;.\n\nI also read reviews mentioning the unsatisfying (often used, cliche) end. One more time Haneke manages to disappoint us, so far we were driven and didn&amp;#039;t know what would happen, what to expect.\n\nOnly in the ending, we see it coming, and so it ends, obviously similar to many other movies. We&amp;#039;re back standard movie stuff, the arc bent and the connection made.\n\n&quot;Funny games&quot; is everything else but the title. Perhaps it refers to the funny games built on standard film violence in everyday movies. Perhaps it doesn&amp;#039;t. Perhaps Haneke wants to stress that violence is a bad thing. Perhaps he&amp;#039;s just sick.\n\nOne thing for sure, regardless if you like it, don&amp;#039;t care, or hate it. You might have seen something somewhat like it, but nothing similar.\n\nIf you hate shockers, don&amp;#039;t watch it. It will only be torture. If you love suspense, sorry, only very little gore here.\n\nIf you plan to watch it, calculate a few hours before you will manage to put your head to rest.\n\nAnd don&amp;#039;t watch it it personal crisis.\n\nThis movie will make you feel bad. If you watch it in a cinema, just look around. You&amp;#039;re not alone with this feeling.\n\n\n\n\nEnjoy\n\n\nLGLuX","torrent":{"xt":"urn:btih:3686e572259e5132e4cad07bc20f97fac148f576","amp;dn":"Funny.Games.DVDRip-LGLuX.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3686e572259e5132e4cad07bc20f97fac148f576","infoHashBuffer":{"type":"Buffer","data":[54,134,229,114,37,158,81,50,228,202,208,123,194,15,151,250,193,72,245,118]},"announce":[],"urlList":[]}}