{"title":"Isosceles - Face The Music","uid":4160681,"size":62870463,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:370f69f47311868efac382f992263c357335a5f8&amp;dn=Isosceles+-+Face+The+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"orbz","files":1,"time":1209359312,"description":"A 1990s release from Canadian prairie hip hop trio Isosceles, two of whom are twin brothers.\n\n01 - isosceles - i once knew you.mp3\n02 - isosceles - clean slate.mp3\n03 - isosceles feat. moka only - all i got.mp3\n04 - isosceles - hate to see you go.mp3\n05 - isosceles - the goalend rules.mp3\n06 - isosceles - open wounds.mp3\n07 - isosceles - boremeta the felt.mp3\n08 - isosceles - jail break (growing pain of freedom).mp3\n09 - isosceles - $pare change.mp3\n10 - isosceles feat. ancient - bio organic youth.mp3\n11 - isosceles - the telepathic triplet.mp3\n12 - isosceles - livin on rekord.mp3\n13 - isosceles - dream big.mp3\n14 - isosceles - the free trunk.mp3\n15 - isosceles - on a whim.mp3\n16 - isosceles feat. intellect - finder\\&amp;#039;s keeper.mp3\n17 - isosceles - the voice in my silence .mp3\n\nIsosceles, (i-sos\\&amp;#039;e-leez):\n\na. Describes a triangle having two equal angles and one unmatched angle.\n\nn. A Canadian hip hop crew featuring twin brothers\n    Shrmpy and Sasafras as well as the telepathic triplet known as Boya D. \n\nA Brief Introduction:\n\n     In 1995, twin brothers, and pioneering Saskatchewan hip hop staples, Sasafras and Shrmp leave their homes on the prairies, and arrive at Beat Factory Studios (Toronto) to record their first project, an E.P. under the name MirrorImage, with production handled by DJ Luv (PKA: L.A. Luv).   With skills beyond their years, the E.P. manages to cause a buzz amongst the \\&quot;in-the-know\\&quot; underground hip hop community, despite it never being officially released!   Soon after, the twins pack their bags and switch to the \\&quot;left coast\\&quot;, to spend some time exploring the musical underworlds of Los Angeles, Seattle, and Vancouver, B.C.   While in Vancouver, they discover a compilation tape (Q-Continuum) which features a track (\\&quot;The Only One\\&quot;) from an MC known as Boya D.   Boya, a long-time veteran of the Vancouver hip hop scene, had been laying low for several years, seeking for \\&quot;like-minded\\&quot; artists to collaborate with.    In 1995, he meets the twins (now operating as \\&quot;Hokus Pokus\\&quot;) at a freestyle barbecue, and together they discuss their shared visions of hip hop.  \n\n     In 1996, Sasafras, Shrmp and Boya meet again, and collaborate on a recording of instrumentals.   Then, in the summer of 1997, with the twins back in Vancouver once again, \\&quot;Isosceles\\&quot; is officially formed, and the first E.P (self-titled) is recorded and released to the underground.   Finally, in April 1998, Boya leaves his humble abode in Vancouver, and moves to Saskatoon, where in October of 1998, the first full-length Isosceles release, \\&quot;Face the Music\\&quot; is completed and released.  Recorded entirely on in-expensive home recording gear, the CD still manages to reach hip hop fans around the world, generating a significant buzz and establishing Isosceles as an innovative new star on the horizon.    Their intelligent, thought-provoking lyrics,  original, jazz based beats and \\&quot;ill\\&quot; turntablism fuse together and relate to the listener first hand, forming a fresh approach to rap music which is interactively intelligent,  cool, conscious and fun.  The album quickly begins to earn Isosceles recognition and they are soon warming stages for acts such as Xzibit, Defari, thePharcyde, Del the funkee homosapien, Kardinal Offishall, Herbaliser, Dalai Lamas, Mystik Journeymen, Eligh, and others.... as well as headlining shows wherever people are looking for a unique experience with sound.\n\n \n\nbio by: C.Rashon","torrent":{"xt":"urn:btih:370f69f47311868efac382f992263c357335a5f8","amp;dn":"Isosceles+-+Face+The+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370f69f47311868efac382f992263c357335a5f8","infoHashBuffer":{"type":"Buffer","data":[55,15,105,244,115,17,134,142,250,195,130,249,146,38,60,53,115,53,165,248]},"announce":[],"urlList":[]}}