{"title":"Final Fantasy VII","uid":4264471,"size":1094479872,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:371c59a7839229c5a3a850e40c7ca5d901c62ab6&amp;dn=Final+Fantasy+VII&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bitrisky","files":1,"time":1214620359,"description":"I trust that you all know the game so here are some things that you must read.\n\n- Just for a start, This is the PC version, and you don&amp;#039;t need to be online while running the game.\n\n- for those who ask for the difference between ultima and original: I don&amp;#039;t really know. all i know is that this one looks the same as the one in playstation and it is full (with sounds and cut scenes)\n\n\nRecovery Record (3%) is included in case you need to repair a corrupt download Smile\n\nHere are some tips for running the game:\n\nThis game is XP/Vista ready so just download, extract, install, and play (please don&amp;#039;t install the xp patch that i included as you don&amp;#039;t need it)\n\n\nOfficial Patch:\n\nI included an official patch but most people don&amp;#039;t have to use it. If you have problem with the game (some minor glitches), you can try installing the official patch. Note that you will have to mount the Fake ISO using a virtual cd program to get the game to work after applying the official patch or you will get &quot;insert disk error&quot;. The fake ISO is in the goodies folder in the installation directory.\n\nKeyboard Patch:\n\nIf you are playing in a labtop, you will probably need to apply the keyboard patch which you can find in the install folder under goodiees, official patches. just put the small file in the main directory of the game. (check the old post in the bin for more info or ask).Here is how:\n\ngo to the installation folder (usually, C:program files FFVII ) and check the folder goodies. There you should find a rar file named &quot;official patches&quot; extract it. inside it, there is a rar file named &quot;keyboard patch&quot; extract it. and copy the extracted file to the installation directory (same directory besides exe of the game).\n\nIf you get a black screen (no movies) or crash at startup:\n\nNew Info: Thanks to beercan\n\nQuote:\nFor those who are having the issue of the game crashing upon startup, and displaying the &quot;FF7 has encountered an error&quot; message, try this:\n\nIf you have uninstalled the Klite codec pack, reinstall it. (Uninstalling it will not have removed the ffdshow option so windows is remembering the ffdshow option is turned on.)\n\nAs it finalises install, you get the option to configure the ffdshow video.\nChoose directshow on the left and there is a drop-down option called &quot;multiple ffdshow instances&quot;. Choose &quot;none (disabled)&quot;. Apply and ok, and the install will complete. The game will now work.\n\n\nsame thing thanks to nhi306 for this info:\n\nQuote:\nNo need to uninstall k-lite at all. This worked for me. I just went to k-lite&amp;#039;s configuration and clicked on the ffdshow video decorder and under the directshow tab look for multiple ffdshow instances and just disabled it\n\n\nTrue motion codec if you need it\n\nCode: &lt;a href=&quot;\nhttp://codec.alshow.co.kr/Page/en/true.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://codec.alshow.co.kr/Page/en/true.htm&lt;/a&gt;\n\n\nYuffie fight problem\n\nThanks to draco dragon, we may have a solution to the Yuffie problem. To solve it, just copy the original ff7.exe and the graphic file exe from the goodies folder to the installation directory and mount the fake iso. It should work.\n\nI need confermation from people that are having this problem, thx\n\nBattle is too fast\n\nif the speed in the battles is unusual try turning the &quot;frame skip&quot; in the setting off. Let me know if it works\n\nWant some tweeking and extra patches and stuff\n\nYou can check out the goodies folder in the installation directory. Also, you can check out this website:\n\nCode: &lt;a href=&quot;\nhttp://wiki.qhimm.com/FF7/Technical/Customising&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiki.qhimm.com/FF7/Technical/Customising&lt;/a&gt;\n\n\nPlease say thanks if you download and go and buy the game. they deserve it Smile","torrent":{"xt":"urn:btih:371c59a7839229c5a3a850e40c7ca5d901c62ab6","amp;dn":"Final+Fantasy+VII","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"371c59a7839229c5a3a850e40c7ca5d901c62ab6","infoHashBuffer":{"type":"Buffer","data":[55,28,89,167,131,146,41,197,163,168,80,228,12,124,165,217,1,198,42,182]},"announce":[],"urlList":[]}}