{"title":"The Lord of the Rings (Score Edition) - Part 1 of 6","uid":4257735,"size":4598759449,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3790a885b54f5b561a40bf15b51370f1b6aa6858&amp;dn=The+Lord+of+the+Rings+%28Score+Edition%29+-+Part+1+of+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Wonsaponatime","files":12,"time":1214324788,"description":"I love the music for the Lord of the Rings, but when I listen to the music, I often remember that it was written for specific imagery, and I do believe the music is married to those images, so I wanted to be able to enjoy both at once. But the Special Extended Edition DVDs don&amp;#039;t allow you to choose an audio track where you can listen to the score only. So that&amp;#039;s where I felt I could do something...\n\nLet me set one thing straight beforehand: this DVD is for everyone who loves the music of the Lord of the Rings. It&amp;#039;s not be sold, but only to be shared freely. It&amp;#039;s a project by a passionate fan for other fans, and not at all for the financial benefit of anyone!\n\nWhat I did was this: \n\nI took the SEE DVD of each movie and ripped the data stream to my harddrive, seperating audio and video stream. I was only going to work on the audio, the video would remain untouched apart from reducing the size of the stream so that the content would fit on a standard DVD. I don&amp;#039;t think any loss in picture quality is visible.\n\nWhat I wanted to create was a version of the film that highlights the score. Thankfully we have the &quot;Complete Recordings&quot; of all three movies on CD by now. So basically I ripped the audio file of a whole DVD into a wave file, synchronized all the relevant tracks from the &quot;Complete Recordings&quot; with that huge file, and then cut out large sections of the original movie audio and did crossfades, so that any movie audio, which included score (4/5 of the movie!), would be replaced by the pure score recordings, meaning all sound effects, dialogue etc would not be heard. The music would come to the fore and would not be obstructed by anything else. For those sections that didn&amp;#039;t have any score underneath, I simply used the movie audio, as silence during a fifth of the palying time would have been dull.\n\nThat&amp;#039;s what I did for the whole bloody thing. There&amp;#039;ll be 6 DVDs, this is the seed of the first.\nThese DVDs are in NTSC, as I took the NTSC SEE DVDs as the source. Why not PAL? Because the images are sped up in the PAL editions, so that you cannot synchronize the &quot;Complete Recordings&quot; with it! Yes, the PAL versions of the movie basically play too fast, and quite a bit too fast! But that&amp;#039;s not a LOTR-specific problem. \n\nSmall sidenote: working on this I noticed that the sound guys sometimes had a bit of fun with the recordings they were given. There are bits where they stretch notes to hold over a particular image, or they loop a bit of music so that it plays longer. I guess this was done because the movie was still being re-edited when the music was already finished. I tried my best to recreate what they did using the undoctored recordings, which were all I had. The only spot where it didn&amp;#039;t work is Bilbo&amp;#039;s narration about the Shire at the beginning, where I &quot;flow in&quot; the original movie audio (and a bit of narration) to close the gap where the sound guys had stretched the music.\n\nThis project involved a lot of time and work (and still does, as the final 3 DVDs are not finished yet), and any feedback would be appreciated. I tried my best to do halfway decent menus etc with DVD-lab PRO, but I&amp;#039;m not a professional at DVD authoring, so please don&amp;#039;t judge too hard. I scrapped the chapter division of the original DVD and used my own concept, which has bigger chapters and is connected to the musical structure.\n\nThere are also subtitles (and their translations) for the sung passages in Elvish etc. I did my best with that, but there may be mistakes. Shore often only took bits and pieces, sometimes just syllables, not whole words from the texts he worked with, so chants like those of the Ringwraiths were a bit tricky. Consider it a bonus.\n\nPraise to the Lord of the Score, the incredible Howard Shore!\n\n- Michael\n\nPS: it&amp;#039;ll probably take a while until the first people have the full thing, since my upload ratio is 40kb maximum. But I think the wait is worth it for those who are obsessed as much by this wonderful music as I am. Once other people have the full thing and keep seeding (please do!), then the download should go a lot faster.\n","torrent":{"xt":"urn:btih:3790a885b54f5b561a40bf15b51370f1b6aa6858","amp;dn":"The+Lord+of+the+Rings+%28Score+Edition%29+-+Part+1+of+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3790a885b54f5b561a40bf15b51370f1b6aa6858","infoHashBuffer":{"type":"Buffer","data":[55,144,168,133,181,79,91,86,26,64,191,21,181,19,112,241,182,170,104,88]},"announce":[],"urlList":[]}}