{"title":"HOUSE OF WAX - VINCENT PRICE (1953)","uid":4266916,"size":731110121,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:37b2ce43991249f64f31b0263056d8af5dfe5f62&amp;dn=HOUSE+OF+WAX+-+VINCENT+PRICE+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yogirajj","files":4,"time":1214698139,"description":"House of Wax brought Vincent Price into the horror genre, where he fit as snugly as a scalpel in a mad scientist?s hand. A remake of the 1933 film Mystery of the Wax Museum, this entertaining Gothic shocker casts Price as a sculptor of wax figures; his unwilling victims?er, ?models??lend their bodies to his lifelike depictions of Marie Antoinette and Joan of Arc. The film was one of the top 10 moneymakers of its year, thanks in part to the 3-D gimmick, which explains why so many things are aimed at the camera (why else would the paddleball man be there?). Footnote to history: director Andre De Toth was blind in one eye, and thus could not see in three dimensions. Not at all a musty relic of the early-sound era, the original Mystery of the Wax Museum (shot in a soft, trial version of Technicolor) is saucy, pre-Code fun. As corpses disappear from the morgue, Lionel Atwill?s wax museum adds to its displays. Coincidence, or the work of the hideously deformed fiend stalking the Manhattan night? Most of the snappy dialogue comes courtesy of reporter Glenda Farrell, a vintage wisecracking dame.","torrent":{"xt":"urn:btih:37b2ce43991249f64f31b0263056d8af5dfe5f62","amp;dn":"HOUSE+OF+WAX+-+VINCENT+PRICE+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37b2ce43991249f64f31b0263056d8af5dfe5f62","infoHashBuffer":{"type":"Buffer","data":[55,178,206,67,153,18,73,246,79,49,176,38,48,86,216,175,93,254,95,98]},"announce":[],"urlList":[]}}