{"title":"NERO WOLFE (pilot) The Golden Spiders [retr?tv]","uid":4061494,"size":733837967,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:380899e071e165216bd9c4df872ab0687d01d0f9&amp;dn=NERO+WOLFE+%28pilot%29+The+Golden+Spiders+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flixer","files":2,"time":1204628970,"description":"A  NERO WOLFE MYSTERY (2001)\nNero Wolfe was a show based on the mystery books and novellas by Rex Stout. It starred Maury Chaykin as a private investigator in 50&amp;#039;s New York City. The brilliant but lazy Wolfe is the genius who solves all the cases, but he uses his assistant Archie Goodwin (Timothy Hutton) to find clues and do all the &quot;dirty work.&quot; The show also stars Colin Fox as Wolfe&amp;#039;s personal cook, Fritz, Bill Smitrovich as Inspector Cramer, and Saul Rubinek as Archie&amp;#039;s friend Saul Panzer who also helps out in many cases. The show also used the interesting stunt of employing the same actors to play different parts in each episode. This was used to give the illusion of the show being like a traveling theatre company. Recurring stars include Robert Bockstael, Kari Matchett, David Schurmann, and many more.\n\n\nPilot. The Golden Spiders   3/5/2000\nNero Wolfe is consulted by a boy, a street kid named Peter Drossos, who makes a profession out of wiping the windshields of parked cars with a rag. While wiping one car in particular, he sees a woman wearing golden spider earrings mouth &quot;Help, get a cop&quot; to him. The car takes off. The next day, Pete is killed by an automobile, as is a man named Matthew Birch. The car is discovered, but there is still much confusion. Soon, Wolfe is visited by a woman wearing golden spider earrings- who is later run down.\n\nWriter: Paul Monash\nDirector: Bill Duke\nGuest star: Harant Alianak, Robert Bockstael (Paul Kuffner), Nicky Gaudagni (Angela Wright), R.D. Reid (Sergeant Purley Stebbins), Beau Starr (Lips Egan) , Trent McMullen (Orrie Cather), Elizabeth Brown (Mrs. Horan), Gary Reineke (Denis Horan), Larissa Laskin (Jean Estey), Harant Alianak (Gerstner), Philip Craig (James Maddox), Gerry Quigley (Lon Cohen), Robert Clark (III) (Pete Drossos), Mimi Kuzyk (Laura Fromm), Fulvio Cecere (Fred Durkin), Peter Mensah (Mort Erwin), Nancy Beatty (Mrs. Drossos)\n\n========================\nNero Wolfe 000 The Golden Spiders.avi\nFilesize......: 699Mb\nRuntime.......: 01:33:07\nVideo Codec...: XviD\nVideo Bitrate.: 910Kbps\nFrame Size....: 624x480\nFrame Rate....: 23.97fps\nAudio Codec...: mp3\nAudio Bitrate.: 51Mbps\nAudio Freq....: 48KHz\nAudio Channels: Stereo \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0283205/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0283205/&lt;/a&gt;\n\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:380899e071e165216bd9c4df872ab0687d01d0f9","amp;dn":"NERO+WOLFE+%28pilot%29+The+Golden+Spiders+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"380899e071e165216bd9c4df872ab0687d01d0f9","infoHashBuffer":{"type":"Buffer","data":[56,8,153,224,113,225,101,33,107,217,196,223,135,42,176,104,125,1,208,249]},"announce":[],"urlList":[]}}