{"title":"Extralabs Feed Editor 4.78 (The Joker)","uid":4100024,"size":2377926,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3821484a706e32b959f7c4eb2be571f575d00e43&amp;dn=Extralabs+Feed+Editor+4.78+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":4,"time":1206490952,"description":" Want to create professional RSS feeds without the complication of RSS technology? Then Feed Editor is the perfect solution for you!\nBy using this software, it is not necessary to be a computer science guru with in-depth knowledge of internet technologies. Instead, our RSS Editor makes work with RSS feeds incredibly simple. Just input the relevant RSS feed and the rest of the work is finished by Feed Editor.\n \nAn easy-to-use and convenient interface makes for fast and effortless processing of RSS feeds. Wizard-driven user guidance prevents mistakes during RSS feed creation. This all results in easy and problem free operation, with all intricate work performed by Feed Editor.\n\n eed Editor has a range of efficient and advanced capabilities:\n\n    * Operation with a variety of RSS formats\n    * Text import from CSV and HTML files\n    * Assistance with HTML editing via WYSIWYG editor\n    * Editing of XML and pictures\n    * View and publish function for RSS feeds\n    * Export capability of RSS to HTML, CSV and JavaScript\n\nFeed Editor makes life easy for those dealing with RSS feeds! It not only creates RSS feeds but can also upload them via FTP. Operation with popular podcasting tools is also supported by Feed Editor. The uploading of podcasts is as simple as their creation.\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:3821484a706e32b959f7c4eb2be571f575d00e43","amp;dn":"Extralabs+Feed+Editor+4.78+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3821484a706e32b959f7c4eb2be571f575d00e43","infoHashBuffer":{"type":"Buffer","data":[56,33,72,74,112,110,50,185,89,247,196,235,43,229,113,245,117,208,14,67]},"announce":[],"urlList":[]}}