{"title":"VmwAROSlive08.7z","uid":4258221,"size":172178120,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:3a6faff94ffd07de0d0e5c7b6da48a9aa510ffb5&amp;dn=VmwAROSlive08.7z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"keenears","files":1,"time":1214340459,"description":"WmvAROS Live! beta 0.8\n\nWhat AROS is?\n\nThe AROS Research Operating System is a lightweight, efficient and flexible desktop operating system, designed to help you make the most of your computer. It&amp;#039;s an independent, portable and free project, aiming at being compatible with AmigaOS 3.1 at the API level (like Wine, unlike UAE), while improving on it in many areas. The source code is available under an open source license, which allows anyone to freely improve upon it.\n\n[read more at http://aros.sourceforge.net/]\n\nMore words: Remember your old Amiga? ;)\n\n\nThen...\n\n\nVmwAROS is the AROS environment already installed and configured in a virtual machine. Compatible with any recent VMware product for Windows, Linux and Macintosh.\n\nThis is a LiveCD - VmwAROS Live! which can run on any PC hardware without virtualisation. It can be installed on the hard drive too. Hardware must be compatible with the AROS operating system.\n[read more at http://vmwaros.org/]\n\nRequirements: an x86-based computer with 500 MHz CPU; 196 MB system RAM; any PCI or AGP video card; 12x CD-ROM drive; 1 GB to 6 GB of free space on a EIDE hard drive (SATA support is very limited); PS/2 mouse and keyboards recommended; USB mice might not be completely supported; Recommended: an AROS compatible network and audio card. Please read the quick guide for references before installing.\n\n\n===\nNew in version 0.8:\n[http://vmwaros.blogspot.com/2008/06/new-vmwaros-beta-08-released.html]\n    \n      \n   * Fixed the boot issue on Vmwaros Live! with some PC chipsets by adding the\nextra stable kernel option on boot (emergency mode kernel and options).\n\nEmergency Mode is not a &quot;Windows-safe-mode&quot;-like option, but a way to force AROS booting on some old machines which aren&amp;#039;t compatible anymore with the current AROS ata.device. Users who got booting problems with VmwAROS 0.7 and 0.7.1 should always use this option: in emergency mode, VmwAROS behaves exactly as in normal mode, no other functions than the partial SATA support are disabled.\n\n* added complete development environment with C, C++ and E (PortablE)\n* updated Murks! IDE to version 0.6.0\n* Murks! can run from CD (but it&amp;#039;s not completely safe)\n* added checks for proper assign and development paths (LIVE! only)\n* Murks! and development tools can be installed either in Sys: or Work: (LIVE! only)\n* added filesystem and futilities menu to AmiStart\n* moved SimpleMail directly in the /Utilities directory\n* added lots of new games\n* added lots of new utilities\n* added some sound and video commands (madahi, play, playnosound, aramp and so on) (sound working only on LIVE! version with AROS supported audio cards).\n* enhanced graphic theme\n* added PlayStation emulator FPSE\n* added some new fonts\n* VmwAROS now launches Opaque commodity at startup\n* custom muimaster.library updated to June 15th sources\n* system files updated to may 23rd nigthly build, some files are newer\n* updated Quick and dirty guide in PDF\n\n===\n\nVmwAROS LIVE! has all the features above, and more:\n\n    * VmwAROS boots directly from CD\n    * VmwAROS software can be installed either on SYS:Extras or Work:Extras\n    * Network already running from CD under VMware and Qemu\n\nSo what you&amp;#039;re waiting for? Just download the new version and start enjoying it. And if you like it, please consider donating, it will surely help Paolo to continue improving his (hard!) work.\n\n7-zip archiver (7-zip.org) and 66+ MB RAM is required to unpack the archive.\n\n==\nThanks to the Paolo Besser, the creator of this distro and all the warm AROS community and developers out there! See ya soon.\t","torrent":{"xt":"urn:btih:3a6faff94ffd07de0d0e5c7b6da48a9aa510ffb5","amp;dn":"VmwAROSlive08.7z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a6faff94ffd07de0d0e5c7b6da48a9aa510ffb5","infoHashBuffer":{"type":"Buffer","data":[58,111,175,249,79,253,7,222,13,14,92,123,109,164,138,154,165,16,255,181]},"announce":[],"urlList":[]}}