{"title":"MEN IN BLACK (Hombres de negro)","uid":4027476,"size":8012648448,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3acc967f84affeb6985455b68669f77abb6d94ab&amp;dn=MEN+IN+BLACK+%28Hombres+de+negro%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perfilator","files":103,"time":1202998286,"description":"The MIB, a top-secret agency that polices, monitors and directs alien activity on Earth, has established the Earth as an apolitical \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;neutral zone\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;. MIB agents have no identity or any public record of existence, and the MIB agency answers to no government. The funding for their agency comes from the patents they own on technology confiscated from aliens, such as velcro, microwave ovens, and liposuction. Any memory of MIB activity upon \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;mustering out\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot; of the MIB is erased and a new identity is created for the departing agent. Into this strange world is ushered the initially skeptical James Edwards (Will Smith), an NYPD officer, as he becomes Agent J, one of the newest MIB personnel. Tommy Lee Jones plays K, a senior MIB agent who recruits and guides J as he learns the ropes.\n\nMIB agents wear sunglasses and dark suits, and appear at UFO landing sites, similar to paranormal reports of real-world Men in Black. Instead of intimidating or threatening witnesses, the MIB use devices known as Neuralizers to wipe their memories and suggest more mundane causes to the encounter (to the amazement of Agent J, such explanations are uniformly and horribly bland). Neuralizers are typically the size and shape of an oversized pen (although a giant version is seen in the second movie, hidden in the Statue of Liberty\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s torch), and can be set to erase memories as far back as several decades. Neuralizers are also used on agents who leave the organization for any reason. The MIB\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s sunglasses protect them from the effects of the Neuralizer.\n\nThe main conflict of the film is as follows: A Bug (member of an alien species that similar in many ways to a very large cockroach) is trying to steal a tiny galaxy, which is later revealed to be secretly contained in an ornament hanging from the neck of Orion, a cat who belongs to a member of the royal family of another planet. The government of this planet, Arquil, is willing to have the Earth destroyed rather than let this galaxy fall into the hands of the Bugs. During their mission, the agents investigate a morgue where they meet Dr. Laurel Weaver (Linda Fiorentino), a cynical deputy medical examiner. Eventually, the Galaxy is recovered, the Bug is exterminated, and K asks J to erase his memory so that he can retire. Dr. Weaver then becomes J\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s new partner, L.\n\nIn the final scene of the film, the camera pulls back into the sky and continues to pull-back through space past our solar system, past millions of stars, ultimately revealing that our galaxy is contained within a circular container resembling a marble. The container is then picked up by an alien hand which throws it, hitting another \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;marble\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039; which also contains a galaxy. Both marbles are then picked up by the hand and placed into a bag full of galaxy-containing marbles.","torrent":{"xt":"urn:btih:3acc967f84affeb6985455b68669f77abb6d94ab","amp;dn":"MEN+IN+BLACK+%28Hombres+de+negro%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3acc967f84affeb6985455b68669f77abb6d94ab","infoHashBuffer":{"type":"Buffer","data":[58,204,150,127,132,175,254,182,152,84,85,182,134,105,247,122,187,109,148,171]},"announce":[],"urlList":[]}}