{"title":"Bill O'Reilly - Culture Warrior (2006) 48kps .MP3s","uid":4103489,"size":130427287,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b9d5624cc8731d89c02566f1c437e31d9c4226b&amp;dn=Bill+O%5C%27Reilly+-+Culture+Warrior+%282006%29+48kps+.MP3s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Diaperzone","files":86,"time":1206692164,"description":"\nBill O&amp;#039;Reilly: Culture Warrior\n\n(Unabridged, read by the author.)\n48kps .MP3 Audiobook, 2006\nCDs 1-5,  Run time 6:01:43\n\n\nSynopsis:\n\nWith three straight #1 bestsellers and more than 4 million copies of his books in print, the most powerful traditional force in the American media now takes off his gloves in the ongoing struggle for America&amp;#039;s heart and soul.\n\nBill O&amp;#039;Reilly is the very embodiment of the idea of a Culture Warrior-and in this book he lives up to the title brilliantly, with all the brashness and forthrightness at his command. He sees that America is in the midst of a fierce culture war between those who embrace traditional values and those who want to change America into a &quot;secular-progressive&quot; country. This is a conflict that differs in many ways from the usual liberal/conservative divide, but it is no less heated, and the stakes are even higher.\n\nIn Culture Warrior, Bill O&amp;#039;Reilly defines this war and analyzes the competing philosophies of the traditionalist and secular-progressive camps. He examines why the nation&amp;#039;s motto &quot;E Pluribus Unum&quot; (&quot;From Many, One&quot;) might change to &quot;What \nAbout Me?&quot;; dissects the forces driving the secular-progressive agenda in the media and behind the scenes, including George Soros, George Lakoff, and the ACLU; and dives into matters of race, education, and the war on terror. He also shows how the \n\nculture war has played out in such high-profile instances as The Passion of Christ, Fahrenheit 9/11, the abuse epidemic (child and otherwise), and the embattled place of religion in public life-with special emphasis on the war against Christmas. \n\nWhatever controversies are roiling the nation, he fearlessly confronts them-and no one will be in the dark about which side he&amp;#039;s on.\n\nCulture Warrior showcases Bill O&amp;#039;Reilly at his most eloquent and impassioned. He is an unrelenting fighter for the soul of America, and in this book he fights the good fight for the traditional values that have served this country so well for so long.\n\n\n","torrent":{"xt":"urn:btih:3b9d5624cc8731d89c02566f1c437e31d9c4226b","amp;dn":"Bill+O%5C%27Reilly+-+Culture+Warrior+%282006%29+48kps+.MP3s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9d5624cc8731d89c02566f1c437e31d9c4226b","infoHashBuffer":{"type":"Buffer","data":[59,157,86,36,204,135,49,216,156,2,86,111,28,67,126,49,217,196,34,107]},"announce":[],"urlList":[]}}