{"title":"Everest Ultimate Edition 4.50.1416 beta","uid":4267529,"size":8708538,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3bb05d29da59899ef81e90819f2570ed3574caeb&amp;dn=Everest+Ultimate+Edition+4.50.1416+beta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":1,"time":1214767704,"description":"EVEREST Ultimate Edition 4.50 Build 1416 Beta\n\nMore infos at:\n &lt;a href=&quot;\nhttp://www.lavalys.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lavalys.com/&lt;/a&gt;\n\n \nEVEREST Ultimate Edition is an industry leading system diagnostics and benchmarking solution for enthusiasts PC users, based on the award-winning EVEREST Technology. During system optimizations and tweaking it provides essential system and overclock information, advanced hardware monitoring and diagnostics capabilities to check the effects of the applied settings. CPU, FPU and memory benchmarks are available to measure the actual system performance and compare it to previous states or other systems. Furthermore, complete software, operating system and security information makes EVEREST Ultimate Edition a comprehensive system diagnostics tool that offers a total of 100 pages of information about your PC. \n\nHardware Information \n\nMotherboard &amp; CPU \nAccurate low-level information about motherboard, CPU and BIOS, including chipset details, DMI enumeration, AGP configuration information, SPD memory modules list, DRAM timing information and CPU instruction set support. \n\nVideo adapter &amp; monitor \nDetailed information about the video adapter, video drivers and monitor, including DDC information, monitor serial number and supported video modes detection, low-level GPU details, OpenGL and Direct3D features list. \n\nStorage devices \nInformation about all hard disk and optical disk drives, including IDE autodetection, S.M.A.R.T. disk health monitoring, ASPI SCSI devices list and partitions information. \n\nNetwork adapters, multimedia, input devices \nExhaustive information about network adapters, sound cards, keyboard, mouse and game controllers, including NIC MAC address detection, IP and DNS list, network traffic monitoring, DirectSound, DirectMusic and DirectInput information. \n\nMisc hardware \nInformation about PCI, PnP, PCMCIA and USB devices, communication ports, power management information, device resources list, printers information. \n\nSoftware Information \n\nOperating system \nDetailed Windows information, including operating system installation date and product key, system services and system drivers list, process information, environment variables list, system folders list, system files and Event Logs content, AX and DLL files list, UpTime information. \n\nServer and display \nInformation about network shares, users and groups list, logged on users list, account security settings, opened files list, fonts list and Windows desktop configuration details. \n\nNetworking \nLarge amount of information about networking status, remote access and mailing accounts, network resources and Internet settings. List of network routes, Internet Explorer cookies and history of visited web pages. \n\nInstalled software \nDetailed information about installed programs, scheduled tasks and startup programs. \n\nSecurity \nWindows Security \nOperating system security information including DEP (Data Execution Prevention) status, list of installed security patches and system restore status. \n\nSecurity applications \nFirewall, anti-spyware and anti-trojan software list. Anti-virus software information including virus database details. \n\nDiagnostics \n\nSystem Stability Test \nAbility to stress system memory, CPU, FPU and local disks simultaneously in real time through a completely visual interface. System thermal solution check through constant temperature, CPU load and CPU thermal throttle monitoring. \n\nCPUID Panel \nEVEREST CPUID panel to provide a compact overview on CPU, motherboard, RAM and chipset. Invaluable information on overclocked systems, dynamic refresh to support Enhanced Intel SpeedStep and AMD Cool&amp;#039;n&amp;#039;Quiet technologies. \n\nHardware monitoring \nSensor information including system, CPU and GPU temperature, fan status, CPU, GPU, AGP and DRAM voltage monitoring, S.M.A.R.T. disk health status. Support for Corsair Xpert memory modules. \n\nSensor icons \nSensor icons feature to display actual system temperature and voltage values on the System Tray. \n\nCPU and FPU benchmarks \nState of the art multi-threaded benchmark methods to measure performance of both old and brand new processors. References list to compare actual performance with other systems. \n\nMemory benchmarking \nMemory read and write speed, memory latency measurement to stress the memory and cache subsystem, including references list to compare actual performance with other systems. \n\nDisk Benchmark module \nDisk Benchmark module to measure performance of hard disk drives, optical disk drives (CD/DVD/Blu-Ray) and USB flash drives. Graphical overview of disk performance measured on different areas of the disk surface. \n\nTips &amp; suggestions \nDetection of possible hardware and software misconfiguration and compatibility issues. \n\nReporting \n\nReport Wizard \nEasy-to-use method to produce report files of the system, by either using pre-configured report profiles or custom selection of information. \n\nReport formats \nThree different report file formats: plain text, customizable HTML and the unique MHTML format. MHTML reports including icons are ideal for printing purposes. \n\nReport e-mailing and printing \nBuilt-in e-mail transfer client using SMTP, also support for MAPI and Outlook protocols. Instant report display and one-click printing capabilities using IE4+ technology. \n\nNew features in EVEREST version 4.50 \n\n\nUpdated CPU and FPU benchmarks \nEnhanced and fixed CPU PhotoWorxx, FPU Julia, FPU Mandel and FPU SinJulia benchmarks to support the upcoming 3-core AMD Phenom and 6-core Intel processors. Further benchmark optimizations for AMD Phenom, AMD Opteron &quot;Barcelona&quot; and Intel &quot;Penryn&quot; CPU family. \n\nRevamped System Stability Test module \nEven more stress on CPU, FPU, caches, system memory and hard disk drives by constantly pushing all available processor cores to the maximum. Enhanced hardware monitoring capabilities to monitor temperatures, voltages and fan speeds while running the stability test. \n\nIntel Skulltrail platform and i5400 chipset support \nDetailed CPU, motherboard, chipset and sensor information for the Intel Skulltrail platform and its components: Intel Core 2 Extreme QX9775, Intel D5400XS motherboard and Intel &quot;Seaburg&quot; 5400 chipset. Temperature monitoring for FB-DIMM modules on Intel 5000, 5400 and 7300 chipset based systems. \n\nSupport for the latest graphics technologies \nVideo adapter, GPU, OpenGL and DirectX information for ATI Radeon HD 34xx/36xx, ATI Radeon HD 3870 X2, nVIDIA GeForce 8800 GS, nVIDIA GeForce 8800 GTS 512, nVIDIA GeForce 9300/9400/9500/9600, nVIDIA GeForce 9800 GX2. Temperature monitoring for special version of Asus EN8800GS and EN8800GT video cards. Preliminary support for nVIDIA GeForce 9800 GTX. \n\nDDR3 Extreme Memory Profile and EPP 2.0 details \nDetailed SPD memory module information, including memory clocks, memory timings and voltage requirements for the upcoming Intel Extreme Memory Profile (XMP) and nVIDIA Enhanced Performance Profiles 2.0 (EPP 2.0). Identification of DDR3 modules up to 2133 MHz.\n\n\n\nEnjoy and remember to seed... :o)\n\n","torrent":{"xt":"urn:btih:3bb05d29da59899ef81e90819f2570ed3574caeb","amp;dn":"Everest+Ultimate+Edition+4.50.1416+beta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bb05d29da59899ef81e90819f2570ed3574caeb","infoHashBuffer":{"type":"Buffer","data":[59,176,93,41,218,89,137,158,248,30,144,129,159,37,112,237,53,116,202,235]},"announce":[],"urlList":[]}}