{"title":"Atlantis Attacks","uid":4255930,"size":311217618,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3bb5d68d35f85fec961909887a9ac96d69bb87ce&amp;dn=Atlantis+Attacks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rishab","files":15,"time":1214244957,"description":"Atlantis Attacks was a comic book super-hero crossover storyline which ran through most of the summer annuals published by Marvel Comics in 1989.\n\nThe storyline is a complicated, multi-layered crossover regarding the return of the seven headed serpent god Set at the hands of the various underwater empires of the Marvel Universe. The title itself is misleading, as Atlantis and its then-leader Attuma only play minor roles in the story as flunkies for the real masterminds: Deviant leader Ghaur and Lemurian super-villainess Llyra.\n\n\\&quot;Atlantis Attacks\\&quot; continued and expanded the format created by 1988s The Evolutionary War crossover, in which all of Marvel\\&amp;#039;s super-hero annuals were tied in to one large, singular storyline. However, where The Evolutionary War had had eleven parts, Atlantis Attacks had fourteen, as Marvel revived the Annual format for Daredevil, Iron Man, and Thor, who were not given annuals in 1988 as part of the storyline. However, due to a typo, the Daredevil Annual is mistakenly numbered with its previous annual number.\n\nAlso, unlike Evolutionary War Annuals, which were connected loosely at best and were mainly written as stand-alone stories loosely connected by the presence of High Evolutionary, Atlantis Attacks were written as a true serial, with many of the Annuals ending on cliffhangers that would be resolved in the next installment.\n\nAlso every annual contained a back-up story called \\&quot;The Serpent Crown Saga\\&quot; which was written by Peter Sanderson with pencil art by Mark Bagley. This 14 part story explained the complicated history of the Serpent Crown and recounted all its previous appearances for new readers.\n\nPart 1: Silver Surfer Annual #2 \nPart 2: Iron Man Annual #10 \nPart 3: X-Men Annual #13 \nPart 4: The Amazing Spider-Man Annual #23 \nPart 5: Punisher Annual #2 \nPart 6: The Spectacular Spider-Man Annual #9 \nPart 7: Daredevil Annual #5(4b) \nPart 8: Avengers Annual #18 \nPart 9: New Mutants Annual #5 \nPart 10: X-Factor Annual #4 \nPart 11: Web of Spider-Man Annual #5 \nInterlude: Avengers West Coast #52 \nPart 12: Avengers West Coast Annual #4 \nPart 13: Thor Annual #14 \nPart 14: Fantastic Four Annual #22 \n\nThis is a request from the forum. Enjoy and Seed. ","torrent":{"xt":"urn:btih:3bb5d68d35f85fec961909887a9ac96d69bb87ce","amp;dn":"Atlantis+Attacks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bb5d68d35f85fec961909887a9ac96d69bb87ce","infoHashBuffer":{"type":"Buffer","data":[59,181,214,141,53,248,95,236,150,25,9,136,122,154,201,109,105,187,135,206]},"announce":[],"urlList":[]}}