{"title":"The_Golden_Compass.rmvb","uid":4112073,"size":478807285,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3bd56bb22acb4648c096755284da391fd7041bba&amp;dn=The_Golden_Compass.rmvb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eachonline","files":1,"time":1207108795,"description":"Directed by Chris Weitz. With Nicole Kidman, Daniel Craig, Dakota Blue Richards. In a parallel universe, young Lyra Belacqua journeys to the far North to ...\n      The opening scene was the very first clue that this film was going to be the barrage of formula drudgery that it ultimately turned out to be. Weitz began by unveiling all the information which the reader isn&amp;#039;t even aware of by the end of the first novel in a horrific attempt to follow the footsteps of The Lord of the Rings with an opening prelude. Much of the intrigue of Pullman&amp;#039;s storytelling is derived from the careful progression of revealed information, letting the reader know only as much as it needs to at any moment, and no more. The mystery is not only lost, it is purposely banished by the blundering slate of exposition which begins with the prologue and carrys on through the film&amp;#039;s duration. Every bit of exposition has the feel of a technical bother that must be gotten out of the way so that the action scenes can make some kind of sense. But the real kicker is the obviousness. The obviousness ranging from New Line&amp;#039;s less than subtle attempt to repeat a miracle (LOTR), to the individual lines in the film (&quot;Why am I here? What do they want? What is she going to do with me?&quot;), and everything in between. Show, don&amp;#039;t tell, is the first rule of third grade story writing, a class these film makers clearly missed. \n\nThe film makers (Chris Weitz and everyone above him) have absolutely no respect for their audience. Somehow they expect people to go to a film like TGC for the action sequences and great CG. They expect people can&amp;#039;t make inferences and connect the dots unless it is entirely spelled out for them. And the really amazing thing, is that in spite of spilling every possible secret of the narrative before the audience could possibly start to wonder about it, the tangle of facts are hugely more confusing than the novel. \n\nThis is a fumble truly. \n\nIt was too big of a project for Weitz and there was way too much (it would seem) direction from above the director making this superb story of amazingly real characters in an amazing, whimsical world nothing more than a long string of pretty CG which amounts to a fantastically muddled flop. \n\nI really have to say that the first mistake made was the same one made by Walden Media with the Chronicles on Narnia: making a children&amp;#039;s film out of something that wasn&amp;#039;t child-material. His Dark Materials are not for children, Narnia wasn&amp;#039;t either. They fit into a genre of literature clearly not understood by Newline, Walden, and film studios like them: Novels. Just because the main characters are children people readily assume they are children&amp;#039;s stories, but Pullman&amp;#039;s work, more so even than Narnia, is written with an intelligent, imaginative, but somewhat cynical audience in mind. Sure their isn&amp;#039;t graphic sex and foul swearing, but the themes addressed in his books are not of a pre-teen nature in the least. The main character in the Sixth Sense is a pre-teen, but no one would assume the bulk of the audience would be ten year olds. Somehow in the fantasy realm, studios have seen giant dollar signs over the heads of young children and grasped for material with a previously established audience that appeals to this demographic. \n\nWhat they forgot about Lord of the Rings is that it was directed by a genius, a genius who cared about both the source material and making as good a film as possible, someone who actually understood the language of film, something that cannot be said for Weitz or anyone above him responsible for this film. Jackson was a dark film maker, his previous films Brain Dead, Heavenly Creatures, and The Frighteners preparing him to deal very appropriately with the material of the Lord of the Rings. Material which, while far denser than Narnia or Compass material, was no more deserving of a serious handling and of caring, talented hands.\n\nThe question I have to ask is do the people responsible realize what they have done wrong, and if they do, do they care? My guess is they will begin to care when TGC loses money and perhaps they will begin to understand that audiences don&amp;#039;t want a bunch of CG action sequences or pretty costumes. Audiences, for every genre and category, want a good story well told with characters that they care about and mystery they can feel. Maybe the next time they spend 180 million dollars they will ponder this, and maybe then we will see something worthwhile. Until then, we can expect nothing more than a steady stream of Narnia-Compass-Eregon-Etc. drivle from the studio machine. ","torrent":{"xt":"urn:btih:3bd56bb22acb4648c096755284da391fd7041bba","amp;dn":"The_Golden_Compass.rmvb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd56bb22acb4648c096755284da391fd7041bba","infoHashBuffer":{"type":"Buffer","data":[59,213,107,178,42,203,70,72,192,150,117,82,132,218,57,31,215,4,27,186]},"announce":[],"urlList":[]}}