{"title":"Predator Chronicles","uid":4243241,"size":4627087515,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3c7061350580260c9e26d61358aaf429071f183d&amp;dn=Predator+Chronicles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"A.v.P","files":17,"time":1213654994,"description":"What kind of fan edit: True Fan Edit.\nOriginal film name: Alien vs Predator, and Aliens vs Predator: Requiem\nNew film name: Predator Chronicles\nFilm studio name: 20th Century Fox\nEdit crew name: Uncanny Antman\nDate Original Film Was Released: 2004 and 2008\nDate Edit Was Released: June 2008\nOriginal Runtime: 1h48m and 1h41m.\nNew Runtime: 57m and 55m.\nAmount of time Cut/Added: I?m terrible at math.\nYour intention for this fan edit: To create a kind of, ?What if the Predator series spawned a series of short TV films, a la Masters of Horror??\n\nI also wanted to emulate the kind of storytelling that Dark Horse did with their one-shot Predator comics. Straight forward Predator stories, (that just happen to also feature the Aliens) with paper-thin characters. The films themselves had very little in the way of interesting characterization, so I felt my only choice was to embrace that approach. Also, as with many of the comics, these edits assume you have a reasonable knowledge of the Alien and/or Predator universe(s). Things such as the Alien's lifecycle, and the Predator's M.O. are not fleshed out just for the benefit of the uninitiated.\n\nIn the end, I just wanted to be able to watch these stories without cringing all the time. They?ll never be great films, but I hope they are now at least fun films.\n\nCuts removed/added/extended: Too many to list individually, but these are some of the major alterations:\n\n\nAvP: (Both theatrical and unrated versions were utilised.)\n\n? Removal of all Predator ship interiors. They are incongruous with Predator 2, and also keeps the actions of the Predators more mysterious, rather than showing us every step they take.\n? Altered all Predator P.O.V. shots (Except when in ?Alien Mode?) to resemble the ?correct? heat vision from Predator 1 and 2. Also added in triple heartbeat sound effect, which was oddly absent.\n? Removed all mention of ?metric time?. Not only is it unnecessary, but it?s complete bunk. 10 minutes is not metric time.\n? Removed all instances of the super-long-wrist blades.\n? The Queen is no longer activated by a secret switch on the floor. She is revived by the Predators directly. In this version, the humans are not lured to the pyramid on purpose, but are merely caught in the wrong place at the wrong time.\n? Removed the first batch of eggs/facehuggers. The assumption is that when the Queen was unfrozen, so were a bunch of warriors. This removes the problem of the ridiculously sped-up gestation time. (Not to mention that Rousseau?s chestburster scene was abysmal.)\n? Removed Scar killing the unarmed Quinn.\n? All but the more minor references to the rite of passage removed. The less of the supposed back-story we know, the less ridiculous it is.\n? Removed Scar marking Lex as a fellow warrior.\n? Trimmed several of the not-so-great shots of Scar?s unmasked face.\n\nMost scenes have been reworked in other ways, including re-sequencing events, re-scoring, sound effects replacement (Such as the Predator plasma cannon sound), and minor effects work on some shots. Some efforts have also been made to minimize the &quot;chunky Predator&quot; appearance when possible.\n\n\nAvP:R:\n\n? All connection to AvP removed. (This edit also done in AvP.) The PredAlien on board is from a different, unknown-to-the-audience incident.\n? Altered Predator P.O.V. shots so that the PredAlien is the same color as regular Aliens. I do not care for many of the ways in which the PredAlien was made to be apart from the rest of its species. In fact, much of the PredAlien has been trimmed out until we get to the roof fight.\n? Removed Buddy Benson?s arm melting off, and the oddly ?black? looking facehugger.\n? Removed all the early teen-angst scenes. We now only see Ricky when he?s interacting with his brother.\n? Removed PredAlien?s new reproduction method entirely.\n? Removed all early scenes with Kelly O?Brien. She and Molly do not appear until the department store.\n? Removed all instances of the Predator?s magic blue liquid. The Predator is here on a hunt, not to clean up the town. (His motives were inconsistent in the film at the best of times, so this makes more sense.) Also, the liquid and it?s never-empty bottle is just plain stupid.\n? Some of the more egregious shots of Aliens simply not defending themselves against the Predator have been removed. Couldn?t take ?em all out, or there would be almost no fighting left.\n? All uses of the Predator?s power-punch-glove-thing are gone. More ill-thought-out ridiculousness.\n? Removed early references to nuking the town. It works better if it?s as much a surprise to us as it is to the townspeople.\n? Reworked roof fight to remove such things as the Predator coming up through the ground, stomping on an Alien?s acid-filled head, the unmasking scene where the PredAlien patiently waits for the Predator to disarm himself, and the Predator pulling the PredAlien?s tongue out.\n\nAs with AvP, there is also major re-sequencing of events in the early stages of the story, some minor scoring alterations and additions, sound effects alterations, and some effects shots.\n\nNote: As anyone who bought the AvP:R DVD knows, the image is hideously, impenetrably dark. I?ve made every attempt to brighten the image to an acceptable level without ruining the contrast or revealing the digital break-up within the black areas. It?s not perfect, but it?s the best I could do. The end result varies depending on your set-up, so apologies if you see too much macro-blocking. There are also several instances where there simply was no image to 'reveal', so they remain brightened, yet difficult to make out.\n\n\nBoth stories now have a few ?nobody? characters who disappear from the narrative, but I didn?t consider them important enough to worry about resolution for them. Both stories end in situations that makes their final fates clear, so there?s no real problem there.\n\n\nFan edit details (please add here details about DVD contents as well as video and audio information): 16x9, 5.1 audio. The DVD also features some supplemental Predator activities (Some footage that was not used in the edits is presented here) three Predator related parodies, and the Chronicles teaser.\n\nHardware and software information (what did you use to create your fan edit): Premiere, DVDLabPro.\nTime needed for the edition: My original attempts at AvP stretched out over about eight months, but the revised ?Chronicles? version took about two months all together.\nPersons involved: One.\nAdditional download links: Teaser trailer -\n\nFanedit Community:\n &lt;a href=&quot;\nhttp://www.avpsgallery.fanedit.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.avpsgallery.fanedit.org/index.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.fanedit.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fanedit.org&lt;/a&gt; &lt;a href=&quot;\nhttp://WWW.forum.fanedit.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://WWW.forum.fanedit.org/index.php&lt;/a&gt; &lt;a href=&quot;\nhttp://www.originaltrilogy.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.originaltrilogy.com&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:3c7061350580260c9e26d61358aaf429071f183d","amp;dn":"Predator+Chronicles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7061350580260c9e26d61358aaf429071f183d","infoHashBuffer":{"type":"Buffer","data":[60,112,97,53,5,128,38,12,158,38,214,19,88,170,244,41,7,31,24,61]},"announce":[],"urlList":[]}}