{"title":"March.of.the.Penguins.XviD.MP3.Eng.FTS.mp4","uid":4021467,"size":781254512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c82a9a78956cb1d0f0c059aca75f2eb2bb8a722&amp;dn=March.of.the.Penguins.XviD.MP3.Eng.FTS.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ftsgroup","files":1,"time":1202681698,"description":"Each winter, alone in the pitiless ice deserts of Antarctica, deep in the most inhospitable terrain on Earth, a truly remarkable journey takes place as it has done for millennia. Emperor penguins in their thousands abandon the deep blue security of their ocean home and clamber onto the frozen ice to begin their long journey into a region so bleak, so extreme, it supports no other wildlife at this time of year. In single file, the penguins march blinded by blizzards, buffeted by gale force winds. Guided by instinct, by the otherworldly radiance of the Southern Cross, they head unerringly for their traditional breeding ground where--after a ritual courtship of intricate dances and delicate maneuvering, accompanied by a cacophony of ecstatic song--they will pair off into monogamous couples and mate. The females remain long enough only to lay a single egg. Once this is accomplished, exhausted by weeks without nourishment, they begin their return journey across the ice-field to the fish-filled seas. The male emperors are left behind to guard and hatch the precious eggs, which they cradle at all times on top of their feet. After two long months during which the males eat nothing, the eggs begin to hatch. Once they have emerged into their ghostly white new world, the chicks can not survive for long on their fathers&amp;#039; limited food reserves. If their mothers are late returning from the ocean with food, the newly-hatched young will die. Once the families are reunited, the roles reverse, the mothers remaining with their new young while their mates head, exhausted and starved, for the sea, and food. While the adults fish, the chicks face the ever-present threat of attack by prowling giant petrels. As the weather grows warmer and the ice floes finally begin to crack and melt, the adults will repeat their arduous journey countless times, marching many hundreds of miles over some of the most treacherous territory on Earth, until the chicks are ready to take their first faltering dive into the deep blue waters of the Antarctic.\n\nThe cycle of life the Emperor&amp;#039;s penguins is disclosed in this wonderful documentary. Every autumn, these animal leave the safety of the ocean and march along twenty days to a place called &quot;Oamack&quot;. Once there, they select their mates, they procreate, protect and feed their offspring and after months they return to the sea. Later, their progeny go to the ocean, where they stay for four years, and when they reach their adult life, they follow the same pattern of their parents.","torrent":{"xt":"urn:btih:3c82a9a78956cb1d0f0c059aca75f2eb2bb8a722","amp;dn":"March.of.the.Penguins.XviD.MP3.Eng.FTS.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c82a9a78956cb1d0f0c059aca75f2eb2bb8a722","infoHashBuffer":{"type":"Buffer","data":[60,130,169,167,137,86,203,29,15,12,5,154,202,117,242,235,43,184,167,34]},"announce":[],"urlList":[]}}