{"title":"Transport Giant-MONEY","uid":3231388,"size":959668260,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3caa50b8fe96cbe15fc7433d90726dfdbb5d983c&amp;dn=Transport+Giant-MONEY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ABZeta99","files":55,"time":1092471273,"description":"PC-Spel: Transport Giant (c) JoWooD by MONEY\n\n   GAME INFORMATION:\n   -------------------\n \n  This is the year 1850. It's an age of radical change and new departures.\n  The era of mass production and mass transportation has just begun. The\n  resourceful entrepreneur has plenty of opportunities. It's a time to build\n  empires with just a little capital and a clever business idea.\n \n  New manufacturing plants are springing up everywhere. The world craves\n  goods of every kind. Towns are growing at a breathtaking rate. But how to\n  get the goods to the customers? How can workers get to the plants? Who will\n  haul the vast amounts of raw materials?\n \n  The time is ripe for a big and powerful haulage firm. Industry\n  transportation in particular is getting out of hand and conventional\n  methods just can't cope anymore. Invest your little starting capital\n  wisely, buy modern vehicles, and slowly build up a growing enterprise.\n \n  Present yourself in a favourable light to your customers, and oust your\n  opponents from the market. You'll need all your know-how and your skills to\n  survive two centuries of changing economic tides and changing demands. For\n  a start, steam locomotives might do, but later on you'll have to replace\n  them with monorails or even superconductor trains.\n\n  INSTALLATION INFORMATION:\n  ---------------------------\n \n Extract, burn, install, copy our crack from the CRACK directory on your CD\n (overwriting the original exe), and enjoy.","torrent":{"xt":"urn:btih:3caa50b8fe96cbe15fc7433d90726dfdbb5d983c","amp;dn":"Transport+Giant-MONEY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3caa50b8fe96cbe15fc7433d90726dfdbb5d983c","infoHashBuffer":{"type":"Buffer","data":[60,170,80,184,254,150,203,225,95,199,67,61,144,114,109,253,187,93,152,60]},"announce":[],"urlList":[]}}