{"title":"HÃƒÂ¥rdrocksnatt SVT1 16/7 - 17/7 - 2004","uid":3225412,"size":6473987816,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3d32dcc3425c7cb0b1408eaf7711285a75791a66&amp;dn=H%C3%83%C2%A5rdrocksnatt+SVT1+16%2F7+-+17%2F7+-+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Metha-","files":15,"time":1090087404,"description":"12 timmar hardrock far alla fantaster\n\nEn hel hardrocknatt med de tyngsta rockgrupperna och de vassaste gitarriffen. Jovan Radomir guidar oss genom ett digert hardrocksmaterial med en blandning av intervjuer, dokumentarer och konsertfilmer.\n\nDet ar latt att konstatera att hardrocken ar starkt underrepresenterad i media. Detta trots att hardrocken eller atminstone hard rock har funnits i snart 40 ar och det finns flera generationer hardrocksfans. En vardematare pa hardrockens storhet ar festivalen Sweden Rock i Salvesborg som drar runt 20 000 besakare och darmed ar av samma storlek som Hultsfredsfestivalen. Hardrockpubliken finns, och den ar stor och hangiven. Darfar har det varit ett helt naturligt val far SVT att agna 12 timmar at hardrock under en natt i sommar.\n\nHardrocknatt bjuder pa en resa genom hardrockens historia med konsertfilmer, dokumentarer, reportage och en spelfilm. Upplagget ar brett och kanske sjalvklart far den mest inbitne hardrocksfantasten, men fokus ligger pa att ge en bred publik en stark musikupplevelse. Hardrocknatt vill fralsa bade nya och vacka gamla fans. Sa varfar inte agna 12 timmar till hardrock i SVT?\n\nMellan programmen visas exklusiva och nygjorda intervjuer med bland andra Rob Halford, K.K. Downing och Glenn Tipton i Judas Priest, Metallicas James Hetfield och Robert Trujillo samt journalister och inbitna hardrocksfans. Alla intervjuer gars av kvallens ciceron och hardrocksfantast Jovan Radomir.\n\nDeep Purple: Machine Head\nDeep_Purple.avi, 571MB\nEn film om inspelningen av gruppens kanske mest kanda album Machine Head som spelades in i Montreux i Schweiz 1972. Skivinspelningen gjordes pa ett hotell eftersom konsertlokalen dar de skulle ha spelat in brunnit ner. Allt finns beskrivet i laten Smoke on the water vars gitarriff har blivit gitarrockens mest kanda klicha.\n\nI musikdokumentaren Machine Head visas den smatt otroliga historian som utspelade sig nar Deep Purple skulle spela in sitt album Machine Head. Albumet som innehall klassikern Smoke on the water och som 1972 gjorde Deep Purple varldsberamda och till nagra av frontfigurerna inom 1970-talets hardrock.\n\nEfter succaerna med In Rock och Fireball bestamde sig bandet far att spela in sitt nya album i Europa. Valet fall pa konsertlokalen The Casino i Montreux i Schweiz. Det blev ingen inspelning pa The Casino far lokalen brann ner natten innan arbetet skulle barja. Det kom dock att visa sig att ur The Casinos aska faddes deras mest minnesvarda lat och framgangsrika platta. Deep Purple tog istallet Grand Hotel i besittning och farvandlade korridorerna i det ade hotellet till sin studio dar de spelade in det som skulle bli deras lyckoalbum.\n\nI exklusiva intervjuer med Ritchie Blackmore, Ian Gillan, Roger Glover, Jon Lord och Ian Paice far tittarna veta hur inspelningen gick till, spar far spar. Ritchie, Jon och Roger demonstrerar riff och licks fran latarna och farklarar uppkomsten till deras latskrivande.\n\nNagra av latarna de framfar ar Higway Star, Smoke On The Water, Space Truckin, Never Before, Pictures Of Home och bonuslatarna When A Blind Man Cries och Black Night. Tittarna bjuds pa bilder fran Deep Purple-konserter, tv-framtradanden och musikvideor och far en unik insyn i skapandet av ett album som blev ett av de mest influerande och framgangsrika hardrockmasterverken fran det tidiga 1970-talet. Ett riktigt klassiskt album.\n\nMetallica - live from London\nMetallica.avi, 353MB\nMetallica ar mitt uppe i ett framgangsrikt ar med ny platta och en uppmarksammad dokumentar som gar pa biografer varlden aver. Har ser vi gruppen fran en exklusiv spelning fran farra aret infar en entusiastisk Londonpublik.\n\nHeavy Metal Parking Lot\nHeavy_Metal_Parking_Lot.avi, 263MB\nNarbilder pa hardrocksscenen fran insidan under sina glansdagar.\n\nFilmen ar en underground-dokumentar inspelad pa en parkeringsplats utanfar en Judas Priest-konsert pa Capitol Center i Largo i Maryland 1986.\n\nFilmaren John Heyd vandrade runt pa parkeringsplatsen fylld med fulla hardrocksfans och behavde inte gara mer an att halla upp en kamera. Fansen spelade luftgitarr, sjang Judas Priest-latar och helt enkelt fullstandigt gjorde bort sig framfar kameran pa ett mycket underhallande satt.\n\nBraderna Hardrock\nBroderna_Hardrock.avi, 88MB\nDetta reportage sandes hasten 1998 i samhallsprogrammet Propaganda och beskriver Braderna Hardrocks mycket hangivna farhallande till Iron Maiden.\n\nVi ser bradernas noggranna farberedelserna infar nagra konsertbesak av sina idoler i Norden. Braderna far sen ocksa traffa medlemmar fran Iron Maiden. Genom reportaget blev Braderna Hardrock ett begrepp och ger en tydlig bild av hur idolskap kan paverka ens liv.\n\nIron Maiden: Rock in Rio\nIron_Maiden.avi, 573MB\nEn konsertfilm fran varldens starsta rockfestival, Rock in Rio, som 2001 gastades av ett av de viktigaste hardrocksbanden, Iron Maiden.\n\nHardrockens historia\nHardrockens_historia.avi, 439MB\nEn odyssa aver det som vi i trettio ar kallat far hardrock. Intervjuer och glimtar fran det allra viktigaste fran Black Sabbaths tidigaste alster till hardrocken som det later pa 2000-talet.\n\nAC/DC, No Bull\nAC_DC.avi, 569MB\nKonserten filmades pa den klassiska tjurfaktningsarenan Las Ventas i Madrid, Spanien. 40 000 fans fick skrika sig igenom klassiska AC/DC-hits fran Ballbreaker-turnan 1996.\n\nJudas Priest - live in Memphis\nJudas_Priest.avi, 440MB\nDe nyligen aterfarenade Judas Priest hade en storhetstid i barjan pa 1980-talet. Har ser vi bandet i en livekonsert med nitar, lader och motorcyklar. Konserten spelades in 1982 i Memphis, USA.\n\nComic Strip: More Bad News on Tour\nComic_Strip.avi, 485MB\nComic Strip - ganget bakom Hemma varst - ger i den kultiga Spinal Tap-liknande filmen More Bad News en underhallande och parodierande beskrivning av ett hardrocksbands uppgang och fall.\n\nDet har gatt fem ar sen alla brak och anklagelser som satte punkt far The Bad News Tour och den undersakande rockjournalisten Sally Friedman som faljde bandet under deras farsta katastrofala turna bestammer sig far att ta reda pa vad som hande med dem. Killarna lockas till aterfarening med ett fett skivkontrakt, en tv-dokumentar och chansen att fa spela far 70000 hardrocksfans . De bestammer sig far att farsaka glamma gammalt groll och det kanske ar averfladigt att saga att allt inte gar enligt planerna.\n\nMore Bad News filmades under tva veckor i Augusti 1986 i London och aven live infar en stor publik vid Castle Donnington. Det var en ofarglamlig syn Bad News inklamda mellan tunga band som Ozzy Osbourne, Motorhead, The Scorpions och Warriors. Hardrockens tungviktare ger aven sitt utlatande om Bad News upptradande.\n\nI rollerna syns bland andra Adrian Edmonson, Peter Richardson, Rik Mayall, Nigel Planer, Jennifer Saunders och Dawn French.\n\nAlice Cooper - Welcome to my nightmare\nAlice_Cooper.avi, 395MB\n&quot;Everyone needs a gimmick. Let's se how far you get without one.&quot; Detta galler nog hela hardrocken dar loggor och figurer och scenshower ar mycket viktiga element. Den som kanske grundligast av alla har odlat detta ar Alice Cooper. Har i en klassisk konsertfilm fran 1975.\n\nAlla manniskor har mardrammar. 1975 utmanande Alice Cooper alla konventioner i sin legendariska show Welcome To My Nightmare. Det var den farsta storslagna och extravaganta rockteatern i sitt slag. Konserten hyllades av publik och kritiker varlden aver. Alice Cooper var den stora stjarnan i denna visuella fest, vilken satte standarden far kommande rockturnaer med sitt genomtankta och innovativa scenframtradande.\n\nI Welcome to My Nightmare framfar han flera av sina klassiska latar, som Iam Eighteen, Schools Out och No More Mr. Nice Guy. Den mardramslika stamningen pa scenen skapas med en magisk filmduk, en mangd skelett och skrackmastaren Vincent Prices rast, allt komponerat far att satta skrack i publiken.\n\nRegi: David Winters.\n\nDecline of Western Civilization 2: The Metal Years\nDecline_of_Western_Civilization.avi, 836MB\nFilmaren Penelope Spheeris uppmarksammade dokumentar fran 1988 ar en av de fa dokumentarer som har gjorts om hardrock. Har ser vi ovanligt inkannande intervjuer med bland annat Steven Tyler, Gene Simmons, Alice Cooper, Lemmy och Ozzy Osbourne.\n\nMotarhead - live at Brixton\nMotorhead.avi, 572MB\nEn numera klassisk konsert med ett 25-arsjubilerande Motarhead. Konserten spelades in pa Brixton Academy i London ar 2000, da bandet gastades av den tidigare gitarristen &quot;Fast&quot; Eddie Clarke.\n\nThin Lizzy\nThin_Lizzy.avi, 276MB\nVi far se en kavalkad av Thin Lizzy-latar fran 1973 till 1983, med bandet som gav oss det melodiasa twinguitar-soundet.\n\nDessutom intervjuas Thin Lizzyas trummis Brian Downey och gitarristen Scott Gorham. Intervjuerna ar fran den kommande dokumentaren &quot;Thin Lizzy - Forever&quot;.\n\nThe Darkness - live in London\nThe_Darkness.avi, 308MB, tyvarr inte hela\nDet engelska bandet The Darkness slog igenom farra aret och lyckades mobilisera fans fran alla aldersgrupper. De tog uttryck fran de mest skiftande eror inom hardrockshistorien och gjorde blandningen till sin egen. Det blev lyckat vilket har speglat sig i enorma skivfarsaljningsframganga\n\n\n---------------------------------------------------------------------\n\nKvaliten ar inte optimal, men det ar svart att fa nagot pa 12 timmar i vettigt format. Have fun and enjoy.\n\n","torrent":{"xt":"urn:btih:3d32dcc3425c7cb0b1408eaf7711285a75791a66","amp;dn":"H%C3%83%C2%A5rdrocksnatt+SVT1+16%2F7+-+17%2F7+-+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d32dcc3425c7cb0b1408eaf7711285a75791a66","infoHashBuffer":{"type":"Buffer","data":[61,50,220,195,66,92,124,176,177,64,142,175,119,17,40,90,117,121,26,102]},"announce":[],"urlList":[]}}