{"title":"Deseo peligro 2007 (DVDR)","uid":4162190,"size":4649236528,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3da3eecc79b6faa9d74ba800cbf0a11d49a23c14&amp;dn=Deseo+peligro+2007+%28DVDR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"angel1958","files":2,"time":1209426590,"description":"2007: Venecia: LeÃƒÂ³n de Oro / Thriller. Romance / SINOPSIS: Shanghai, 1942. La ciudad estÃƒÂ¡ ocupada por los japoneses. La Sra. Mak, una mujer sofisticada y adinerada, entra en un cafÃƒÂ©, hace una llamada y se sienta a esperar. Recuerda... cÃƒÂ³mo empezÃƒÂ³ todo hace unos aÃƒÂ±os, en la China de 1938. En realidad no se llama Sra. Mak, sino Wong Chia Chi. Un poco antes de la II Guerra Mundial su padre huyÃƒÂ³ a Inglaterra, dejÃƒÂ¡ndola en China. Era estudiante universitaria y conociÃƒÂ³ a Kuang Yu Min, que acababa de fundar una sociedad teatral para fomentar el patriotismo. Wong Chia Chi se convirtiÃƒÂ³ en la primera actriz de la compaÃƒÂ±ÃƒÂ­a y descubriÃƒÂ³ que era capaz de conmover al pÃƒÂºblico y a Kuang. Este ÃƒÂºltimo convenciÃƒÂ³ a un grupo de estudiantes para llevar a cabo un ambicioso plan para asesinar a un importante colaborador de los japoneses, el Sr. Yee. AsignÃƒÂ³ un papel a cada estudiante: Wong Chia Chi era la Sra. Mak, que debÃƒÂ­a ganarse la confianza de Yee haciÃƒÂ©ndose amiga de su mujer para acabar seduciÃƒÂ©ndolo. La joven se transformÃƒÂ³ interior y exteriormente para hacer su papel. Todo iba segÃƒÂºn lo previsto hasta que sucediÃƒÂ³ un acontecimiento inesperado...","torrent":{"xt":"urn:btih:3da3eecc79b6faa9d74ba800cbf0a11d49a23c14","amp;dn":"Deseo+peligro+2007+%28DVDR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da3eecc79b6faa9d74ba800cbf0a11d49a23c14","infoHashBuffer":{"type":"Buffer","data":[61,163,238,204,121,182,250,169,215,75,168,0,203,240,161,29,73,162,60,20]},"announce":[],"urlList":[]}}