{"title":"Star Wars - The Radio Drama Collection - SeymourDAC","uid":4142532,"size":2360357896,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3dc6d98ec423f44725200e62fac78b2075ecab6a&amp;dn=Star+Wars+-+The+Radio+Drama+Collection+-+SeymourDAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SeymourCat","files":63,"time":1208561837,"description":"A long time ago in a galaxy far, far away...\n\n\nTALES OF THE JEDI by Tom Veitch.\n&quot;For over a thousand generations, the Jedi Knights were the most powerful, most respected force in the galaxy. . . The guardians of peace and justice in the Old Republic.&quot;\n\nWith those words, Obi-Wan Kenobi hinted at the grand legend, the era of the Jedi Knights. Now you can follow the adventures of Ulic Qel-Dromoa and Nomi Sunrider, young Jedi Knights drawn into battle against the dark side, a battle that may decide the fate of the planet?and a galaxy!\n\n\nTALES OF THE JEDI - DARK LORDS OF THE SITH by Kevin J Anderson and Tom Veitch.\nDarth Vader was a Dark Lord of the Sith, now discover the terror of the Dark Lords who preceded him in this stunning sequel to Star Wars: Tales of the Jedi.\n\nUlic Qel-Dromoa and Nomi Sunrider are young Jedi Knights drawn into a battle for the survival of the Old Republic. But as the power of the evil Sith spreads across the galaxy, it threatens the existence of the Jedi themselves, and draws one of their greatest allies over to the dark side!\n\n\nDARK FORCES - SOLDIER FOR THE EMPIRE by William C Dietz.\nKyle Katarn has joined the ranks of legendary Star Wars heroes such as Luke Skywalker and Han Solo. A timeless adventure of revenge and honor.\n\nIn Soldier for the Empire, Kyle Katarn, having just graduated from the Imperial Military Academy, learns of his father&amp;#039;s murder. On his way home, he meets a Rebel agent, learns the ugly truth about the way in which his father died, and swears revenge.\n\n\nSTAR WARS - A NEW HOPE by Brian Daley and George Lucas.\nLuke Skywalker,an impulsive but good hearted young man who lives on the dusty planet of Tatooine with his aunt and uncle, longs for the exciting life of a Rebel soldier. The rebels are fighting against the evil Empire, which has set about destroying planets inhabited by innocent citizens with the Death Star, a fearsome planet-like craft.\n\n\nSTAR WARS - THE EMPIRE STIKES BACK by Brian Daley and George Lucas.\nThe Rebel Forces have been successful in destroying the Empire&amp;#039;s Death Star. However, the Empire&amp;#039;s top commander, the terrifying Lord Darth Vader, is scanning the galaxy for the Rebels&amp;#039; secret location.\n\nAfter a stunning showdown on the ice planet Hoth, the Rebels are forced to flee...\n\n\nSTAR WARS - RETURN OF THE JEDI by Brian Daley and George Lucas.\nLuke must save Han Solo from the clutches of the monstrous Jabba the Hut, and bring down the newly reconstructed, and even more powerful, Death Star!\n\n\nDARK FORCES - REBEL AGENT by William C Dietz.\nIn Rebel Agent, Kyle Katarn learns more about what his father found in the Valley of the Jedi that ultimately led to his death. Kyle finally earns his Knighthood as a Jedi, and the stage is set for him to avenge his father&amp;#039;s death and stop the Dark Jedi from taking control of the source of energy that lies underneath the Valley of the Jedi!\n\n\nDARK FORCES - JEDI KNIGHT by William C Dietz.\nJerec, the Dark Jedi, brings his forces to Ruusan in the final part of his search for the Valley of the Jedi. Destroying anything that gets in his way, Jerec reaches the Valley just ahead of Kyle Katarn and Jan Ors.\n\nWith the help of the indigenous inhabitants of the planet, Kyle and Jan confront Jerec&amp;#039;s Jedi and prepare for a final showdown with Jerec. If Jerec defeats Kyle, the unlimited power contained in the Valley will enable him to rule the galaxy. Are Kyle&amp;#039;s untrained Jedi powers enough to defeat Jerec?\n\n\nDARK EMPIRE by Tom Veitch.\nSix years after the Battle of Endor, the fight for freedom rages on. Darth Vader is dead, but a reborn Empire, under a mysterious new leader, strikes back at the struggling Rebel Alliance.\n\nMassive World Devastators, more powerful and unstoppable than the Death Star, ravage entire planets, while the ruthless heirs of Jabba the Hutt place a monumental price on the heads of Princess Leia and her husband, Han Solo. Along with Lando, Chewbacca, Artoo, Threepio, and other old allies, Han and Leia struggle to protect the future for their unborn child. But their greatest foe may be their closest friend: Luke Skywalker!\n\n\nDARK EMPIRE II by Tom Veitch.\nThe Empire in retreat, Luke Skywalker is on a quest to rebuild the Jedi. But before he can revive that elite corps of protectors, he must first rebuild himself!\n\nHe has spent time in the Emperor&amp;#039;s thrall, and the taint of the dark side still tugs at his subconcious. Can he pull together the Jedi, can he pull himself together, before the New Republic loses the upper hand, or will the Empire take root once more?\n\n\nEMPIRE&amp;#039;S END by Tom Veitch.\nThe Emperor is back, and this time he&amp;#039;s out for blood! Following his battle with Luke Skywalker in Dark Empire II, Emperor Palpatine was forced to occupy an inferior clone-body. That body is now aging rapidly, and Palpatine&amp;#039;s final, irrevocable end is near unless he can infuse his line of clones with genetic material from a Jedi bloodline. His target: Han and Leia&amp;#039;s youngest child, Anakin!\n\n\nThese are listed in chronological story order. Bitrates vary, but the lowest bitrate is 160kbps CBR.\n\nThe Tales of the Jedi Duology and the Dark Empire Trilogy are my rips from CD using Exact Audio Copy.\n\nThe rest were downloaded from various sources (thanks to the original cappers) and I&amp;#039;ve listened to them all and they&amp;#039;re clean CD rips with no glitches.\n\nIf anyone has Crimson Empire on CD it would be great if you could upload it as the only copies on the net seem to be cassette rips.\n\nPlease be patient until there are more seeds as this is a huge torrent for my upload speed. It will take a couple of days to complete.\n\nHave fun and please seed,\n\nSeymour ","torrent":{"xt":"urn:btih:3dc6d98ec423f44725200e62fac78b2075ecab6a","amp;dn":"Star+Wars+-+The+Radio+Drama+Collection+-+SeymourDAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dc6d98ec423f44725200e62fac78b2075ecab6a","infoHashBuffer":{"type":"Buffer","data":[61,198,217,142,196,35,244,71,37,32,14,98,250,199,139,32,117,236,171,106]},"announce":[],"urlList":[]}}