{"title":"FS2004 F-35 by iris simulations","uid":4048347,"size":56213018,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3e8ba5ca446f838c854c71602952c7b3006de91c&amp;dn=FS2004+F-35+by+iris+simulations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"onlinesharif","files":1,"time":1204038925,"description":"\nIRIS brings you our first excellent rendition of Lockheed Martin?s upcoming F-35B aircraft. Whilst the Joint Strike Fighter has yet to be named by partner air forces, we have taken some artistic licence and named it the Scimitar FA.2. \n\nThe Scimitar FA.2 continues our range of products previously seen under the label of DSB Design. The Scimitar FA.2 product features a number of enhanced features not seen in our previous aircraft. The Virtual Cockpit has been improved considerably over our previous products and features working switches, radios, levers and other effects as well as a unique touch screen MFD that can be used for operating the aircraft systems. \n\nWhilst the Virtual Cockpit has been improved, the exterior model has also retained the high quality carried on from our established F-5 , F-15 and Harrier series of aircraft, and the product features a number of different models as has come to be a trademark of our designs. \n\nThe F-35B product features the following: \n\n- Six different visual models covering the Royal Air Force, Royal Navy and US Marine Corps F-35B in their strike and air defence roles. \n- Authentic 2D panel based on available information from Lockheed Martin. \n- Full 3D Dynamic Virtual Cockpit featuring animated control surfaces and custom gauges with emersive night lighting. \n- Specular shine and accurate night lighting including &amp;#039;Slime-Lights&amp;#039;. \n- XML controlled effects for afterburners, drive fan heat, ground dust in hover and wingtip vorticies. \n- High detail textures with realistic weathering effects and reflective areas. \n- Animated landing gear, lift fan doors, variable exhaust nozzle, afterburner petals and weapon bays. \n- Detailed flight model based on available Joint Strike Fighter data with authentic STOL performance. \n- A choice of numerous texture sets covering the Royal Air Force, Royal Navy Fleet Air Arm and US Marine Corps. \n- Dynamic Shine and lighting on all models. \n- A total of over 52 aircraft combinations to choose from and fly!! \n- High quality soundset for the JSF from Christoffer Petersen.\n\nPLEASE SEED\n","torrent":{"xt":"urn:btih:3e8ba5ca446f838c854c71602952c7b3006de91c","amp;dn":"FS2004+F-35+by+iris+simulations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e8ba5ca446f838c854c71602952c7b3006de91c","infoHashBuffer":{"type":"Buffer","data":[62,139,165,202,68,111,131,140,133,76,113,96,41,82,199,179,0,109,233,28]},"announce":[],"urlList":[]}}