{"title":"Navy Field 1.210","uid":4167394,"size":423242690,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3eadc2a3ce43a4610a16b68f4527e96eedb98d88&amp;dn=Navy+Field+1.210&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"The_Aeolian","files":1,"time":1209681473,"description":"Official Description:\n\nWelcome to Navy Field; a massively multiplayer online tactics simulation game based on World War II naval warfare by SD EnterNet.\n\nBe prepared to experience intense naval battles against large teams of real opponents from across the globe. To help you on your quest to be the ultimate commander of the sea, almost 100 different WWII era naval vessels are available to use. Start with a humble frigate as you again experience and points for superior classes of ships including: destroyers, battle cruisers, and aircraft carriers. Each model reproduced in painstaking detail. Equip your vessel with a massive selection of historically accurate naval guns, torpedo launchers, Fire Control Systems, engines, and armor.\n\nChose from four nations; the United States, United Kingdom, Japan, and Germany. Each balanced through a variety of strengths and weaknesses.\n\nAn RPG style sailor leveling system exists to provide extensive replay and strategic value. 75 different sailor positions are available so you can take command of your vessel in the manner that best suits you. The possibilities for customization are almost endless.\n\nThe way you advance through Navy Field is up to you. Special missions are available for new players to develop their skills. Clans and fleets are able to be formed so you can work together as a strategic team. With new game modes and features on the horizon, Navy Field is the ultimate choice for authentic strategic naval simulation.","torrent":{"xt":"urn:btih:3eadc2a3ce43a4610a16b68f4527e96eedb98d88","amp;dn":"Navy+Field+1.210","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eadc2a3ce43a4610a16b68f4527e96eedb98d88","infoHashBuffer":{"type":"Buffer","data":[62,173,194,163,206,67,164,97,10,22,182,143,69,39,233,110,237,185,141,136]},"announce":[],"urlList":[]}}