{"title":"Apple Gabriel - another Moses","uid":4111470,"size":107457784,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ee437522a27dc0aec41e82074b09469729413d4&amp;dn=Apple+Gabriel+-+another+Moses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ganjagirl","files":10,"time":1207080900,"description":"Track Listing\n1. Telepathic Wave\n2. Another Moses\n3. Be As One\n4. Back Out Hyena\n5. Power Struggle\n6. Poor Man Street\n7. Keep on Dancing\n8. Heat Wave\n9. Venus\n10. I&amp;#039;m Still Waiting\n\nAnother Moses (RAS, 1999)\n\nRAS prints on the cover of Apple Gabriel&amp;#039;s solo debut the heading &quot;Original Member of Israel Vibration,&quot; in case you were confused (like me) by the name Apple Gabriel being attached to someone looking remarkably like Albert &quot;Apple&quot; Craig.   With the new moniker, Craig fancies himself a new Moses leading listeners to the Promised Land.  Unfortunately, he makes this trek alone, leaving behind the other two members of Israel Vibration to carry on the group&amp;#039;s name.  With his departure, the quality of Israel Vibration&amp;#039;s next album Pay the Piper, dropped noticeably, so was it worth it?  Is Another Moses so great that Craig -- in my opinion, the most unique and entertaining of the group -- had to separate one of the all-time great roots acts?  Did he need this album as an outlet for material he couldn&amp;#039;t put forth on an Israel Vibration album?  To quote Dawn Penn, &quot;No, No, NO!&quot;  Granted, Another Moses is better than Pay the Piper, but neither is as good as most of the stuff the threesome so consistently put out for many years.  I was apprehensive listening to this album, but initially my fears were silenced by the strong opening of Another Moses.  The first 4 tracks -- and especially the first two -- are quite good, featuring Craig&amp;#039;s appealingly froggy voice and typically slow, funky, almost bluesy style, but the drop-off in quality from there on is drastic.  Of the remaining cuts, only &quot;Venus&quot; comes close to this standard.  It seems that Craig is used to writing only 3 or 4 songs per Israel Vibration album, so the rest of the tunes on this album turn out to be filler.  On the other hand, if he was to combine the best 4 or 5 songs from Another Moses with the best 4 or 5 from Pay the Piper, we the fans would be blessed with a decent Israel Vibration album, instead of two sub-par efforts.\n","torrent":{"xt":"urn:btih:3ee437522a27dc0aec41e82074b09469729413d4","amp;dn":"Apple+Gabriel+-+another+Moses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ee437522a27dc0aec41e82074b09469729413d4","infoHashBuffer":{"type":"Buffer","data":[62,228,55,82,42,39,220,10,236,65,232,32,116,176,148,105,114,148,19,212]},"announce":[],"urlList":[]}}