{"title":"Terrorist Takedown Conflict in Mogadishu .","uid":4271281,"size":667051448,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f10a8eefd222f74db00443e09cfd08bc7fc9290&amp;dn=Terrorist+Takedown+Conflict+in+Mogadishu+.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jesminps","files":1,"time":1214949115,"description":"Here is other game released few minutes ago by TiNYiSO. No high requeriments, as usual on TiNYiSO releases, if you like war games and haven?t a fast computer, try this game!\n\nSomalia, 1993: U.S. forces deploy into Mogadishu for Operation Task Force Ranger, and engage in full-scale combat for the first time since the Vietnam war. As member of Army Rangers, the elite special operations force, you?ll engage the fanatical followers of terrorist warlords in a furious battle for control of the city. Fighting shoulder-to-shoulder with fellow squaddies, you may need to call in air support more than once! Prepare for a challenging campaign in which you?ll rescue hostages, hunt down terrorist leaders, hit key enemy facilities, and protect supply convoys from hordes of bandits. Get ready for fast-paced, in-your-face combat - in Mogadishu, the action never stops!\n\n\n\nFeatures:\n\n- 10 Intense Single Player Missions - Lead your squad through the rebel occupied streets of Mogadishu, Somalia on foot and in heavily armed military vehicles, including HMMVVS and Blackhawks\n- 9 Authentic Military Weapons - Includes the M9 Beretta, CAR-15, M16 with M203 Grenade launcher, MG249 SAW, M40A1 Sniper Rifle, Frag Grenade, Shotgun and LAW\n- In Game Mission Map - with waypoints to help players complete mission objective","torrent":{"xt":"urn:btih:3f10a8eefd222f74db00443e09cfd08bc7fc9290","amp;dn":"Terrorist+Takedown+Conflict+in+Mogadishu+.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f10a8eefd222f74db00443e09cfd08bc7fc9290","infoHashBuffer":{"type":"Buffer","data":[63,16,168,238,253,34,47,116,219,0,68,62,9,207,208,139,199,252,146,144]},"announce":[],"urlList":[]}}