{"title":"System of a Down - System of a Down (1998) [FLAC]","uid":3269668,"size":302722218,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f5fe10881ebd213107d601670ea8e7fd8c6d422&amp;dn=System+of+a+Down+-+System+of+a+Down+%281998%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Flaccube","files":17,"time":1104231549,"description":"I recently decided to stop seeding this and all other albums due to the fact that Piratebay users simply don't seed or care about ratios at all. I will make another try in maybe a month from now at best with a new album. I'm sorry, but the only one you can blame is probably yourself.\n\n\n\n\n\nUPDATE: THIS IS THE ONLY RECORD IN THIS CATHEGORY I WILL SEED UNTIL I SEE YOU LEECHERS AT LEAST SHARE A RATIO OF 1:1. REMEMBER IT'S YOUR FAULT!!!!!\n\nSystem of a Down - Self titled.\n\nNow finally in an acceptable format, since mp3s wreck your HiFi equipment here we go in FLAC format\nhttp://flac.sf.net\n\nMP3's belong to the 90's, use FLAC and be happy...\n\nIf you like FLACs and want me to put up more (Got about 300 records in FLAC) please message me or put in the comment section of this torrent. If interest is low I'll simply stop seeding. Expect that I will seed 1 New FLAC record every day. Also please note that you SHOULD if you're able to, rip your own records and follow the FLAC standard of storning things\n\nThat is \n&lt;Artist name&gt; - &lt;Song nr&gt; - &lt;Song title&gt;.flac\nFull Tags are appreciated.\n_______________________________________________\nArtist: System of a Down\nAlbum: System of a Down\nLabel (CAT#): Columbia (COL49209)\nDate: 1998\n\nFile Size: 288mb\nFormat: Flac 1.1.1, -8\nUsed drive  : ASUS    CRW-4816A   Adapter: 1  ID: 1\nRead mode   : Secure with C2, accurate stream, disable cache\nRead offset correction : 12\nOverread into Lead-In and Lead-Out : No\n\nTracklist\n\n01. Suite-Pee\n02. Know\n03. Sugar\n04. Suggestions\n05. Spiders\n06. DDEVIL\n07. Soil\n08. War\n09. Mind\n10. Peephole\n11. CUBErt\n12. Darts\n13. P.L.U.C.K.\n\n\nTotal: 40:41\n\nDescription:\nAt the request of someone I am reseeding this one.  System of a Down's self titled\nalbum.  Nice touch of metal, but with actual discernable lyrics.  I shouldn't really have\nto say much and my brain isn't currently working well enough to think of much. :)\nSorry for the C2 being on, but I assure you this drive doesn't screw up with it on, \nI've had it for years and this CD has since met with certain death.\n\nAMG Review by Stephen Thomas Erlewine\n\nSystem of a Down's self-titled major-label debut finds the Los Angeles band consolidating\nits gothic alt-metal, sharpening its deadly riffs, strengthening its brutal rhythms, and\nadding muscle to its attack. The band differentiates itself from the legions of Southern\nCalifornian alt-metalheads by emphasizing its Armenian musical heritage, which gives the\nmusic an eerie, otherworldly quality. Part of the success of System of a Down lies with\nproducer Rick Rubin, who helps give the band focus, but ultimately the record works\nbecause of the band itself, since they have contributed a set of strong songs that\nillustrates this is a band that relies on smarts as well as sound. \n","torrent":{"xt":"urn:btih:3f5fe10881ebd213107d601670ea8e7fd8c6d422","amp;dn":"System+of+a+Down+-+System+of+a+Down+%281998%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5fe10881ebd213107d601670ea8e7fd8c6d422","infoHashBuffer":{"type":"Buffer","data":[63,95,225,8,129,235,210,19,16,125,96,22,112,234,142,127,216,198,212,34]},"announce":[],"urlList":[]}}