{"title":"Lou Donaldson - The Righteous Reed!: The Best Of Poppa Lou (Blue","uid":4261371,"size":196615709,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3ff1e0a9f0968c950fa3db82c3ac313ebcc65b96&amp;dn=Lou+Donaldson+-+The+Righteous+Reed%21%3A+The+Best+Of+Poppa+Lou+%28Blue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":19,"time":1214496196,"description":"Lou Donaldson has long been an excellent bop altoist influenced by Charlie Parker, but with a more blues-based style of his own. His distinctive tone has been heard in a variety of small-group settings, and he has recorded dozens of worthy and spirited (if somewhat predictable) sets through the years. \n\nDonaldson started playing clarinet when he was 15, soon switching to the alto. He attended college and performed in a Navy band while in the military. Donaldson first gained attention when he moved to New York and in 1952 started recording for Blue Note as a leader. At the age of 25, his style was fully formed, and although it would continue growing in depth through the years, Donaldson had already found his sound. In 1954, he participated in a notable gig with Art Blakey, Clifford Brown, Horace Silver and Tommy Potter that was extensively documented by Blue Note and that directly predated the Jazz Messengers. However, Donaldson was never a member of the Messengers, and although he recorded as a sideman in the 1950s and occasionally afterwards with Thelonious Monk, Milt Jackson and Jimmy Smith, among others, he has been a bandleader from the mid-1950s up until the present. \nDonaldson&amp;#039;s early Blue Note recordings were pure bop. In 1958, he began often utilizing a conga player, and starting in 1961 his bands often had an organist rather than a pianist. Donaldson&amp;#039;s bluesy style was easily transferable to soul-jazz, and he sounded most original in that context. His association with Blue Note (1952-63) was succeeded by some excellent (if now-scarce) sets for Cadet and Argo (1963-66). The altoist returned to Blue Note in 1967 and soon became caught up in the increasingly commercial leanings of the label. For a time, he utilized an electronic Varitone sax, which completely watered down his sound. The success of &quot;Alligator Boogaloo&quot; in 1967 led to a series of less interesting funk recordings that were instantly dated and not worthy of his talent. \n\nHowever, after a few years off records, Lou Donaldson&amp;#039;s artistic return in 1981 and subsequent soul-jazz and hard bop dates for Muse, Timeless and Milestone have found the altoist back in prime form, interacting with organists and pianists alike and showing that his style is quite timeless. (AMG)\n\n\n\n01. Alligator Bogaloo                                            \n02. Rev. Moses                                                   \n03. Peepin&amp;#039;                                                      \n04. Midnight Creeper                                             \n05. Say It Loud - I&amp;#039;m Black And I&amp;#039;m Proud                        \n06. Snake Bone                                                   \n07. Turtle Walk                                                  \n08. Everything I Do Gonh Be Funky (From Now On)                  \n09. Hamp&amp;#039;s Hump                                                  \n10. If There&amp;#039;s Hell Below (We&amp;#039;re All Going To Go)                \n11. Sassy Soul Strut\n\n\n\nLabel: Blue Note/EMI\nReleased: 1994\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:3ff1e0a9f0968c950fa3db82c3ac313ebcc65b96","amp;dn":"Lou+Donaldson+-+The+Righteous+Reed%21%3A+The+Best+Of+Poppa+Lou+%28Blue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff1e0a9f0968c950fa3db82c3ac313ebcc65b96","infoHashBuffer":{"type":"Buffer","data":[63,241,224,169,240,150,140,149,15,163,219,130,195,172,49,62,188,198,91,150]},"announce":[],"urlList":[]}}