{"title":"Dexter.2x07.Spanish.HDTV.DVB.XViD ","uid":4111733,"size":414066688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:40693900ee6e75163cb04cfeca1242f51ba917bd&amp;dn=Dexter.2x07.Spanish.HDTV.DVB.XViD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superdescargas","files":-1,"time":1207091441,"description":"Dexter es un forense especializado en la sangre del Departamento de PolicÃƒÂ­a de Miami. TambiÃƒÂ©n es un fiel novio, un divertido padrastro, un hermano confidente y un friki de la sangre para algunos; pero todo esto no son mÃƒÂ¡s que papeles que, voluntariamente o no, desempeÃƒÂ±a de cara a una sociedad que no le aceptarÃƒÂ­a: Dexter es, y lo sabe, un monstruo, un psicÃƒÂ³pata, un cuerpo sin alma, frÃƒÂ­o, calculador; un asesino en serie. O no. Ãƒ?l disfruta de ello. Como a ÃƒÂ©l le gusta decir es, simplemente, Dexter. Una vez conocemos a Dexter, descubrimos que no hay nada que lo inmute, que perturbe sus sueÃƒÂ±os, ya que ni siquiera los tiene; ni siquiera ningÃƒÂºn sentimiento que no es capaz de poseer: ni el amor hacia su novia o hermana, ni los atroces crÃƒÂ­menes a los que acude en su trabajo, ni sus vÃƒÂ­ctimas. Dexter estÃƒÂ¡ vacÃƒÂ­o, y lo ÃƒÂºnico que alguna vez le ha causado placer es la caza, lo que nadie sabe ni ha sabido excepto su padre, al ÃƒÂºnico al que pudo confiar su secreto desde su infancia. Pero Dexter no es un asesino en serie al uso, ya que si bien comparte motivaciones (el placer de la caza), gracias a su padre adoptivo posee unos principios sÃƒÂ³lidos, cuestionables o no, pero que como solÃƒÂ­a decir aquÃƒÂ©l, Harry Morgan, policÃƒÂ­a, le mantienen vivo.","torrent":{"xt":"urn:btih:40693900ee6e75163cb04cfeca1242f51ba917bd","amp;dn":"Dexter.2x07.Spanish.HDTV.DVB.XViD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40693900ee6e75163cb04cfeca1242f51ba917bd","infoHashBuffer":{"type":"Buffer","data":[64,105,57,0,238,110,117,22,60,176,76,254,202,18,66,245,27,169,23,189]},"announce":[],"urlList":[]}}