{"title":"Marnie (Hitchcock, 1964)","uid":3235946,"size":681069262,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40a3178a0d677626bfb83772e3a4de7e291a7141&amp;dn=Marnie+%28Hitchcock%2C+1964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"testarossa56","files":1,"time":1094121358,"description":"(from IMDB:)\n\nOpinions vary widely on this Hitchcock psychological mystery. &amp;quot;Marnie&amp;quot; has gained appreciators over the years since it was first released, and many viewers have revisited this drama, with enhanced understanding.\n\nAt the center of the procedings is 'Tippi' Hedren, in a most difficult role, which she tries her best to handle. Part of her success and failing may be attributed to an extremely challenging, somewhat uneven script.\n\nThe role stretches Hedren's talent to the limit, and she manages to rise to the occasion for the climactic scene. Her alleged strained relationship with Hitchcock on this production may have actually enhanced her characterization work here (though it may have curtailed her subsequent film work).\n\nHer costar, Sean Connery, didn't let her down, nor did composer Bernard Herrmann (influenced by his &amp;quot;Vertigo&amp;quot; themes).\n\n'Tippi' today seems quite happy promoting animal rights with her Shambala preserve and Roar Foundation and, even though she may still be smarting from her &amp;quot;Marnie&amp;quot; experience.\n\n&amp;quot;Marnie&amp;quot; may always have a smaller audience than some of Hitchcock's more active, less talky films, but for those who appreciate good psychological mystery, they can return to this from time to time with continued intrigue.","torrent":{"xt":"urn:btih:40a3178a0d677626bfb83772e3a4de7e291a7141","amp;dn":"Marnie+%28Hitchcock%2C+1964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a3178a0d677626bfb83772e3a4de7e291a7141","infoHashBuffer":{"type":"Buffer","data":[64,163,23,138,13,103,118,38,191,184,55,114,227,164,222,126,41,26,113,65]},"announce":[],"urlList":[]}}