{"title":"Men in Trees S01E11 - Alte Liebe (German)","uid":4039882,"size":406087680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4127bc3a7b39a8224124ad09d5a46dc51ca69e7a&amp;dn=Men+in+Trees+S01E11+-+Alte+Liebe+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gwodus","files":1,"time":1203620184,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nMarin ist nach New York gereist. Jack ruft sie dort an und gesteht ihr seine Liebe - allerdings muss er mit Marins Mailbox vorliebnehmen, denn Marin selbst hoert das Klingeln des Telefons nicht. Da sie auch ihre Mailbox eine Zeit lang nicht abhoert, weiss sie von Jacks Liebeserklaerung erst einmal nichts. Dennoch entscheidet sie, nach Elmo zurueckzukehren und Jack einzugestehen, dass sie eine Beziehung mit ihm eingehen moechte.\n\nJack erfaehrt von Ben, dass Marin auf dem Weg nach Alaska ist. Voller Vorfreude beeilt er sich, rechtzeitig zum Flughafen zu kommen, um Marin abzuholen. Doch als sich die Tuer des Flugzeugs oeffnet, traut Jack seinen Augen kaum: Vor ihm steht nicht Marin, sondern seine verflossene grosse Liebe Lynn, die ihn vor mehreren Monaten verlassen und ihn damit in eine schwere Krise gestuerzt hatte. Lynn kuendigt an, lediglich ihre Sachen abholen zu wollen, um dann nach Vancouver zurueckzukehren. Ueberrumpelt verlaesst Jack mit Lynn den Flughafen. Wenig spaeter trifft Marin in Elmo ein und macht sich sofort zu Jack auf. Sie ist voellig schockiert, als nicht er, sondern eine fremde Frau ihr die Tuere oeffnet...\n\nUnterdessen verbringen Sam und Jane ein paar wundervolle Tage in New York. Zufaellig treffen sie eine Bekannte von Jane auf der Strasse. Jane ist es peinlich, Sam vorzustellen, da sie glaubt, dass dieser wenig kultivierte Schneepflueger aus der Provinz unter der Wuerde ihrer grossstaedtischen Geschaeftspartner und Freunde sein koennte. Jane besucht anschliessend sogar allein eine Party und verletzt Sam damit noch mehr. Doch waehrend der Feier wird ihr ploetzlich klar, wie unverbindlich und unertraeglich oberflaechlich diese gehobene Gesellschaft ist...","torrent":{"xt":"urn:btih:4127bc3a7b39a8224124ad09d5a46dc51ca69e7a","amp;dn":"Men+in+Trees+S01E11+-+Alte+Liebe+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4127bc3a7b39a8224124ad09d5a46dc51ca69e7a","infoHashBuffer":{"type":"Buffer","data":[65,39,188,58,123,57,168,34,65,36,173,9,213,164,109,197,28,166,158,122]},"announce":[],"urlList":[]}}