{"title":"From Sex to Superconsciousness","uid":4246231,"size":346275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4131a4ca70534c2c897f9803877b754d6a433c0a&amp;dn=From+Sex+to+Superconsciousness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bhupendra","files":-1,"time":1213801463,"description":"Product Description\nThis book says that there is a way to go beyond sex, you can transcend sex. And the route is simple: sex just has to be part of your religious life, it has to be something sacred. Sex has to be something not pornographic, not condemned, not repressed but immensely respected. This book will guide you to this goal. --This text refers to an out of print or unavailable edition of this title. \n\n\nreview-\n\nIn 5 days discourse, Osho delivers a solid foundation, showing that the basis of our obvious compulsion with sex and sexuality is founded in the creation of false taboos and restrictive suppressive frameworks of so called religions conflicting with suggestive marketing and advertising. Osho makes it perfectly clear that our western society is far out of order, and we will be very well served when we open up the dialog about sex and accept and embrace our deep inner longing for love, intimacy and unity. We are invited to begin to utilize sex as a means to persue this true longing and to see that our compulsive fascination with irresponsible pleasure is best replaced with a healthy sacred approach to sexuality. Sex is the bottom rung (perhaps the bottom 10 rungs) on the ladder to the divine, it must be understood, stood upon, over stood, and explored before any higher consciousness can manifest... It is very dangerous and rather pointless to try to jump up and grab the upper rungs of a ladder, when the ladder was intelligently and logically constructed to bear our weight on each rung in sequence...","torrent":{"xt":"urn:btih:4131a4ca70534c2c897f9803877b754d6a433c0a","amp;dn":"From+Sex+to+Superconsciousness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4131a4ca70534c2c897f9803877b754d6a433c0a","infoHashBuffer":{"type":"Buffer","data":[65,49,164,202,112,83,76,44,137,127,152,3,135,123,117,77,106,67,60,10]},"announce":[],"urlList":[]}}