{"title":"detective conan movie 7 -crossroad in the ancient capital","uid":4053444,"size":734053305,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41d5e4d3c9f0307767cd43e97c65ff18efd1bd23&amp;dn=detective+conan+movie+7+-crossroad+in+the+ancient+capital&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xerol","files":1,"time":1204259703,"description":"Heiji Hattori tries to find a girl he saw when he was little. She was playing outside a temple, and he fell in love with her. Several murders have happen in Kyoto, and Kogoro, Ran, Conan and Sonoko goes there to solve the case. There, they meet Heiji and Kazuha. The killer seems to be after Heiji and he tries to kill him several times, and injures Heiji very badly once. Kazuha gets kidnapped, but when Heiji collapses, Conan finds a way to turn back into Shinichi for a short time (He is given a pill by Haibara which will give him the symptoms of a cold, then drinks a bottle of Sake). He disguises himself as Heiji in an attempt to arrest the killer and save Kazuha. But then Heiji comes again, and Shinichi knows that he is changing back. In the woods, he meets Ran and shoots Ran unconscious with his watch to prevent her from seeing him change back into Conan. During that time, Heiji was kendo fighting the guy, but when Kazuha was in trouble, Conan appears and saves her by kicking sticks of fire at the enemies. Conan does another deed when Heiji was falling off the roof, kicked a soccer ball at the enemy and gives Heiji time to come back. In the end, Heiji finds out that the girl he saw and in which he fell in love with, was Kazuha all along when Kazuha sang the song in his memory and admits she was there. Except that Kazuha doesn&amp;#039;t know Heiji saw.","torrent":{"xt":"urn:btih:41d5e4d3c9f0307767cd43e97c65ff18efd1bd23","amp;dn":"detective+conan+movie+7+-crossroad+in+the+ancient+capital","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41d5e4d3c9f0307767cd43e97c65ff18efd1bd23","infoHashBuffer":{"type":"Buffer","data":[65,213,228,211,201,240,48,119,103,205,67,233,124,101,255,24,239,209,189,35]},"announce":[],"urlList":[]}}