{"title":"TweakNOW PowerPack Pro 2.1 Portable","uid":4261022,"size":25276696,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4244d51cdae764b234907a57650bdba53749e7b4&amp;dn=TweakNOW+PowerPack+Pro+2.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":5,"time":1214481156,"description":"TweakNow PowerPack Professional v2.1 plus Portable\n\nNo need to install it!\n\nOr, if you want to, Setup program is included\n  \nTweakNow PowerPack is a fully-integrated suite of utilities that let you fine-tune every aspect of your computer&amp;#039;s operating system and Web browser. The RAM Idle program manages the free memory that is available to run Windows programs. It prevents performance from degrading as you swap files and programs in and out of memory. The AutoShutdown program lets you suspend, hibernate, or shut down your computer after a specified period of time. In addition to saving resources, this program keeps your system more secure by making it unavailable to unauthorized people. The CD AutoRun is an extension of Windows&amp;#039; CD and DVD autorun features, giving you additional options for starting programs or listening to music. The Virtual Desktop program lets you run as many as four custom-designed desktop configurations simultaneously, allowing you to tailor your computer screen to your mood and your work requirements. The suite gives you a complete picture of all aspects of your computer&amp;#039;s hardware, including detailed information about your motherboard, processor, video card, memory, hard disk and network.  \n\nMore Infos at:\n  &lt;a href=&quot;\nhttp://www.tweaknow.com/powerPack.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tweaknow.com/powerPack.html&lt;/a&gt;\n\n\nThis package contains the Setup program and a first Portable version built using RunHiddenConsole.exe to start the Batch file that changes some values in Registry, runs the program and deletes the Registry values when exiting from the program. Some AVs complain with it recognizing RunHiddenConsole.exe as a malicious/potentially harmful program as it can be used to hide malicious behaviours. If it&amp;#039;s your case, or just don&amp;#039;t trust in the first one, use the second version that runs the batch file directly. You will have the sloppy DOS window in the background but less complaints from antiviruses.\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:4244d51cdae764b234907a57650bdba53749e7b4","amp;dn":"TweakNOW+PowerPack+Pro+2.1+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4244d51cdae764b234907a57650bdba53749e7b4","infoHashBuffer":{"type":"Buffer","data":[66,68,213,28,218,231,100,178,52,144,122,87,101,11,219,165,55,73,231,180]},"announce":[],"urlList":[]}}