{"title":"When We Left Earth The NASA Missions Part 2 - HDTV XviD-FQM","uid":4246342,"size":733998660,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:43382efa51233e73e3a4d44734f7a0d52e3b71b6&amp;dn=When+We+Left+Earth+The+NASA+Missions+Part+2+-+HDTV+XviD-FQM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"axxxxe","files":1,"time":1213806143,"description":"The Apollo program is set to achieve the ultimate prize of the Space Race, landing men on the moon. But a fire breaks out in the pressurized capsule of Apollo 1, resulting in the deaths of Gus Grissom, Ed White, and Roger Chaffee. But NASA\\\\\\&amp;#039;s astronauts and engineers turn tragedy into triumph with the first manned launch of the formidable Saturn V rocket, lifting three astronauts into deep space for the first time. Two missions later and NASA is ready to land men on the moon in the ultimate test of America\\\\\\&amp;#039;s spacefaring vision.\n\nNow that NASA has mastered the lunar round trip, they want to explore more of the moon\\\\\\&amp;#039;s mysteries. With Apollo 13, they face their biggest crisis in space -- returning a damaged spacecraft back safely to earth. Undaunted, NASA launches more moon missions and a new lunar rover that allows wide-ranging lunar surface expiditions. Apollo 17 is the longest moon mission and the last time man would set foot on the moon for generations. In a new phase of the space program, NASA converts an unused Saturn V rocket into Skylab, America\\\\\\&amp;#039;s first space-station. But by the time it reaches orbit it\\\\\\&amp;#039;s badly damaged. For the first time, astronauts will have to work outside the spaceship to save the space-station.\n\n","torrent":{"xt":"urn:btih:43382efa51233e73e3a4d44734f7a0d52e3b71b6","amp;dn":"When+We+Left+Earth+The+NASA+Missions+Part+2+-+HDTV+XviD-FQM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43382efa51233e73e3a4d44734f7a0d52e3b71b6","infoHashBuffer":{"type":"Buffer","data":[67,56,46,250,81,35,62,115,227,164,212,71,52,247,160,213,46,59,113,182]},"announce":[],"urlList":[]}}