{"title":"Datel - My Mii Manager - for PC (Connect Wii remote to PC!)","uid":4039931,"size":72772467,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43b0a3dc8632a6c38e686bf93ae7cc5bf8c7030f&amp;dn=Datel+-+My+Mii+Manager+-+for+PC+%28Connect+Wii+remote+to+PC%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kneel23","files":3,"time":1203622347,"description":"NOTE: You must have a USB bluetooth adapter for this software.  I believe any bluetooth will work, even if it is built in, but I have not tested with that,\nbut you will need bluetooth for this to work.  It comes with one when you buy the software but it is just a generic Made-in-China USB bluetooth adapter. So any should work.\n\nWii owners can now personalize their Wii Mii the easy way.\n\nDatel's powerful Mii Manager software lets you edit your Mii on your PC. It's a doddle to use. Just import your Mii into the editor, then edit it until your heart's content. You can even share your Mii with Wii gamers from all over the world over the internet!\n\nMy Mii Manager has everything you need:\n--There's the powerful Mii Manager software application for your PC;\n--Wii-cade games for PC that let you play games on your PC with the Wiimote!\n--Also it comes with Glove Pie, an application that lets you map out the Wiimote or ANY peripheral movements or buttons or keys, etc., to basically &lt;anything&gt; on the computer that you can think of, including MIDI events and such.\nAll in all its pretty damn neat!\n\nEnjoy!\n\nPS:  This _IS_ indeed Datel software and it is called &quot;My Mii Manager&quot; - so ignore the one dumb commenter below who doesn't have a clue.  A picture of the software and box which is what I ripped this ISO from exactly, and description, are here:  &lt;a href=&quot;\nhttp://us.codejunkies.com/Products/Wii-My-Mii-Manager__EF000244.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://us.codejunkies.com/Products/Wii-My-Mii-Manager__EF000244.aspx&lt;/a&gt;","torrent":{"xt":"urn:btih:43b0a3dc8632a6c38e686bf93ae7cc5bf8c7030f","amp;dn":"Datel+-+My+Mii+Manager+-+for+PC+%28Connect+Wii+remote+to+PC%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b0a3dc8632a6c38e686bf93ae7cc5bf8c7030f","infoHashBuffer":{"type":"Buffer","data":[67,176,163,220,134,50,166,195,142,104,107,249,58,231,204,91,248,199,3,15]},"announce":[],"urlList":[]}}