{"title":"Racing Stripes","uid":4259175,"size":1982495682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:44aa98077f3b12adbbb6ec4ed0b11f973e1cd173&amp;dn=Racing+Stripes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"snoodle","files":1,"time":1214384457,"description":"In the middle of a raging thunderstorm, a traveling circus accidentally leaves behind some very precious cargo--a baby zebra. The gangly little foal is rescued by horse farmer Nolan Walsh, who takes him home to his young daughter Channing. Once a champion thoroughbred trainer, Walsh has given up horse training for a quiet life with Channing on their modest Kentucky farm. The little zebra, or &quot;Stripes,&quot; as Channing calls him, is soon introduced to the farm&amp;#039;s misfit troupe of barnyard residents, led by a cranky Shetland Pony named Tucker and Franny, a wise old goat who keeps the family in line. The group is joined by Goose, a deranged big-city pelican who&amp;#039;s hiding out in the sticks until the heat dies down in Jersey. The un-aptly named bloodhound Lightening keeps a lazy eye on goings-on at the farm - in between naps. The Walsh farm borders the Turfway Racetrack, where highly skilled thoroughbreds compete for horse racing&amp;#039;s top honor, the ultra-prestigious Kentucky Crown. From the first moment Stripes lays eyes on the track, he&amp;#039;s hooked--he knows that if he could just get the chance, he could leave all those other horses in the dust. What he doesn&amp;#039;t know is--he&amp;#039;s not exactly a horse. But with characteristic zeal, he devotes himself to training for the big time, with a little help from Tucker, who has coached a host of champion racehorses in the past.  Written by Sujit R. Varma ","torrent":{"xt":"urn:btih:44aa98077f3b12adbbb6ec4ed0b11f973e1cd173","amp;dn":"Racing+Stripes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44aa98077f3b12adbbb6ec4ed0b11f973e1cd173","infoHashBuffer":{"type":"Buffer","data":[68,170,152,7,127,59,18,173,187,182,236,78,208,177,31,151,62,28,209,115]},"announce":[],"urlList":[]}}