{"title":"Battlestar Galactica Season 3 DVD 5/6","uid":4023048,"size":7186208815,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:44c6e84b757ef6371300fce2e029ce2aab8743cf&amp;dn=Battlestar+Galactica+Season+3+DVD+5%2F6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cadame","files":20,"time":1202761397,"description":"BATTLESTAR GALACTICA\n\nSeason 3 || DVD 5 of 6\n\n\nAudio: Spanish [5.1] / English [5.1]\nSubs: Spanish / English / Portuguese\nAspect Ratio: 16*9\nRegion: PAL\n\nDVD9 =&gt; DVD9\nSoftware: DVDFab Decrypter\n\nBattlestar Galactica is a critically acclaimed and award winning re-imagining \nof the original 1970s series of the same name. This new version picks up some \ncharacters and mythological aspects of the original, but differs radically in approach. \nInstead of the original&amp;#039;s family-friendly escapism, this new series is darker, \nusing its concept to reflect a post-9/11 world and made relevant to modern times, \nas well as exploring issues such as the nature of faith and what it means to be human. \nThe show strays from conventional science fiction in that it does not focus on a variety \nof aliens or showcase technical devices or get bogged down by technobabble. \nThe shows takes a more realistic approach in which space is mostly empty, planets \nare not always habitable, things break down, resources are finite, and people are not perfect; \nthe &quot;good guys&quot; are not always heroic and the villians can garner sympathy.\n\nThe series begins 40 years after the end of what&amp;#039;s known as the Cylon War. \nThis war began when humanity, who live in a group of habitable planets called the \nTwelve Colonies, created machines to make easier for them: the Cylons. \nProgrammed to be sentient, they were employed to do things from labour to fighting wars. \nHowever, the Cylons eventually grew to hate their masters, revolting, thus beginning \nthe Cylon War. The conflict ended when the Cylons agreed to leave the Colonies to \nmake a home on another planet. No one had seen or heard from the Cylons in 40 years \nuntil they launched a successful assault on the Colonies that effectively killed all but a few \nthousand who fled their destroyed homes to seek out the legendary world known as Earth. \nHowever, they are constantly being followed by the Cylons. To make matters worse, \nin the time isolated from humanity, the Cylons had developed themselves to appear human. \nThere are 12 specific models, but each has several copies. They took human form in\norder to become closer to God, and base their actions on the belief that humanity was a mistake, \nand that they were themselves created by God (not the Gods that the people of the Colonies worship) \nto take humanity&amp;#039;s rightful place. Led by the battlestar Galactica, the fleet of surviving ships have\n. to evade attacks both from outside as well as inside, both Cylon and even human. \nA few of these humanoid Cylons act as infiltrators to destroy the remainer of humanity, \nsome copies not even aware of their Cylon identity. In order to keep chaos from taking over, \nthe fleet tries to uphold the laws that they were bound to before the attacks, but with their \nextreme situation in mind, certain rules must be bent. Tough decisions must be made that both allow \nthe people their rights and freedom, but also ensure the survival of the human race. \n\n\n--&gt; Crew\n\n? Ronald D. Moore - Developer &amp;  Executive Producer\n? David Eick  - Executive Producer\n? Toni Graphia - Co-Executive Producer\n? Mark Verheiden - Co-Executive Producer \n? Michael Angeli - Co-Executive Producer \n? Michael Taylor - Supervising Producer\n\n\n--&gt; Cast","torrent":{"xt":"urn:btih:44c6e84b757ef6371300fce2e029ce2aab8743cf","amp;dn":"Battlestar+Galactica+Season+3+DVD+5%2F6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44c6e84b757ef6371300fce2e029ce2aab8743cf","infoHashBuffer":{"type":"Buffer","data":[68,198,232,75,117,126,246,55,19,0,252,226,224,41,206,42,171,135,67,207]},"announce":[],"urlList":[]}}