{"title":"Orin Meditations - The Millennium Journeys by Orin - Part 1","uid":4032149,"size":105695582,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:461e0608cfa6480d3b525da1d7c927237ad38ba9&amp;dn=Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SuperManny","files":14,"time":1203224121,"description":"Meditations by Orin and Sanaya Roman\n\nThe Millennium Journeys by Orin\nPart 1:  Increasing Your Inner Light \n &lt;a href=&quot;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm010d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm010d&lt;/a&gt;\n\nProgram 1: Surrounding Yourself With Light--Meet and receive light from the Divine Angels of Love. Surround yourself, your home, and loved ones with light. Bring the gold and white angels into your etheric body for transformation.\n\nProgram 2: Creating an Enlightened Mind--Your thoughts create your reality. Spin old beliefs and thoughts out of your aura, awaken the point of light in the center of your head that links you with the Universal Mind, and continuously experience new, creative, and positive thoughts.\n\nProgram 3: Preparing for Time Changes--An incredible journey into the center of time. Directly experience the \\&quot;new\\&quot; time that is coming. Rewrite your past and create a new future.\n\nProgram 4: Connecting With the Pole Star, Great Bear, Sirius, and Pleiades--Make a triangle of light between the Great Bear, Sirius, and Pleiades, then travel up through this triangle to the Pole star to absorb its light of direction, will, and purpose into your being.\n\nProgram 5: Awakening Soul Vision--Work with a Master of Vision to experience your third eye as a spinning, five pointed star. See your life through the eyes of your soul. Transmit soul vision to assist another in awakening his or her soul vision.\n\nProgram 6: Living as Your Soul--Tap into the light, love, will, power, serenity, and joy of your soul to transform your life.\n\t\nProgram 7: Linking With Lightworkers and Great Ones--Experience the power available to you from your inner link with other lightworkers. Receive transmissions from the Great Ones to assist you in harmonizing with the new light coming.\n\nProgram 8: Working From the Fifth Dimension: Creating New Opportunities--Travel into the fifth dimension. Join with high beings who will work with you to reorganize the essence of your being into a higher pattern. Become light and let all possibilities for your life open up.\n\nProgram 9: Adding Light to Your Chakras--Bring seven rays of light from your soul, \nthe Solar light, and an electrical light from a Master of light into your chakras to increase your inner light.\n\nProgram 10: Spirit Into Matter: Atomic Radiance--Bring light into the atoms of your \nbody to awaken the seed of light within them. Experience these atoms awakening to a new consciousness as you take one of your next evolutionary steps.\n\nProgram 11: Seeing Into the Future--Learn how to see into the future as you make a triangle of light between two points of light above your eyes and your third eye. Realize what actions to take that will put you on your highest path.\n\nProgram 12: Increasing the Light in Your Aura--Work with star energy to enhance your vision, to awaken your inner light, and to draw to yourself the best and highest opportunities. ","torrent":{"xt":"urn:btih:461e0608cfa6480d3b525da1d7c927237ad38ba9","amp;dn":"Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"461e0608cfa6480d3b525da1d7c927237ad38ba9","infoHashBuffer":{"type":"Buffer","data":[70,30,6,8,207,166,72,13,59,82,93,161,215,201,39,35,122,211,139,169]},"announce":[],"urlList":[]}}