{"title":"The Temptations - Cloud Nine + Puzzle People (2LP In 1CD)@320","uid":4045945,"size":187305531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46cd07c1592fcee925c22fa4c108a24ebcfa38a3&amp;dn=The+Temptations+-+Cloud+Nine+%2B+Puzzle+People+%282LP+In+1CD%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":27,"time":1203911301,"description":"Part of Motown&amp;#039;s European remastering series of its classic albums, this single-CD compilation of the two LPs Cloud Nine and Puzzle People runs circles around any existing domestic CD of either title for sound quality. Representing much of the group&amp;#039;s output for the year 1969, the two albums show the group advancing in the face of adversity -- Paul Williams, who had been very much the Temptations&amp;#039; sparkplug in its earlier years, was in declining health, and music was changing around the group, almost faster than a lot of soul artists of the era could keep up with. This remastered collection is a reminder, even better than the Emperors Of Soul box, of precisely how ambitious and urgent the Temptations&amp;#039; music became in response, and how the group and producer Norman Whitfield helped expand and change soul music&amp;#039;s boundaries in the process. \n&quot;Cloud Nine&quot; itself was a Grammy-winning single that introduced Dennis Coffey&amp;#039;s wah-wah pedal guitar to the Temptations&amp;#039; sound, and prominently featured Dennis Edwards, Paul Williams, and Eddie Kendricks on lead vocals; &quot;I Heard It Through the Grapevine&quot; got one of its hardest, busiest renditions; and &quot;Run Away Child, Running Wild&quot; blew out the boundaries of song length to a whopping nine-and-a-half minutes, not a second of it wasted and even working in a brief featured spot for Melvin Franklin&amp;#039;s bass singing. It&amp;#039;s amazing that Berry Gordy failed to see the value of productions like &quot;Run Away Child, Running Wild&quot; without Whitfield&amp;#039;s coaxing, because it&amp;#039;s spellbinding to hear 30-plus years later -- the group does vocal acrobatics around the band&amp;#039;s pounding, surging performance, evolving like a soulful &quot;Bolero.&quot; (It&amp;#039;s also obvious, listening to tracks like this, that without them Marvin Gaye would have had an even harder time getting What&amp;#039;s Goin&amp;#039; On out the door.) From there through the sweeter strains of the gently orchestrated, deeply passionate &quot;Hey Girl,&quot; the surging, poetic lament &quot;Why Did She Have to Leave Me,&quot; and the driving, intense &quot;I Gotta Get a Way,&quot; listeners are treated to some of the best &quot;lost single&quot; tracks in Motown&amp;#039;s late-&amp;#039;60s output. And then there&amp;#039;s &quot;Gonna Keep on Tryin&amp;#039; Till I Win Your Love,&quot; which, on close listening, seems like an intriguing and rewarding semi-rewrite of &quot;I Can&amp;#039;t Help Myself,&quot; utilizing the same beat and a few similar modulations. \nThe tracks from Puzzle People are more intense, beginning with &quot;I Can&amp;#039;t Get Next to You,&quot; another full-throttle workout for all three leads. &quot;Hey Jude,&quot; which opens with a boogie-woogie piano figure before moving into the Temptations&amp;#039; more familiar style, proves that Wilson Pickett didn&amp;#039;t have the last word to say in soul covers of the Beatles hit, although they could have stretched it out another 30 or 40 seconds beyond its length of three minutes and change. The other major cover here, of the Isley Brothers&amp;#039; &quot;It&amp;#039;s Your Thing,&quot; is equally choice for its boldness and power. The group applies its talents most successfully to topical concerns with the pounding, serious &quot;Don&amp;#039;t Let the Jones Get You Down&quot; and &quot;Message From a Black Man,&quot; the latter a conceptual piece complete with narrative passages bookending a poignant lyric. The lyricism here is saved for the later tracks, including &quot;Little Green Apples,&quot; a soft, guitar-dominated ballad, while &quot;You Don&amp;#039;t Love Me No More&quot; is an enjoyably spirited piece and &quot;Since I&amp;#039;ve Lost You&quot; is a sweetly harmonized ballad with restrained orchestration. The only slight disappointment is &quot;Slave,&quot; an extended track that doesn&amp;#039;t do quite enough to justify its length. \nThe two albums are featured in release order on the disc, and the restored sound works wonders, giving the voices real body in the playback and pushing a solid bass sound up front, as well as allowing listeners to hear the resonance off the drum skins, instead of the drums sounding like worn cardboard boxes a room away (the way they do on the old domestic CDs from the 1980s). \nThe only complaint one might have is the lack of content to the enclosed booklet, which should have featured session information and perhaps a historical essay, and instead mostly promotes the other releases in the series. (AMG)\n\n\n\n\n01. Cloud Nine                                                                                                          \n02. I Heard It Through The Grapevine                                                                                    \n03. Runaway Child, Running Wild (Edit)                                                                                  \n04. Love Is A Hurtin&amp;#039; Thing                                                                                             \n05. Hey Girl                                                                                                            \n06. Why Did She Leave Me (Why Did She Have To Go)                                                                       \n07. I Need Your Lovin&amp;#039;                                                                                                  \n08. Don&amp;#039;t Let Him Take Your Love From Me                                                                                \n09. I Gotta Find A Way (To Get You Back)                                                                                \n10. Gonna Keep On Tryin&amp;#039; Till I Win Your Love                                                                           \n11. I Can&amp;#039;t Get Next To You                                                                                             \n12. Hey Jude                                                                                                            \n13. Don&amp;#039;t Let The Joneses Get You Down                                                                                  \n14. Message From A Black Man                                                                                            \n15. It&amp;#039;s Your Thang                                                                                                     \n16. Little Green Apples                                                                                                 \n17. You Don&amp;#039;t Love Me No More                                                                                           \n18. Since I&amp;#039;ve Lost You                                                                                                 \n19. Running Away (Ain&amp;#039;t Gonna Help You)                                                                                 \n20. That&amp;#039;s The Way Love Is                                                                                              \n21. Slave \n\n\nLabel: Motown\nDate: 1986\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share\t","torrent":{"xt":"urn:btih:46cd07c1592fcee925c22fa4c108a24ebcfa38a3","amp;dn":"The+Temptations+-+Cloud+Nine+%2B+Puzzle+People+%282LP+In+1CD%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46cd07c1592fcee925c22fa4c108a24ebcfa38a3","infoHashBuffer":{"type":"Buffer","data":[70,205,7,193,89,47,206,233,37,194,47,164,193,8,162,78,188,250,56,163]},"announce":[],"urlList":[]}}