{"title":"Big Ass Emulator Disk 3a xbox1","uid":4164322,"size":3779854336,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:475325e05095e4165c38316631eb88ce8fdded46&amp;dn=Big+Ass+Emulator+Disk+3a+xbox1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jameshmtd","files":1,"time":1209530957,"description":"It took a while, but BAED3 is here. I went through the entire MAME\nset to pick out the non-working games and lame porno games. I may\nhave made a mistake or two, and there are also cases of non-working\nparent ROMs having to stay on the disc to enable their working clones to\nfunction, but I think it&amp;#039;s safe to say that 99% of the games on the MAME\ndisc work. After pulling all those out, I was left with about 6GB.\nFrom that, I took out all the CPS1/2/Neo Geo stuff and was left with 3.4GB.\nThat&amp;#039;s Disc A.\n\n\n\n\nDisc B is FBA-XXX, which is the CPS1/2/Neo Geo stuff, including the newer\n&quot;banned&quot; ROMs that aren&amp;#039;t in the regular MAME set, like Metal Slug 5 and King of\nFighters 2003. Unlike the MAME disc, I didn&amp;#039;t go through the games on here\nwith a fine-toothed comb, so there may be some games that don&amp;#039;t work on the\nFBA-XXX disc. All the files on here have been verified with a ROM auditing\ntool, though, so hopefully there should be very few games that don&amp;#039;t work. I\ndid successfully test (test = goof around and play) the majority of the\nmost popular games.\n\n\n\nArcade ROMs use the old 8+3 naming convention, so that means that both\ndiscs of BAED3 can be easily put on your Xbox hard drive as-is, unlike\nBAED1 and 2, which required extensive renaming.\n\n\n\nQuick Instructions:\n\nDisc A (MAME):\n\nThe first time you use it, it automatically will scan the disc for ROM files\nand place that list into a gamesave file so it doesn&amp;#039;t have to be done again.\nAfter this, you&amp;#039;ll have your list of games. Press A to launch a game. It&amp;#039;ll\nask you to type OK to indicate you legally own the game. Just push the left\nanalog stick Left, then Right, to do this.\nTo &quot;insert a coin&quot; press Back.\nTo pause your game, press Back+Black at the same time.\nTo exit from a game back to the menu, press Back+Start at the same time.\nFor other configuration options and details, see Help section in the game and\nexplore the options and mess around.\n\n\n\nDisc B (FBA-XXX)\n\nThe games here are split into different menus by system. You&amp;#039;ve got CPS1, CPS2,\nNeo-Geo, and Other. To cycle between the different menus, press the triggers.\nLike in MAME, you press A to launch the game and Back to insert a coin. Unlike\nMAME, you don&amp;#039;t have to &quot;type OK.&quot; When playing, press the right control stick\nin like a button to pause the game and bring up a menu that will allow you to\nchange a lot of options, and also exit back to the game menu.","torrent":{"xt":"urn:btih:475325e05095e4165c38316631eb88ce8fdded46","amp;dn":"Big+Ass+Emulator+Disk+3a+xbox1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475325e05095e4165c38316631eb88ce8fdded46","infoHashBuffer":{"type":"Buffer","data":[71,83,37,224,80,149,228,22,92,56,49,102,49,235,136,206,143,221,237,70]},"announce":[],"urlList":[]}}