{"title":"SCUM - [ENG][1979] - LIBRE &amp; VERITAS","uid":4112435,"size":944066560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:480becd52fcf00c8b30e7505bca397becc9bf1e8&amp;dn=SCUM+-+%5BENG%5D%5B1979%5D+-+LIBRE+%26+VERITAS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Libre_Veritas","files":1,"time":1207134262,"description":"Scum is a film made in 1979 portraying the brutality of life inside a British borstal. Directed by Alan Clarke and starring Ray Winstone, Mick Ford, Julian Firth, John Blundell, Phil Daniels and Ray Burdis, it tells the story of a young offender named Carlin as he arrives at the institution, and his rise through violence and self-protection to the top of the inmates&amp;#039; pecking order, purely as a tool to survive. Beyond Carlin&amp;#039;s individual storyline, it is also cast as an indictment of the borstal system&amp;#039;s flaws in terms of its ineffectiveness at rehabilitating inmates, instead just turning them into even more broken individuals.\n\nThe film caused much controversy when first shown. Some felt it should be banned, while others felt that it should be required viewing. The film is violent, with a vicious male rape scene (the victim is a minor) that leads to the suicide of the victim. It features two suicides in total, many fights which are not short on realism and a large amount of racism and colourful language. The warders and convicts alike are brutalised by the system. There is no attempt at rehabilitation; the inmates are simply left to their own devices.\n\nThe story was originally made for the BBC&amp;#039;s Play for Today strand in 1977 but was not shown at the time, although the BBC version has been broadcast since. Two years later director Alan Clarke and scriptwriter Roy Minton remade it as a film, which was then shown on Channel 4 in 1983, by which time the borstal system had been abolished (the British public morality campaigner Mary Whitehouse initially won her court case against Channel 4 for showing the film, but Channel 4 later won on appeal). The original BBC production differed slightly from the remade one. Aside from one or two differences in the cast (Mick Ford and Julian Firth did not play their major supporting roles in the 1977 play, for example - these parts were played by David Threlfall and Martin Philips), the main difference was in a homosexual relationship between Carlin and another inmate, which was in the BBC version but dropped from the later film. Minton later said that this was a pity because it would have expanded Carlin&amp;#039;s character and made him vulnerable in an area where he could not afford to be vulnerable.\n\nFortunately, when a special DVD re-release of the film was made in 2005, the BBC original version was added onto the disc as a bonus, allowing viewers to compare the two versions in terms of content, cast and production.\n\nRay Winstone subsequently became one of the UK&amp;#039;s most in-demand actors, even though he had been kicked out of drama school at the time of the Scum auditions and had only gone along to accompany a friend. When Clarke saw Winstone, he cast him as Carlin on the spot because he liked the way he walked. The original intention had been to characterise Carlin as a Glaswegian. The likes of Mick Ford, Julian Firth, Phil Daniels, Ray Burdis, Patrick Murray, Alan Igbon and Andrew Paul all became familiar faces in British television and film after their youthful appearances in Scum.","torrent":{"xt":"urn:btih:480becd52fcf00c8b30e7505bca397becc9bf1e8","amp;dn":"SCUM+-+%5BENG%5D%5B1979%5D+-+LIBRE+%26+VERITAS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"480becd52fcf00c8b30e7505bca397becc9bf1e8","infoHashBuffer":{"type":"Buffer","data":[72,11,236,213,47,207,0,200,179,14,117,5,188,163,151,190,204,155,241,232]},"announce":[],"urlList":[]}}