{"title":"The Clash - The Rat Patrol From Ft. Bragg","uid":4037090,"size":470976602,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48d70028078e51a5a9eb86553b25d28562dc4342&amp;dn=The+Clash+-+The+Rat+Patrol+From+Ft.+Bragg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Simmdale","files":24,"time":1203485193,"description":"Ok... Hi folks. This is my first upload here at The Pirate Bay. Acknowledged as one of the top three obtainable bootlegs from The Clash, this is the unreleased original version of the &amp;#039;Combat Rock&amp;#039; album as produced by Mick Jones in 1981. \nIn early 2002, this CD-R boot first surfaced with a previously different track order along with the newly discovered instrumental track titled &quot;Walk Evil Talk&quot;, although most all of these tracks had been much traded in bootleg circles long before. By far, these tracks are in their absolute best sound quality here and much improved over all of the previously traded sources. \nAnd, this is the second version of this boot which had edited corrections applied to mistracking errors on a song from the first version batch of this bootleg that surfaced. And now, this new version torrent here is incorporating further improved sound quality on the edited track (there still was quite a noticeable sound volume level drop present which I addressed), noise/pop error removal in several places throughout the disc and including &quot;corrected&quot; artwork as well. I also titled all of the tracks themselves from just &quot;Track1, Track2, etc.&quot; as they were titled on the SHN files and I just went with FLAC instead of SHN after I finished working on them simply because it appears that is the more popular format now. I think all that might have an interest in this will be extremely pleased. Enjoy...\n\nThe Clash\nThe Rat Patrol From Fort Bragg\n\nBootleg CD-R (version 2 with edited track repairs) &gt; Trade &gt; \nCD-R &gt; EAC (Secure with Offset Correction) &gt; WAV &gt; SHN &gt; \nZomb &gt; WAV &gt; FLAC (level 8, align on sector boundaries)\n\nThanks to BrockDenker for this original upload on Zomb.\n\nNew version incorporating further improved sound quality and fully corrected \nartwork rendered by Simmdale during February 2008.\n\n And now, this new version torrent here is incorporating further improved sound quality on the edited track (there still was quite a noticeable sound volume level drop present which I addressed), noise/pop error removal in several places throughout the disc and including &quot;fully corrected&quot; artwork as well. I also properly titled all of the tracks themselves from just  &quot;Track1, Track2, etc.&quot; as they were titled on the SHN files and I just went with FLAC instead of SHN after I finished working on them simply because it appears that is the more popular format now. - Simmdale February 2008\n\n\nTracklist:\n\n01 The Beautiful People Are Ugly Too  3:44.69\n02 Kill Time  4:58.12\n03 Should I Stay Or Should I Go?  3:05.00\n04 Rock The Casbah  3:47.04\n05 Know Your Rights  5:05.00\n06 Red Angel Dragnet  5:12.05\n07 Ghetto Defendant  6:17.47\n08 Sean Flynn  7:30.24\n09 Car Jamming  3:53.38\n10 Inoculated City  4:32.71\n11 Death Is A Star  2:38.64\n12 Walk Evil Talk  7:37.32\n13 Atom Tan (Edited)  2:44.61\n14 Inoculated City (Uncensored &amp;#039;Combat Rock&amp;#039; Version)  2:30.44\n15 First Night Back In London  2:56.56\n16 Cool Confusion  3:10.24\n17 Straight To Hell  6:54.65\n\nTotal Disc Time: 76:40.16\n\n\nSummary\n\nTitle: &amp;#039;The Rat Patrol From Ft. Bragg&amp;#039;\n\nType: Studio outtakes\n\nFormat: CD\n\nDiscs: One\n\nDate(s): This album mix dates from mid to late 1981\n\nVenue(s): n/a\n\nLineup: Joe Strummer (Vocals, guitar) \nMick Jones (Guitar, vocals) \nPaul Simonon (Bass, vocals)\nTopper Headon (Drums)\n\nArtwork: Included \n\nSound quality: Excellent sound quality throughout\n\nRated: 10/10\n \n\nInfo\nThis is the unreleased original version of the &amp;#039;Combat Rock&amp;#039; album as produced by Mick Jones in 1981. In early 2002, this CD-R boot came out with a previously different track order along with the then newly discovered instrumental track titled &quot;Walk Evil Talk&quot;, although most all of these tracks had been much traded in bootleg circles long before. This replaced another boot CD-R known as &amp;#039;Combat Out Rock.&amp;#039; By far, these tracks are in their best sound quality here and much improved over all of the previously traded sources. And, this is the second version of this boot which had edited corrections applied to mistracking errors on a song from the first version batch of this bootleg that surfaced.\n\n\nReview\nThis was intended to be a double album entitled &amp;#039;The Rat Patrol From Ft. Bragg&amp;#039;. The rest of the band dismissed it, and called in producer Glyn Johns to cut it down to size for a single LP. All songs became shorter, and a lot tighter, with more pronounced vocals, a much &amp;#039;tighter&amp;#039; mix musically, and less vague sound effects and extended rapping. Also, four tracks (&quot;Cool Confusion&quot;, &quot;First Night Back In London&quot;, &quot;The Beautiful People Are Ugly Also&quot; and &quot;Kill Time&quot;) were cut. Overall, all the songs sound very similar to each other, with a significant emphasise on studio sound effects. The whole thing also has a &amp;#039;darker&amp;#039; sound to it. Track 7 from &amp;#039;Combat Rock&amp;#039;, &quot;Overpowered By Funk&quot;, is not present here and was apparently added to &amp;#039;Combat Rock&amp;#039; at the last minute (an instrumental version exists on &amp;#039;Clash On Broadway Outtakes&amp;#039; and an extended remix is on &amp;#039;Golden Bullets&amp;#039;). Each song varies in some way to the official ones on &amp;#039;Combat Rock&amp;#039;, so here is a track by track review:\n\nThe Beautiful People Are Ugly Too\nA great song, and it&amp;#039;s good to have it here with very good sound quality. I especially like the tune to this song, it&amp;#039;s very catchy, and Joe and Mick&amp;#039;s singing on it works very well. In keeping with the style of the rest of the album, there are the familiar sound effects. This was also known as &quot;Fulham Connection W11&quot;, and has also been known as &quot;Man In A Box.&quot; \n\nKill Time\nAgain, a great song. Very reggae styled (true to Clash form). Also, excellent sound quality which is very welcome from an unreleased studio track. Good to have a complete version of it as well, as it appears on &amp;#039;Pier Pressure&amp;#039; but is cut short and misses out a drumbeat or two in the intro and is missing quite a bit near the end. The &amp;#039;Pier Pressure&amp;#039; version also uses a vinyl as its source, whereas this does not. Sometimes known as &quot;(Licence To) Kill Time&quot; and &quot;Idle In The Kangaroo Court&quot; which was the song&amp;#039;s working title.\n\nShould I Stay Or Should I Go\nLots of Spanish dialogue at times, along with extra vocals, possibly just Mick&amp;#039;s dubbed over twice. Also some extra vocals from Joe it sounds like. Extended, and with extra instrumentation, including brass?\n\nRock The Casbah\nDifferent intro, then once it kicks in it is very similar to the official album version. There&amp;#039;s extra sound effects in places and it&amp;#039;s also maybe a touch slower.\n\nKnow Your Rights\nThis is a basic but extended version, and seems to be a bit slower. Joe is talking rather than singing and the lyrics are different in places. &quot;Know Your Rights&quot; has a few incarnations besides the official one. This being one, and another one is on &amp;#039;Clash On Broadway Outtakes.&amp;#039; This is a good version of the song, and in ways works better, with the message of the song being delivered more effectively by Joe&amp;#039;s voice.\n\nRed Angel Dragnet\nPaul&amp;#039;s vocals seem a bit more present in the song as the volume of the music is lower. Some instrumentation found in the offical version is increased in volume a little - such as the electronic organ effect. Also, there is some faint talking in the background, possibly Joe? There are also extra background vocals from Joe and Mick. Towards the end, there are extra lyrics, as this is an extended version.\n\nGhetto Defendant\nAllen Ginsberg&amp;#039;s lead vocals are different at times, and sometimes appear in a different place to where they do in the official version. There is extra instrumentation. Joe&amp;#039;s singing is also very different. The lyrics in the song are different, and this is an extended version. It also fades off quite nicely at the end.\n\nSean Flynn\nA different, and quite spooky, intro to this song, then it kicks in as normal. The sound quality throughout this song varies a bit - there is the odd drop out (fixed on this version). Some instrumentation is more pronounced and there are extra sound effects. An extended version but on the whole very similar to the official one. This is a welcome track - &quot;Sean Flynn&quot; is an excellent song and this version lasts nearly 8 minutes. \n\nCar Jamming\nAgain, this is a more basic version but is very similar to the official one. There are extra sound effects in places and it&amp;#039;s extended.\n\nInoculated City\nA more pronounced opening that works well. An extended version, with extra vocals that again just sounds like Mick&amp;#039;s dubbed on twice. In this song in particular there are studio sound effects not found in the official version. The toilet cleaner ad - &amp;#039;2000 Flushes&amp;#039; - (with the American housewife) is a bit longer too. This is a better version of this song (the official one is too short really) and the extended playing is welcome. There&amp;#039;s also faint voices, chatter and laughing in the background at times, which get louder as the song nears its end.\n\nDeath Is A Star\nVery similar to the official version, just some extra lyrics and talking in places. It&amp;#039;s clever how, as in the official version as well, Mick and Joe&amp;#039;s voices unnoticeably blend into each other at the beginning and throughout.\n\nWalk Evil Talk\nThe newly discovered instrumental track, quite spooky sounding really, with piano and strange percussion.\n\nAtom Tan\nSeems a touch slower, and has slightly different lyrics in places but otherwise is very similar to the official version.\n\nInoculated City (Uncensored &amp;#039;Combat Rock&amp;#039; Version)\nThe exact &quot;Combat Rock&amp;#039; version with the &quot;2000 Flushes&quot; commercial that was removed from the official release after the very first pressings (more info below).\n\nFirst Night Back In London\n this is almost exactly the same as the official version and appears on &amp;#039;Super Black Market Clash.&amp;#039; It&amp;#039;s obvious this song came from this mix, with the big emphasis on sound effects and that particular drumming sound and style.\n\nCool Confusion\nAs with &quot;First Night Back In London&quot;, about the same as the version on &amp;#039;Super Black Market Clash&amp;#039; and &amp;#039;Clash On Broadway&amp;#039; but a great alternate mix of this song can be found on the &amp;#039;D.O.A.&amp;#039; compilation. Here it cuts off a second or so too soon though. This song is mostly made up of sound effects and strange, but effective vocals.\n\nStraight To Hell\nThis is the same as the official unedited version found on &amp;#039;Clash On Broadway.&amp;#039; An extended mix, but with a slightly slightly altered drum effect, that fades away nicely at the end.\n\n\nExtra\nThe quality of some of the tracks is truly excellent. These songs are interesting alternatives and make an enjoyable listen. Of course, extended versions are welcome for some of these classic Clash songs. It&amp;#039;s a great shame that true official releases of &quot;The Beautiful People Are Ugly Too&quot; and &quot;Kill Time&quot; haven&amp;#039;t appeared. They should have made it onto the &amp;#039;Clash On Broadway&amp;#039; boxset (the &quot;Straight To Hell&quot; unedited version is there) in favour of material that was already available anyway. Other unreleased tracks made it (such as &quot;One Emotion&quot;) so why not these? If not then, they should almost certainly have made it onto &amp;#039;Super Black Market Clash&amp;#039;, along with &quot;Cool Confusion and &quot;First Night Back In London&quot; from these very same mixes. As mentioned throughout, all the songs are extended versions. And mostly, it&amp;#039;s just the last verse which has been cut out in the official versions on &amp;#039;Combat Rock.&amp;#039; They also seem to be a bit slower as well, but only a touch, and that may have something to do with the mix of the song that just affects how fast it seems to go, and not simply faster playing. Or perhaps for &amp;#039;Combat Rock&amp;#039; the tapes were speeded up slightly?  I think that&amp;#039;s highly unlikely though.\n\n-------------------------------------------------------------------------------\n\nThe above review was basically cribbed from a wonderful site maintianed by Robin Sharrock for the &amp;#039;Combat Out Rock&amp;#039; release. Below is the review, also from the same site for this &quot;exact&quot; release. Much thanks to Robin for the excellent site, and I hope my use here is allowed. Here is the link: http://cap.vapor.com/Frontier/sharoma.com/clash/index.htm#index\n\n-------------------------------------------------------------------------------\n\nReview\nFirst off, enormous thanks from myself and the rest of the Clash loving community to Bill Plenge, aka the Equaliser, for getting this item into circulation. Without doubt, it is the best Clash find of recent years. Essentially an upgrade for &amp;#039;Combat Out Rock&amp;#039;, this comes from a much cleaner source, apparently a tape that was floating around an RCA office back in the early 1980s. Needless to say, it is a joy to listen to. The opening two numbers sounding superb in almost faultless audio quality. Crystal clear in fact. So much so, that if you are curious about the lyrics to these songs, or you&amp;#039;re just after a laugh, you should attempt to transcribe them. \nThe quality in general is an improvement for every track on &amp;#039;Combat Out Rock&amp;#039;, with the first two being the most noticeable. A few of the songs sound as they did in the previous collection but I think on the whole the sound quality is a lot better. You can certainly hear more instrumentation and even extra vocals in parts. The versions are the same, with the exception of the extra track &quot;Walk Evil Talk&quot;, and the extra version of &quot;Inoculated City&quot;, and also the &quot;Atom Tan&quot; incident.\nSo what of this new song? You&amp;#039;re probably dying to hear it if you haven&amp;#039;t already. Apparently a leftover from the &amp;#039;Sandinista!&amp;#039; sessions (you&amp;#039;d never guess that huh?) it&amp;#039;s an ambling seven minute affair much in the style of other dub induced classics such as &quot;Shepherds Delight&quot; and &quot;If Music Could Talk.&quot; It has a more up tempo style, with piano, and at times sounds like the soundtrack to a Western. It&amp;#039;s percussion led, leading me to suspect Mick and Topper were in the studio jamming when it came about. The song threatens and threatens to get going with bursts of drumming from Topper (by the way it has been confirmed that Tops is the drummer on this CD). Aside from some excellent drumming (the sound quality really shows it off) there&amp;#039;s just the piano, so the song doesn&amp;#039;t suffocate you with sound like some instrumentals can. The song reminds me a bit of &quot;Trojans&quot;, an instrumental by The Damned that appeard on &amp;#039;Phantasmagoria&amp;#039;, though that suffered from added saxophone. Thankfully, there&amp;#039;s nothing to muddy the mix in &quot;Walk Evil Talk.&quot; A very moody song, the music speaks for itself. On the whole, I&amp;#039;d say it&amp;#039;s very good. As for its origins, I doubt it&amp;#039;s an offspring of the &amp;#039;Sandinista!&amp;#039; sessions. Its sound is in keeping with the rest of the album. It fits very well here. As mentioned in the &amp;#039;Combat Out Rock&amp;#039; review, they wanted the album to fit on two sides of vinyl, not four. So there was obviously no room for an apparently aimless 7 minute instrumental.\nThe &quot;Atom Tan&quot; edit suffers a dip in quality nearing the two minute mark, with the left channel seeming to drop out a bit. It picks up after 30 seconds or so as the song dies away. This is what I addressed to repair somewhat on this torrent version.\nPerhaps the &quot;Inoculated City&quot; debacle needs some explaining. It all relates to a lesser known advert known as the &quot;2000 Flushes&quot; commerical. Where better to seek explanation than Satch&amp;#039;s boards? Adam Headland explains:\n&quot;2000 Flushes was something you put in your toilet to ostensibly keep it clean. The ad clip was actually on the first released copies of &amp;#039;Combat Rock&amp;#039;, but the company threatened legal action, so they had to remove the it. I guess they figured being associated with the Clash would &amp;#039;soil&amp;#039; their image!&quot;\n\n...Ludwig adds:\n&quot;(Actually, I think 2000 flushes is also on the LAST editions of Combat Rock ... on mine it is ... I always thought it was a kind of news report ... but I prefer the version without it that I had encoded first from the Mediatheque)&quot;\n\nAdam:\n\n&quot;It was on the very first releases, taken off for the remainder of the LPs, and restored on the reissues- I guess the 2000 Flushes company was no longer a going concern by then.&quot;\n\nPersonally, I have Combat Rock&amp;#039; LP from 1982 and the commercial excerpt is on it. I then noticed it wasn&amp;#039;t on the 1986 CD reissue. Now of course it&amp;#039;s back on the remasters thankfully. Anyway, the extended version has it.\n\nBack to the review... &quot;Cool Confusion&quot; (not the version with the drums which you can find on Adam&amp;#039;s superb &amp;#039;DOA&amp;#039; collection seems to me to be the best version of the non-drum versions. Even superior to the &amp;#039;Super Black Market Clash&amp;#039; mix. I&amp;#039;m a fan of this song, so all you &quot;Cool Confusion&quot; haters can go take a running jump... lol.\nAs I stated in the COR review, the extended intro to &quot;Sean Flynn&quot; is the spookiest bit of playing you&amp;#039;ll ever hear. Sheer class. This album is certainly superior to &amp;#039;Combat Rock.&amp;#039; Far more interesting and diverse, and this improved sound quality makes it a must-have item for any Clash fan. A great listen, and the first two tracks are true unreleased gems.","torrent":{"xt":"urn:btih:48d70028078e51a5a9eb86553b25d28562dc4342","amp;dn":"The+Clash+-+The+Rat+Patrol+From+Ft.+Bragg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48d70028078e51a5a9eb86553b25d28562dc4342","infoHashBuffer":{"type":"Buffer","data":[72,215,0,40,7,142,81,165,169,235,134,85,59,37,210,133,98,220,67,66]},"announce":[],"urlList":[]}}