{"title":"Thai-Dragon.DVD.XviD.MP3[Oskar]","uid":4037273,"size":28387,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:498a22bedb71055c59b79c98453b3e048b2145cb&amp;dn=Thai-Dragon.DVD.XviD.MP3%5BOskar%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oskarlog","files":1,"time":1203500547,"description":"THAI-DRAGON\n(Tom-yum-goong)\n\nDirecciÃƒÂ³n: Prachya Pinkaew.\nPaÃƒÂ­s: Tailandia.\nAÃƒÂ±o: 2005.\nDuraciÃƒÂ³n: 109 min.\nGÃƒÂ©nero: AcciÃƒÂ³n, artes marciales.\nInterpretaciÃƒÂ³n: Tony Jaa (Kham), Mum Jokmok (Mark), Bongkuch Kongmalai (Pla), Amonphan Gongtragan (Goong), Jing Xing (Madame Rose), Johnny Nguyen (Johnny), Nathan Jones (TK), David Asavanond (Oficial Rick), Jon Foo (Luchador), Lateef Crowder (Luchador).\nGuiÃƒÂ³n: Napalee Piyaros Thongdee, Joe Wannapin y Kongdej Jaturanrasamee; basado en un argumento de Prachya Pinkaew.\nProducciÃƒÂ³n: Prachya Pinkaew y Sukanya Wongsathapat.\nMÃƒÂºsica: Zomkiat Ariyachaipanich y Sasis Millindavanij.\nFotografÃƒÂ­a: Nathawut Kittikun.\nMontaje: Marut Seelacharoen.\nDirecciÃƒÂ³n artÃƒÂ­stica: Ukkadej Kaewkot.\nVestuario: Ekkaphume Nganchamung.\nEstreno en Tailandia: 11 Agosto 2005.\nEstreno en EspaÃƒÂ±a: 10 Marzo 2006.\n\n\nSINOPSIS\n\nKham (Tony Jaa) es un muchacho de campo cuya vida experimenta un vuelco cuando la mafia internacional irrumpe en su adormecida villa para apoderarse de sus dos magnÃƒÂ­ficos elefantes y llevÃƒÂ¡rselos a Australia. No se trata de unos paquidermos cualquiera. Son enormes, majestuosos, pen-sados para ser ofrecidos a Su Majestad el Rey como prueba de de-vociÃƒÂ³n: son los elefantes de Kham. Ãƒ?ste no tendrÃƒÂ¡ otro remedio: deberÃƒÂ¡ partir hacia Australia pues no puede permitir que nadie se apodere de sus adorados elefantes. TendrÃƒÂ¡ que penetrar en el cora-zÃƒÂ³n del distrito controlado por la mafia y seguir la pista de los rap-tores hasta conseguir que los paquidermos vuelvan con ÃƒÂ©l a casa. Sin embargo, la empresa serÃƒÂ¡ cualquier cosa menos fÃƒÂ¡cil. Incluso con la ayuda del sargento Mark (Mum Jokmok), un oficial de policÃƒÂ­a tailandÃƒÂ©s que trabaja para la policÃƒÂ­a australiana, ademÃƒÂ¡s de la de Pla (Bongkuch Kongmalai), una chica tailandesa forzada a ejercer la prostituciÃƒÂ³n, y la de Rick (David Asavanond), el compaÃƒÂ±ero del sargento Mark tan estricto con las normas, todavÃƒÂ­a se evidencia una incursiÃƒÂ³n extremadamente arriesgada. El caso es que puede que Kham vaya tras la mafia, pero la mafia tambiÃƒÂ©n va tras ÃƒÂ©l. La dirige la frÃƒÂ­a y despiadada Madame Rose (Jin Xing) quien envÃƒÂ­a a sus dos guerreros mÃƒÂ¡s poderosos, Johnny (Johnny Nguyen) y TK (Nathan Jones) tras Kham en el intento de detener a ÃƒÂ©ste en su im-placable bÃƒÂºsqueda. Es en este momento en el que tiene comienzo la autÃƒÂ©ntica batalla. La lucha por los elefantes se evidencia una in-tensa prueba de coraje y capacidad resolutiva por parte de Kham. El poder y esplendor del antiguo Muay Thai brilla en toda su pleni-tud cuando Kham se concentra en los movimientos basados en la naturaleza y, de modo mÃƒÂ¡s especÃƒÂ­fico, en el propio elefante.\n\n","torrent":{"xt":"urn:btih:498a22bedb71055c59b79c98453b3e048b2145cb","amp;dn":"Thai-Dragon.DVD.XviD.MP3%5BOskar%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"498a22bedb71055c59b79c98453b3e048b2145cb","infoHashBuffer":{"type":"Buffer","data":[73,138,34,190,219,113,5,92,89,183,156,152,69,59,62,4,139,33,69,203]},"announce":[],"urlList":[]}}