{"title":"Harry Enfields Television Program S01 E02 (English)","uid":4160689,"size":244739459,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:49bb7eba62ba611110b038ed7738cb477ffa355b&amp;dn=Harry+Enfields+Television+Program+S01+E02+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"scruffsshop","files":4,"time":1209360166,"description":"From IMDB:\n\nIt seems like only yesterday that Harry Enfield was the brightest comedy star on British television. His appearances on &amp;#039;Saturday Live&amp;#039; ( as &amp;#039;Stavros&amp;#039; and &amp;#039;Loadsamoney&amp;#039; ) and &amp;#039;Filthy, Rich &amp; Catflap&amp;#039;, as well as the brilliant &amp;#039;Norbert Smith - A Life?&amp;#039; seemed to confirm him as the natural successor to the great Peter Sellers. In 1990, he departed Channel 4 for the B.B.C.\n\n&amp;#039;Programme&amp;#039; was a traditional sketch show in which he played characters as diverse as the revolting &amp;#039;Wayne Slob&amp;#039;, the toothy &amp;#039;Tim Nice-But-Dim&amp;#039;, the irritating pensioner &amp;#039;Mr.Don&amp;#039;t Want To Do It Like That&amp;#039;, the &amp;#039;40&amp;#039;s public information film presenter Mr.Grayson, the over-excited &amp;#039;Little Brother&amp;#039;, the Alan Freeman-inspired D.J. &amp;#039;Dave Nice&amp;#039; ( Freeman could not have been offended. He later guested on the show ) and of course, one half of the decrepit and senile Old Gits.\n\nWithin weeks of its debut, the show&amp;#039;s catchphrases were being repeated in schools and workplaces all around the country. All of the characters had some small grain of truth to them; haven&amp;#039;t we all encountered someone as ghastly as &amp;#039;Don&amp;#039;t&amp;#039; at one time or another? Some fared less well than others; &amp;#039;The Double Take Brothers&amp;#039; used to react with exaggerated excitement each time the unexpected occurred, and caused me to press the &amp;#039;mute&amp;#039; button on my remote, and the first series featured a superhero spoof which fell embarrassingly flat, but there were enough good characters for Enfield to develop over two seasons, and into the spin-off &amp;#039;Harry Enfield &amp; Chums&amp;#039;. For instance, &amp;#039;Little Brother&amp;#039; mutated into the miserable teenager &amp;#039;Kevin&amp;#039;.\n\nEarlier I mentioned that this was a &amp;#039;traditional&amp;#039; sketch show. By that I meant the show owed a great debt to the late, great Dick Emery&amp;#039;s long-running Saturday night series. By his own admission, Enfield was a big fan of Emery&amp;#039;s, and intended &amp;#039;Programme&amp;#039; as a homage.\n\nWriters included Ian Hislop and Nick Newman, who had worked on &amp;#039;Spitting Image&amp;#039;, and Charlie Higson, later to create the popular ( but inferior, in my view ) &amp;#039;The Fast Show&amp;#039;.\n\nSpecial mention must be made of the fine supporting cast, in particular Paul Whitehouse and Kathy Burke. Many of the best sketches featured pairings either of Enfield and Whitehouse or Enfield and Burke. But it was with Whitehouse that Enfield really shone. Whether it was as idle garage mechanics &amp;#039;Lee and Lance&amp;#039;, &amp;#039;The Old Gits&amp;#039; or &amp;#039;Smashie &amp; Nicey&amp;#039;, Whitehouse and Enfield were one of the funniest comedy teams I can recall seeing.\n\nIts not every day that a television comedy show panics a radio station into dumping its presenters, but &amp;#039;Smashie &amp; Nicey&amp;#039; had that effect. With their cheesy patter, outdated fashion sense and over-reliance on the hit 70&amp;#039;s record &amp;#039;You Ain&amp;#039;t Seen Nothing Yet&amp;#039; by The Bachman Turner Overdrive, the aging disc jockeys were a stinging criticism of the old school of Radio 1 broadcasters. The consequences were devastating: Dave Lee Travis famously resigned on air. Simon Bates, Alan Freeman and even Gary Davies were shown the door. Luckily for Tony Blackburn, he&amp;#039;d moved on a long time before.\n\nIn recent years, Harry Enfield has become the &amp;#039;forgotten man&amp;#039; of British comedy. His series for Sky Television - &amp;#039;Harry Enfield&amp;#039;s Brand Spanking New Show - was so bad even he admitted to never having watched an episode. It was recently confirmed he would be teaming up again with Paul Whitehouse for a new show. If it will be as funny as this one, I can hardly wait.\n","torrent":{"xt":"urn:btih:49bb7eba62ba611110b038ed7738cb477ffa355b","amp;dn":"Harry+Enfields+Television+Program+S01+E02+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49bb7eba62ba611110b038ed7738cb477ffa355b","infoHashBuffer":{"type":"Buffer","data":[73,187,126,186,98,186,97,17,16,176,56,237,119,56,203,71,127,250,53,91]},"announce":[],"urlList":[]}}