{"title":"Postal  [Subs.Espanol]","uid":4134418,"size":775825408,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a35bbe6ba2053e70ea517ab8ae736f1ff2c7efc&amp;dn=Postal++%5BSubs.Espanol%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zeporro","files":1,"time":1208194845,"description":"POSTAL de Uwe Boll, seguramente la mejor y mas divertida adaptacion de un videojuego al cine. En VO y subtitulada en espanol.\nZack Ward es Postal Dude, el protagonista, que vive en una autocaravana con su perro Champ y la ballena de su mujer, Bitch, en el pueblo llamado Paradise. Esta sin trabajo y sin dinero. Intenta conseguir un trabajo y tras una humillante entrevista no es elegido. Asi que recurre a su tio Dave, un tipo que se ha convertido en el lider del culto del pueblo, pero que tambien pasa malos momentos economicos, ya que Hacienda le reclama dinero. Dude y tio Dave preparan un plan para robar una valiosa mercancia. Pero a Paradise tambien han llegado un grupo de talibanes liderados por el mismo Bin Laden que tienen un plan muy siniestro. Tanto el plan de tio Dave como el de Bin Laden tienen que ver con la proxima inauguracion del parque tematico aleman que dirige el mismisimo Uwe Boll y donde van a ser presentadas las munecas Crotchy, unos peluches en forma de polla. Mientras Dude y Dave quieren robar la partida de munecas para subastarlas por internet y conseguir dinero, Bin Laden y los talibanes las quieren utilizar para esparcir la gripe aviar por todos los USA en ampollas escondidas en las munecas...","torrent":{"xt":"urn:btih:4a35bbe6ba2053e70ea517ab8ae736f1ff2c7efc","amp;dn":"Postal++%5BSubs.Espanol%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a35bbe6ba2053e70ea517ab8ae736f1ff2c7efc","infoHashBuffer":{"type":"Buffer","data":[74,53,187,230,186,32,83,231,14,165,23,171,138,231,54,241,255,44,126,252]},"announce":[],"urlList":[]}}