{"title":"Beyond Belief 2007 - Enlightenment 2.0","uid":4041288,"size":4267463280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4acf6b4b719c640dcc60e97e6cab3942ac1e8883&amp;dn=Beyond+Belief+2007+-+Enlightenment+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"riversonthemoon","files":41,"time":1203694465,"description":"Video: XVID 320x240 23.98fps\nAudio: MPEG Audio Layer 3 44100Hz stereo 128Kbps\n\nBeyond Belief 2007 - Enlightenment 2.0 &lt;a href=&quot;\nhttp://thesciencenetwork.org/BeyondBelief2/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thesciencenetwork.org/BeyondBelief2/&lt;/a&gt;\n\nAs you watch the conversation in Beyond Belief: Enlightenment 2.0, it might help to know about one of the sources that was helpful to me in formulating the agenda, assembling the cast of characters, and setting the tone for the meeting. I quoted this passage from Humanity: A Moral History of the Twentieth Century by Jonathan Glover (who directs the Centre of Medical Law and Ethics at King\\&amp;#039;s College, London):\n\n    \\&quot;Now we tend to see the Enlightenment view of human psychology as thin and mechanical, and Enlightenment hopes of social progress through the spread of humanitarianism and the scientific outlook as naÃƒ?Ã‚Â¯ve...One of this book\\&amp;#039;s aims is to replace the thin, mechanical psychology of the Enlightenment with something more complex, something closer to reality...another aim of the book is to defend the Enlightenment hope of a world that is more peaceful and humane, the hope that by understanding more about ourselves we can do something to create a world with less misery. I have qualified optimism that this hope is well founded...\\&quot; \n\nI say Amen to that. If Enlightenment 1.0 took a thin and mechanical view of human nature and psychology, I think Enlightenment 2.0 can offer a much \\&amp;#039;thicker\\&amp;#039; and cognitively richer account - less naÃƒ?Ã‚Â¯ve and also, perhaps, less hubristic. If there\\&amp;#039;s one thing we\\&amp;#039;ve learned - particularly from cognitive neuroscience - it is that we need to have some strategic humility about the hobby horses we are inclined to ride.\n-Roger Bingham\nDirector, The Science Network\n\nThis 3-day event is available for viewing only. It will also be available for purchase on DVD following the arrival of the new year.\n\n\nThe aim of Beyond Belief: Enlightenment 2.0 is to invite participants to undertake together an ongoing reconnaissance of Enlightenment ideas in the light of advances in primarily cognitive neurosciences, evolutionary biology, physics etc. though not by any means scanting history, philosophy, law. The word reconnaissance is used advisedly. Although reconnaissance now usually means a military information-gathering exercise, the preference is for original root - recognoscere - which roughly suggests \\&amp;#039;to get to know again\\&amp;#039;. The hope is to explore our current sense of Reason, Truth, Belief, Human Nature, Progress, Virtue and the Good Life in this light. It could be argued that the Enlightenment was not quite the disaster that some critics have suggested, and that version 2.0, and subsequent releases, could conceivably be a dynamic improvement if we set our minds to it, guided by that eudaemonic impulse.\n\nThis is the sequel to Beyond Belief 1 - and the second in what we now are planning to be an annual series of conversations on this topic. There were over 3 million hits and over half a million downloads of some or all of the 15 hours of conversation, which is unedited, free of the tyranny of the soundbite; hundreds of thousands of views on YouTube and hundreds of blogs and e-mails. Beyond Belief: Enlightenment 2.0 will also be videotaped and subsequently webcast as part of TSN\\&amp;#039;s educational mission - To Enlarge the Constituency of Reason. It will be highly interactive: the emphasis is less on formal presentation than on participation. Invitees play multiple roles - as presenters, panelists, and participating audience members. Above all, this is a conversation.\n\nClearly, the religion/faith/belief issue will come up again - as it has most recently concerning Islamic science in the pages of Nature (with thoughts of Ziauddin Sardar\\&amp;#039;s Commentary on 12 July, and Sam Harris\\&amp;#039; letter on August 23). But we would also like to consider exploring what Ed Wilson (with a nod to Condorcet) would call a Consilience direction. So as well as many of the participants from last year an additional contingent has been invited from the humanities \\&quot;tribe\\&quot; to help us better understand, amongst other things, The Sea of Faith, the Sleep (or Dream) of Reason, the Perils of Scientism, the possibly premature reports of the Death of Utopia and the reason for the recurrent calls for Re-Enchantment.\n\nWe shall also re-visit some of last year\\&amp;#039;s questions including: Can evolutionary biology, anthropology and neuroscience help us to better understand how we construct beliefs, and experience empathy, fear and awe? Can science help us create a new rational narrative as poetic and powerful as those that have traditionally sustained societies? If not God, then what? And we shall hopefully be weaving a rich tapestry including historical threads from sources including Spinoza, Shakespeare, Milton, Blake, Thomas Paine, William James, Beethoven, Bacon, Rawls and Alhazen.\n\nWe really do think of this as an ongoing project to foster and promote the use of reason in formulating social policy. It is interesting that both ends of the political spectrum are currently gnashing teeth and blaming the others for either a \\&quot;Retreat from Reason\\&quot; or an \\&quot;Assault on Reason\\&quot;. It would be refreshing to have a rational discussion about this!\n","torrent":{"xt":"urn:btih:4acf6b4b719c640dcc60e97e6cab3942ac1e8883","amp;dn":"Beyond+Belief+2007+-+Enlightenment+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4acf6b4b719c640dcc60e97e6cab3942ac1e8883","infoHashBuffer":{"type":"Buffer","data":[74,207,107,75,113,156,100,13,204,96,233,126,108,171,57,66,172,30,136,131]},"announce":[],"urlList":[]}}