{"title":"Cowboy Junkies 2004-10-03 @ Handelsbeurs - Gent, BEL","uid":4057887,"size":610170182,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ada8a72f6cbe5d9e1a7b2574598135c9ceef895&amp;dn=Cowboy+Junkies+2004-10-03+%40+Handelsbeurs+-+Gent%2C+BEL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":28,"time":1204464677,"description":" This is the first show from Europe in the SOTM series, and the first from the 2004 tour. The 2004 tour featured the band playing two sets each night. For the first set, the so-called Folk Fusion Quartet of Mike, Margo, Jeff Bird and Jaro  Czerwinec, who returned to the band after a long absence for this tour, played a 30 minute acoustic set. After a short intermission, Pete and Alan would join in for a usually raucous second set. It made for a lovely contrast, particularly in quiet venues like this one.\n\n \n\nThis tour also showcased one of Mike&amp;#039;s best ever compositions, &quot;Notes Falling Slow.&quot; The band played it quite often on this tour, and sometimes, as in this performance, did it acoustically, which added an extra emotional component to this song of bereft relationships.\n\n \n\nAs a final note about this show, I&amp;#039;ll leave you with Mike&amp;#039;s impressions: &quot;The gig tonight took place in a very cool performance space. It was inside of an old bank building which has been intelligently refurbished and renovated so that it retains its old world charm, but enables it to also be a thoroughly modern art space. It was another excellent audience: so intense and so focused. We had another very good gig. It was an absolute joy to play for these people.&quot;","torrent":{"xt":"urn:btih:4ada8a72f6cbe5d9e1a7b2574598135c9ceef895","amp;dn":"Cowboy+Junkies+2004-10-03+%40+Handelsbeurs+-+Gent%2C+BEL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ada8a72f6cbe5d9e1a7b2574598135c9ceef895","infoHashBuffer":{"type":"Buffer","data":[74,218,138,114,246,203,229,217,225,167,178,87,69,152,19,92,156,238,248,149]},"announce":[],"urlList":[]}}