{"title":"Fitna - Islam Radicals vs The Case for Christ - U pick the Real","uid":4105830,"size":3168635488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4aea43786a7afa780a28acc417d83187a62f3e6c&amp;dn=Fitna+-+Islam+Radicals+vs+The+Case+for+Christ+-+U+pick+the+Real+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jesus_Freak","files":1,"time":1206804649,"description":"In response to the film FITNA I have included the film, &quot;The Case for Christ&quot; to show the Contrast between Islam and Jesus Christ, the Creator of the Universe.\n\nThe More You share the More shares you will receive, may Yahweh Bless You as He has me.\n\nSeed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.\n &lt;a href=&quot;\nhttp://bibledatabase.com/html_bibles.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bibledatabase.com/html_bibles.html&lt;/a&gt;\n\nMovie Portrays Islam as Violent and Bloodthirsty\nby Hillel Fendel\n\nThe long-awaited and controversial movie Fitna, which graphically portrays Islam as a religion seeking to dominate the world and slaughter non-believers, finally debuted on the internet on Thursday night.  \n\nWithin two hours of the film&amp;#039;s release on Britain&amp;#039;s LiveLeak.com video site, close to two million people had seen it.  More than half of them were from Holland, home to the film&amp;#039;s producer, Dutch politician Geert Wilders.\n\nThe screening of the movie had been in doubt after the world&amp;#039;s largest website name registrar, Network Solutions, decided to block the movie&amp;#039;s home site. The decision to censor the film bolstered concerns that the extent of the fear of Islamic violence has even affected WWW content.\n\nOn Thursday, the UN Human Rights Council passed a resolution against the movie.  Proposed by Islamic countries, the resolutiion passed by a 21-10 vote, over the opposition of Europe and Canada.\n\nDespite all, LiveLeak stepped in to film the movie, at &lt;www.liveleak.com/view?i=7d9_1206624103&gt;, explaining, &quot;There was no legal reason to refuse Geert Wilders the right to post his film on LiveLeak.com, and it is not our place to censor people based on an emotive response.&quot;  Many websites feared even to list the URL at which the movie could be seen.\n\nResponse to the film has not been as intense as feared - though Dutch police had upped security precautions to near-top levels.  The movie was condemned by Iran, Indonesia, and the Netherlands, but no rioting or other reactions like those that followed the publication in Denmark of anti-Mohammed cartoons have broken out. \n\nFitna includes graphic footage of Moslem terror attacks around the world, including beheadings, disfigured bodies, destroyed buses, and the like. The scenes are accompanied by the relevant verses in the Koran, such as, &quot;Prepare for them whatever force and cavalry ye are able of gathering to strike terror, to strike terror into the hearts of the enemies of Allah and your enemies.&quot; This particular verse is followed by clips of a plane slamming into the World Trade Center and setting the building afire, and imams calling for the annihilation of all infidels.\n\nOne Moslem cleric is seen calling for the murder of Jews; he unsheathes a sword and cries out in nearly uncontrollable frenzy, &quot;By Allah, we shall cut off the Jew&amp;#039;s head!  Allah is great! Allah is great! Jihad for the sake of Allah!&quot;  The audience, in a similar frenzy, cheers him on. \n\nThe film ends with the sound of a page being torn out of a book, followed by stark sentences on the screen reading, &quot;It is not up to me, but up to Moslems themselves to tear out the hateful verses from the Koran. Muslims want you to make way for Islam, but Islam does not make way for you.  The government insists that you respect Islam, but Islam has no respect for you.  Islam wants to rule, submit, and seeks to destroy our Western civilization. In 1945, Nazism was defeated in Europe.  In 1989, Communism was defeated in Europe. Now, the Islamic ideology has to be defeated.&quot;\n","torrent":{"xt":"urn:btih:4aea43786a7afa780a28acc417d83187a62f3e6c","amp;dn":"Fitna+-+Islam+Radicals+vs+The+Case+for+Christ+-+U+pick+the+Real+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aea43786a7afa780a28acc417d83187a62f3e6c","infoHashBuffer":{"type":"Buffer","data":[74,234,67,120,106,122,250,120,10,40,172,196,23,216,49,135,166,47,62,108]},"announce":[],"urlList":[]}}