{"title":"Cowboy Junkies 1998-09-19 @ Savings Bank Music Hall - Troy, NY","uid":4057663,"size":620136849,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4afb8b3966471f90f254c0b8c88110366f1a6fd2&amp;dn=Cowboy+Junkies+1998-09-19+%40+Savings+Bank+Music+Hall+-+Troy%2C+NY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Foolishness","files":28,"time":1204454727,"description":" As I&amp;#039;ve been creating this page, I&amp;#039;ve been listening to this show in detail for the first time. It&amp;#039;s actually quite wonderful, and from the sound it seems it was intimate. Listen to Margo tell her story of a Starbucks visit in New York City before the band plays &quot;A Common Disaster.&quot; When she introduces &quot;Bea&amp;#039;s Song (River Song Trilogy: part II), she says, &quot;This is another song from the Lay It Down album. It&amp;#039;s probably my favorite song to sing from that album,&quot; and before she can go on a woman in the audience yells &quot;Bea&amp;#039;s Song!&quot; Margo sort of chuckles and says, &quot;That&amp;#039;s right!&quot; It&amp;#039;s wonderful to hear that sort of interaction, and very rare these days in our era or prepackaged artists.\n\n \n\nThis tour was in support of the &quot;Miles from Our Home&quot; album, a very underrated release. They did some interesting material off that album, like &quot;Darkling Days,&quot; and a slightly mellower version of &quot;Blue Guitar.&quot; This show also includes my favorite song off that album, &quot;No Birds Today.&quot; Margo says that &quot;Good Friday&quot; is her favorite song to sing from the album before playing it.\n\n\nThe sound quality of the recording is mostly good, although you can hear some clipping during the latter half of &quot;Lost My Driving Wheel&quot; and &quot;Hunted.&quot; Otherwise, I think it really captures the hall and what sounds like an incredibly intimate performance, one I wish I had been at!\n\n \n\nI think this show is quite an lovely undiscovered gem; I hope you feel the same.","torrent":{"xt":"urn:btih:4afb8b3966471f90f254c0b8c88110366f1a6fd2","amp;dn":"Cowboy+Junkies+1998-09-19+%40+Savings+Bank+Music+Hall+-+Troy%2C+NY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4afb8b3966471f90f254c0b8c88110366f1a6fd2","infoHashBuffer":{"type":"Buffer","data":[74,251,139,57,102,71,31,144,242,84,192,184,200,129,16,54,111,26,111,210]},"announce":[],"urlList":[]}}