{"title":"Astala vista 's Security Toolbox DVD v4.0  - 10 language","uid":4163081,"size":4700376042,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c638bb2d1405254dbf0860f12db767dcde3f17e&amp;dn=Astala+vista+%5C%27s+Security+Toolbox+DVD+v4.0++-+10+language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d1111s","files":-1,"time":1209475013,"description":"Astalavista's Security Toolbox DVD v4.0\n\nThis DVD is the swiss army knife for people with interests in IT secutity and Hacking. And alot of other stuff too, you wont believe the range!\n\n\nAstalavista's Security Toolbox DVD v4.0 is considered to be the largest and most comprehensive Information Security archive.\n\nContained are 5944 tools in 352 categories all displayed and accessable within a user friendly interface that is descriptive and educational. You also have a choice of  10 languages:-\tEnglish\n\t\t\tDeutsch\n\t\t\tEspanol\n\t\t\tItaliano\n\t\t\tFrancais\n\t\t\tNederlands\n\t\t\tEsperanto\n\t\t\tPortugues\n\t\t\tAfricaans\n\t\t\tSvenska\n\t\t\t\t\n\n\n A resource for all of your security and hacking interests, in an interactive way!\n The Information found on the Security Toolbox DVD has been carefully selected,\n so that you will only browse through quality information and tools.\n\n\n\nWhen looking at the hot security topics of the day, penetration testing AKA ethical hacking has got to be near the top of everyone's list. With the onslaught of compliance regulations, this self-testing process is virtually required by law. As with any technical process (even one as sexy as legal hacking for a living), there is bound to be standards, training and, of course, certifications to go along with it. This one is no different. As we all know, a certification is not the end all - be all in the IT world. And as most know, I am fond of saying that a certification is a baseline of knowledge and by no means meant to be an indicator of expert status. But you have to start somewhere.\n\nActive ImageOK... so I want to be a professional hacker. Where do I start? Who offers this training? With all popular IT fields, there are a multitude of certifications. Which one do I choose? If I have no experience, how do I start? If I have IT experience, where do I jump in? Well, without causing a huge debate, a lot of companies now use the format of sending their staff to a highly regarded training facility with the end goal of attaining some type of certification. Like it or not, that is the reality. A recent US DoD report (Document 8570.01-M) states their intentions to require certifications for security positions. So let's just continue with the assumption that no matter where you end up on your road to becoming a professional penetration tester, training and a certification is likely somewhere in your plans.      &lt;a href=&quot; http://www.ethicalhacker.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.ethicalhacker.net/&lt;/a&gt;\n\n\n\n\n\n\n No matter if you are a computer enthusiast, a computer geek, a newbie looking for information on &quot;how to hack&quot;,\n or an IT Security professional looking for quality information for offline use or just for convenience,\n you will be satisfied, even delighted by the DVD!\n\n\nFor windows and Linux Platforms\n\nIso made with poweriso, burn or mount\n\nCAUTION! THIS DVD IS NOT FOR MUPPETS!, LOL\nWARNING THIS DISC WILL MAKE VIRUS SCANNERS AND SUCH LIGHT UP LIKE A CHRISTMAS TREE, BECAUSE OF THE TYPE OF SOFTWARE. IT IS SAFE FOR YOU IF YOU USE IT WISELY\nd1111s #: - }\n &lt;a href=&quot;\nhttp://workittothebone.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://workittothebone.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:4c638bb2d1405254dbf0860f12db767dcde3f17e","amp;dn":"Astala+vista+%5C%27s+Security+Toolbox+DVD+v4.0++-+10+language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c638bb2d1405254dbf0860f12db767dcde3f17e","infoHashBuffer":{"type":"Buffer","data":[76,99,139,178,209,64,82,84,219,240,134,15,18,219,118,125,205,227,241,126]},"announce":[],"urlList":[]}}