{"title":"Laibach - (1984) - Laibach [4th edititon]","uid":4162942,"size":377389066,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4cde896eed1b5847dd9c726272f303d9e87197d6&amp;dn=Laibach+-+%281984%29+-+Laibach+%5B4th+edititon%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kislithepothead","files":16,"time":1209467356,"description":"The group Laibach was established in the year 1980 in Trbovlje, an industrial-coal mining town in the  centre of Slovenia (YU).\n\nUpon its founding in  1980 Laibach prepared in Trbovlje its first  multimedia project \\&quot;Red Districts (Rdeci revirji)\\&quot;,  designed to challenge the striking contradictions of the  political structure of the town at that time. The project  was banned before it opened, which prevented the first  public appearance of the group, though not the angry  media response which followed. Laibach appeared  again in 1982, with their first concert appearance in  Ljubljana. This was followed by the first concerts around  Yugoslavia (Zagreb, Belgrade), and a headlining  appearance at the New Rock festival in the centre of  Ljubljana. On June 23rd 1983, the group made its first  television appearance, an interview on the political/news  programme \\&quot;TV Tednik\\&quot;. The interview provoked numerous  reactions, and was followed by an administrative/political  ban on public appearances and the use of the name Laibach.  November and December 1983 saw the first European tour by  the group, the \\&quot;Occupied Europe Tour\\&quot; (with the British group Last Few  Days). The 17-date tour covered 16 cities in 8 countries  in Eastern and Western Europe. The group made a  successful anonymous appearance at the Malci Belic Hall,  Ljubljana in December 1984. April 1985 saw the release of  the first album by Laibach, on the Slovenian Ropot  label. Because of the ban, the record came out without  the group\\'s name, and instead the cover featured a symbol,  the group\\'s trademark. \n\nTracklist:\n#01 Cari Amici Soldati (Dear Soldier Friends)\n#02 Sila (The Force)\n#03 Sredi Bojev (In the Midst of Struggles)\n#04 Drzava (The State)\n#05 Dekret (Decree)\n#06 Mi Kujemo Bodocnost! (We are Forging the Future!)\n#07 Brat Moj (Brother of Mine)\n#08 Panorama (Panorama)\n#09 N Y 1984 - Policijski Hit (N Y 1984 - The Police Hit)\n#10 Prva TV Generacija (The First TV Generation)\n#11 Der Zivilisation (The Civilisation)\n#12 L\\'Homme Arme (The Armed Man)\n#13 One Plus One (1+1)","torrent":{"xt":"urn:btih:4cde896eed1b5847dd9c726272f303d9e87197d6","amp;dn":"Laibach+-+%281984%29+-+Laibach+%5B4th+edititon%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cde896eed1b5847dd9c726272f303d9e87197d6","infoHashBuffer":{"type":"Buffer","data":[76,222,137,110,237,27,88,71,221,156,114,98,114,243,3,217,232,113,151,214]},"announce":[],"urlList":[]}}