{"title":"Download Manager For Up-to-Date McAfee Security Suite","uid":4145119,"size":636192,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e330dfde8f013713c21cfb83c4b8cb6d5fd971a&amp;dn=Download+Manager+For+Up-to-Date+McAfee+Security+Suite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dakota2007","files":1,"time":1208650068,"description":"Improved Features:\n\n\nMcAfee SecurityCenter makes it simple to review your PC security status, check for update and fix potential security issues. Virus Protection is award-winning protection that provides on-access scanning that blocks viruses, worms, Trojans and unwanted programs before they install on your computer. Firewall Protection automatically monitors activity, and lets you hide your presence on the Internet to make your computer invisible to malicious hackers. Additional Benefits\nIdentity Theft Protection guards your identity when you are online. McAfee Password Vault provides a safe place to store your confidential passwords. Windows Protection with McAfee X-Ray for Windows detects and kills applications that hide from Windows such as rootkits. McAfee System Guards watch your computer for specific behaviors that signals virus, spyware or hacker-like activities. Backup &amp; Restore saves copies of your most valuable files wherever you want, encrypting and compressing your files on a CD/DVD, or USB, external or network drive. Built-in PC Health and Performance Tools keeps the PC running at peak performance with automated disc defrag, and clean-up for files, applications and browser history. McAfee Image Analysis keeps offensive content and pictures away from your children. McAfee Network Manager monitors PCs across your network for security weaknesses so you can easily fix security issues from one centralized network map. Built-in McAfee Shredder allows you to digitally ?shred?","torrent":{"xt":"urn:btih:4e330dfde8f013713c21cfb83c4b8cb6d5fd971a","amp;dn":"Download+Manager+For+Up-to-Date+McAfee+Security+Suite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e330dfde8f013713c21cfb83c4b8cb6d5fd971a","infoHashBuffer":{"type":"Buffer","data":[78,51,13,253,232,240,19,113,60,33,207,184,60,75,140,182,213,253,151,26]},"announce":[],"urlList":[]}}