{"title":"Jeff Farias Show - July 02, 2008 (24kbs Audio).mp3","uid":4273936,"size":23473360,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4e739500501549677eea3ae2aada0a1e3e5f408a&amp;dn=Jeff+Farias+Show+-+July+02%2C+2008+%2824kbs+Audio%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DBaum23","files":1,"time":1215085305,"description":"at 4 PM Rep Kyrsten Sinema LD -15 to discuss Ward Connerly&amp;#039;s racist initiative and the Marraige amendment initiative.  To particpate in the challenge to this racist initiative call 800-690-3639\n\nat 5 PM candidate for Maricopa County Attorney Gerald Richard to discuss Andrew Thomas&amp;#039; involvement with the Ward Connerly racist initiative.\n\n---------------\n\nHUGH HEWITT\n\nAmong right wing whacko radio talk show hosts, Hugh Hewitt is known as a ?Christianist,? according to Andrew Sullivan. As far as we can detect, that means Hewitt thinks that he is holier than thou. We doubt whether Christ has weighed in on Hewitt?s self-proclaimed religiosity.\n\nFor all practical purposes, Hewitt is just another shill for what used to be known as the kooky right wing, but is now called the Republican Party. In fact, Hewitt worked for Reagan and was the first executive director of the Nixon Library. Now, those are some credentials for becoming a national talk show host, huh?\n\nDon Howson of Grapevine, Texas, succinctly provided an anecdotal example of why Hewitt is worthy of the BuzzFlash Media Putz Award:\n\n    I wish I could eloquently provide you a reason for nominating\n\n    Hugh Hewitt, but his words say it all:\n\n    Hugh Hewitt on OSU-USC football game: &quot;[I]t&amp;#039;s probably the last football game we&amp;#039;ll ever get to see before the United States gets blown up by the Islamists under Obama&quot;\n\n    &amp;#039;Nuff said.\n\n    Thanks, and keep up the good work.\n\nThe full quote from Hewitt?s June 25th radio program, for the record, is: &quot;By the way, I -- I&amp;#039;m still trying to find two tickets to the Ohio State-USC game. And none of the USC people will give up their tickets to me. I&amp;#039;d pay fair price. They -- they know Ohio State&amp;#039;s gonna slaughter the Trojans. They know that they&amp;#039;re gonna slaughter the Trojans, and therefore they do not want me there at the bloodbath, since it&amp;#039;s probably the last football game we&amp;#039;ll ever get to see before the United States gets blown up by the Islamists under Obama.&quot;\n\nRight-wing hate talk radio worms its way into the basest instincts and emotions of its listeners. Limbaugh is a master at that, which is giving the devil his due -- and he is, once again, the BuzzFlash Media Putz of the Week.\n\nAh, nobody says it better than Hugh. If you?re going to be a crackpot who supports an administration that has done more destruction to the American economy and infrastructure than terrorists could ever hope to do, you might as well not go half hog.\n\nIn regards to a book by a Hewitt, ?A Guide to Christian Ambition,? an online reviewer wrote: ?Hugh Hewitt spends his time on the nation&amp;#039;s airwaves flattering WMD developers like Frank Gaffney and other members of our military industrial mafia. If your Christ is a rich militarist, this book and Hewitt&amp;#039;s show are for you.?\n\n----------------\n\n\nAlso try listening to Thom Hartmann,  Randi Rhodes,  Ed Schultz and Mike Malloy","torrent":{"xt":"urn:btih:4e739500501549677eea3ae2aada0a1e3e5f408a","amp;dn":"Jeff+Farias+Show+-+July+02%2C+2008+%2824kbs+Audio%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e739500501549677eea3ae2aada0a1e3e5f408a","infoHashBuffer":{"type":"Buffer","data":[78,115,149,0,80,21,73,103,126,234,58,226,170,218,10,30,62,95,64,138]},"announce":[],"urlList":[]}}