{"title":"Carnivale Season 1 Disc 1","uid":4272005,"size":4509567555,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ef8fe11ff7ed1b610fb9a20d5cf4e16d0e7e305&amp;dn=Carnivale+Season+1+Disc+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tankengine1964","files":17,"time":1214980788,"description":"Movie Title............................Carnivale Season 1 Disc 1\n\nIMDB Rating............................9.1 / 10\t\t\n\nGenre..................................Drama\n\nAudio..................................English, French, Hungarian\n\nSubtitles..............................English, French, Hungarian, Dutch, Arabic, Danish, Finnish, Greek, Hebrew, Norwegian, Polish, Portugese, Swedish \n\nMenu...................................Untouched\n\nDVD Extras.............................All Available\n\nVideo..................................DVD Shrink\n\nVideo Standard.........................Pal\n\nRegion.................................Region Free\n\nOther..................................DVD &amp; Cover art work included\n\n\nSeason 1, Episode 1: Milfay\nOriginal Air Date: 14 September 2003\nOklahoma Dust Bowl, 1934. 18-year-old Ben Hawkins is a young man whom lives with his physically sick, God-fearing mother. After his mother dies from a long illness, Ben unceremoniously buries her in the back yard of his home which is then repossessed for outstanding late payments. Ben is taken in by a traveling carnival troupe (titled Carnivale) and becomes acquainted with the residents whom include the kind-hearted dwarf owner Samson; his right-hand man and head rigger Clayton Jones; Gypsy tarot reader Sofie; the bearded lady Lila; girlie tent owner Felix &quot;Stumpy&quot; Dreifuss, his wife Rita Sue whom Felix solicits to some of the patrons, and their two teenage daughters Libby and Dora Mae; Gekco the Reptile Man; snake charmer Ruthie; Ruthie&amp;#039;s son Gabriel, the low-IQ strongman; and conjured twins Alexandria (Alex) and Caladonia (Cat). Ben is revealed to have strange mystical powers of clairvoyance and healing which worry Professor Lodz, the blind mystic of the traveling troupe. Meanwhile in the small town of Mintern, California, an evangelical preacher, named Brother Justin Crowe, receives a sign when a woman vomits up silver coins that disappear before his eyes, that leaves him awakened to the possibility of mysterious powers that he has and it somehow gives him a psychic connection to Ben, both of whom have never met.\n\n\nSeason 1, Episode 2: After the Ball Is Over\nOriginal Air Date: 21 September 2003\nA practical joke by Jones on Ben to clean a dirty trailer leads Ben to a piece of the puzzle of is his past which is a tuxedo-clad man, named Scudder, that Ben keeps seeing in his dreams who may be his long-lost father, and whom worked at Carnivale. Meanwhile, Brother Justin and his sister Iris, (who lives with him in the same house in Mintern), seek the assistance from Brother Justin&amp;#039;s mentor, Reverend Norman Balthus, try to turn Mr. Chin&amp;#039;s, a local brothel, into a house of worship for the local migrants. Brother Justen then does do by persuading the owner after having a psychic vision. At the Carnivale, Sofie continues to tend to her comatose, telepathic mother, Apollonia, after their upsetting run in with Ben, whose powers can help, or harm.","torrent":{"xt":"urn:btih:4ef8fe11ff7ed1b610fb9a20d5cf4e16d0e7e305","amp;dn":"Carnivale+Season+1+Disc+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef8fe11ff7ed1b610fb9a20d5cf4e16d0e7e305","infoHashBuffer":{"type":"Buffer","data":[78,248,254,17,255,126,209,182,16,251,154,32,213,207,78,22,208,231,227,5]},"announce":[],"urlList":[]}}