{"title":"C. C. Adcock - Lafayette Marquis.  Swamp Rock","uid":4031913,"size":301600797,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4fddc4ca3bf375687588241e87d0d57367e88ab5&amp;dn=C.+C.+Adcock+-+Lafayette+Marquis.++Swamp+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"grumpygroo","files":17,"time":1203210421,"description":"C. C. ADCOCK\n\nLafayette Marquis\n\n\n \n\n\n\n1.\tY?all?d think she?d be good 2 me\n2.\tStealin? all day\n3.\tAll for the betta\n4.\tBlaksnak bite\n5.\tRunaway life\n6.\tLoaded gun\n7.\tLove n? gold\n8.\tSlangshotz n? boom-r-angz\n9.\tI love you\n10.\tBetween the lies\n\nLAFAYETTE MARQUIS (Yep Roc) ? C.C. Adcock\nOnce every ten years C.C. Adcock puts out a record. His first conjured up a vision of Louisiana reeking of Spanish moss, sex, and tremolo. Rather than sounding like so many roots records--simultaneously sterilized and mummified--Adcock&amp;#039;s debut put you right in the corrugated-tin roadhouse shack, with the condensation on the walls, the beer flowing like Niagara, and the women&amp;#039;s skirts hiked to their waists. What made it one of my all-time favorites was the way it captured the infectious deep bayou feel without sounding like a Clifton Chenier carbon--that is to say, Adcock and producer Tarka Cordell seemed to be fully aware that they were making a RECORD, understanding that to create the excitement of a live performance in the studio requires a certain type of production voodoo, adjusting for the fact that you are not actually being sprayed with the singer&amp;#039;s sweat.\nIn the decade between that offering and Lafayette Marquis, Adcock has been recording tunes piecemeal with kindred spirits like Doyle Bramhall II and the late, legendary Jack Nitzsche (Ry Cooder, The Stones), as well as keeping his roadhouse credentials current with the swamp-supergroup Lil&amp;#039; Band O&amp;#039; Gold. Lafayette Marquis picks up where he left off while nodding to all that has come since. Tunes like &quot;Y&amp;#039;All&amp;#039;d Think She&amp;#039;d Be Good 2 Me,&quot; and &quot;Slangshotz N&amp;#039; Boom-r-angs&quot; demonstrate Adcock&amp;#039;s comfort with the collage production techniques of hip-hop and electronica. His genius lies in his ability to layer loops and guitars without losing the immediacy and greasy funk that makes swamp music so irresistible. Such is the strength of his distinctive artistic voice, that stripped down to an acoustic guitar, fiddle and voice, a Cajun-style tune like &quot;Runaway Life&quot; nestles naturally next to the fuzz-guitar wall of sound of &quot;Loaded Gun.&quot; \nLet&amp;#039;s just hope that it isn&amp;#039;t ten years to the next one. \n? Michael Ross\n\n\nEnjoy and seed!","torrent":{"xt":"urn:btih:4fddc4ca3bf375687588241e87d0d57367e88ab5","amp;dn":"C.+C.+Adcock+-+Lafayette+Marquis.++Swamp+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fddc4ca3bf375687588241e87d0d57367e88ab5","infoHashBuffer":{"type":"Buffer","data":[79,221,196,202,59,243,117,104,117,136,36,30,135,208,213,115,103,232,138,181]},"announce":[],"urlList":[]}}