{"title":"WAR ON DRUGS and Related Acts of Betrayal","uid":4103517,"size":223633407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50a3be764ad1de139703728cdd84096b906c01f1&amp;dn=WAR+ON+DRUGS+and+Related+Acts+of+Betrayal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EVReddy","files":47,"time":1206692998,"description":"WAR ON DRUGS AND RELATED ACTS OF BETRAYAL:\nA FIELD GUIDE FOR WARRIORS - A SAFETY BLANKET FOR THE CAUTIOUS - A BEACON FOR THE ADVENTUROUS.\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\nEDITORIAL - FROM THE DESK OF EDDY TIT-ORAL\n\nThe Changing Face of Law EnforcementÂ© [August 2007]\n?Nothing so needs reforming as other people&amp;#039;s habits.?  ~Mark Twain, Pudd&amp;#039;nhead Wilson&amp;#039;s Calendar for 1894\n\nCONSTRUCTIVE LAW-ENFORCEMENT is (or should be) an open, living system, responsive to change, comprised of multifarious, co-dependant component segments working in unison toward maintaining its overall health and potency to effectively accomplish the purpose for its very creation, viz., maintaining society?s standard of Law and civic Order. As an enforcement entity anointed by public trust, it is critical that it also establish and maintain an unsullied image of integrity and a consistent track record of its practical worth as a public service ? public safety implement to warrant its continuing existence. \n\nThe ?Neighborhood ?Beat Cop? Era? died quite a while ago. It was condemned to death by asphyxiation in mothballs. Good ol? ?Officer Murphy?, the Beat Cop, was an accepted presence in the daily neighborhood scene; on foot-patrol merrily impressing the kids with his dexterity at baton twirling synchronized with that unique gait! He was familiar with almost everyone in his Beat. He knew their first names, occupation, friend-acquaintance-family circle, hang-outs, personal habits, etc?. (PS: This is now technically called ?Suspect Profiling?!) ?.. ?Murphy? was liked, and was easy to approach, to talk to, to confide in, TO TRUST! (Hey! If you?ve got nothing to hide, why shouldn?t you trust a cop today? Right?).\n\nWell, the contemporary ?Officer Murphy? seldom walks the beat alone, if at all! That?s for ?Officer Safety? reasons! (Hey! If he did nothing to betray public trust, why should he fear the public today? Right?). Murphy now prowls around in a semi-armored squad car (actually, a mobile jail cell) loaded with mandatory ?safety gear? (i.e., for HIS safety): anti-personnel weapons, restraint equipment, and such; and that certain cocky arrogance that leaves in the wake a dense putrid odor long after he has departed from the scene.\n\nSo what of the ?Police Mission?? There?s a shitpile of caselaw supporting the fact that the police are under no obligation to protect individuals! Just ask those hapless 911-Rape-In-Progress callers! California Government Code Â§ 821, 845, and 846 is crystal clear: &quot; ? Neither a public entity or a public employee [may be sued] for failure to provide adequate police protection or service, failure to prevent the commission of crimes and failure to apprehend criminals?.&amp;#039;&amp;#039;.\n\nAnd what of the Pledge of Allegiance taken by every graduating peace officer at the Academy, and those ?TO PROTECT &amp; SERVE? logos on squad cars and elsewhere? It is deliberately obscure as to precisely who they?ve sworn allegiance to protect and serve, and who they?ve (perhaps unwittingly?) been commissioned to subdue, paving the way for the emergence of global monarchy, the New World Order. \nA safe, stable, secure society is bad for business. There?d be no need for more laws, law enforcement personnel, or the judiciary. So, to continue existing, and justify its continued existence, this living system (?Law? Enforcement) must first create, and then feed on public hysteria. \n\nWith the rapid disappearance of external threats to our nation, the only two options immediately available to ensure continuity of our Gargantuan Law Enforcement entity long since bursting at the seams, is to identify eligible fellow citizens? groups within the country, which the gullible ?majority?, influenced by pseudo-patriotic propaganda and nifty ?buzz-words?, could be persuaded to grant ?Enemy?Criminal Status? to. \n\nWe have a checkered record of ruthless expertise at segregating our people for fun and profit! Remember our Japanese citizenry confined to local concentration camps during WWII? Our Afro-American community still finds it difficult to walk steadily, impeded by the hemorrhoids conferred by a hostile, prejudiced value system.  More recently, the surreptitious introduction of creative gun legislation that criminalized a major section of law abiding gun-owners overnight, ? then the infamous declaration of ?War on Drugs? sending over 7M citizens to U.S. jails, probation or parole for non-violent, victimless ?crimes?. But we socked it real good to our Native Americans: took their land, rustled their horses, traded their scalps, captured their women, broke just about every treaty we conned them into, and left them drunk and bamboozled wondering ?tween swigs,  ?Whaat?appennedd, Kemo- Sabe???. [By the way, ever wondered what Tonto meant by that? Could it have been ?Butt Buddy?, since the Lone Ranger and he got to spend plenty of ?Quality Time? together privately, struttin? around on the prairie? I heard, in Apache, Kemo Sabe meant ?Horse?s Ass?. Except that Tonto was a Navaho! Later on I learned, Kemo Sabe in Navaho meant, &quot;Trusted friend&quot;; y?know, like a Butt Buddy who?ll keep your affair secret. And Kemosabe meant ?Soggy Bush?, like a secret remnant after a wild night of passion. Ahhh ? The wily Injun horndog! Figures! And you thought Silver was gettin? some, Huh? (Just some trivia ?thought you?d like to know!)].\n\nAnyway, back to the depressing stuff ?\n\n?Divide and conquer? strategy always works when coupled with public indifference and reliance on the illusion, ?This won?t happen to us!? The immediate objective was to distract the public into focusing on local ?faction? groups, labeling them as non-conformists, disruptive, criminal. Responding to such ?emergent threats? from pre-identified and targeted local ?splinter? groups would, along with persuasive media hype, refocus public attention, rejuvenate the mundane into the newsworthy, muster ?public? support, keep the life blood (fiscal budget) going, and bide time to organize and orchestrate dramatic, phantasmagoric, convincing evidence of external threats purportedly reflecting a ?clear and present danger to the security of our nation?.\n\nIt didn?t take very long to bring about Phase II: The creation of the menacing Boogyman: Ben Laden, Al-Qaida, Islamic ?Fundamentalists? (whatever the F that is!) and anything ?believed to be connected? with them, which could instill fear, fuel prejudice, and promote justification to further grant Enforcement Agencies carte blanc powers to deal with this new ?global menace?.  Where playing ?Cowboys and Indians? was a popular and socially acceptable game of massacre with us as kids, we?ve now moved on to playing ?Cowboys and Muslims? as adults!\n\nAs the people grab their ankles and willingly prostitute their hard earned freedom in exchange for fabricated illusions of ?security? from exaggerated, strategically created ?threats?, the enforcement arm of society, now unrestrained and unchallengeable, manifests itself into a separate, distinct, elite society of itself, turning predator upon any perceived threat to its continuing, domineering presence. This entity has now, with certainty and decisiveness, mushroomed into maturity, and is here to stay! Welcome to yet another Police State: The People?s Fascist Serfdom of America, where ?Freedom?s just another word for nothing else to lose?? has a hopeless ring of truth to it!\n\nIn all fairness, though, let?s set the record straight: Cops are really not ?bad people?. They have families just as we do; work to make ends meet, live on a budget. They embark on a thankless job, often in a hostile work environment. They are prone to errors, unintentional or otherwise. Like us, they are sometimes stuck with an asshole boss, have to deal with asshole clients, and, on occasion, give vent to the same asshole frustrations as we do. It doesn?t end there. Frequently, there?s stress at home: His All-American sophomore son has been overheard boasting of his dexterity at rolling reefers ? His wife?s been banging some low life parolee on the sly ? the freshman daughter got caught in the men?s locker room taking on a ?train? of the School Football team. She?s thrown out of school, is four months pregnant, and calls the fetus Leroy-Rufus III.  \n\nNo, cops are not bad people at all. Ask any cop! They?re just a different society with a different culture, different laws, and different philosophy; and goals often radically tangential from the mainstream society. They are simply the nuts-and-bolts of a giant, independent, living, predatory institution resolute on surviving! We created it, nurtured it, and empowered it. And now, it feeds on us! A dramatic changeover from Public Servants to Public?s Predator. Well, what do you expect when you let the fox guard the chicken, eh?\n\nHere?s another one for you: What?s more unnerving than a gay proctologist? A whole bunch of them! (As for what this has to do with anything, I don?t have the slightest damn clue! Perhaps it?s related somehow to integrity, ethics, honor and trust ? meaningless balderdash! But it barely makes it as a one-liner ?. Mercy!). \n\nI came across a disturbing prediction somewhere, allegedly authored by Ben Franklin: &quot;This [the U.S. Constitution] is likely to be administered for a course of years and then end in despotism... when the people shall become so corrupted as to need despotic government, being incapable of any other.&quot; Abe Lincoln supposedly warned that &quot;America will never be destroyed from the outside. If we falter, and lose our freedoms, it will be because we destroyed ourselves.&quot; Hmmm ? Sounds revolutionary, seditious, treasonous, and sufficiently &quot;Lincolnesque&quot; and ?Franklinean? to merit some serious thought. My first serious thought is, if these guys were alive today, they?d be singing a different tune in Guatanama Bay! (Wow! It rhymes! Maybe someone someday will make it ?RAP? and we can all ?Git-Doun? and do the moon-dance for our Masters).\n\n?When you&amp;#039;re telling cops that they&amp;#039;re soldiers in a Drug War, you&amp;#039;re destroying the whole concept of the citizen peace officer, a peace officer whose fundamental duty is to protect life and be a community servant?. General Colin Powell told us during the Persian Gulf War what a soldier&amp;#039;s duty is. It&amp;#039;s to kill the enemy. And when we allowed our politicians to push cops into a war that they&amp;#039;ll never win, they can&amp;#039;t win, and let them begin to think of themselves as soldiers, the mentality comes that anything goes.?  - Admirable speech delivered by Dr. Joe McNamara at the ninth International Conference on Drug Policy Reform, Santa Monica. Dr. McNamara, a veteran of the New York City Police Department, and former Chief of Police of Kansas City and San Jose, is currently a Research Fellow at Stanford University&amp;#039;s Hoover Institution.\n\nIt never ceases to amaze me how top brass, only after retirement, become critical of the policies they vigorously enforced throughout their long tenure in power! What of the evil precedent one has already set and the long list of lives, hopes, dreams that one defecated upon while on his merry path to an honorable, juicy Peace Officer retirement? ?Amends? always come a day late and a dollar short. But, don?t you fret none, Joey! It?s still mighty magnanimous of ya!\n\nPower certainly corrupts, but it?s nice to know that cops do their own housecleaning ? even if for their own reasons. In the ?big picture?, however, a few exposed ?rogue cops? convicted through trenchant journalism is no real threat to The System or the Plan. All wars have casualties. As for ?We The People ? ?? It?s an ideology now bedridden, weakened by old age, incontinence and lengthy confinement in storage ? and badly in need of a new set of dentures! What germinated as a gradual surreptitious encroachment on our Rights, has since evolved; metamorphosed into a visible, ruthless, commanding force set on systematically sodomizing our principles of freedom and hastening our eventual enslavement, ?For fascism arrives without fanfare, like tooth decay or dry rot, creeping in,  behind closed walls, until the very foundation of freedom is washed  away, forever?. \n\nIt?s all a part of the Major Plan, boys and girls, and it?s perhaps too damn late to do anything about it! May the NWO proctologists treat us gently and with kindness! God Bless America!\n\n\n\n[Compiled from ?Stray Thoughts of LEROY-RUFUS, II? - A die-hard fan of JFK, and fellow-patriot high on mind-enhancing anti-depressants: ?That?s how we?d get our stray thoughts?! So, Peace! Schalong! Or is it ?Shalom?? What?s the difference anyway? We?d still be soothing our hemorrhoids as we deal with the business end of their Piece! Ouch!].\n\n","torrent":{"xt":"urn:btih:50a3be764ad1de139703728cdd84096b906c01f1","amp;dn":"WAR+ON+DRUGS+and+Related+Acts+of+Betrayal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50a3be764ad1de139703728cdd84096b906c01f1","infoHashBuffer":{"type":"Buffer","data":[80,163,190,118,74,209,222,19,151,3,114,140,221,132,9,107,144,108,1,241]},"announce":[],"urlList":[]}}