{"title":"Gone.Baby.Gone.2007.iTALiAN.COMPLETE.PAL.DVDR-SiLENT","uid":4135070,"size":4641044480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:51555173502485fbbd99ce88de2cab0587a5c61b&amp;dn=Gone.Baby.Gone.2007.iTALiAN.COMPLETE.PAL.DVDR-SiLENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"REVEK","files":38,"time":1208222085,"description":"[ Info Film ]\n\n|Titolo originale: Gone Baby Gone \n|Nazione: USA\n|Anno: 2007 \n|Genere: Drammatico \n|Durata: 114 minuti\n|Regia: Ben Affleck   \n|Cast: Casey Affleck, Michelle Monaghan, Morgan Freeman, Ed Harris, John Ashton, Amy Ryan, Amy Madigan, Titus Welliver\n|Supporto: DVD Singolo lato, doppio strato\n|User Rating: 8.0/10 (27,421 votes)\n\n[ Trama ]\n\nPatrick Kenzie Ãƒ?Ã‚Â¨ un bostoniano da sempre e questo gli ha consetito di conoscere cosÃƒ?Ã‚Â¬ tante persone da fargli decidere di divenire detective privato. Nella professione Ãƒ?Ã‚Â¨ aiutato dalla sua compagna Angie Gennaro. Un giorno i due giovani investigatori si vedono contattare perchÃƒ?Ã‚Â© coadiuvino la polizia nelle ricerche di Amanda, una bambina di quattro anni scomparsa recentemente. Non Ãƒ?Ã‚Â¨ perÃƒ?Ã‚Â² la poco affidabile e tossicodipendente madre Helene a cercarli ma gli zii della bambina. Nonostante la contrarietÃƒ?  del capo della polizia locale Jack Doyle i due si mettono all\\&amp;#039;opera coadiuvati da due poliziotti che Doyle assegna loro come aiutanti. L\\&amp;#039;indagine non Ãƒ?Ã‚Â¨ facile anche perchÃƒ?Ã‚Â© finirÃƒ?  con il mettere in gioco delle complesse scelte morali.\nBen Affleck, al suo debutto dietro la macchina da presa fa subito centro con un film di genere che va oltre il genere per affrontare delicati temi legati al rapporto tra adulti e bambini. L\\&amp;#039;unica pecca del film Ãƒ?Ã‚Â¨ il titolo che, somigliando a quello di una canzone che potrebbe essere dei Bee Gees cosÃƒ?Ã‚Â¬ come dei Platters, rischia di avere un contenuto diverso da quello che invece possiede. D\\&amp;#039;altronde si tratta del titolo originale di un romanzo scritto da Dennis Lehane che Ãƒ?Ã‚Â¨ (oltre che l\\&amp;#039;autore di quattro storie che hanno al centro Patrick e Angie) colui che ha scritto \\&quot;Mystic River\\&quot;. Scusate se Ãƒ?Ã‚Â¨ poco. Si potrebbe dire che con un autore cosÃƒ?Ã‚Â¬ alle spalle chiunque avrebbe potuto ottenere un buon risultato ma, purtroppo, diverse esperienze di trasposizioni non riuscite non confortano questa valutazione. CosÃƒ?Ã‚Â¬, lo ripetiamo, onore a Ben Affleck che si Ãƒ?Ã‚Â¨ per di piÃƒ?Ã‚Â¹ assunto l\\&amp;#039;onere di offrire un ruolo importante al meno noto fratello Casey affiancandogli dei comprimari come Morgan Freeman ed Ed Harris che possono mettere in difficoltÃƒ?  anche attori molto piÃƒ?Ã‚Â¹ rodati di lui.\nInvece Casey Affleck e Michelle Monaghan offrono il ritratto di una coppia capace di uscire dagli stereotipi di genere e capace di attraversare una cittÃƒ?  rivisitata non da troppo tempo sotto l\\&amp;#039;ottica del malaffare (The Departed) mostrando la complessitÃƒ?  del male che si insinua non nei grandi traffici ma davvero sotto lo zerbino della porta accanto.\nLa stessa inflessione di Affleck nell\\&amp;#039;originale risulta un misto di determinazione e timidezza, offrendo al personaggio uno spessore insolito. PerchÃƒ?Ã‚Â©, se Ãƒ?Ã‚Â¨ vero che ancora una volta un romanzo di Lehane torna a scavare nell\\&amp;#039;intimo delle coscienze cercando di leggere il talvolta inestricabile groviglio tra torti e ragioni, a portarlo sullo schermo Ãƒ?Ã‚Â¨ un regista che sa scegliere gli attori. Lo si vede, al di lÃƒ?  dei nomi citati, nell\\&amp;#039;interpretazione offerta da Amy Ryan nel ruolo della madre della bambina. Le sue dichiarazioni dinanzi alle telecamere dopo la sparizione della figlia mettono in luce, con una naturalezza difficile da raggiungere al cinema, la profonda povertÃƒ?  materiale e morale della donna mista alla sua ignoranza. In quel momento sembra di assistere a uno dei nostri telegiornali infarciti fino all\\&amp;#039;inverosimile di cronaca nera e dei suoi attori. Quelli, purtroppo, veri.\n\n\n\n[ Info DVD ]\n\n|Compression rate: Untouched\n|Audio language(s): Italian DD 5.1, English DD 5.1\n|Subtitles: Italian, English, Dutch, Slovenian, Turkish, Serbian, Croatian * All Director Comments\n|Menu: Yes\n|Extra: Yes\n\n\n","torrent":{"xt":"urn:btih:51555173502485fbbd99ce88de2cab0587a5c61b","amp;dn":"Gone.Baby.Gone.2007.iTALiAN.COMPLETE.PAL.DVDR-SiLENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51555173502485fbbd99ce88de2cab0587a5c61b","infoHashBuffer":{"type":"Buffer","data":[81,85,81,115,80,36,133,251,189,153,206,136,222,44,171,5,135,165,198,27]},"announce":[],"urlList":[]}}