{"title":"Done Lying Down - John Austin Rutledge [1994] grunge / nirvana s","uid":4157484,"size":73127936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:51cdb8972909e7bb38b0abaf6e11b7f73b661287&amp;dn=Done+Lying+Down+-+John+Austin+Rutledge+%5B1994%5D+grunge+%2F+nirvana+s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"john111111111111111111111","files":21,"time":1209219826,"description":"Done Lying Down formed In the Autumn of 1992, after singer Jack Plug relocated to the UK from his hometown of Boston Massachussetts, and met up with guitarist Frank Art, bassist AliMac and drummer James &quot;The Mez&quot; Sherry.\n\nIn the Summer of 1993 Done Lying Down signed to Abstract Sounds, acquired the production services of John Robb, and released their debut EP, Heart Of Dirt, in October. The NME promptly made it Single Of The Week; the accompanying live shows received unanimous critical acclaim; and you almost couldn&amp;#039;t turn on the radio without hearing the colossal strains of Dissent.\n\nAs 1993 ended, Done Lying Down performed live in session on BBC Radio Five&amp;#039;s Hit The North; recorded a session for the John Peel programme on BBC Radio One that was broadcast on New Year&amp;#039;s Day; and appeared on XFM Radio in London, where the Heart Of Dirt EP remained on the A-list for three of their four weeks of airtime. The EP, unsurprisingly, quickly sold out all its pressings.\n\nAs 1994 unfolded, Done Lying Down were invited onto the six track Shagging In The Streets double 7&quot; EP, the first release on Fierce Panda Records, the brainchild of the NME&amp;#039;s Simon Williams.\n\nThe band&amp;#039;s second EP, Family Values, was released in March 1994, again to unanimous acclaim, and accompanied by the band&amp;#039;s debut video which featured on ITV&amp;#039;s The Chart Show and MTV&amp;#039;s 120 Minutes.The third EP, Negative One Friends, followed in July 1994 and earned the band a prestigious Record Of The Week slot on BBC Radio One&amp;#039;s Evening Session, and Single Of The Week in the Melody Maker. Amongst all this, they somehow managed to record their second session for the John Peel programme and appeared at the Phoenix Festival. Barely one month later, their fourth EP, Just A Misdemeanor, was released, again securing several Single Of The Week accolades, and later to be voted at Number Ten in John Peel&amp;#039;s end of year Festive Fifty.\n\nIn October 1994, barely one year since that first EP, Done Lying Down released their debut album, John Austin Rutledge, again to much feverish critical acclaim. It culminated a remarkable year for the band which yielded four EPs, notable recognition from the music press, radio and television, several live and recorded radio sessions, and over one hundred live shows in the company of the likes of Girls Against Boys, The Wonder Stuff, Compulsion, Jon Spencer&amp;#039;s Blues Explosion, Ned&amp;#039;s Atomic Dustbin and Velocity Girl.\n\n1995 saw the band head off to America to take in the sights, get some sun on their backs and write their second album, and play live alongside Skunk Anansie at London&amp;#039;s LA2 as part of XFM Radio&amp;#039;s successful monthly broadcast. Having signed to Immaterial Records, Done Lying Down released their Chronic Offender EP in late August, and followed it with the So You Drive EP in late November. Their second album, Kontrapunkt, was released in February 1996, and the band were invited to record their third John Peel session shortly afterwards. Their seventh single, Can&amp;#039;t Be Too Certain, was released in June 1996, again on Immaterial Records.\n\n&quot;Amidst even the most severe Done Lying Down song, you&amp;#039;ll find cruel dashes of intentional and very dark humour. Wild at heart and wired on top, they&amp;#039;re the best punk rock group on the entire planet&quot; ( NME )\n\n&quot;Frontman Jack Plug is a man with a lot of problems; grievances that force the jugular to stand out of his neck at regular intervals. A bleeding heart, a raging bull, an unpredictable maniac&quot; ( Metal Hammer )\n\n&quot;Full of contradictions and surprises, they&amp;#039;re exciting, charming, then make you laugh just a little uneasily&quot; ( Melody Maker )\n\n&quot;Heavy, churning guitars and lunging melodies without the metal fatigue. Ungainly to look at, but score well on teeth-grinding lyrics and Big Black and Pixiescomparisons&quot; ( Select )\n\n&quot;Frequently stupid, occasionally desperately serious, but always eye-widening in their cavalier disregard for all the rules. They are pop without the noncey bits, hardcore without the depressingly self-righteous overtones, and blamming, slamming, cheesy good fun&quot; ( Volume )\n","torrent":{"xt":"urn:btih:51cdb8972909e7bb38b0abaf6e11b7f73b661287","amp;dn":"Done+Lying+Down+-+John+Austin+Rutledge+%5B1994%5D+grunge+%2F+nirvana+s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51cdb8972909e7bb38b0abaf6e11b7f73b661287","infoHashBuffer":{"type":"Buffer","data":[81,205,184,151,41,9,231,187,56,176,171,175,110,17,183,247,59,102,18,135]},"announce":[],"urlList":[]}}