{"title":"TrueCrypt 5.0 PL portable for U3 platform (open source)","uid":4023129,"size":1198076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:526fcc3066708c47c5b81b57ec2c9123659c81f8&amp;dn=TrueCrypt+5.0+PL+portable+for+U3+platform+%28open+source%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Freddie-PL","files":1,"time":1202764708,"description":"\nFree open-source disk encryption software for Windows Vista/XP , Mac OS X, and Linux  \nMain Features: \nCreates a virtual encrypted disk within a file and mounts it as a real disk. \nEncrypts an entire hard disk partition or a storage device such as USB flash drive.\nEncryption is automatic, real-time (on-the-fly) and transparent.\nProvides two levels of plausible deniability, in case an adversary forces you to reveal the password:\n1) Hidden volume (steganography ? more information may be found here).\n2) No TrueCrypt volume can be identified (volumes cannot be distinguished from random data).\nEncryption algorithms: AES-256, Serpent, and Twofish. Mode of operation: XTS. \nFurther information regarding features of the software may be found in the documentation\n\n\n\n \nHomepage &lt;a href=&quot;\nhttp://www.truecrypt.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.truecrypt.org/&lt;/a&gt;\n\n\n\nWhat`s new in 5.0:\n\nNew features:\nAbility to encrypt a system partition/drive (i.e. a partition/drive where Windows is installed) with pre-boot authentication (anyone who wants to gain access and use the system, read and write files, etc., needs to enter the correct password each time before the system starts). For more information, see the chapter System Encryption in the documentation.   (Windows Vista/XP/2003)\n\nPipelined operations increasing read/write speed by up to 100%   (Windows)\n\nMac OS X version\n\nGraphical user interface for the Linux version of TrueCrypt\n\nXTS mode of operation, which was designed by Phillip Rogaway in 2003 and which was recently approved as the IEEE 1619 standard for cryptographic protection of data on block-oriented storage devices. XTS is faster and more secure than LRW mode (for more information on XTS mode, see the section Modes of Operation in the documentation).\n\nNote: New volumes created by this version of TrueCrypt can be encrypted only in XTS mode. However, volumes created by previous versions of TrueCrypt can still be mounted using this version of TrueCrypt.\n\nSHA-512 hash algorithm (replacing SHA-1, which is no longer available when creating new volumes).\n\nNote: To re-encrypt the header of an existing volume with a header key derived using HMAC-SHA-512 (PRF), select &amp;#039;Volumes&amp;#039; &gt; &amp;#039;Set Header Key Derivation Algorithm&amp;#039;.\n\n\n\n\nImprovements, bug fixes, and security enhancements:\n\nThe Linux version of TrueCrypt has been redesigned so that it will no longer be affected by changes to the Linux kernel (kernel upgrades/updates).\n\nMany other minor improvements, bug fixes, and security enhancements.  (Windows and Linux)\n\nIf you are using an older version of TrueCrypt, it is strongly recommended that you upgrade to this version. \n\n\n\n\n\nHistory: &lt;a href=&quot;\nhttp://www.truecrypt.org/docs/?s=version-history&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.truecrypt.org/docs/?s=version-history&lt;/a&gt;","torrent":{"xt":"urn:btih:526fcc3066708c47c5b81b57ec2c9123659c81f8","amp;dn":"TrueCrypt+5.0+PL+portable+for+U3+platform+%28open+source%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"526fcc3066708c47c5b81b57ec2c9123659c81f8","infoHashBuffer":{"type":"Buffer","data":[82,111,204,48,102,112,140,71,197,184,27,87,236,44,145,35,101,156,129,248]},"announce":[],"urlList":[]}}