{"title":"Future Tactics The Uprising VENGEANCE","uid":3265933,"size":785949042,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:52c6fef2b67212b316f7f24eeafd1a284d17360a&amp;dn=Future+Tactics+The+Uprising+VENGEANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SniperFin","files":55,"time":1103249222,"description":"ÃŸ   ÃŸ    V e n g e a n c E   Ãœ Ã›Ã› Ãœ   P r e s e n t S        ÃœÃ›Ã›Ã›Ãœ Ã›Â°\n Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„ÃŸÃŸÃ›Ã›Ã›ÃŸÃ„Ã„\n                   Future Tactics: The Uprising (c) JoWooD\n Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„\n   Release Date  :  12-16-2004               Protection   :  SecuROM / XPROT\n   File Count    :  CD=53x15mb               Game Genre   :  RPG        \n Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„\n   Release Notes:\n\n   The reality you know is under threat.\n\n   The reality you know has been infected with a retroactive virus capable of \n   rewriting history in its own image. The reality you know must end in order \n   to save it.\n\n   At an indeterminable point in mankind's future, ordered society has \n   reverted to a feudal state, scattered groups of survivors huddling \n   together in small villages and nomadic enclaves. Mankind is running scared \n   of the greatest to it's existence since reality first sputtered into \n   existence.\n\n   Decades ago, the face of the planet changed, entire cities disappeared \n   overnight, whole countries vanished. Left in their place were creatures, \n   hideous shambling monstrosities, technologically advance, and yet \n   intellectually retarded. And as mankind would soon discover, this was an \n   enemy that could not be stopped and killed. Strike one down, and it would \n   be reborn without so much as a scratch.\n\n   In the dark years ahead, when our enemies are but warped reflections of \n   ourselves, and where our allies may be more than they seem, a boy, his \n   sister, and a rag-tag assembly of unlikely warriors are the planets last \n   hope. But as they soon discover, immortality comes at a price. Twisting \n   perceptions, time and emotions.\n \n   Future Tactics is a tale of love, loss, hope...and some mean green ugly \n   muthas. \n\n\n   Some Scene Notes:\n\n   A loader is a small program/piece of code designed to alter parts of one \n   or more programs to suit the user. A loader is not limited to being \n   EXTERNAL like some may think. Inline patching methods are not good enough\n   to be used in the ISO scene. Yes, inline patching IS considered a loader \n   for very obvious reasons (take a look at n2c inline patching tutorials).\n\n   A loader defeats the cdcheck in safedisc very well but it leaves the game \n   in the exact same state as it was WITH the protection, very useless to the \n   iso scene. In fact a loader is exactly the same as a clonecd release only \n   instead of using alcohol or daemon tools to play the game the LOADER tells \n   the protection the cd is already in the drive. So then the 'crack' is \n   NOT A CRACK AT ALL, it is a work-around. \n\n   Having said that, the ISO scene is about cracks. Cracks require removal of \n   the protection, not emulation. Almost all commercial protections can be \n   &amp;quot;made to load without the cd&amp;quot; but where is the honor in that? Might as \n   well create some clonecd group and save the trouble of creating such a \n   loader. \n\n   Cracking is an art and removal of commercial protections is now something \n   very few crackers are capable of doing. Crackers that spend a long time \n   working on truly cracking protections get very annoyed when others take \n   obvious shortcuts to get a release out before everyone else. \n \n   These LOADER cracks do not work well with some virus scanners, debuggers,\n   and severely slow down the game on low-end machines.  Removing a cd\n   protection from a game, or using a legitimate crack could mean the\n   difference between night and day for some people.\n\n   A valid ISO release is as follows:\n\n    If you release a securom game, you release it with SECUROM REMOVED! \n    THUS CRACKED.\n \n    If you release a safedisc game, you release it with SAFEDISC REMOVED! \n    THUS CRACKED.\n\n    If you release a starforce game you release it with STARFORCE REMOVED! \n    THUS CRACKED.\n\n    If you release a tages game you release it with TAGES REMOVED! \n    THUS CRACKED.\n\n\n   If the cd protection is activated when you play a game, it is not\n   cracked.  As long one can play without the protection being active,\n   then it is a crack.  The protection must in no way be active!  These\n   loaders invoke the protection directly, and thus are not valid.\n\n   Working around a protection simply DOES NOT cut it. One must remove it.\n   \n    \n Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„\n  \n Install Notes (Please follow these instructions IN ORDER)\n\n   1. Unpack the release with WinRAR or equivalent\n\n   2. Burn using Nero, CDRWIN or equivalent.\n\n   3. Install.\n \n   4. From the /Crack/ directory on the CD, copy the cracked files to your\n      installation directory.\n\n   5. Play!    \n\n Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„Ã„","torrent":{"xt":"urn:btih:52c6fef2b67212b316f7f24eeafd1a284d17360a","amp;dn":"Future+Tactics+The+Uprising+VENGEANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52c6fef2b67212b316f7f24eeafd1a284d17360a","infoHashBuffer":{"type":"Buffer","data":[82,198,254,242,182,114,18,179,22,247,242,78,234,253,26,40,77,23,54,10]},"announce":[],"urlList":[]}}