{"title":"The Punk Years Documentary Episodes 1 &amp; 2 SVCD","uid":3239477,"size":778739996,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5329d8d076b8145d8439eaf4ac4b4a3b1572e5fa&amp;dn=The+Punk+Years+Documentary+Episodes+1+%26+2+SVCD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bandit999","files":3,"time":1095444901,"description":"This is an amazing documentary series that was shown on the satellite channel Play UK in 2002 shortly before it closed down. This is the only documentary that actually covers all punk rock right from the Sex Pistols up to Bad Religion, it has interviews with loads of people. Johnny Rotten, Steve Ignorant, Penny Rimbaud, Billy Bragg, Mark Perry and so many more. This is a must for all fans of punk rock, there will be opinions you agree with and ones you don't. This is a download you all need to see, its your history after all.\n\nThis is a 10 part series and i will post them 2 at a time, enjoy!\n\nProgramme 1: Wham Bam Thank You Glam\n\nA look at the nihilist rock n' roll forefathers of punk - Warhol &amp;amp; The Velvets, Iggy &amp;amp; The Stooges, MC5, Glam rock - Roxy, Bolan and Bowie - and the British Pub rockers and discover why they had such an impact on the young punks-to-be.\n\nProgramme 2: Year Zero\n\nNew York's punk scene developed from its roots in Warhol's Factory and The Velvet Underground through to the New York Dolls and venues like Max's Kansas City. We explore how the now legendary CBGB's evolved into a seminal punk club, playing host to the likes of Patti Smith, Blondie, Television, Talking Heads and The Ramones and how the New York scene informed the nascent London punks.\n\nWham Bam Thank You Glam Episode One 2002 SVCD 25 minutes\nYear Zero Episode Two 2002 SVCD 25 minutes\n\nThese are in PAL SVCD format and should be burned to CD and it will play in most DVD players. They will fit on 1 80min blank cd-r using nero.\n\nCome and join www.punktorrents.com for more of this kind of thing.\n\nEnjoy bandit999\n","torrent":{"xt":"urn:btih:5329d8d076b8145d8439eaf4ac4b4a3b1572e5fa","amp;dn":"The+Punk+Years+Documentary+Episodes+1+%26+2+SVCD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5329d8d076b8145d8439eaf4ac4b4a3b1572e5fa","infoHashBuffer":{"type":"Buffer","data":[83,41,216,208,118,184,20,93,132,57,234,244,172,75,74,59,21,114,229,250]},"announce":[],"urlList":[]}}