{"title":"Irreversible.[gtm].[2002].[french].[eng subs]","uid":4043124,"size":685396992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5341f4d3806e09808d104f009b5a02d1c57b71ab&amp;dn=Irreversible.%5Bgtm%5D.%5B2002%5D.%5Bfrench%5D.%5Beng+subs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"deathmetalmp3s","files":1,"time":1203779272,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0290673/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0290673/&lt;/a&gt;\n\nHoly Macaroni! Believe the hype, folks...this really IS one of the most shocking, confronting and raw movies ever made! It actually is one of those rare purchases that makes you wonder what the role of cinema is in modern society. IrrÃƒ?Ã‚Â©versible certainly can\\&amp;#039;t be classified as \\&amp;#039;entertainment\\&amp;#039;, that\\&amp;#039;s for sure. It merely looks like a brutal eye-opener, highly unpleasant to watch at times and it sometimes makes you even feel ashamed to be human! Some of the stuff here goes beyond your most feared nightmares and could easily provoke depression, anti-social behavior and anxiety among influential viewers. It\\&amp;#039;s real-life drama and that makes it so powerful and shocking. IrrÃƒ?Ã‚Â©versible is told backwards, \\&amp;#039;Memento\\&amp;#039;-style if you wish...only it\\&amp;#039;s a lot more effective here as it was in Memento, which actually was a pretty boring and extremely overrated movie. This very simple backwards-structure aspect gives IrrÃƒ?Ã‚Â©versible the opportunity to implement a couple of unique and rarely seen style elements. The first half hour (which actually is the end of the story) smacks you in the face right away sets the tone for a non-stop, raw experience. Also, you don\\&amp;#039;t really get to know the characters until the last chapter (which is actually the beginning of the film) The characters are a riddle to you constantly and you can\\&amp;#039;t symphatise with any of them, since you just know too little. Through wild camera movements and simplistic techno-music, a claustrophobic and horrifying atmosphere gets created and the violence is really hard to digest. The infamous scene in which Monica Belluci brutally gets raped is one of the most perverted things I\\&amp;#039;ve ever seen. It seems to go on forever and you can really visiualise the painful hell the poor girl is going through. I\\&amp;#039;d call IrrÃƒ?Ã‚Â©versible a successful combination of ancient, rough exploitation and modern art-house film-making. The brutality portrayed here is typical for the euro-shock cinema but the stylish shooting lifts it up to Cannes Festival material. Cult as pure as it comes!","torrent":{"xt":"urn:btih:5341f4d3806e09808d104f009b5a02d1c57b71ab","amp;dn":"Irreversible.%5Bgtm%5D.%5B2002%5D.%5Bfrench%5D.%5Beng+subs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5341f4d3806e09808d104f009b5a02d1c57b71ab","infoHashBuffer":{"type":"Buffer","data":[83,65,244,211,128,110,9,128,141,16,79,0,155,90,2,209,197,123,113,171]},"announce":[],"urlList":[]}}