{"title":"Cymande - Second Time Around (1973)","uid":3234870,"size":60587043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:53d9cd32a1c572705a700b7b91b4945f613c60b1&amp;dn=Cymande+-+Second+Time+Around+%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"magOwl","files":11,"time":1093691218,"description":"Cymande - Second Time Around (1973).\n\n10 songs - 57.8mb @ high VBR.\n\nCymande's second LP is captivating enough, but perhaps too political for the masses. Still, there've been few better fusions of reggae and jazz than Second Time Around. The spirited &amp;quot;Anthracite&amp;quot; is driven by horns on the chorus, a scorching sax solo, and a titillating flute. Flautist Mike Rose continues to captivate on the oddly titled &amp;quot;Willie Headache,&amp;quot; which is far too mellow to cause listeners to grab for the Tylenol. Everything is centered around Steve Scipo's bubbly bass notes, a good example being &amp;quot;Trevorgus,&amp;quot; in which the beat falls between midtempo and uptempo and everything (the horns, the rhythm, the chanting vocals) complements each other as if linked by an invisible chain. The group scintillates on &amp;quot;Fug,&amp;quot; a rapid-fire mover and shaker that speaks of people dying because of greed and deceit. Cymande let their dreads down on this one -- emoting, getting real, and performing like there's no tomorrow. Gotta give Pablo Gonsales a bone for his constant, creative work on the congas throughout; drummer Sam Kelly stays in the background, happy with his understated role and keeping it tight. Vocalist Ray King breaks off his best lead on the tempo changing &amp;quot;Bird,&amp;quot; and Joey Dee assists vocally while patting on his conga set; Peter Serreo, and Derek Gibbs sax play sparkles like champagne from beginning to end. - from AMG.\n\nenjoy and seed :]\n\n/owl","torrent":{"xt":"urn:btih:53d9cd32a1c572705a700b7b91b4945f613c60b1","amp;dn":"Cymande+-+Second+Time+Around+%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53d9cd32a1c572705a700b7b91b4945f613c60b1","infoHashBuffer":{"type":"Buffer","data":[83,217,205,50,161,197,114,112,90,112,11,123,145,180,148,95,97,60,96,177]},"announce":[],"urlList":[]}}