{"title":"WWII.The.Complete.History.10of13.XviD.AC3","uid":4242402,"size":731815936,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:53f1e5c14fd52f18b69cc76ed99aea4f76840111&amp;dn=WWII.The.Complete.History.10of13.XviD.AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1213577237,"description":"WWII The Complete History (2000)\n\n\n\nInformation\nThe British Movietone Company presents this comprehensive and thrilling look at the 20th Century&amp;#039;s most decisive conflict. Featuring a strong narrative and complete with original music scored dramatically for this program, this documentary makes for a strong and compelling narrative. Setting this program apart from others is the focus on some rarely covered parts of WWII such as Operation Barbarossa, the &quot;phony war&quot; period following the Polish invasion, the Flying Fortresses and the Manhattan Project.\n\nEpisode 1 - This is the story of the greatest war of world history. This is the story of great individuals, of men who cast huge shadows across time. In this 13 part series we examine the events and personalities that drove World War Two.\nIt is impossible to examine the events of 1939 ? 1945 without first understanding the effects wrought upon Europe by World War One. In Part one of this series we look at the legacy of Versailles and the League of Nations and their impact on events to come.\n\nEpisode 2 - Now that his systematic deletion of the Versailles Treaty was complete, Hitler began to turn his eyes to his weaker neighbours. The Anschluss had made Germany even stronger and now Hitler focused his attention on Czechoslovakia and Poland.\nIn Part Two of the series we look at how the pace of history was already propelling countries towards a war in Europe and how the public mood had changed from one of appeasement to one of opposition.\n\nEpisode 3 - The time that followed the destruction of Poland in just five weeks of frenetic activity came to be known as the ?Phoney War?, a period were neither side wanted to engage the other.\nIn Part Three of this series we look at how the war developed from these early months of quiet. Britain and France prepared to fight a war based on their successful tactics of World War One and a disastrous encounter in Norwegian waters ended with the resignation of a Prime Minister and the arrival of one of the wars great legends - Winston Churchill.\n\nEpisode 4 - On 13th May 1940 Winston Churchill became Britain?s Prime Minister. He gave no quick solution to the conflict but swore there would be no appeasement of Hitler. This decision was made all the more difficult as, in the first few hours of Churchill taking office, the war in Europe exploded into life. After the surrender of France the population of Britain began to grow ever fearful. Their enemy was now just 20 miles away, across the English Channel and plotting an invasion. In Churchill?s words: ?The Battle of France is over. The Battle of Britain has begun.?\n\nEpisode 5 - In Episode 5 of this complete history we look at the impact of the Battle of Britain. Hitler?s aim was total air supremacy, to negate British Naval power and enable the German army to cross the Channel and invade Britain. But the battle proved to be more complex. Gradually this European war began to spread to all corners of the globe. As Japan and Italy attached their destiny to Hitler and the USA began to introduce peacetime conscription, it seemed that the tide of war was inevitably pulling every country into its path.\n\nEpisode 6 - In Episode Six of this series we examine how, as 1940 drew to a close the conflict was spreading. Disasters were continuing to unfold around the Italian war effort. At the same time another front had opened up in North Africa; Erwin Rommel and his North Afrika Korps stepped up to take their place in history.\nOn 22nd June 1941 Hitler gave the order that would begin Operation Barbarossa, a three pronged attack designed to cripple the Soviet Union. But a German victory was not a foregone conclusion as the first snow of a harsh Russian winter had begun to fall.\n\nEpisode 7 - Episode 7 of this series begins in Russia, with Stalin?s army fighting to defend Moscow. Although Hitler?s Operation Barbarossa faltered under the weight of a heavy Russian winter the battle for the east wasn?t over. As victory on one front inevitably meant an increasing threat from another, this time it was the turn of the Japanese. Eager to remove all outside influence in the Pacific, the Japanese began a course of action that would determine the outcome of the entire war. They attacked Pearl Harbour, a US Navy base in Hawaii and with one stroke brought America into the war.\n\nEpisode 8 - In Episode 8 of this series we examine the increasingly savage fighting in the Pacific and we look to Russia, as Hitler?s forces turn their attention to the city of Stalingrad.\nThe fighting in the Mediterranean and North Africa took on greater prominence as the siege of the island of Malta intensified and Rommel mounted ever more threatening operations in the desert.\n\nEpisode 9 - As the conflict continued countries in all corners of the globe became deeply entangled in their own theatres of war. In the desert the Afrika Korps seemed certain of their successful capture of Egypt. But yet another change of British commander saw the arrival of a man who created his own desert legend, a legend to match Rommel ? the commander?s name was Bernard Montgomery. The Allies built on their successes and began an offensive, rather than defensive, campaign. With these new victories firmly secured Churchill and Roosevelt met to discuss the ultimate war aim ? the unconditional surrender of all Nazi forces.\n\nEpisode 10 - In Episode 10 of ?World War II: The Complete History? we see how across the world the forces of the Axis were in retreat. In the sands of the desert Rommel had been overwhelmed by the Allies and driven out of Africa and the Italians deposed their leader Mussolini and surrendered to the Allies. Germany?s last ditch attempt to obtain victory over the Russians led to a final great tank battle near the city of Kursk but it made no difference. With the forces of Nazism so obviously on the defensive the Allied leaders gathered to discuss the next big push ? the invasion of Western Europe: D ? Day\n\nEpisode 11 - By the spring of 1944 it seemed obvious that the Allies would have to mount an invasion of Western Europe in order to bring about the end of the war. The invasion began on the beaches of Normandy. In the Pacific Japan was struggling after the destruction of the last of her naval strength.\nEverywhere the Nazis were being rolled back but attempts to bring about a swift end to the conflict failed. A series of defeats in badly planned battles across Western Europe meant that the war continued into another year\n\nEpisode 12 - If any of those involved in the war doubted what all the fighting had been for then the last months of conflict would show them. As soldiers entered the territory of the Third Reich conclusive proof of the evils of Nazism was found as the death and concentration camps were uncovered. In Berlin, as the Russian Army laid siege to the city, Hitler retired to the safety of his bunker and committed suicide. The world now watched and waited for the rest of the Axis forces to succumb to an unconditional surrender.\nOn the 8th May 1945 the war in Europe came to an end.\n\nEpisode 13 - Even after the triumph of VE Day, there still remained a war to be fought.\nThe final act of this war was played out in the skies above Japan. A new US President, Harry Truman, took the devastating decision to deploy a new weapon against the forces of Japan. The atomic bomb was dropped on Hiroshima and Nagasaki and the dreams of Imperial Japan were ended at a stroke.\nOur modern world springs from the ashes of World War Two and the lessons of good versus evil. The lesson of history created by those millions who suffered and died, the lesson to both present and future generations, is that we must never forget.\n\nRelated Documentaries\nWar of the Century\nThe History of WWII\nBattlefield\n\nTechnical Specs\n\nTotal Size (MB) ....: ~700.00 MB\nTotal Streams ......: 2 Stream(s)\n\nVideo Length .......: ~00:52:00\nVideo Codec Name ...: XviD MPEG-4 codec\nVideo Bitrate ......: ~1650 KB/s\nResolution .........: 640 x 480\nAspect Ratio .......: 1.33:1\nQuality Factor .....: 0.183 B/px\n\nAudio Codec Name ...: FAST Multimedia AG DVM (Dolby AC3)\nAudio Bitrate ......: 192 KB/s (CBR)\nChannels ...........: 2 Ch\nSampling Rate ......: 48000 Hz\n\n.MVGroup.Forum.avi.","torrent":{"xt":"urn:btih:53f1e5c14fd52f18b69cc76ed99aea4f76840111","amp;dn":"WWII.The.Complete.History.10of13.XviD.AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53f1e5c14fd52f18b69cc76ed99aea4f76840111","infoHashBuffer":{"type":"Buffer","data":[83,241,229,193,79,213,47,24,182,156,199,110,217,154,234,79,118,132,1,17]},"announce":[],"urlList":[]}}