{"title":"jPod.S01E06.HDTV.XviD-2HD","uid":4032609,"size":367495504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54377db88a0f9213b028084b6a40f863477ff4fe&amp;dn=jPod.S01E06.HDTV.XviD-2HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"spots","files":1,"time":1203209594,"description":"jPod.S01E06.HDTV.XviD-2HD\n\nBased on Douglas Coupland\\&amp;#039;s cult bestseller of the same name, jPod is a one-hour drama series with amusing and evil twists. Ethan Jarlewski (DAVID W. KOPP) and four coworker pals are bureaucratically marooned in the bowels of a massive video game company, Neotronic Arts.\n\nThe series chronicles the amoral, lighthearted and often shocking lives of these five \\&quot;Podsters.\\&quot; In Season One alone, they routinely deal with Chinese gangs, boneheaded bosses, sexual swinging, power lesbians, British royalty, gore-laced game designs and ...it\\&amp;#039;s a very long list.\n\njPod also follows the lives of Ethan\\&amp;#039;s seemingly ultra normal parents, Jim (ALAN THICKE) and Carol Jarlewski (SHERRY MILLER). Jim and Carol are the new post-middle class, now enmeshed in marijuana grow-ops, biker gangs and ballroom dancing.\n\njPod is ultimately about the new relationships and modes of being that we, as citizens of this strange new century, are creating as we move forward. There is no map into the unknown, but we do have these five kids and a lot of heart and dark humor.\n\njPod stars David W. Kopp, Emilie Ullerup, Steph Song, Ben Ayres, Torrance Coombs, Sherry Miller and Alan Thicke. Produced by No Equal Entertainment for CBC Canada, jPod is created by Douglas Coupland and Michael MacLennan. Larry Sugar, Douglas Coupland and J.B. Sugar are executive producers; Matthew Chipera is producer. Series writers are Douglas Coupland, J.B. Sugar, Daegan Fryklind, Dennis Heaton and Michael MacLennan. Episodic directors are Mike Clattenburg, Brad Turner, J.B. Sugar, Tim Southam, Peter Deluise, Rachel Tallalay and Kristoffer Tabori.","torrent":{"xt":"urn:btih:54377db88a0f9213b028084b6a40f863477ff4fe","amp;dn":"jPod.S01E06.HDTV.XviD-2HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54377db88a0f9213b028084b6a40f863477ff4fe","infoHashBuffer":{"type":"Buffer","data":[84,55,125,184,138,15,146,19,176,40,8,75,106,64,248,99,71,127,244,254]},"announce":[],"urlList":[]}}