{"title":"Reactive.Software.Google.Talk.Password.Recovery.1.10.02.08.CRACK","uid":4035387,"size":633027,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5458c54f77733342d39f9b3080cdf99eb108e064&amp;dn=Reactive.Software.Google.Talk.Password.Recovery.1.10.02.08.CRACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ony","files":2,"time":1203401102,"description":"APPLICATION : Reactive Software Google Talk Password Recovery 1.10.02.08 *CRACKED*\n\t       OS : win\n       TYPE : password util\n        WWW : http://www.reactive-software.com\n    RELDATE : dunno\n PROTECTION : serial crap\n CRKRELDATE : 19/02/2008\n\nINSTALLATION:\n              install.\n              copy .exe from \\crack and overwrite installed one.\n              click &quot;register now&quot; if enabled, enter something.\n\n       NOTES: \n              install not needed. running cracked standalone works fine.   \n              more sparetime killed.. enjoy! / ONY\n\nABOUT:\n\nGoogle Talk Password Recovery is a utility for finding and decrypting Google Talk,\nGmail Notifier, Google Desktop, Picasa and Google Photos Screensaver passwords that\nare stored on your computer with a click of a button! This password decoder works\nwhen &quot;Remember Password&quot; checkbox is ticked in GTalk instant messenger. Passwords\nfrom multiple profiles can be recovered, all versions of Google Talk are supported.\nThis password decoder will also find a saved password from Gmail Notifier &amp; Picasa.\nGoogle services passwords from Firefox and Internet Explorer are recovered too.\nThis is possibly the best password decrypter for Google passwords that you can find\non the internet! \n\nFunctionality of Google Talk password recovery - in other words, what this tool can do:\n\n    * All versions of Google Talk are supported\n    * Multiple profile password recovery\n    * Decrypt Google Talk password for account (GTalk password decrypter)\n    * Decode Google Talk passwords (GTalk password decoder)\n    * Crack Google Talk profile passwords (GTalk password cracker)\n    * Recover Google Talk password (GTalk password recovery)\n    * Find Google Talk passwords (GTalk password finder)\n    * Google Talk password ripper (rip GTalk passwords)\n    * Google Talk password hacker (will hack GTalk passwords for saved accounts only on local accounts)\n    * Google Talk remote account hacker (hacking GTalk passwords is not implemented)\n\nAdditional features of Google Talk Password Recovery:\n\n    * GMail account password recovered from Gmail Notifier\n    * Picasa Web Albums password (recovers forgotten Google Picasa password - only when the password is saved by Picasa on the local computer)\n    * Google Photos Screensaver password is decoded - New!\n    * Google Desktop password is decrypted - New!\n    * GMail account password recovered from browsers\n    * Google services account information recovered from browsers (including passwords) - Firefox and Internet Explorer\n\n    * Autodetection of where the account information is stored\n    * Support of multiple profiles\n    * Support of proxy server passwords\n","torrent":{"xt":"urn:btih:5458c54f77733342d39f9b3080cdf99eb108e064","amp;dn":"Reactive.Software.Google.Talk.Password.Recovery.1.10.02.08.CRACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5458c54f77733342d39f9b3080cdf99eb108e064","infoHashBuffer":{"type":"Buffer","data":[84,88,197,79,119,115,51,66,211,159,155,48,128,205,249,158,177,8,224,100]},"announce":[],"urlList":[]}}