{"title":"Last knight of camelot","uid":4253912,"size":555128,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5460d47c0f4dbc68abd4604105ea337a9ff03293&amp;dn=Last+knight+of+camelot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"josef87","files":1,"time":1214150181,"description":"In the age of King Arthur and his Round Table, Merlin and the king send out a call for a new knight to join the court. The player&amp;#039;s character takes up the challenge to prove himself worthy of the honor, and ultimately must scour the kingdom in search of Excalibur and the Black Knight whose Dwarf minions have stolen it. There are hidden treasure troves, teleports and special items to be found as well.\n\nLast Knight at Camelot is a side-scrolling platformer somewhat in the tradition of Epic MegaGame&amp;#039;s Jill of the Jungle series; the player has no weapons, however, and must either avoid enemies completely or jump on them to defeat them. The keyboard&amp;#039;s four arrow keys move the knight left and right, enable him to look up and down, climb up and down, move switches and enter doorways; the shift key makes him jump.\n\n\n\nTrivia\nThe same game was released by Adventure LearningWare with added educational content under the title &quot;Word Games at Camelot&quot;. The added content consisted of word lists for SAT preparation: &quot;More than 3300 words, their definitions, and sentences that use them.&quot; It included also a word list editor to add the player&amp;#039;s own words and the ability to generate printed material: crosswords, word searches, and flashcards, and allowed the student to keep track of progress.","torrent":{"xt":"urn:btih:5460d47c0f4dbc68abd4604105ea337a9ff03293","amp;dn":"Last+knight+of+camelot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5460d47c0f4dbc68abd4604105ea337a9ff03293","infoHashBuffer":{"type":"Buffer","data":[84,96,212,124,15,77,188,104,171,212,96,65,5,234,51,122,159,240,50,147]},"announce":[],"urlList":[]}}