{"title":"Blood Ties S1 Disc 3 (11-15)","uid":4034223,"size":4680937472,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54cd5034e25bc2b5c01cfd1ef31448271ed0f1e4&amp;dn=Blood+Ties+S1+Disc+3+%2811-15%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JL1989","files":11,"time":1203333023,"description":"DVD-Rip of Disc 3 of the Blood Ties Season 1 collection. Inlcudes all menus, ready to burn to DVD. This torrent contains the following episodes:\n\n11. Post Partum\n12. Norman\n13. D.O.A.\n14. Wild Blood\n15. 5:55\n\nAll eps are uncut, high dvd-quality, with full titles and end credits.\n\nPlease support this wonderful show by purchasing the episodes from ITunes or the DVD set from Amazon UK (Region 2 only!). And let&amp;#039;s keep pushing for another season of Blood Ties!\n\nFor your information, if you saw this show on Lifetime TV in the USA, the original season of 22 epsiodes was split up into 2 &quot;seasons&quot;, this set will include all 22 episodes which make up the full Season 1. I will upload the other discs as soon as there are more seeds on this torrent besides just me. So please, SEED SEED SEED! And enjoy!\n\nDue to a recent problem with my main PC (RAM chip died) I will be seeding this torrent on my smaller laptop. I will be shutting the laptop down for a &quot;rest&quot; every night/early morning.  So, if there are no seeds when you join the torrent, don&amp;#039;t worry!  I will be back on the next day and I will keep seeding until there are at least 2 or 3 other seeds (or full copies available).  If the torrent remains dead for more than 24 hours and you want it, I can always come back to seed if asked.  And when I get my new memory I will be able to seed longer.  Thanks for your patience!","torrent":{"xt":"urn:btih:54cd5034e25bc2b5c01cfd1ef31448271ed0f1e4","amp;dn":"Blood+Ties+S1+Disc+3+%2811-15%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54cd5034e25bc2b5c01cfd1ef31448271ed0f1e4","infoHashBuffer":{"type":"Buffer","data":[84,205,80,52,226,91,194,181,192,28,253,30,243,20,72,39,30,208,241,228]},"announce":[],"urlList":[]}}