{"title":"War Of The Worlds - Original","uid":4021700,"size":787868492,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55c5d9e2e9950836c773a795e6eedb3896dfe56b&amp;dn=War+Of+The+Worlds+-+Original&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pcconsultant2007","files":2,"time":1202690742,"description":"Actors: Gene Barry, Ann Robinson, Les Tremayne, Robert Cornthwaite, Sandro Giglio \nDirectors: Byron Haskin \nFormat: Closed-captioned, Color, Dolby, DVD-Video, NTSC \nLanguage: English, French \nRegion: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n\nAspect Ratio: 1.33:1 \nNumber of discs: 1 \nRating:  \nStudio: Paramount \nDVD Release Date: April 20, 1999 \nRun Time: 85 minutes \n\nBased on H.G. Wells&amp;#039; classic novel, George Pal&amp;#039;s The War Of The Worlds is a classic in its own right. The movie transfers the story from England and the turn of the century to California and the 1950&amp;#039;s. Some people see the paranoia of the &amp;#039;50s in the movie but the novel also had a strong theme of fear of things beyond our ken. Pal often included a religious theme in his movies and this film would have been better without it, but it does not detract from the movie enough to keep it from being a classic. The story is that of an invasion of Earth by coldly intelligent Martians. Told in clear, bold strokes with exceptional special effects (for the time) and fine performances by the two leads, Gene Barry and Ann Robinson, The War Of The Worlds should be in every collection of science fiction movies. \nThe DVD transfer is excellent. The picture is sharp and clear. The color is strong and rich, as Technicolor should be. Like most people, I had only seen this movie on television and it never looked as good as it does on DVD. The picture resolution is so good that you can easily see the wires supporting the Martian war machines. The sound does not measure up to the standard of the video. It is mono and there are cracks and pops on the sound track during the early part of the movie, though I didn&amp;#039;t notice them as much in the later scenes (but that may simply be because I was caught up in the excitement of the story). The disk provides only a trailer as supplemental material (I don&amp;#039;t consider scene selection to be a special feature, it should be standard on any DVD). The disk is formatted in TV standard but that is not significantly different from the movie&amp;#039;s original ratio, since it was not shot in what we now call widescreen. \n\nNOTE - For anyone thinking that my torrents are FAKE, please find a life or something else to do besides disrupt someones torrent. \nMy uploads are of good quality, either from Rips, R5 sources or Screeners, \nunless otherwise specified. They DO NOT contain viruses, scams or any other \nnegative information. For someone who has NO uploads of his own to offer anyone, \nyou sure do have alot to say... GO FIGURE...!!! ","torrent":{"xt":"urn:btih:55c5d9e2e9950836c773a795e6eedb3896dfe56b","amp;dn":"War+Of+The+Worlds+-+Original","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55c5d9e2e9950836c773a795e6eedb3896dfe56b","infoHashBuffer":{"type":"Buffer","data":[85,197,217,226,233,149,8,54,199,115,167,149,230,238,219,56,150,223,229,107]},"announce":[],"urlList":[]}}