{"title":"Batman - The Cult [BBN][h33t]","uid":4042134,"size":58753449,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:55cfcc74adec74c63b99ffff9c1a7f774a9efe01&amp;dn=Batman+-+The+Cult+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seedYAbastid","files":5,"time":1203729895,"description":"[IMG]http://img182.imageshack.us/img182/2900/bmthecultat4.png[/IMG]\nBatman - The Cult (Books 1-4)\n[quote]Writer: Jim Starlin, Artist: Berni Wrightson\n\nFrank Miller changed the rules in 1986 with The Dark Knight Returns. Jim Starlin follows up on that success, borrowing certain ideas from Miller&amp;#039;s landmark story -- including a wicked new Batmobile -- while keeping elements of The Cult firmly within the bounds of current comic-book chronology.\n\nThe Cult is one of the stand-out stories from the brief period when Jason Todd filled Robin&amp;#039;s pixie boots. It also manages to mess with the Batman&amp;#039;s sanity and create a major, citywide crisis in Gotham without DC&amp;#039;s usual several-month crossover extravaganza. This four-part story pits Batman against Deacon Blackfire, a mystic figure who may have roots as old as Gotham itself. Blackfire, with sheer charisma and an undeniable messiah complex, has created an army among the city&amp;#039;s disaffected and homeless, and that army expands as he seems to get results in fighting crime and making the streets safe at night.\n\nBut Blackfire has a hidden agenda, and Batman stands in his way. In an affecting series of sequences, Batman&amp;#039;s will and psyche are systematically broken down, leaving him open to Blackfire&amp;#039;s influence and suggestions. It is a very different Batman, torn with confusion and fear, who later must face Blackfire and end the mystic&amp;#039;s quest for martyrdom. Everything is brought to life by illustrator Berni Wrightson, who creates significant tension in his art.\n\nThe Cult was one of the best comic-book series of the late &amp;#039;80s, and I&amp;#039;m pleased to say it holds up more than a dozen years later. This one&amp;#039;s a keeper.[/quote]\n\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:55cfcc74adec74c63b99ffff9c1a7f774a9efe01","amp;dn":"Batman+-+The+Cult+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55cfcc74adec74c63b99ffff9c1a7f774a9efe01","infoHashBuffer":{"type":"Buffer","data":[85,207,204,116,173,236,116,198,59,153,255,255,156,26,127,119,74,158,254,1]},"announce":[],"urlList":[]}}