{"title":"Big Brother USA 9 Live Feeds - 02-15&amp;16-08","uid":4032707,"size":546365081,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:564a64fa6246867372178bf22c16a483a0771754&amp;dn=Big+Brother+USA+9+Live+Feeds+-+02-15%2616-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xx2000xx","files":18,"time":1203257611,"description":"Big Brother USA Live Feeds - 02/15&amp;16/08 - xx2000xx\n\nFor youtube vids + exclusive content go to - http://bbcouchpotatoes.blogspot.com/\n\nFirst off, sorry for not getting uploading it yesterday. Youtube deleted my account so I was pretty pissed off and didn&amp;#039;t want to deal with anything.\n\nThat said, I had well over a gig of action the past 2 nights but hell if I&amp;#039;m going to post that much. So here is only the best bits from the past 2 days. It&amp;#039;s already 7AM here so I&amp;#039;m going to make it quick.\n\nNot a lot of game talk as Parker/Jen are 100% going home. Nothing will change in the span of 4 days at all, it&amp;#039;s a lock.\n\n- The 15th\n\nPart 1 - 14 min.\nRandom talk then Matt tells Parker about the BJ he got.\n\nPart 2 - 32 min.\nSharon/Josh break down the game, and how they are going to screw over parker/jen - Then Sharon gets Nat on board too even though Matt is 100% for Parker. IMO Sharon/Josh have this game wrapped up already, watch it come down to them and Adam/Sheila, the floaters.\n\nPart 3 - 21 min.\nAllison talks about she&amp;#039;ll play dirty to get far (messing around with Matt) - Then she flirts with him.\n\nPart 4 - 7 min.\nThe only clip I have of Adam since day one. He tells a funny story about getting hand jobs at a message parlor. He has the house laughing their ass off.\n\nPart 5 - 28 min\nThis is the whole Amanda/Alex molestation deal. In retrospect I should have recorded a lot more as I dumped most of it because it&amp;#039;s a HUGE issue in the house and the internet. Anyways, this is all that I have of it.\n\n- The 16th.\n\nPart 1 - 21 min.\nAmanda seems strangely flirty with somebody who &quot;allegedly&quot; molested her the night before.\n\nPart 2 - 18 min.\nNatalie does a strip dance - The house talks about sex - Matt tells both Parker and Alex about getting the BJ.\n\nPart 3 - 13 min.\nNatalie gets naked in the hot tub. She is quickly becoming the star of this season.\n\nPart 4 - 20 min.\nNatalie starts giving a HJ to Matt then of course they had to switch the camera to the Alex/Amanda/Parker drama. It&amp;#039;s edited, so there is maybe 5 minutes that you missed. When we get back to them she is still giving him a HJ then gives him a BJ. And yes, she does swallow, but I wouldn&amp;#039;t expect anything less from her :-). Right after he finished he raced out of the room to tell the boys what just happened. Yet she&amp;#039;s not allowed to say anything (the famous pinky swear). Amanda now knows about it as you will see in the next clip and also knows all the shit he was talking about her. We&amp;#039;ll find out tomorrow if Amanda spills the beans.\n\nPart 5 - 16 min.\nAmanda spies on the boys without them knowing. Good stuff.\n\nMisc clips - 47 megs\nJust random small clips.","torrent":{"xt":"urn:btih:564a64fa6246867372178bf22c16a483a0771754","amp;dn":"Big+Brother+USA+9+Live+Feeds+-+02-15%2616-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"564a64fa6246867372178bf22c16a483a0771754","infoHashBuffer":{"type":"Buffer","data":[86,74,100,250,98,70,134,115,114,23,139,242,44,22,164,131,160,119,23,84]},"announce":[],"urlList":[]}}