{"title":"Oh Susanna-Short Stories (2007-VBR) (Folk-Country-Rock)","uid":4032547,"size":50417902,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:569865c83f9e9290be84c894e35eecb1cc665704&amp;dn=Oh+Susanna-Short+Stories+%282007-VBR%29+%28Folk-Country-Rock%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cheng","files":16,"time":1203206737,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/61Pd4%2BzY-jL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/61Pd4%2BzY-jL._SS500_.jpg&lt;/a&gt;\n\n-=Review=- by Peter Walenta &quot;flying parsons&quot;\n\nDeparting from her raucously up-tempo roots rock 2003 album &quot;Oh Susanna&quot;, Suzie Ungerleider a/k/a &quot;Oh Susanna&quot;, delivers a quieter yet moving set of songs on her latest record, &quot;Short Stories&quot; (Stella Records) that harken back to her earliest recorded outings such as the alt.country classic, &quot;Johnstown&quot; and her 1997 debut EP, &quot;Oh Susanna&quot;. I&amp;#039;ve been avidly following the musical adventures of American born Canadian, Suzie Ungergleider for nearly 9 years now and the maturity as a singer and the growth as a songwriter that Suzie demonstrates on &quot;Short Stories&quot; is very impressive. The fact that her wonderful voice and her heart felt songs are presently known only to a small circle of people, mainly fans of Canadian country rockers Blue Rodeo and some Lilith Fair afficionados, is nothing short of criminal. Ah, but semi-popular niches are where the most honest and original music gets made. My job is to entice you to check out &quot;Oh Susanna&quot; and I highly recommend &quot;Short Stories&quot; as the place to start if you&amp;#039;re just discovering Suzie by live performances, through reading blogs or from her site on\n\nIn other reviews, I&amp;#039;ve mentioned stand-out tracks, but &quot;Short Stories&quot; should be heard as a whole, as each of the 11 songs creates a total mood akin to a contemplative boat ride on a placid river where one rolls past vignettes of an aging parent plagued by maternal regret and concern, schoolyard fights, the mythical Stagger Lee, tarnished beauty queens, holy rollers, Lady Liberty and yes, even Billy the Kid. Comparisons to Emmylou Harris and Mary Gauthier are apt to describe Suzie&amp;#039;s rich, clear and expressive vocal delivery. On &quot;Short Stories&quot;, Suzie mines themes such as the need to be free from abuse, cold, loneliness, and fear. Her cover of an obscure Bob Dylan tune &quot;Billy 4&quot; is totally in keeping with the theme of people dealing with tragic consequences often of their own making. The musicians on &quot;Short Stories&quot; create both rustic and modern sounds that compliment Suzie&amp;#039;s often stark lyrics. Blue Rodeo&amp;#039;s Bob Packwood and Bazil Donovan add solid keyboard and bass fills. String arrangements on several of the songs further keep the mood peaceful but not somber. \n\nThese songs evoke a calm won by hard bitten experience. Is &quot;Short Stories&quot; autobiographical? Not exactly according to Ungerleider when asked the question by Exclaim&amp;#039;s Kerry Doole, &quot;I feel like what I do has a confessional aspect to it, though it&amp;#039;s not necessarily me that is confessing. I find pretending I&amp;#039;m someone else that much more intriguing. I don&amp;#039;t think my life is all that worthy of writing into songs in a literal sense. If I were to write about my life, I&amp;#039;d still be manipulating it in such a way as to fictionalize it.&quot; Exclaim.com Review - Wood Wires And Whiskey - June 2007, [...] \n\nIn sum, &quot;Short Stories&quot; is one of the best albums of 2007. Don&amp;#039;t overlook this record, as it is a beautiful, gentle yet honest adult song cycle by a keenly observant story teller that is a true delight to listen to.\n &lt;a href=&quot;\nhttp://www.ohsusannamusic.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ohsusannamusic.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.amazon.com/dp/B000PD3LIK/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/dp/B000PD3LIK/&lt;/a&gt;\n\n---------------------------------------------\n\nArtist.......: Oh Susanna\nAlbum........: Short Stories\nLabel........: Stella Records/Outside\nGenre........: Folk-Rock\nCatnr........: 6-23339-9032-2-6\nsource.......: CDDA\nrip.date.....: May-12-2007\nstr.date.....: My-01-2007\nquality......: VBR/44,1Hz/Joint-Stereo\nUrl..........: www.ohsusannamusic.com.\n\ntrack  title                                          time\n\n 01.   Pretty Face                                   03:37\n 02.   Beauty Queen                                  02:22\n 03.   Bullies                                       02:16\n 04.   Three Shots                                   04:05\n 05.   Greyhound Bus                                 03:47\n 06.   Miss Liberty                                  03:21\n 07.   Schoolyard                                    03:50\n 08.   Pretty Penny                                  02:54\n 09.   Holy Roller                                   03:23\n 10.   Billy 4                                       05:43\n 11.   Filled With Gold                              03:32\n\n                                            Runtime  38:50 min\n                                            Size     46,0 MB\n\n\nRelease Notes:\n\nOh Susanna, a.k.a. Suzie Ungerleider, is known for\nher lovely Dolly Parton-esque voice and her moving\nsongs of people struggling in life and love. Her\nlatest album is called Short Stories, which follows\nup on her self-titled CD from 2003. Short Stories\nis just that: mini-vignettes of various characters,\nreal and imagined personal joys and tragedies sung\nin that sweet, sad voice.\n","torrent":{"xt":"urn:btih:569865c83f9e9290be84c894e35eecb1cc665704","amp;dn":"Oh+Susanna-Short+Stories+%282007-VBR%29+%28Folk-Country-Rock%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569865c83f9e9290be84c894e35eecb1cc665704","infoHashBuffer":{"type":"Buffer","data":[86,152,101,200,63,158,146,144,190,132,200,148,227,94,236,177,204,102,87,4]},"announce":[],"urlList":[]}}