{"title":"TaskPaper 1.0.3 (MacHeist 2)","uid":4035538,"size":937588,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:56e596e4689b282fd01529b7ddf909cf4a31bbbf&amp;dn=TaskPaper+1.0.3+%28MacHeist+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kantijob","files":1,"time":1203414126,"description":"TaskPaper 1.0.3 (26)\nGet things done.\n\nFor Mac users who want a simpler way to stay organized and get things done. TaskPaper is a simple to-do list that&amp;#039;s surprisingly adept. Unlike the competition, TaskPaper&amp;#039;s text based interface is focused on paper-like simplicity. Requires Mac OS X 10.4 or later\n\n\n* Simplify your work\n\nTaskPaper makes it easy to create lists of tasks and group them by project. All of your information is stored in a simple text file that is easy to take with you on the go, and edit when TaskPaper isn&amp;#039;t available. Even on Windows. When TaskPaper opens your file, it auto formats the content to look good and provides lots of enhancements for quickly editing and viewing the content.\n\n\n* Paper-like simplicity\n\nPaper-like simplicity sets TaskPaper apart. Unlike standard organizer apps that have many different views and complex database style user interfaces, TaskPaper is built around a simple text base user interface that looks like this:\n\n    Project 1:\n    - task 1\n    - task 2 @done\n    Project 2:\n    - task 3\n    - task 5\n    Archive:\n    - task 6 @done\n    - task 4 @done\n\nOrganizing your tasks with TaskPaper is as fast, easy, and portable as typing in a text file.\n\n\n* Surprisingly powerful\n\nIn TaskPaper&amp;#039;s hands your simple text to-do list becomes surprisingly powerful.\n\nTaskPaper excels at the fundamentals of Getting Things Done Â®. Nothing is better at quickly entering tasks and projects. The text interface provides a clean, compact way to view your lists. Creating tasks, completing tasks, and deleting tasks can all be accomplished with single keystrokes.\n\nTaskPaper knows how to filter your tasks so you can easily manage thousands of tasks in a single file. Click on a project&amp;#039;s title hyperlink to filter out other projects and just focus on that project&amp;#039;s tasks. Click on a tag hyperlink and instantly see all the other tasks sharing that tag. Use the project toolbar popup menu to jump to any of your projects. The toolbar search fields stays fast even with thousands of tasks.\n\n\n* Reviews\n\n&quot;It&amp;#039;s a very simple, but intriguing and original concept. I&amp;#039;ve been using it for a few weeks, and it&amp;#039;s definitely worth a look.&quot; ? John Gruber, Daringfireball.net\n\n&quot;Don&amp;#039;t buy TaskPaper if you&amp;#039;re looking for a sophisticated personal information manager, because it&amp;#039;s nothing of the sort. All it can do is manage smart lists for busy people, but it does this very well indeed.&quot; ? Giles Turnbull, MacUser 5/5 Rating\n\n&quot;Because, friends, TaskPaper is just about fiddle-proof, and, frankly, I know a lot of people who could benefit from that today.&quot; ? Merlin Mann, 43Folders.com\n\n&quot;TaskPaper?s strength is that it lets you focus on crossing out those tasks instead of building a self-referential web of unfinished business which separates you from the cold, harsh reality of all the work you need to do.&quot; ? Scott McNulty, Tuaw.com\n\n&quot;Using TaskPaper, I started doing my grocery list. While such a project is hardly complex, I was surprised at how pleasant it was using TaskPaper.&quot; ? Charles Jade, Arstechnica.com\n\n\n* Is TaskPaper the right tool for you?\n\nTaskPaper is designed as a simple alternative to full featured GTD Â® programs like OmniFocus. If TaskPaper does everything that you need, then it is likely the better choice. If you&amp;#039;re certain that you need more then OmniFocus comes from a great Mac developer with a great tradition. Both apps are free to try, see what works best for you.\n\nHere are the features that I think make TaskPaper special:\n\nText Interface\nUsing text as the primary interface has many benefits. It&amp;#039;s fast: auto-complete tasks are created in a single keystroke. It&amp;#039;s flexible: there&amp;#039;s no wrong way to structure your file. Text provides the cleanest and most compact display for lists and has the added benefit of portability.\n\nProject Focus\nA single text file allows you to see everything at once. Project links provide the other essential feature: the ability to focus on a single project and its tasks.\n\nTagging and Searching\nTaskPaper looks and feels just like a text file, but it&amp;#039;s fast like a database. Click on a tag hyper-link and you&amp;#039;ll get an instant list of all other tasks that share that same tag. The toolbar search fields stays instantaneous even with thousands of tasks.\n\nKeyboard Support\nEverything can be done from the keyboard. Navigate through hundreds of projects and thousands of tasks in a few keystrokes. Command-L to show a list of all projects. Command-D to mark the current task as done. Command-K to delete the current task.\n\n &lt;a href=&quot;\nhttp://hogbaysoftware.com/products/taskpaper&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hogbaysoftware.com/products/taskpaper&lt;/a&gt;\n\n------------------------\n\nAfter mounting the .dmg file, license info is included as the SN#.\n\n(Part of the MacHeist 2 bundle)","torrent":{"xt":"urn:btih:56e596e4689b282fd01529b7ddf909cf4a31bbbf","amp;dn":"TaskPaper+1.0.3+%28MacHeist+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56e596e4689b282fd01529b7ddf909cf4a31bbbf","infoHashBuffer":{"type":"Buffer","data":[86,229,150,228,104,155,40,47,208,21,41,183,221,249,9,207,74,49,187,191]},"announce":[],"urlList":[]}}