{"title":"WHEN HARRY MET SALLY - [ENG][1989] - LIBRE &amp; VERITAS","uid":4112479,"size":815854764,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:57026cb57292033532743278e707f498e2d67b2a&amp;dn=WHEN+HARRY+MET+SALLY+-+%5BENG%5D%5B1989%5D+-+LIBRE+%26+VERITAS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Libre_Veritas","files":1,"time":1207135584,"description":"When Harry Met Sally... is a 1989 American film written by Nora Ephron, and directed by Rob Reiner. The romantic comedy stars Billy Crystal as Harry and Meg Ryan as Sally. The film follows the title characters from the time they meet on a carpool ride from the University of Chicago to New York, through the next twelve years or so of chance encounters in New York City. The film raises the question &quot;Can men and women ever just be friends?&quot; and advances many ideas about love that have become household concepts now, such as the &quot;high maintenance&quot;[1] girlfriend and the &quot;transitional person&quot;.[2]\n\nThe origins of the film came from Reiner&amp;#039;s return to single life after a divorce. Ephron interviewed Reiner and it provided the basis for Harry. Sally was based on Ephron and some of her friends. Crystal came on board and made his own contributions to the screenplay, making Harry funnier. Ephron supplied the structure of the film with much of the dialogue based on the real-life friendship between Reiner and Crystal. The soundtrack consists of standards performed by Harry Connick, Jr., with a big band and orchestra arranged by Marc Shaiman. Connick won his first Grammy for Best Jazz Male Vocal Performance.\n\nColumbia Pictures released the film using the &quot;platform&quot; technique, which involved opening it in a few select cities letting positive word of mouth generate interest and then gradually expanding distribution over subsequent weeks. When Harry Met Sally... grossed a total of US$92 million in North America, well above its $16 million budget. Ephron received a British Academy Film Award, an Oscar nomination, and a Writers Guild of America Award nomination for her screenplay. The film is 23rd on AFI&amp;#039;s 100 Years... 100 Laughs list of the top comedy films in American cinema and number 60 on Bravo&amp;#039;s &quot;100 Funniest Movies&quot;. In early 2004, the film was adapted for the stage in a production starring Luke Perry and Alyson Hannigan.","torrent":{"xt":"urn:btih:57026cb57292033532743278e707f498e2d67b2a","amp;dn":"WHEN+HARRY+MET+SALLY+-+%5BENG%5D%5B1989%5D+-+LIBRE+%26+VERITAS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57026cb57292033532743278e707f498e2d67b2a","infoHashBuffer":{"type":"Buffer","data":[87,2,108,181,114,146,3,53,50,116,50,120,231,7,244,152,226,214,123,42]},"announce":[],"urlList":[]}}