{"title":"All Amityville Movies 1 - 9","uid":4022316,"size":6608675920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5746814ee74893406fc2e922e731884b38994355&amp;dn=All+Amityville+Movies+1+-+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"captainelliotspencer","files":24,"time":1202688854,"description":"                   Amityville Movie Collection\n                        All Movies 1 - 9\n                   ------------------------------ \n\n1.) The Amityville Horror (1979)\n\nBased on a true story that was claimed by writer Jay Anson, The Amityville Horror is \nabout a large house on the coast of Long Island where newly weds George and Kathy \nLutz and their three children move into the house that they hope will be their dream \nhouse but it ends up in terror. Despite full disclosure by the real estate agent \nof the home&amp;#039;s history, George and Kathy buy the house. George says, &quot;Houses \ndon&amp;#039;t have memories,&quot; but they turn to their family priest Father Delaney who \nbelieves the house is haunted \nand performs an exorcism on the house.\nBut the evil spirit in the house causes him to become blind and makes him very ill. \nGeorge and Kathy with the help of another priest Father Bolen and a police detective they face the fears of the house,\nbut not knowing the spirit is planning to possess George and then the children...\n\nInFO:\n*Ripped From Original Source DIsc, PAL Region 2\n*Length                            01:53:51\n*Resolution                        640 x 352\n*Audio Bit rate                    111kbps       \n*Encoded In Xvid\n*Includes Scan of original Cover &amp; DVD.\n\n\n==================================================================================\n\n2.) The Amityville Horror II - The Possession (1982)\n\nBefore the residence at 112 Ocean Avenue became infamous in The Amityville Horror,\nits supernatural legacy of terror had already begun. Inspired by a true story, \nthis chilling prequel is a bloodcurdling, special-effects-laden encounter with all-powerful,\nall-consuming evil. Although the Montellis are not exactly the &quot;perfect family,&quot; \nat least they&amp;#039;ve found the perfect home. And even though a liquid that looks like blood \ngushes from the kitchen faucet and every window has been nailed shut, it still qualifies \nas their dream houseuntil all hell breaks loose! A local priest tries to rid the house of unclean\nspirits, but what he doesn&amp;#039;t yet suspect is that teenage son Sonny Montelli has been possessed, \nbody and soul, by a murderous demon bent on total destruction.\n\nInFO:\n*Ripped From Original Source Disc, PAL Region 2\n*Length                            01:39:50\n*Resolution                        640x480\n*Audio Bit Rate                    103kbps                     \n*Encoded In Xvid\n*Includes Scan of original Cover.\n\n===================================================================================\n\n3.) Amityville 3: The Demon (1983)\n\nA man who is separated from his wife moves into the infamous Amityville House. \nTheir daughter dies in a boating accident (after being told that she is not \nallowed to go to the house) and now the mother sees her deceased daughter \n&quot;alive&quot; in the house. Mr. Baxtor calls a paranormal investigator in to help \nand the investigator finds out the source of the household problems.\n\nInFo:\n*Ripped From Original Source Disc, PAL Region 2\n*Length                            01:33:11  \n*Resolution                        576x432\n*Audio Bitrate                     142kbps  \n*Encoded in DivX\n*Includes scan Of original DVD &amp; Cover.\n\n===================================================================================\n\n4.) Amityville The Evil Escapes (1989)\n\nIt is a cold dark and rainty night. A group of priests gather, shivering outside a house silently\neach removes a crucifix and rosary beads from a long black bag and moves towards the front door. \nIt is a final attempt to purge the evil from the house....\n30,000 miles away and two weeks later recently widowed Nancy Evans and her three children have just moved \ninto her mother Alice&amp;#039;s house. The same day a package arrives from Alice&amp;#039;s sister, \na birthday present, containing a large and vaguely sinister lamp purchased at a yard sale.....\nin Amityville. The evil has escaped.\nFrom the writer of the original Amityville Horror comes another chilling chapter in the Amityville story.\n\nInFO:\n*Ripped From Original Source DIsc, PAL Region 2 \n*Length                            01:35:14\n*Resolution                        640x480\n*Audio Bitrate                     115kbps  \n*Encoded In Xvid\n*Includes Scan of original Cover.\n\n=================================================================================== \n\n5.) The Amityville Curse (1990)\n\nAn unseeen assailant murders a priest in his confessional. \nThe church is closes. Years later, the rectory is up for sale as a house and Debbie and Frank purchase it.\nDebbie is strangely drawn to the house because it reminds her of her dreams. After moving in Debbie&amp;#039;s \ndreams grow in intensity along with the power of the curse in the house. Strange incidents begin to occur. \nWhen the priest&amp;#039;s former housekeeper is murdered by an unseen assailant. \nDebbie finds she must battle to save herself, her husband, and hopefully put the Amityville curse to rest. \n\nInFO:\n*Ripped From Original Source DIsc, PAL Region 2 \n*Length                            01:27:04\n*Resolution                        640x480\n*Audio Bit rate                    105kbps \n*Encoded In Xvid\n*Includes Scan of original Cover.\n\n\n===================================================================================\n\n6.) Amityville 1992: It&amp;#039;s About Time (1992)\n\nA widowed father Jake Sterling (Stephen Macht) returns home from a business meeting in Amityville. \nHe brings home a gift for his two teenage kids: an eerie looking old mantle clock. What he doesn&amp;#039;t know, \nis the clock has an evil past being created by a 15th century French necromancer (eater of the dead). \nThe clock is tied to the evil past of Amityville. Soon after placing it on the fireplace mantle, he is \nattacked by the local neighborhood dog, leaving his ex-girlfriend Andrea to take care of him. \nAs Jake&amp;#039;s son and a neighbor get closer to finding out the legend of the clock, all hell breaks \nloose as hedges are set on fire, the dog is murdered, time begins to skip hours and slow down, \nJake&amp;#039;s daughter becomes seductive, and many people around them begin to die. \nNow, no one is safe from the terror as the clock begins to become the house itself.\n\nInFO:\n*Ripped From Original Source Disc, NTSC Region 1\n*Length                            01:35:14\n*Resolution                        640x480\n*Audio Bit rate                    115kbps \n*Encoded In Xvid\n*Includes Scan of original Cover.\n\n\n===================================================================================\n\n7.) Amityville: A New Generation (1993)\n\nThe saga of the demonic possession now comes full circle with the return of Frank Bronner, a central\ncharachter in the dark and deadly legend of Amityville. An ancient mirror has now become the unholy host\nfor the evil spirit of the bedevilled house and a lot worse than seven years bad look awaits anyone\ncursed by the mirrors reflections of misery.\nPassed onto a struggling young photographer the terrifying powers entombed in the glass have found a human\nlink to the other side with grave consequences for everyone.\n\nInFO:\n*Ripped From Original Source DIsc, PAL Region 2 \n*Length                            01:27:37\n*Resolution                        640x480 \n*Audio Bit rate                    113kbps\n*Encoded In Xvid\n*Includes scan Of original DVD &amp; Cover.\n\n\n===================================================================================\n\n8.) Amityville Dollhouse (1996)\n\nA dollhouse that is a replica of the infamous Amityville haunted house is given to a little girl.\nSoon after, all sorts of horrible unexplained accidents start to happen.\nThe family must work together to fight off the terrifying evil that has inhabited their lives.\n\nInFO:\n*Ripped From Original Source Disc, NTSC Region 1\n*Length                            01:36:38\n*Resolution                        640x480\n*Audio Bit rate                    128kbps \n*Encoded In Xvid\n*Includes scan of original Cover.\n\n\n===================================================================================\n\n9.) The Amityville Horror (2005) [REMAKE]\n\nOn November 13, 1973, police received a frantic phone call that led them to a nightmarish crime \nscene at the Defeo residence in Amityville, Long Island -an entire family had been murdered in \ntheir beds while they slept. In the days that followed, Ronald Defeo eventually confessed to \nmethodically killing his parents and four siblings with a rifle, saying &quot;voices&quot; in the house \ndrove him to the massacre. One year later, George and Kathy Lutz and their children moved into \nthe house thinking it would be their dream home. But soon the voices began again. Sleepless nights. \nNumbing cold. Visions of a murdered little girl. Then George began to do what the voices told him... \n28 days after moving in, the Lutzes abandoned the residence - lucky to escape with their lives. \n30 years after the shocking real-life events that inspired one of the most popular horror stories \nof all time, revisit the house that started it all: &quot;The Amityville Horror.&quot;.\n\nInFo:\n*Ripped From Original Source DIsc, PAL Region 2 \n*Length                            01:25::39\n*Resolution                        640x272\n*Audio Bit Rate                    128kbps                  \n*Encoded In Xvid\n*Includes scan Of original DVD &amp; Cover.\n==================================================================================\n\n#All movies RiPPeD from the Captain&amp;#039;s personal Dvd collection#\n\nThanks to WhIsKeY for helping to seed this.\n\nPlease, Please, bere with us uploading this huge file, as we do not have the\nfastest connections going..BUT You will get all these movies!!\n\n\nSome of these movies are rare and were difficult to find,\n\nso,\n\nEnjoy!! :)\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD\n\n\n\n{Open NFO in notepad}","torrent":{"xt":"urn:btih:5746814ee74893406fc2e922e731884b38994355","amp;dn":"All+Amityville+Movies+1+-+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5746814ee74893406fc2e922e731884b38994355","infoHashBuffer":{"type":"Buffer","data":[87,70,129,78,231,72,147,64,111,194,233,34,231,49,136,75,56,153,67,85]},"announce":[],"urlList":[]}}