{"title":"Seven","uid":3258208,"size":3708773668,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:57d4e0b3e008dfa73b43884cbc179db98997c937&amp;dn=Seven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CTPAX","files":37,"time":1101136340,"description":"Gluttony, greed, sloth, envy, wrath, pride, and lust--these are the seven deadly sins that are being punished with unimaginable cruelty and calculation by an enigmatic killer in David Fincher's bleak thriller SEVEN. Set in a perpetually gloomy unnamed city, the film follows Somerset (Morgan Freeman), a retiring police detective, as he experiences his final week on the job, reluctantly working with assertive newcomer Mills (Brad Pitt). When an obese man is found brutally murdered in his home, the seasoned Somerset realizes this is no ordinary killing--someone tortured him because of his appetite. Slayings that reflect the sins of greed and sloth soon follow, leading Somerset and Mills on a desperate search to find the mysterious John Doe, who is responsible for these methodical murders. As the case builds to a startling conclusion, both Somerset and Mills become more involved than they ever could have imagined. \nStarring : Brad Pitt, Morgan Freeman, Gwyneth Paltrow, Kevin Spacey, John Cassini, Bob Mack, Peter Crombie, R. Lee Ermey, Richard Portnow, Daniel Zacapa, Andy Walker, Mark Boone Junior, Dominique Jennings \n \n!!! English subtitles only !!!","torrent":{"xt":"urn:btih:57d4e0b3e008dfa73b43884cbc179db98997c937","amp;dn":"Seven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d4e0b3e008dfa73b43884cbc179db98997c937","infoHashBuffer":{"type":"Buffer","data":[87,212,224,179,224,8,223,167,59,67,136,76,188,23,157,185,137,151,201,55]},"announce":[],"urlList":[]}}