{"title":"The Only Ones Live at Dingwalls 1980","uid":4144986,"size":2357680128,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5857745804dbed087a4ab130b67eb83e283be7cf&amp;dn=The+Only+Ones+Live+at+Dingwalls+1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mean Mistreater","files":1,"time":1208688300,"description":"The Only Ones are an English rock and roll band. They were initially active in the late 1970s and were associated with punk rock, yet straddled the musical territory in between punk, power pop and hard rock, with noticeable influences from psychedelia. The band reformed in 2007 following the band&amp;#039;s biggest hit &quot;Another Girl, Another Planet&quot; being used in a Vodafone ad campaign in 2006.[1] They completed a small UK tour in June 2007, and more dates are confimed for 2008.\n\nThe Only Ones were originally formed in August 1976 in South London by Peter Perrett. Perrett had been recording demos since 1973, and in late 1975 was introduced to guitarist John Perry as a temporary bass guitar player. (The guitarist at that time was Glenn Tilbrook of Squeeze). Perry wanted to concentrate on playing guitar, so by August 1976 he and Perrett then found drummer Mike Kellie (ex-Spooky Tooth); and bassist Alan Mair who previously had huge success with The Beatstalkers who became Scotland&amp;#039;s top group. Their first single &quot;Lovers Of Today&quot;, self-released on the Vengeance record label, was immediately made &amp;#039;Record of The Week&amp;#039; by three of the four main music papers. A year later they signed to CBS. Their next single &quot;Another Girl, Another Planet&quot; was a very popular and influential song, and unquestionably the band&amp;#039;s best-known song. It is often featured on various musical box-sets featuring a punk rock or New Wave theme. An album was released The Only Ones in 1978 and was well received by reviewers and fans. Their follow-up album was Even Serpents Shine released in the next year. A year later their final studio album Baby&amp;#039;s Got A Gun was released. In 1982 the band officially disbanded. In subsequent years the band gained a fierce cult following and its posthumously-released records - live performances, BBC TV and radio shows, and compilation albums - now outnumber their official albums. Unusually, the Only Ones discs were never deleted from the CBS catalogue, and remain in print today.\n\n","torrent":{"xt":"urn:btih:5857745804dbed087a4ab130b67eb83e283be7cf","amp;dn":"The+Only+Ones+Live+at+Dingwalls+1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5857745804dbed087a4ab130b67eb83e283be7cf","infoHashBuffer":{"type":"Buffer","data":[88,87,116,88,4,219,237,8,122,74,177,48,182,126,184,62,40,59,231,207]},"announce":[],"urlList":[]}}