{"title":"Morte no Funeral (Death at a Funeral) 2008 DVDRip Dual Audio By ","uid":4055395,"size":734536685,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5867ff28368146ebf838f502225c9f9c199fd2f8&amp;dn=Morte+no+Funeral+%28Death+at+a+Funeral%29+2008+DVDRip+Dual+Audio+By+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bozano","files":3,"time":1204343584,"description":" Com a morte do patriarca, uma familia inglesa de classe media alta, dividida por ciumes e segredos, se reune para o funeral. Daniel (Matthew Macfadyen), um dos filhos, promete para a sua mulher Jane (Keeley Hawes) uma nova vida e faz de tudo para que a despedida do pai seja boa. Mas seu irmao, um romancista de sucesso, so pensa em paquerar belas mulheres. O namorado da prima ingere acidentalmente drogas e passa a ter delirios. Como se nao bastasse, um anao (Peter Dinklage) chega ao velorio, pedindo dinheiro para nao revelar que era o amante de seu pai. Daniel, entao, precisa arranjar uma forma de resolver a confusao para que a calamidade nao aumente.\n\nDaniel is a decent young man, married to Jane, still living at his father&amp;#039;s home. When his father dies, it his up to him to organize his funeral. On this painful morning, the suitable grave expression on his face, Daniel is ready to welcome his father&amp;#039;s friends and relatives. But preserving the dignity inherent in such a circumstance will be a hard task. Particularly with an undertaker who botches his work, the return from the USA from his famous but selfish brother, his cousin&amp;#039;s fiancÃƒÂ© who has accidentally ingested drugs, the presence a moron who takes advantage of the sad event to win back the heart (or rather the body) of a woman who is about to marry another, of a handicapped old uncle who is also the most unbearable pain in the neck. To cap it all, Daniel notices the presence among the mourners of a mysterious dwarf nobody else seems to know...\n\nEnjoy... :)","torrent":{"xt":"urn:btih:5867ff28368146ebf838f502225c9f9c199fd2f8","amp;dn":"Morte+no+Funeral+%28Death+at+a+Funeral%29+2008+DVDRip+Dual+Audio+By+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5867ff28368146ebf838f502225c9f9c199fd2f8","infoHashBuffer":{"type":"Buffer","data":[88,103,255,40,54,129,70,235,248,56,245,2,34,92,159,156,25,159,210,248]},"announce":[],"urlList":[]}}