{"title":"Primordia 1-3 (of 3) [BBN]","uid":4053496,"size":75073427,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:593fe31c1442cbdfc6fc0798f799e81d3d6d6366&amp;dn=Primordia+1-3+%28of+3%29+%5BBBN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seedYAbastid","files":4,"time":1204263025,"description":"\n[IMG]http://img264.imageshack.us/img264/1732/primordialu4.png[/IMG]\n\nPrimordia 1-3 (of 3)\n\n[quote]In a world of primeval fantasy, a wood nymph adopts a pair of infants abandoned in the\nancient forest of the woodfolk, and they grow to exhibit mysterious powers of sorcery. Driniel is the night- wanderer, holding concourse with the darkling spirits of the deep groves and summoning demons for his arcane pleasures. Alleyr is the flame of valor, rising to esteem in the ranks of the woodfolk hunters and taming a fierce beast with his sorcery.\n\nThe Woodking?s daughter, Vega, finds herself torn by a powerful affection for both of the twins. Yet even her love for them cannot sway the judgment of the Woodking when the brothers come of age and their brutal natures manifest, and his judgment is severe: exile into the savage world of Man.\n\nAlleyr bands the primitive human tribes beneath the banner of the Sun, while Driniel comes to rule an empire of nocturnal creatures, demons, and beast- men; under their banners, the Night Tribes and Sun Tribes wage a ceaseless battle for dominance of a strange and barbarous world, a battle that will fling open the very gates of the Underworld itself...[/quote]\n\n\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:593fe31c1442cbdfc6fc0798f799e81d3d6d6366","amp;dn":"Primordia+1-3+%28of+3%29+%5BBBN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"593fe31c1442cbdfc6fc0798f799e81d3d6d6366","infoHashBuffer":{"type":"Buffer","data":[89,63,227,28,20,66,203,223,198,252,7,152,247,153,232,29,61,109,99,102]},"announce":[],"urlList":[]}}