{"title":"NGC-Deepsea Drillers - Gulf of Mexico - Independence Project (Di","uid":4247889,"size":324625616,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5949c2e3fc5ed80892fe640c7dde134f2e8c9e70&amp;dn=NGC-Deepsea+Drillers+-+Gulf+of+Mexico+-+Independence+Project+%28Di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sandhopper","files":1,"time":1213875178,"description":"The Independence Project, located in the ultra-deep waters of the Eastern Gulf of Mexico, is a $2 billion development designed to bring previously stranded natural gas reserves to energy consumers in the United States. Through the collaborative efforts of Enterprise, Helix Energy Solutions and four independent exploration &amp; production companies, approximately 1 billion cubic feet per day (&quot;Bcf/d&quot;) of natural gas production and transportation capacity is expected to be in service beginning in 2007. The natural gas produced from this project will have the potential to increase the supply of natural gas in the U.S. by approximately 2% and natural gas deliveries from the Gulf of Mexico by approximately 10%. \n\nThe Independence Project consists of three main components: Independence Subsea, Independence Hub and Independence Trail. The Independence Hub facility, which is 80 percent-owned by affiliates of Enterprise, and 20 percent-owned by Helix Energy Solutions Group, Inc., is a state of the art 105-foot deep-draft, semi-submersible platform. Enterprise, a leader in the development of midstream infrastructure in the Gulf of Mexico, designed, constructed and is installing the Independence Hub platform. The facility will be located in Mississippi Canyon block 920 in a water depth of approximately 8,000 feet. The platform is designed to process up to 1 Bcf/d of natural gas production from the initial 10 anchor fields, with excess payload capacity to tie-back up to nine additional subsea flowlines. \n\nThe Independence Trail Natural Gas Pipeline, which is 100 percent-owned and operated by an affiliate of Enterprise, is a new 134-mile, 24-inch pipeline that will have the capacity to transport up to 1 Bcf/d of natural gas from the Independence Hub to an interconnect with Tennessee Gas Pipeline at West Delta block 68, a new platform also owned and operated by an affiliate of Enterprise. \n\n","torrent":{"xt":"urn:btih:5949c2e3fc5ed80892fe640c7dde134f2e8c9e70","amp;dn":"NGC-Deepsea+Drillers+-+Gulf+of+Mexico+-+Independence+Project+%28Di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5949c2e3fc5ed80892fe640c7dde134f2e8c9e70","infoHashBuffer":{"type":"Buffer","data":[89,73,194,227,252,94,216,8,146,254,100,12,125,222,19,79,46,140,158,112]},"announce":[],"urlList":[]}}