{"title":"Avolta Jr. Rare Brazilian Grooves!","uid":4114782,"size":486357803,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5aa23bf452f8dc5e1935a15aa4e4cb23c5a82c96&amp;dn=Avolta+Jr.+Rare+Brazilian+Grooves%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aineko","files":27,"time":1207249973,"description":"This is a podcast from 2005-6 of lots of rare and funky brazilian tracks, by Avolta Jr (real name Jose Inacio Castro e Neves Brasileiro de Souza). Unfortunately the podcaster passed away last year, and all links to the podcast have gone with him... I still have 26 episodes of the podcast sitting on my drive, and I thought I should share these gems since it seems they&amp;#039;re now impossible to find. There are 4 episodes missing from 2005 as far as I can tell, but this torrent contains 26 episodes for your listening pleasure. Please share for as long you can. This is my first torrent upload, so fingers crossed...\n\nExample description for episode Avolta Jr - Brazil By Mellow Groove!\n10/10/2006 (16.93 MB)\nThis podcast features some great tracks with one thing in common - mellow grooves! Antonio Adolfo &amp; Brazuca&amp;#039;s Festival sound contributes Claudia and sets the tone for some great 60s funky mellowness. Joao Donato joined Bossa Rio for their tour of japan in 69 and this is a great version of Bad Company&amp;#039;s Come And Get It. Brasilia Modern Six stay with the intertnational cover theme and a hip version of Bacharach &amp; David&amp;#039;s Say A Little Prayer. Doris Monteiro covers paulo Diniz&amp;#039;s first nordestino groove hit and the great Ed Lincoln comes up with his blues swing (Balanco Azul). Legendary chanteuse Elis Regina recorded A Time For Love in London with Scott Walker&amp;#039;s Arranger Reg Knight. Studio session group Formula 7 bring in Simplesmente and army funksters Fuzi 9 come up trumps with their weird Hebrew sounding Haiakaiam! Italian based percussion legend Mandrake has a cool version Jobim&amp;#039;s Estrada do Sol and Pedrinho Mattar is joined by the wonderful Tita on her Nirvana. Durval Ferreira / Orlandivo side project As Quentes do Patropi cover Jorge Ben &amp; Toquinho&amp;#039;s Que Maravilha whilst Osmar Milito backing group Quarteto Forma 7&quot; rarity A Ilha is followed by Raul de Souza&amp;#039;s laconic funk version of Herbie Hancock&amp;#039;s Seminal Cantaloupe Island - Brasil by Mellow Groove! 1. Claudia - Antonio Adolfo e a brazuca 2. Come And Get It - Bossa Rio 3. I Say a Little Prayer - Brasilia Modern Six 4. Brasil, Brasa, Braseiro - Doris Monteiro 5. Balanco Azul - Ed Lincoln 6. A Time For Love - Elis Regina 7. Simplesmente - Formula 7 8. Haiakaiam - Fuzi 9 9. Estrada do Sol - Mandrake Som 10. Sambachiana - Os Tres Morais 11. Pedrinho Mattar (feat.Tita) - Nirvana 12. Que Maravilha - As Quentes do Patropi 13. A Ilha - Quarteto Forma 14. Cantaloupe Island - Raulzinho &amp; Impacto 8 \n\nFile list:\nAlbumArtSmall.jpg\nAvolta Jr - Africa Brasil!.mp3\nAvolta Jr - Brasil Relax!.mp3\nAvolta Jr - Brazil Black Rio!.mp3\nAvolta Jr - Brazil Blue!.mp3\nAvolta Jr - Brazil Bossa Jazz!.mp3\nAvolta Jr - Brazil By Azymuth!.mp3\nAvolta Jr - Brazil By Donato!.mp3\nAvolta Jr - Brazil By Jorge Ben!.mp3\nAvolta Jr - Brazil By Mellow Groove!.mp3\nAvolta Jr - Brazil By Orlandivo!.mp3\nAvolta Jr - Brazil By Sambalanco!.mp3\nAvolta Jr - Brazil Classic Samba Sou.mp3\nAvolta Jr - Brazil Funky Bits!.mp3\nAvolta Jr - Brazil Guitars!.mp3\nAvolta Jr - Brazil Krazy Covers Vol.mp3\nAvolta Jr - Brazil Novelas Vol 1!.mp3\nAvolta Jr - Brazil Novelas Vol 2!.mp3\nAvolta Jr - Brazil Old School Classi.mp3\nAvolta Jr - Brazil Pura Samba!.mp3\nAvolta Jr - Brazil Sem Tema!.mp3\nAvolta Jr - Brazil Summer Samba!.mp3\nAvolta Jr - Brazil a Go Go!.mp3\nAvolta Jr - Brazilian Girls Get Funk.mp3\nAvolta Jr - Os Sanfoneiros!.mp3\nAvolta Jr - Samba Soul Vol 2!.mp3\nAvolta Jr - The Great Arrangers Part.mp3\nFolder.jpg\nreadme.txt\n\n\nThe readme.txt contains the description of each episode.","torrent":{"xt":"urn:btih:5aa23bf452f8dc5e1935a15aa4e4cb23c5a82c96","amp;dn":"Avolta+Jr.+Rare+Brazilian+Grooves%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa23bf452f8dc5e1935a15aa4e4cb23c5a82c96","infoHashBuffer":{"type":"Buffer","data":[90,162,59,244,82,248,220,94,25,53,161,90,164,228,203,35,197,168,44,150]},"announce":[],"urlList":[]}}