{"title":"Debbie Bonham - For You And The Moon [1985] HQ VINYL GEM","uid":4259847,"size":50647504,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5bf20fca6ddcb5853253d8595a757a526fb5c7b1&amp;dn=Debbie+Bonham+-+For+You+And+The+Moon+%5B1985%5D+HQ+VINYL+GEM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sweetthing","files":9,"time":1214414107,"description":"DEBBIE BONHAM For You And The Moon (1985 UK 9-track Carrere LP from the younger sister of John Bonham, legendary Led Zep drummer. Critically acclaimed in its own right this LP was never issued outside Europe and remains a vinyl-only gem, not having been reissued on CD, picture sleeve CAL216) \n\n\n1. Sanctuary \n2. It&amp;#039;s Only Love \n3. On The Air Tonight \n4. Who Is The Enemy \n5, Hungry Night \n6. For You And The Moon \n7. Fly Away \n8. Lovers And Friends \n9. Never Looking Back\n\n\nBorn in Worcestershire, the younger sister of the late John and Michael Bonham. Deborah was only five when John joined Led Zeppelin, and this powerful introduction sparked in her the overwhelming desire to write and perform.\n\nHer home was The Old Hyde farm, where she lived with her father, John Henry Bonham snr, known as Jack, in the cottage at the back of The Old Hyde Farm. Her brother, John and his family, lived in the main House.\n\nWhile living there, Deborah and John&amp;#039;s son Jason started playing and recording their own songs. At the age of 17, at Robert Plant&amp;#039;s house in a nearby village, she recorded her first demos.\n\nWith some encouragement and advice from Robert, Deborah sent out the songs anonymously and soon landed her first record deal with the major label Carerre Records, for whom she recorded the critically acclaimed album &quot;For You and the Moon&quot;. The album reached the top 5 in the NME chart, was Simon Bates record of the week on Radio 1 and sold extremely well in Europe, being voted &quot;Record of the Year&quot; by Musik Mart, Germany. \n\nA period of recording for the Japanese Sam Corporation followed, and with press and radio promotion including interviews for Burrn and J Wave Radio. After this, English label RPM records released the single, &quot;Perfect World&quot; in 1995.\n\nDeborah spent 1996 getting her new band together, new songs for an album and playing some great shows such as headlining the Belfast Festival and a sell out show at the Bottom Line, Shepherd&amp;#039;s Bush to excellent reviews, honing a new direction for the forthcoming album.\n\nThe beginning of 1997 saw two extremely successful trips to the US. Firstly, she performed live on LA&amp;#039;s Rockline radio to three million listeners throughout North America and Canada. This was followed by a special appearance with Jason Bonham and his band at the Whiskey A Go Go in Los Angeles, where she went down a storm!\n\nThe success of the first trip led to another visit to the US with her band to open for Jason Bonham Band&amp;#039;s shows in Los Angeles &amp;#039;House of Blues&amp;#039; with guests Slash and Terry Reid, Dallas Fort Worth, Houston, New York and Chicago &amp;#039;House of Blues&amp;#039;. Subsequently, two more tours across America were secured.\n\nBack in the UK and Europe, Deborah has toured and performed with Van Halen, Alannah Myles, Tim Rose, Uli Jon Roth, Paul Weller, Humble Pie, Donovan, Lonnie Donnegan, Jools Holland, Ann Peebles, Foreigner and Paul Rodgers. Played festivals from Glastonbury to Donnington, and twice at Fairport Convention&amp;#039;s Cropredy Festival.\n\nLatest Tour Dates &amp; News on Message Board\n\nNew album &amp;#039;Duchess and the Shufflemeister&amp;#039;, signed to Warner Brothers&amp;#039; Rhino label\n\nThe album will be ready for release in early 2008 and Deborah will be touring to support the record throughout the year.\n\nDeborah&amp;#039;s live band take up the reins in the studio, contributing co-writes, and a solid backing for some wonderful guest musicians, including a duet with Paul Rodgers, Pink Floyd&amp;#039;s Dick Parry on Sax, Robbie Blunt &amp; BJ Cole on Pedal Steel.\n\n&amp;#039;The Old Hyde&amp;#039; CD released in the UK in 2004 is a stunning array of bluesy rock and emotive ballads, all perfectly showcasing Deborah&amp;#039;s powerful voice to maximum effect. The title track being a ballad written about her Father Jack, and brother&amp;#039;s John &amp; Michael and the house they built, where Deborah lived. Produced by MO FOSTER (of Jeff Beck, Van Morrison, Phil Collins fame), the album features guest appearances from, MICK FLEETWOOD, Robert Plant guitarists ROBBIE BLUNT and DOUGIE BOYLE, Pretenders/Paul McCartney&amp;#039;s guitarist ROBBIE MCINTOSH and John&amp;#039;s son JASON BONHAM on drums.\n\n&amp;#039;Lot of Help From My Friends&amp;#039; CD released on Track Records, is a live concert in aid of Deborah&amp;#039;s Charity &amp;#039;Racehorse Sanctuary and Rehoming Centre&amp;#039;, and features Deborah, Kenney Jones Gang, Mark Butcher and Donovan. Deborah performs a beautiful duet of &amp;#039;Colours&amp;#039; with Donovan. An enhanced cd, it also features videos and picture gallery for viewing on PC and MAC.\n\n&amp;#039;Steve Marriott Memorial Concert&amp;#039; DVD features Deborah performing 3 songs, and backing Paul Weller and a reformed Humble Pie including Peter Frampton. A fantastic live concert DVD.\n\n\nwww.led-zeppelin.com/deborahbonham\n\n\nRipped from good quality vinyl for your listening pleasure. The vinyl was centralized which means there was absolutely no side to side movement of the tone arm. This is usually the major flaw with vinyl as it causes a &quot;WOWING&quot; effect noticable to most audiophiles. It is caused by the hole not being entirely central and is more annoying than the occasional click in my opinion. Also in use on the Dual 505 Record Deck was a Platter Pad [a solid rubber, turntable mat, about 1 and a half cm thick] which no user of vinyl should be without. It enhances the sound no end!\n\n","torrent":{"xt":"urn:btih:5bf20fca6ddcb5853253d8595a757a526fb5c7b1","amp;dn":"Debbie+Bonham+-+For+You+And+The+Moon+%5B1985%5D+HQ+VINYL+GEM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf20fca6ddcb5853253d8595a757a526fb5c7b1","infoHashBuffer":{"type":"Buffer","data":[91,242,15,202,109,220,181,133,50,83,216,89,90,117,122,82,111,181,199,177]},"announce":[],"urlList":[]}}