{"title":"Saturday.Night.Fever[1977]","uid":4167158,"size":1463240859,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c585a9b44446c96711989c54580b854a62f0327&amp;dn=Saturday.Night.Fever%5B1977%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ricksp","files":2,"time":1209671376,"description":"Director: John Badham\n\nProduction: Kevin McCormick and Robert Stigwood\n\nDuration: 118 min\n\nSubtitles: English\n\nAudio: English\n\nPlot: Travolta plays Tony Manero, a Brooklyn paint-store clerk who&amp;#039;d give anything to break out of his dead-end existence. In life, Tony is a peasant; on the disco dance floor, he&amp;#039;s a king. As the soundtrack plays one Bee Gees hit after another (including &quot;Stayin&amp;#039; Alive&quot;), we watch white-suited Tony strut his stuff amidst flashing lights and sweaty, undulating bodies. Tony&amp;#039;s class aspirations are mirrored in his relationship with his dance partner, Stephanie (Karen Lynn Gorney), a secretary eager to move into the glamorous world of Manhattan. Saturday Night Fever&amp;#039;s huge success grew meteorically thanks to the towering popularity of its soundtrack; during the first half of 1978, when the movie&amp;#039;s disco songs saturated the singles charts up to four at a time, it was no longer clear whether the hit movie was feeding the hit songs or the hit songs were feeding the hit movie. This crossover between music and movies set the pace for many movies to come, as it also marked the rise and fall of 1970s disco culture. Two versions of this film exist: the original R-rated version and a PG version, edited down to more &quot;family-friendly&quot; fare and fed to the public with the tagline, &quot;Because we want everyone to see John Travolta&amp;#039;s performance.&quot; (Written by Hal Erickson)\n\nCast: John Travolta (Tony Manero), Karen Lynn Gorney (Stephanie), Donna Pescow (Annette), Julie Bovasso (Mother), Barry Miller (Bobby), Joseph Cali (Joey), Paul Pape (Double J).\n\nimdb: tt0076666","torrent":{"xt":"urn:btih:5c585a9b44446c96711989c54580b854a62f0327","amp;dn":"Saturday.Night.Fever%5B1977%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c585a9b44446c96711989c54580b854a62f0327","infoHashBuffer":{"type":"Buffer","data":[92,88,90,155,68,68,108,150,113,25,137,197,69,128,184,84,166,47,3,39]},"announce":[],"urlList":[]}}