{"title":"Habitacion.Sin.Salida[DVDRip][Spanish]","uid":4242502,"size":734974328,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c60343b71a5252e38a812a19e767e33dbff3407&amp;dn=Habitacion.Sin.Salida%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mois20","files":6,"time":1213624841,"description":"Un desvÃƒÂ­o nocturno se convierte en una pesadilla inimaginable cuando el coche de una pareja separada se averÃƒÂ­a en una remota carretera rural. Al encontrarse atrapados en una oscura y desierta carretera de dos carriles, David Fox (Luke Wilson) y su ex mujer, dentro de muy poco, Amy (Kate Beckinsale) se ven obligados a pasar la noche en un sÃƒÂ³rdido motel dirigido por un extraÃƒÂ±o aunque aparentemente inofensivo propietario (Frank Whaley). En su habitaciÃƒÂ³n mugrienta y raÃƒÂ­da, la pareja, siempre peleando, encuentra un alijo de pelÃƒÂ­culas caseras macabras que parecen extraÃƒÂ±amente reales. Cuando se dan cuenta que los vÃƒÂ­deos sangrientos estÃƒÂ¡n hechos en la misma habitaciÃƒÂ³n en la que estÃƒÂ¡n, David y Amy descubren que serÃƒÂ¡n las prÃƒÂ³ximas vÃƒÂ­ctimas de los sÃƒÂ¡dicos cineastas a menos que dejen a un lado sus diferencias y trabajen juntos para escapar. Tras la muerte accidental de su joven hijo, el matrimonio de David (Luke Wilson) y Amy Fox (Kate Beckinsale) estÃƒÂ¡ hecho pedazos. De vuelta de su ÃƒÂºltimo viaje juntos antes de terminar su matrimonio, David decide tomar un atajo desconocido por una solitaria carretera secundaria. Cuando su coche se averÃƒÂ­a, se dan cuenta de que no tienen otra opciÃƒÂ³n que quedarse en un motel cercano donde el distraÃƒÂ­do gerente nocturno, Mason (Frank Whaley), parece mÃƒÂ¡s interesado en ver morbosas pelÃƒÂ­culas de terror que ayudarlos con sus problemas de motor. La pareja se resigna a una tensa e incÃƒÂ³moda noche juntos en la decadente habitaciÃƒÂ³n, pero tan pronto como doblan la raÃƒÂ­da colcha de la cama empiezan a oÃƒÂ­r golpes desesperados de la habitaciÃƒÂ³n de al lado. Cuando protestan por el ruido, Mason informa a los Fox de que son los ÃƒÂºnicos huÃƒÂ©spedes del hotel, y sugiere que un vagabundo puede haber entrado y tomado temporalmente como residencia la puerta de al lado. Nervioso y desesperado por relajarse, David intenta ver alguno de los vÃƒÂ­deos sin etiqueta que encuentra en la habitaciÃƒÂ³n, que resultan ser pelÃƒÂ­culas grÃƒÂ¡ficas macabras de bajo presupuesto como las que Mason estaba viendo cuando entraron en el hotel. Tras unos minutos, David se da cuenta con creciente horror que la brutal violencia de los vÃƒÂ­deos no es fingida. Llena de mÃƒÂºltiples cÃƒÂ¡maras ocultas, la &quot;suite nupcial&quot; del hotel es el escenario de un enfermizo y mortal juego del gato y el ratÃƒÂ³n. La pareja pronto se imagina que los asesinos sedientos de sangre tratan que David y Amy sean las estrellas de su prÃƒÂ³xima pelÃƒÂ­cula. Cuando comienzan su desesperado esfuerzo por escapar se dan cuenta que sus captores estÃƒÂ¡n rodando todos sus movimientos, jugando con ellos para aumentar el sÃƒÂ¡dico atractivo de la producciÃƒÂ³n. Con sus torturadores acercÃƒÂ¡ndose rÃƒÂ¡pidamente, David y Amy deben aprender a depender otra vez el uno del otro si quieren tener alguna posibilidad de sobrevivir a la noche mÃƒÂ¡s larga de sus vidas.","torrent":{"xt":"urn:btih:5c60343b71a5252e38a812a19e767e33dbff3407","amp;dn":"Habitacion.Sin.Salida%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c60343b71a5252e38a812a19e767e33dbff3407","infoHashBuffer":{"type":"Buffer","data":[92,96,52,59,113,165,37,46,56,168,18,161,158,118,126,51,219,255,52,7]},"announce":[],"urlList":[]}}