{"title":"Alex Jones Show Enhanced Edition - June 26, 2008 - Watson, Madse","uid":4262567,"size":67243159,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5caf398187f37a4e732a4b8246460cd2adee9b77&amp;dn=Alex+Jones+Show+Enhanced+Edition+-+June+26%2C+2008+-+Watson%2C+Madse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Femacamper","files":7,"time":1214538376,"description":"The Alex Jones Show, Enhanced Edition\n\nVeteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you thought-provoking interviews and takes an in-depth look at the news between the daily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing personalities in the world from guerrilla journalists to government officials to whistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any other on the air. Jones is a seasoned investigative journalist who has broken hundreds of national stories during his career. He is an aggressive Constitutionalist who digs deeply into the facts to defend property rights, our national borders, and the Second Amendment while he sends out a rallying call to the American people to resist foreign entanglements and wars for corporate interests. Jones eschews the bogus political labels of left and right and instead focuses on what really matters: what&amp;#039;s right and wrong.\n\nWednesday, June 25th, 2008\n\nTHE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex talks with Prison Planet editor and webmaster Paul Joseph Watson about new policies in the UK that will mandate parents get government permission to kiss their children. Alex also welcomes Washington, D.C.-based investigative journalist, author, syndicated columnist, and former NSA analyst Wayne Madsen. Aaron Zelman and Larry Pratt will talk with Alex about the Supreme Court ruling on the Second Amendment.\n\nOriginal capture by chakra71 (all four hours plus overdrive with commercials edited out, split into hourly segments), added playlist, guest picture, show description and informative mp3 tags (used Mp3tag and WinAmp). Used with permission. Alex Jones authorizes you to redistribute his materials for non-profit, educational purposes.\n\nGo here if there are no seeds:   &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg209618#msg209618&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg209618#msg209618&lt;/a&gt;\n\nOr you can do up your own .mp3s here:   &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=45157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=45157&lt;/a&gt;\n\nDownload the daily .mp3 here:   &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:5caf398187f37a4e732a4b8246460cd2adee9b77","amp;dn":"Alex+Jones+Show+Enhanced+Edition+-+June+26%2C+2008+-+Watson%2C+Madse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5caf398187f37a4e732a4b8246460cd2adee9b77","infoHashBuffer":{"type":"Buffer","data":[92,175,57,129,135,243,122,78,115,42,75,130,70,70,12,210,173,238,155,119]},"announce":[],"urlList":[]}}