{"title":"The X-Files - The Complete First Season (1993) - Disk 1 of 7","uid":4145335,"size":7815026688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ce56b40e1115aa6bc5260098b97e3ee453596b3&amp;dn=The+X-Files+-+The+Complete+First+Season+%281993%29+-+Disk+1+of+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"plasmaview","files":24,"time":1208702902,"description":"The X-Files - The Complete First Season (1993) - Disk 1 of 7\n\n#  Actors: David Duchovny, Gillian Anderson, Charles Cioffi, Cliff De Young, Sarah Koskoff\n# Directors: Robert Mandel\n# Format: Box set, Closed-captioned, Collector&amp;#039;s Edition, Color, DVD-Video, NTSC\n# Language: English, French\n# Subtitles: English, Spanish\n# Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)\n# Aspect Ratio: 1.33:1\n# Number of discs: 7\n# Rating:\n# Studio: 20th Century Fox\n# DVD Release Date: May 9, 2000\n# Run Time: 1104 minutes\n# Average Customer Review:\n \n383 Reviews\n5 star: \t78% \t (301)\n4 star: \t14% \t (55)\n3 star: \t4% \t (19)\n2 star: \t0% \t (3)\n1 star: \t1% \t (5)\n\nSee all 383 customer reviews...\n4.7 out of 5 stars 383 customer reviews (383 customer reviews)\n# ASIN: B00003RQND\n\n Amazon.com\nIn the first season of The X-Files, creator Chris Carter was uncertain of the series&amp;#039; future, so each of the episodes is a self-contained suspense story; they do not delve deep into the ongoing X-Files mythology or turn to self-parody and humor as do episodes in later seasons. Yet, these episodes display the elements for which the show would become famous: the cinematic production values and top-notch special effects, the stark lighting of the Vancouver sets, the atmospheric halo of Mark Snow&amp;#039;s score, and the clever plots dealing with subjects ranging from the occult, religion, and monsters to urban legends, conspiracy theories, and science fiction. Most importantly, season 1 introduces FBI agents Dana Scully (Gillian Anderson) and Fox &quot;Spooky&quot; Mulder (David Duchovny), two of the most attractive government officials around. Scully is the serious-minded medical scientist assigned to join Mulder on the X-Files, a division of the FBI dealing with the paranormal. Mulder is the intuitive thinker with a dry wit, a passionate believer in the existence of paranormal phenomena and one of the few characters on television smart enough to figure out who the bad guy is before the audience does. Their muddled relationship, a deep friendship laced with sexual tension, provides the human heart in a world where the bizarre and horrible lurk in everyday society.\n\nThe materials on the bonus disc provide some interesting trivia and background, but it is the 24 episodes themselves that make this seven-disc boxed set a true find. Those unfamiliar with The X-Files often view all the fuss with the same skepticism with which Scully first regards her new partner&amp;#039;s ideas. But just as she comes to realize the uncanny accuracy of Mulder&amp;#039;s outlandish theories, newcomers to The X-Files who sample a few episodes in this boxed set will likely find themselves riveted to their television late into the night. And undoubtedly, the shadows and creaking noises in the house that evening will seem more menacing than usual. --Eugene Wei\n\nProduct Description\nNow you can own the entire first season of The X-Files. All 24 classic episodes from the first season of this award-winning show are available for the first time in this exclusive collector s edition. Don t miss the opportunity to see how the phenomenon all began back on September 10 1993.This 7-disc set includes detailed footage special effects shots some of your favorite scenes dubbed in languages from around the world and episode listings for the show s entire seven seasons. Additional bonus features from Season One include: An 11-Minute documentary on the making of Season One. 12 interviews with Chris Carter on his favorite episodes from Season One: Pilot Deep Throat Squeeze Conduit Ice Fallen Angel Eve Beyond The Sea E.B.E. Darkness Falls Tooms and The Erlenmeyer Flask 11 &quot;Behind-the-Truth&quot; spots from F/X 47 promotional television spots DVD-ROM game &quot;Roots of Conspiracy&quot; (PC Only)Format: DVD MOVIE \n\nIn the first season of The X-Files, we are introduced to the Lone Gunman, Scully&amp;#039;s father dies, Deep Throat is killed, and the X-Files are closed.\n\nAll 24 episodes are on 7 discs, with documentaries, deleted scenes, etc.\n\nEpisodes:\n-----------\n\n1) The X-Files (pilot) - This is the episode where Scully is assigned to be Mulder&amp;#039;s partner. Her assignment is to apply a scientific look at Mulder&amp;#039;s &quot;discovers.&quot; In their 1st assignment they travel to Oregon where it appears several teenagers have been abducted by aliens.\n\n2) Deep Throat - Mulder meets with Deep Throat who is willing to provide information concerning UFOs and government conspiracies.\n\n3) Squeeze - Mulder and Scully meet Eugene Tooms who can squeeze his body through any space. It appears that every 30 years he comes out of hibernation and eats the liver of 5 people.\n\n4) Conduit - Mulder and Scully learn of a teenage girl who apparently been abducted and during the investigation they discover the girl&amp;#039;s mother may have also been abducted in her youth.\n\n5) The Jersey Devil - Mulder and Scully travel to New Jersey to investigate the legend of a beast that has been stalking people.\n\n6) Shadows - Mulder and Scully investigate a woman who appears to be under the protection of a ghost.\n\n7) Ghost in the Machine - Mulder is contacted by Deep Throat and informs him that the DoD is seeking a computer whiz.\n\n8) Ice - Mulder and Scully travel to Alaska after all communications are cut off. While there, they discover a worm like &quot;alien.&quot;\n\n9) Space - Mulder and Scully are told that sabotage attempts are being made against NASA&amp;#039;s Space Shuttles. A former astronaut and head of the program appears to be possessed by an alien ghost.\n\n10) Fallen Angel - Mulder has less than a day to prove that a space ship has crashed.\n\n11) Eve - Mulder and Scully investigate the murder of two men, one in California, and the other in Connecticut. Their daughters appear to be identical twins.\n\n12) Fire - Mulder and an old British girlfriend investigate what appears to be a man that can create fire with his mind.\n\n13) Beyond the Sea - Luther Boggs, claiming to be a psychic, says he will help Mulder and Scully solve a kidnapping crime if he can get his death sentence change to life. Scully is dealing with the death of her father and it appears Boggs has contact with his spirit.\n\n14) Genderbender - Mulder and Scully investigate the Kindred, who appear to have the ability to switch gender and may in fact be aliens.\n\n15) Lazarus - Scully and Jack Willis are involved in a shootout with a bank robber. Jack and the bank robber are shot but at the hospital, Jack dies and the bank robber appears to leap into his body.\n\n16) Young at Heart - Mulder finds himself looking for John Barnett, someone he had put into prison many years ago. Barnett, who supposedly died in prison, was part of a genetic experience to reverse the aging process.\n\n17) E.B.E. - Deep Throat sends Mulder on a wild &quot;UFO&quot; chase.\n\n18) Miracle Man - Mulder and Scully investigate Samuel who appears to have the power to heal people but lately they have been dying.\n\n19) Shapes - Mulder and Scully travel to Montana to investigate what appears to be an Indian Manitou.\n\n20) Darkness Falls - Mulder and Scully travel to the National Forest in Washington and discover tiny green phosphorous insects that are active in the dark and feed on human flesh.\n\n21) Tooms - Tooms, from the Squeeze episode, is release for good behavior but go back to his old ways.\n\n22) Born Again - Mulder and Scully investigate an 8-year-old girl who may be a reincarnated serial killer.\n\n23) Roland - Mulder and Scully investigate Roland, an autistic, being manipulated by his dead brother who is frozen in liquid nitrogen.\n\n24) The Erlenmeyer Flask - Mulder and Scully investigate the terminally ill that are being injected with alien DNA. Deep Throat is killed and the X-Files are closed. \n\n","torrent":{"xt":"urn:btih:5ce56b40e1115aa6bc5260098b97e3ee453596b3","amp;dn":"The+X-Files+-+The+Complete+First+Season+%281993%29+-+Disk+1+of+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce56b40e1115aa6bc5260098b97e3ee453596b3","infoHashBuffer":{"type":"Buffer","data":[92,229,107,64,225,17,90,166,188,82,96,9,139,151,227,238,69,53,150,179]},"announce":[],"urlList":[]}}