{"title":"LITTLE MISS SUNSHINE - [ENG][2006] - LIBRE &amp; VERITAS","uid":4112411,"size":735528960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d0b2d4c8bf6afc19e2b9b2dc44bfd00ae53dd7b&amp;dn=LITTLE+MISS+SUNSHINE+-+%5BENG%5D%5B2006%5D+-+LIBRE+%26+VERITAS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Libre_Veritas","files":1,"time":1207132658,"description":"Little Miss Sunshine is an Academy Award-winning comedy-drama film about a family&amp;#039;s road trip to a children&amp;#039;s beauty pageant and was the film directional debut of the husband-wife team of Jonathan Dayton and Valerie Faris. The film was produced by Big Beach Films on a budget of US$8 million.[1][2] The film starred Greg Kinnear, Steve Carell, Toni Collette, Paul Dano, Abigail Breslin and Alan Arkin.\n\nThe film&amp;#039;s screenplay was written by first-time writer Michael Arndt, and after directors Dayton and Faris initially settled on studio Focus Features, the film was later funded by one of the producers when the studio dropped the film. Many of the actors&amp;#039; roles had been chosen by the directors, and although the role of Frank Ginsberg was initially supposed to be played by Bill Murray or Robin Williams, the role went to Carell. Filming occurred over thirty days in Arizona and Southern California in the summer of 2005. A large portion of the film focuses on the family vehicle, a Volkswagen T2 Microbus, and many of the problems associated with the vehicle were based on Ardnt&amp;#039;s past experience on a family trip. The film&amp;#039;s pageant used actual contestants from prior pageants, and the directors held their own pageant to learn more about the process before filming.\n\nThe film premiered at the Sundance Film Festival on January 20, 2006. Its distribution rights were bought by Fox Searchlight Pictures for $10.5 million plus ten percent of the revenues of the gross,[3][4] reportedly one of the biggest deals ever made in the history of the Sundance Film Festival.[5] The film had its continental European premiere on August 12, 2006 at the 2006 Locarno International Film Festival[6], and its wide release in the United States on August 18, 2006,[1]. The soundtrack was released on July 11, 2006 and included tracks from DeVotchKa, Rick James, and Sufjan Stevens. The DVD was released on December 19, 2006 that included deleted scenes and four alternate endings.\n\nLittle Miss Sunshine received generally positive reviews, earning a 92% approval rating on Rotten Tomatoes and 80/100 from Metacritic and had total international box office gross receipts of $100.2 million. The film was nominated for four Academy Awards, including Best Picture, and won two: Best Original Screenplay for Michael Arndt and Best Supporting Actor for Alan Arkin. There was also some controversy over the producers&amp;#039; credits at the Academy Awards, which allowed only three of the five producers to receive the award for the film. It also won the Independent Spirit Award for Best Feature and received multiple other awards and nominations. The film was dedicated to Rebecca Annitto, the niece of producer Peter Saraf and an extra in scenes set in the diner and the convenience store, who was killed in a car accident on September 14, 2005.[7]\n","torrent":{"xt":"urn:btih:5d0b2d4c8bf6afc19e2b9b2dc44bfd00ae53dd7b","amp;dn":"LITTLE+MISS+SUNSHINE+-+%5BENG%5D%5B2006%5D+-+LIBRE+%26+VERITAS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0b2d4c8bf6afc19e2b9b2dc44bfd00ae53dd7b","infoHashBuffer":{"type":"Buffer","data":[93,11,45,76,139,246,175,193,158,43,155,45,196,75,253,0,174,83,221,123]},"announce":[],"urlList":[]}}