{"title":"Jet Black Crayon - In The Interim DVD Disc","uid":4267893,"size":2256406528,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5d5435e7a54038fd4bea1b8d77056c8734a69104&amp;dn=Jet+Black+Crayon+-+In+The+Interim+DVD+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxbassxx","files":54,"time":1214788861,"description":"Jet Black Crayon re-emerges with their fifth release, the CD + DVD In the Interim. The JBC trio?Tommy Guerrero (Quannum Projects, Mo?Wax, Galaxia, Function 8), Monte Vallier (ex-Swell, Def American/American Recordings, Beggars Banquet) and Gadget (Function 8)?created this next level of collaboration by working with independent filmmakers. Seven of the nine tracks on In the Interim are complemented with short films. The filmmakers include Andrew Paynter (music photographer, artist), Dan Wolfe (skateboard filmmaker: Real Skateboards, Nike SB, Adidas SB, etc.), Greg Hunt (skateboard filmmaker: DC Shoes, Transworld Media, Alien Workshop), Cheryl Dunn (filmmaker and photographer: Beautiful Losers) and Christophe Beaucourt (independent French filmmaker). In the Interim will be released April 8, 2008 on Function 8.\n\nThose familiar with Jet Black Crayon will find a renewed soundscape, and those familiar with Tommy Guerrero?s music will note a more visual, cerebral and textural sound. The interplay between music and fi lm on In the Interim is key. The creative process was a true collaboration; JBC and the filmmakers exchanged rough mixes and edits, allowing them to shape the respective audio and visual parts in tandem. Some of the songs dynamically move to the fi lms while others create a moody score. Check out musical cameos from John Herndon and Dan Bitney (Tortoise) on ?Lost in the Fog,? the powerful spoken word of Pete Simonelli (The Enablers) on ?My Fair Romans,? and longtime JBC collaborator Charlie Hall (Tommy Guerrero) playing drums on ?Brighter Days.?\n\nJet Black Crayon came into being when Tommy Guerrero was asked to open for Isotope 217 on a short West Coast U.S. tour in late 1999. Instead of playing solo shows, Tommy decided to gather a group of like-minded musicians, who were already working together on various projects. JBC, known for constantly exploring and developing their sound, reached new heights with their last record (Inaccuracies of the Mind Machine, FER 88814-2, 6/21/04). In the Interim continues the exploration, while finding a tighter, sparser direction.","torrent":{"xt":"urn:btih:5d5435e7a54038fd4bea1b8d77056c8734a69104","amp;dn":"Jet+Black+Crayon+-+In+The+Interim+DVD+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5435e7a54038fd4bea1b8d77056c8734a69104","infoHashBuffer":{"type":"Buffer","data":[93,84,53,231,165,64,56,253,75,234,27,141,119,5,108,135,52,166,145,4]},"announce":[],"urlList":[]}}