{"title":"Ez3kiel - 2008 - Battlefield","uid":4132851,"size":81273109,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d9919ab0cbf2264807bca2071610ffe631de3af&amp;dn=Ez3kiel+-+2008+-+Battlefield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"amowgli","files":12,"time":1208120118,"description":"Artist : Ez3kiel\nAlbum : BattleField\nGenre : Electronic/Dub\nDate : 2008-01-21\nQuality : 206kbps \n\n01. Adamantium \n02. Volfoni&amp;#039;s Revenge\n03. Spit on the Ashes\n04. Coal Flake\n05. The Wedding\n06. Break or die\n07. Alignment\n08. Lull\n09. Firedamp\n10. The Montagues and the Capulet\n11. Wagma\n\nFounded in 1994, EZ3kiel is magnet-Dub originating from Tours, France. In beginning they had a singer, but there is no recorded material from that period. \nFrom 1999 they work as a trio:Yann Nguema (bass guitar, visuals), Joan Guillon (samples, effects, keyboard) and Matthieu Fays (percussion)\nIn 1999 they released a promising mini album &quot;Equalize-it&quot;. In 2000 they released album called &quot;Handle with care&quot;, which was full of collaborations with big names of French independent scene (Yann Tiersen, Sylvestre from Dit Terzi and Sir Jean from Mei Tei Sho). That album intrigated with the audience and confirmed the band&amp;#039;s eclectic style. On their live performances, they are known for creating of poetic universe with beautiful visuals and graphics, which are made b bass guitarist Yann N&amp;#039;Guema. He uses samples of various photographs, which in combination with the music create a special audio-visual experience. Other French electro bands use visuals on their live performance, but Ez3kiel are really something special compared to them, their visuals are synchronized with the sound. In 2003 they released another album &quot;Barb4ry&quot; which show that band&amp;#039;s mature period came. With it they confirmed they identity as a group which expresses in different music genres (electronica, dub, hiphop etc.) and do lots of experimentation. In their music beauty and melancholic mood quickly change to aggression and cruelty. The efficiency of Ez3kiel lies in their ability to surprise the audience. The profanity of their sound and visuals delivered them to become one of the most exciting and interesting French electro dub bands.","torrent":{"xt":"urn:btih:5d9919ab0cbf2264807bca2071610ffe631de3af","amp;dn":"Ez3kiel+-+2008+-+Battlefield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9919ab0cbf2264807bca2071610ffe631de3af","infoHashBuffer":{"type":"Buffer","data":[93,153,25,171,12,191,34,100,128,123,202,32,113,97,15,254,99,29,227,175]},"announce":[],"urlList":[]}}