{"title":"SWF games by TAMBA","uid":4025785,"size":13945622,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:5df34a3187df6896070787adab9e96cc9c36870f&amp;dn=SWF+games+by+TAMBA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"w888","files":18,"time":1202918714,"description":"A small list of swf games from TAMBA\n\nAce Driver:\nThe aim is to avoid the obstacles and slow down for the speed cameras, making sure you get to the checkpoints before the time runs out.\n\nAsk The Spirits II:\nCommunicate with the dead and ask them questions. Be careful as they are easily offended and you could end up on the other side.\n\nAvenue of Death:\nHelp Bond avoid sinister creatures and traps in order to survive the Avenue of Death.\n\nBarcode Bedlam:\nScan the barcodes in this face paced game.\n\nChimney Challenge:\nHit the accountants with the snowballs. The quicker you hit the accountants the  more points you get.\n\nEnergy Champions:\nCollect the recycling dropped from above by the selfish workers and place them in the correct recycling bins before your carbon workprint becomes too big.\n\nHow Does Your Garden Grow:\nStep into CyberChris? muddy shoes and become a virtual gardener. \n\nMuck about with Cupid and Fate:\nHelp Cupid collect game consoles, pints of beer and hamburgers which help him progress to the vortex.\n\nPimp My Sleigh:\nCustomise your sleigh and submit to the gallery. Then race your customised sleigh (or choose one from the inventory) in the Sleigh Slalom.\n\nRed Lead:\nHelp save the Red Noses by getting them safely from one side of the screen to the other, avoiding the sharp pencils.\n\nSleigh Away:\nHelp Santa retrieve his presents from his stolen sleigh. \n\nSofa Bash:\nDestroy the sofa with some fiendish weapons as quick as you can in this mouse-click frenzy.\n\nSpy a Solution:\nHelp Barry the Buyer negotiate 20 challenges with increasing difficulty in order to save his job in this retro styled platform game.\n\nSunshine Shopaholic:\nCollect your designer gear now and make sure your partner doesn&amp;#039;t catch you!\n\nSuzi Says:\nClick on the gadgets that Suzi says.The faster you click them, the more points you get however, if you click on the wrong gadget you will lose points.\n\nThe Day The Office Melted:\nPlay as Mr Heatbuster and stop Ms. Dee Hydration from melting the office.\n\nTim-Ball Pinball:\nTim Henman has just hit the pinball table! Usual rules apply, simply try get as many points as you can.\n\nTurkey Target:\nIt&amp;#039;s Christmas and the turkeys have hatched a daring plan to escape the dinner table though a certain fox has other plans! Save the turkeys from impending doom and assist their bid for freedom.\n","torrent":{"xt":"urn:btih:5df34a3187df6896070787adab9e96cc9c36870f","amp;dn":"SWF+games+by+TAMBA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5df34a3187df6896070787adab9e96cc9c36870f","infoHashBuffer":{"type":"Buffer","data":[93,243,74,49,135,223,104,150,7,7,135,173,171,158,150,204,156,54,135,15]},"announce":[],"urlList":[]}}