{"title":"Alex Jones Show Enhanced Edition - July 2, 2008 - Wed - Iserbyt,","uid":4273539,"size":43427851,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5e643e023c8f0ffdb4c3ee76a873ed9b2c0fae06&amp;dn=Alex+Jones+Show+Enhanced+Edition+-+July+2%2C+2008+-+Wed+-+Iserbyt%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Femacamper","files":8,"time":1215064779,"description":"The Alex Jones Show, Enhanced Edition\n\nVeteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you\nthought-provoking interviews and takes an in-depth look at the news between the\ndaily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines\nhis media presence with actual physical activism, a practice that once led to\nhim being arrested on the personal order of George W. Bush! Alex Jones has\ngained international attention for standing up for what he believes in.\n\nFrom La Prensa to the Wall Street Journal and USA Today, Jones has brought the\ninformation war to the mainstream print media worldwide, speaking out against\ntyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing\npersonalities in the world from guerrilla journalists to government officials to\nwhistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any\nother on the air. Jones is a seasoned investigative journalist who has broken\nhundreds of national stories during his career. He is an aggressive\nConstitutionalist who digs deeply into the facts to defend property rights, our\nnational borders, and the Second Amendment while he sends out a rallying call to\nthe American people to resist foreign entanglements and wars for corporate\ninterests. Jones eschews the bogus political labels of left and right and\ninstead focuses on what really matters: right and wrong.\n\nWednesday, July 2nd, 2008\n\nTHE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex welcomes whistleblower Charlotte Iserbyt, former Senior Policy Advisor in\nthe Office of Educational Research and Improvement and author of The Deliberate\nDumbing Down of America, and Richard C. Hoagland, author of Dark Mission: The\nSecret History of NASA. Finally, Alex talks with ex-NFL star George Martin, who\nwalked 500 miles to raise money for afflicted 9/11 first responders. \n\nOriginal capture by chakra (Sourced from the 32 Kbps live stream using Total\nRecorder 7 Pro, or from the 42 Kbps podcast.  Re-encoded to 32 Kbps @ 22.05 KHz.\nEditing done using Nero WaveEditor 4 by hand. Four hours duration before\ncommercial edit takes it down to about 3 hours of playing time. Genre tag set to\nPodcast for better ipod compatibility with bookmarking and chapter support).\nTags edited, edited pictures and show description with Mp3Tag and Winamp. Used\nwith permission. Alex Jones authorizes you to use and redistribute his materials\nfor non-profit, educational purposes:\n\nGo here if there are no seeds: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg214251#msg214251&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg214251#msg214251&lt;/a&gt;\n\nOr you can do up your own .mp3s here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=45157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=45157&lt;/a&gt;\n\nDownload the daily .mp3 here: &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&lt;/a&gt;\n\nOr listen live at","torrent":{"xt":"urn:btih:5e643e023c8f0ffdb4c3ee76a873ed9b2c0fae06","amp;dn":"Alex+Jones+Show+Enhanced+Edition+-+July+2%2C+2008+-+Wed+-+Iserbyt%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e643e023c8f0ffdb4c3ee76a873ed9b2c0fae06","infoHashBuffer":{"type":"Buffer","data":[94,100,62,2,60,143,15,253,180,195,238,118,168,115,237,155,44,15,174,6]},"announce":[],"urlList":[]}}