{"title":"Secrets of the Dead - Mystery of the Black Death [digitaldistrac","uid":4112326,"size":368177152,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5e66783ced24ab742b30c6dd651c633558b8c43f&amp;dn=Secrets+of+the+Dead+-+Mystery+of+the+Black+Death+%5Bdigitaldistrac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rennui","files":1,"time":1207127463,"description":"This episode of Secrets of the Dead was originally encoded by digitaldistractions, which is no longer around.\n\nHere&amp;#039;s a description of the episode from the PBS website:\n[The Mystery of the Black Death begins in September of 1665, when a tailor in the secluded English village of Eyam opened a flea-infested shipment of fabric from London. In a matter of days, the tailor and much of the village were suffering the telltale signs of bubonic plague, the disease that, in the first five years since its arrival, had wiped out a third of the European population. To prevent the outbreak from spreading throughout the region, the whole town was quarantined -- no one was allowed in or out. Outsiders assumed that the bacteria would simply wipe out the entire village. But they were wrong. Three hundred and fifty years later, Dr. Stephen O&amp;#039;Brien, a geneticist from the National Institutes of Health in Washington, D.C., is delving into the reasons why some individuals managed to survive the excruciating Black Death while others were dying all around them. Following O&amp;#039;Brien as he takes DNA samples and investigates historical records and family archives, the film sheds light on the resistance to the plague, and reveals a stunning legacy that the plague survivors passed on to their descendents -- a similar resistance to the modern-day scourge of AIDS.]","torrent":{"xt":"urn:btih:5e66783ced24ab742b30c6dd651c633558b8c43f","amp;dn":"Secrets+of+the+Dead+-+Mystery+of+the+Black+Death+%5Bdigitaldistrac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e66783ced24ab742b30c6dd651c633558b8c43f","infoHashBuffer":{"type":"Buffer","data":[94,102,120,60,237,36,171,116,43,48,198,221,101,28,99,53,88,184,196,63]},"announce":[],"urlList":[]}}