{"title":"Product Key Explorer 2.0.7(with serial)","uid":4259846,"size":1342429,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5eb7a400762372e32a217b68a0f99ea0d2dc8856&amp;dn=Product+Key+Explorer+2.0.7%28with+serial%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aoloffline","files":1,"time":1214414102,"description":"Product Serial Key Find, Recovery and Backup\n\t\nLose your product key? Instantly find your product keys with Product Key Explorer!\n\t \n  \t\n\nSoftware is an investment, Are you sure your investment is safe? In the event of a computer crash, you lose hundreds of dollars in software if you cannot find your product keys, with &quot;Product Key Explorer&quot; you can prevent losing your investment and money\n\t \n  \t \n\nProduct Key Explorer recovers product key for Windows, Microsoft Office, SQL Server and more than 500 software products installed on network computers\n\t  \t\n\nProduct Key Explorer - Find over 500 popular software product keys instantly!\n\nProduct Key Explorer displays product key for Windows, MS Office, SQL Server and more than 500 popular software products installed on your local or remote network computers.\n\nIn order to install or reinstall Microsoft Office, Windows, or other commercial software, you must have access to a product serial key (CD Key) for that product. Product Key Explorer retrieves serial keys from network computers and allows to protect your company from having pirated software on your network.\n\nWith this software you will be able to track the number of software licenses installed in your business, find and recover a lost or forgotten product keys, save and keep an up-to-date backup of all your software license keys in a central location. Excellent tool for network administrators, or businesses undergoing a software license compliancy.\n\nYou can save product keys as Tab Delimited Txt File (.txt), Excel Workbook (.xls), CSV Comma Delimited (.csv), Access Database (.mdb), Web Page (.html) or XML Data (.xml) file, Print or Copy to Clipboard.\n\t  \t \n  \t- Recent version: 2.0.7\n- Release date: June 24, 2008\n- Windows 2000/XP /2003/Vista","torrent":{"xt":"urn:btih:5eb7a400762372e32a217b68a0f99ea0d2dc8856","amp;dn":"Product+Key+Explorer+2.0.7%28with+serial%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb7a400762372e32a217b68a0f99ea0d2dc8856","infoHashBuffer":{"type":"Buffer","data":[94,183,164,0,118,35,114,227,42,33,123,104,160,249,158,160,210,220,136,86]},"announce":[],"urlList":[]}}