{"title":"Half-Life.2.PROPER-EMPORiO","uid":3257276,"size":1572955714,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5ecd8b9e3ccb25ba4ff06c86e69a3832ed40d779&amp;dn=Half-Life.2.PROPER-EMPORiO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MonkeyMan","files":34,"time":1100934587,"description":"Release Date : 19112004 Protection : Simple\nFile Count : 32x50 MB Game Genre : Action FPS\nGame info:\n\nThe player again picks up the crowbar of research scientist\nGordon Freeman who finds himself on an alieninfested Earth\nbeing picked to the bone its resources depleted\nits populace idwindling. Freeman is thrust into the unenviable\nrole of rescuing the world from the wrong he unleashed back at\nBlack Mesa. And a lot of people he cares about are counting on him.\n\nFeatures:\nAdvanced facial animation\nsystem delivers the most sophisticated ingame characters ever seen.\nWith 40 distinct facial muscles human characters convey the full\narray of human emotion and respond to the player with fluidity\nland intelligence.\n\nFrom pebbles to water to 2ton trucks respond as expected\nas they obey the laws of mass friction gravity and buoyancy.\n\nSources shaderbased renderer like the one used at Pixar to\ncreate movies such as Toy Story and Monsters Inc creates\nthe most beautiful and realistic environments ever seen in a video game.\n\nNeither friends nor enemies charge blindly into the fray.\nThey can assess threats navigate tricky terrain\nand fashion weapons from whatever is at hand.\n\nRelease Notes:\n\nThis is a Steamrip of HalfLife 2 from Steam doh.\nAll unnecessary files were removed crack is already applied and should work\nfine now :\nOur previous version was not working correctly also not with the APE fix\nthats why we made this one\nIf you still have save files from previous version just copy them over.\n\nBUY THE GAME IF YOU LIKE IT ENJOY\nInstall Notes:\n\n1. Unpack the release with WinRAR or WinACE\n2. Run Launcher.exe and the game will start\n3. Enjoy \n\n---------------------\n\nI don't know if this one works better than previous release with APE's fix, but at least it's a smaller download because they have removed CS Source.\n\nTO GET RID OF AI_DISABLE AND NODE GRAPH REBUILD BUGS, EDIT x:your_hl_dirhl2cfgautoexec.cfg AND ADD FOLLOWING AT THE END OF THE FILE AND YOU SHOULD BE SET: ai_norebuildgraph &quot;1&quot;\n\nYes, I have confirmed that this release and fix works. Don't yell at me if it doesn't, because here things work flawlessly.","torrent":{"xt":"urn:btih:5ecd8b9e3ccb25ba4ff06c86e69a3832ed40d779","amp;dn":"Half-Life.2.PROPER-EMPORiO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ecd8b9e3ccb25ba4ff06c86e69a3832ed40d779","infoHashBuffer":{"type":"Buffer","data":[94,205,139,158,60,203,37,186,79,240,108,134,230,154,56,50,237,64,215,121]},"announce":[],"urlList":[]}}