{"title":"The Very Best of Richard Williams (Who Framed Roger Rabbit, The","uid":4249070,"size":3367204050,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5ee3206c6718d2f5baa2da49dfa518bdc9094a36&amp;dn=The+Very+Best+of+Richard+Williams+%28Who+Framed+Roger+Rabbit%2C+The+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tygerbug","files":29,"time":1213920774,"description":"The Very Best of Richard Williams\n\n(Who Framed Roger Rabbit, The Thief and the Cobbler, A Christmas Carol,\nRaggedy Ann &amp; Andy)\n\n\nThe legendary, triple Oscar winning animator. Some of his best, rarely seen work\n is collected in this special presentation, screened recently in San Francisco.\n\nAlso look for The Thief and the Cobbler: Recobbled Cut and Raggedy Ann &amp; Andy:\nA Musical Adventure.\n\n\nBuy Richard&amp;#039;s book &quot;The Animator&amp;#039;s Survival Kit,&quot; as well as his extensive (and\nexpensive) 16-DVD set, a must have for animators, at:\n\ntheanimatorssurvivalkit.com\n\n\n\nA Maroon Cartoon - 5 min\nRoger Rabbit screen test - 41 sec.\nReturn of the Pink Panther clip (53 sec)\nCharge of the Light Brigade (5 min 23 sec)\nAnimated Ads - 20 min 4 sec\nAir Canada ad - 41 sec.\nI Drew Roger Rabbit (26 min 29 sec)\nA Christmas Carol - 25 min\nRaggedy Ann &amp; Andy: A Musical Adventure Scenes (No Girl&amp;#039;s Toy, Candy Hearts,\nBlue, The Greedy) - 10 min (About 2.5 min apiece)\nThief and the Cobbler: Recobbled Cut Trailer - 3 min 28 sec\n\nAbout 98 minutes total.\n\n\nRichard Williams was the creative mind behind the animation of the worldwide smash\nsuccess Who Framed Roger Rabbit for which he won two Oscars. He directed and\ndesigned Roger and Jessica Rabbit, Baby Herman and all the new characters for the\nWalt Disney/Steven Spielberg blockbuster.\n\nBritish based Williams has won 3 Oscars, 3 British Academy Awards and over 250\nother international awards.\n\nRichard Williams has a 50 year career in animation which includes The Return of\nthe Pink Panther, The Pink Panther Strikes Again, What&amp;#039;s New Pussycat, the James\nBond Casino Royale, The Charge of the Light Brigade, and Oscar winning A Christmas\nCarol.\n\nHe is also known for his unfinished masterpiece, The Thief and the Cobbler, which was\nnever released as intended but is available on the internet as &quot;The Thief and the\nCobbler: Recobbled Cut,&quot; a restoration of the intended version of the film, on which\nhe spent 23 years.\n\nRichard Williams&amp;#039; current project is a 16-DVD boxed set which brings together his\nlegendary Masterclasses with his best-selling book to create The Animator&amp;#039;s Survival\nKit - Animated. This has over 350 specially animated examples intercut with his 4\nday Masterclass filmed at Blue Sky Studios in New York.\n\nIn the 1990&amp;#039;s he gave the Richard Williams&amp;#039; Animation Masterclasses around the world\nto participants from studios such as Disney, Pixar, ILM, Dreamworks/PDI and Warner\nBros followed by the best-selling The Animators Survival Kit (2001).\n\nDuring his more than 50 years in the business Williams has been one of the true\ninnovators and serves as the link between the Golden Age of animation by hand and\nthe new computer animation successes. Perhaps even more important has been his\ndedication to passing along his knowledge to a new generation of animators so that\nthey in turn can push the medium in new directions.\n\n&amp;#039;Absolute animation genius&amp;#039;\nLOS ANGELES TIMES\n\n&amp;#039;Arguably the best animator working in the field today&amp;#039;\nHOLLYWOOD REPORTER\n\nVoted by peers as &amp;#039;The Animator&amp;#039;s Animator&amp;#039;\nOBSERVER\n\n&amp;#039;The only &quot;genius&quot; genius to come along in animation in years ... probably one\nof the most respected draftsmen in the world.&amp;#039;\nLOS ANGELES TV TIMES\n\nAwards\nRichard Williams has OVER 250 INTERNATIONAL AWARDS (Average of one award every\nmonth over 25 years) including:\n\nOSCAR: Special Academy Award 1989, Who Framed Roger Rabbit\nOSCAR: Academy Award - Special Effects 1989, Who Framed Roger Rabbit\nOSCAR: Academy Award 1972, A Christmas Carol\nBRITISH ACADEMY AWARD: Special Achievements 1989, Who Framed Roger Rabbit\nEVENING STANDARD SPECIAL AWARD: Distinguished Contribution to British Cinema 1989,\nWho Framed Roger Rabbit\nBRITISH ACADEMY AWARD: 1958, The Little Island\nEMMY AWARD: 1982, Ziggy&amp;#039;s Gift\nWINSOR McCAY AWARD: 1984, Distinguished Contribution to the Art of Animation &quot;Annie&quot;\n\n","torrent":{"xt":"urn:btih:5ee3206c6718d2f5baa2da49dfa518bdc9094a36","amp;dn":"The+Very+Best+of+Richard+Williams+%28Who+Framed+Roger+Rabbit%2C+The+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ee3206c6718d2f5baa2da49dfa518bdc9094a36","infoHashBuffer":{"type":"Buffer","data":[94,227,32,108,103,24,210,245,186,162,218,73,223,165,24,189,201,9,74,54]},"announce":[],"urlList":[]}}