{"title":"Halo XBOX-ProjectX By req","uid":3225247,"size":3537530741,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:5f0607b86da88970acdabc004bedb9822c817a0a&amp;dn=Halo+XBOX-ProjectX+By+req&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rooban","files":74,"time":1090019794,"description":"&lt;img src=&quot;http://images.amazon.com/images/P/B00009TW6R.01.LZZZZZZZ.jpg&quot;&gt;\n\n&lt;a name=&quot;amzn-reviews&quot;&gt;&lt;b class=h1&gt;Product Description&lt;/b&gt;&lt;/a&gt;\n&lt;a name=&quot;b00009tw6r4055&quot;&gt; &lt;span class=&quot;small&quot;&gt;&lt;b&gt;&lt;i&gt;From the Manufacturer&lt;/i&gt;&lt;/b&gt;&lt;/span&gt; &lt;span class=&quot;serif&quot;&gt;&lt;i&gt;Halo&lt;/i&gt;, the award-winning and critically acclaimed science fiction epic adventure, is coming to the PC courtesy of Bungie and Gearbox Software. Packed with action, &lt;i&gt;Halo&lt;/i&gt; contains all the thrilling gameplay and rich story that made it a smash hit with gamers all over the world. Now you can take the battle online with all new multiplayer including new maps, weapons and vehicles available only on your PC! &lt;p&gt; Bent on Humankind's extermination, a powerful fellowship of alien races known as the Covenant is wiping out the Earth's fledgling interstellar empire. You and the other surviving defenders of a devastated colony-world make a desperate attempt to lure the alien fleet away from Earth. Shot down and marooned on the ancient ring-world Halo, you begin a guerilla-war against the Covenant. Fight for humanity against an alien onslaught as you race to uncover the mysteries of Halo.&lt;p&gt; &lt;ul&gt; &lt;li&gt;&lt;b&gt;New to &lt;i&gt;Halo&lt;/i&gt; for the PC&lt;/b&gt;: &lt;i&gt;Halo&lt;/i&gt; allows you to take the battle online with gamers from all over the world in a variety of customizable individual and team based games. Experience the all new multiplayer with the addition of new maps, weapons and vehicles. &lt;i&gt;Halo&lt;/i&gt;'s been enhanced for play on the PC with the precision offered by the mouse and keyboard and the support of high-end hardware allowing up to 1600x1200 resolution! &lt;li&gt;&lt;b&gt;Rich sci-fi experience&lt;/b&gt;: &lt;i&gt;Halo&lt;/i&gt; transports you into a science fiction universe fresh out of a Hollywood movie. With a detailed, twisting storyline, complex characters and cunning enemies, &lt;i&gt;Halo&lt;/i&gt; will fulfill every sci-fi enthusiast's dreams. &lt;li&gt;&lt;b&gt;Vehicle and foot-based action&lt;/b&gt;: Tackle missions any way you choose, be it storming an enemy base or taking the wheel or gunnery position in a variety of powerful vehicles. Vehicles range from stolen Covenant flyers to human tanks and more. &lt;li&gt;&lt;b&gt;Intense online multiplayer shootouts&lt;/b&gt;: Take the battle online with gamers from all over the world in a variety of individual and team-based games such as King of the Hill, Capture the Flag, Race, Oddball, Death Match, and more &lt;li&gt;&lt;b&gt;Huge Weapon Variety&lt;/b&gt;: Enemies can be crushed with a vast array of human or Covenant weaponry, ranging from the stealthy semiautomatic pistols and needler guns to the fierce rocket launchers and fuel-rod gun. &lt;li&gt;&lt;b&gt;Incredible mission variety&lt;/b&gt;: Fight the Covenant in a variety of missions as they uncover the dark secrets of Halo. Among the many objectives: to attack enemy outposts, raid underground labs for advanced technology, rescue fallen comrades, steal alien vehicles and weaponry, and snipe at enemy forces. &lt;li&gt;&lt;b&gt;Indoor and outdoor combat&lt;/b&gt;: Fights are seamless in &lt;i&gt;Halo&lt;/i&gt;'s ultrarealistic indoor and outdoor environments as gamers hunt the Covenant in a variety of single-player and multiplayer battles. &lt;li&gt;&lt;b&gt;Optimized for the PC&lt;/b&gt;: With the precision of mouse and keyboard support, playing &lt;i&gt;Halo&lt;/i&gt; is like never before. Take advantage of their high-end graphic cards and see &lt;i&gt;Halo&lt;/i&gt; in superhigh 1,600 x 1,200 resolution. &lt;li&gt;&lt;b&gt;5.1 compatible&lt;/b&gt;: Enjoy a complete surround-sound experience! Enemy troops yell out the front speakers, while friendly troops yell assistance from the right. Meanwhile, hear bullets fired from behind and watch them strike targets in front of you. &lt;/ul&gt;&lt;/span&gt; &lt;/a&gt;\n&lt;a name=&quot;b00009tw6r4040&quot;&gt; &lt;span class=&quot;small&quot;&gt;&lt;b&gt;&lt;i&gt;Product Description&lt;/i&gt;&lt;/b&gt;&lt;/span&gt; &lt;span class=&quot;serif&quot;&gt;Halo, the award-winning and critically acclaimed science fiction epic adventure, is coming to the PC, courtesy of Bungie and Gearbox Software.&lt;/span&gt; &lt;/a&gt;\n&lt;p&gt;","torrent":{"xt":"urn:btih:5f0607b86da88970acdabc004bedb9822c817a0a","amp;dn":"Halo+XBOX-ProjectX+By+req","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f0607b86da88970acdabc004bedb9822c817a0a","infoHashBuffer":{"type":"Buffer","data":[95,6,7,184,109,168,137,112,172,218,188,0,75,237,185,130,44,129,122,10]},"announce":[],"urlList":[]}}