{"title":"The Water Margin","uid":4102005,"size":7175263232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5f3e1e6dd8118e80a0a852e27203d00c068c82da&amp;dn=The+Water+Margin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":13,"uploader":"ozzyfudd","files":26,"time":1206626633,"description":"Before \\&amp;#039;Crouching Tiger...\\&amp;#039; Before Jackie Chan. Before \\&amp;#039;A Chinese Ghost Story\\&amp;#039;, there was this fantastic series set during fuedal Japan. \n\nThe story went something like this: The hero, Lin Chung, was the right hand soldier of his boss Kao Chu. After fighting a dangerous battle for his master, Lin Chung returns home to find out that his wife has committed suicide. He later discovers that the boss that he so faithfully defended during the war, had on many occasions made lewd advances towards his betrothed. She of course rejected his unwanted attentions, but Kao Chu forces himself upon her. She becomes ashamed and blames herself for the assault, and later takes her own life. Lin Chung attempts to assassinate Kao Chu in revenge, but is captured and imprisoned. After many years, he escapes with a number of inmates, and they seek refuge in their hide-out situated \\&amp;#039;...on the water margins of the mountains.\\&amp;#039; as the narrator explains at the beginning of each episode. There they form a band of rebels called The Liang Shang Po, who take it upon themselves to defend villagers and such from Kao Chu\\&amp;#039;s army, and any other hostile aggressors. \n\nThe dialogue was dubbed into English, much like a similar series which was broadcast around the same time in England -the late \\&amp;#039;70s- called \\&amp;#039;Monkey\\&amp;#039;. The battle sequences are truly fantastic to watch, and have obviously been influenced by Akira Kurosawa\\&amp;#039;s films. There is no blood and gore, as this seems to have been aimed at a young teenage audience, and it remains a classic to anyone who loves martial arts movies. \n\n","torrent":{"xt":"urn:btih:5f3e1e6dd8118e80a0a852e27203d00c068c82da","amp;dn":"The+Water+Margin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f3e1e6dd8118e80a0a852e27203d00c068c82da","infoHashBuffer":{"type":"Buffer","data":[95,62,30,109,216,17,142,128,160,168,82,226,114,3,208,12,6,140,130,218]},"announce":[],"urlList":[]}}