{"title":"ONKEL_REMUS_DISNEY_1948_GERMAN","uid":4106347,"size":1051496448,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6063cdd87d5eb83e5ea0ead52ada74c664bed8f5&amp;dn=ONKEL_REMUS_DISNEY_1948_GERMAN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonne210","files":5,"time":1206824532,"description":"Kinderfilm, USA 1946, Regie: Wilfred Jackson, Wilfred Jackson und Harve Foster, Harve Foster, Buch: Dalton Reymond, Morton Grant und Maurice Rapf, Kamera: Gregg Toland, Musik: Charles Wolcott, Daniele Amfitheatrof und Paul Smith, Produzent: Walt Disney. Mit: James Baskett, Luana Patten, Bobby Driscoll, Glenn Leedy, Ruth Warrick, Eric Rolf, Hattie McDaniel, Lucile Watson.\n\n\nBei einem Besuch auf der SÃƒÂ¼dstaaten-Plantage seiner GroÃƒ?mutter erfÃƒÂ¤hrt der 10-jÃƒÂ¤hrige Johnny von den TrennungsplÃƒÂ¤nen seiner Eltern. WÃƒÂ¤hrend Johnnys Vater nach Atlanta zurÃƒÂ¼ckkehrt, soll der Junge zukÃƒÂ¼nftig mit seiner Mutter auf der Plantage leben. Tief unglÃƒÂ¼cklich und voller Sehnsucht nach seinem Vater beschlieÃƒ?t Johnny, fortzulaufen. Doch die Flucht wird von Onkel Remus verhindert, einem alten und weisen Sklaven, der die FÃƒÂ¤higkeit hat, mit Hilfe magischer Geschichten traurige Kinderherzen zu trÃƒÂ¶sten. Zwischen Johnny und Remus entwickelt sich eine innige Freundschaft, die jedoch von Sally, Johnnys Mutter, mit wachsendem Argwohn betrachtet wird. Als Sally dem alten Sklaven schlieÃƒ?lich jeden weiteren Umgang mit ihrem Sohn verbietet und Remus daraufhin die Plantage verlÃƒÂ¤sst, kommt es zu einer TragÃƒÂ¶die...\n\nDank der phantastisch-tollen Geschichten, die der schwarze &quot;Onkel Remus&quot; erzÃƒÂ¤hlt ist dies ein groÃƒ?artiger Disney-Klassiker, der, obwohl er Real- und Zeichentricksequenzen geschickt verbindet, nie in deutschen Kinos zu sehen war und erst vierzig Jahre nach seiner Entstehung seine deutsche ErstauffÃƒÂ¼hrung auf Video erfuhr.","torrent":{"xt":"urn:btih:6063cdd87d5eb83e5ea0ead52ada74c664bed8f5","amp;dn":"ONKEL_REMUS_DISNEY_1948_GERMAN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6063cdd87d5eb83e5ea0ead52ada74c664bed8f5","infoHashBuffer":{"type":"Buffer","data":[96,99,205,216,125,94,184,62,94,160,234,213,42,218,116,198,100,190,216,245]},"announce":[],"urlList":[]}}