{"title":"John Pilger - In the name of justice (2007) [DVDRip.Luftwaffe]","uid":4044942,"size":5704185656,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6078268de348705ab0ee8c26dccaacc405a28965&amp;dn=John+Pilger+-+In+the+name+of+justice+%282007%29+%5BDVDRip.Luftwaffe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DieLuftwaffe","files":15,"time":1203865038,"description":"I have now ripped the 4 DVD&amp;#039;s in this box (original total size was nearly 17 GB).\n\nNOTE: THERE ARE 12 DOCUMENTARIES IN THIS TORRENT. YOU DON&amp;#039;T HAVE TO DOWNLOAD ALL OF THEM!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nIf you use a good client (uTorrent) you can choose which ones to download and which ones to skip.\nIf you liked what you saw, you can come back and get the rest later.\n\nABOUT JOHN PILGER:\nJohn Pilger is a well-known journalist (twice named British journalist of the year and recipient of UN Media Peace Prize) whose stories - whether it&amp;#039;s in the form of documentaries, books or articles - are always told from the perspective of the poor and suffering people of the world. He brings up issues that mainstream media won&amp;#039;t even touch. His works are very serious, there is nothing &quot;conspiratorial&quot; about them, and if you have not yet read or seen anything by him, now is a great opportunity.\n\n//Luftwaffe\n\n\nContents:\n\n**** Disc One ****\n1.1 THE MEXICANS\n- Mexico - a country rich in oil resources but heavily influenced by the policies and politics of its near neighbour, the USA. In a country dominated by the thought that the revolution is only half over, is Mexico a potential Iran on American doorsteps?\n\n1.2 STREET OF JOY\n- John Pilger investigates how product marketing techniques used in advertising are applied to politics, specifically the US Presidential campaign in the mid- 1970s. In doing so he uncovers the spin doctors at work and witnesses how they can make less-than deserving presidential candidates into frontrunners through reworking their public image.\n\n1.3 PYRAMID LAKE IS DYING\n- Due to the damming and changing of the water flow from two lakes in the Nevada desert to accommodate white settlers, the Pyramid Lake Paiute reservation is on the verge of extinction. With Lake Winemucca already dead and Pyramid Lake dying, the Paiutes have to resort to legal remedies to survive.\n\n**** Disc Two ****\n2.1 A FARAWAY COUNTRY\n- John Pilger investigates the Czech Underground and interviews members of the group known as the Charter 77 Movement. Outlawed by the then-incumbent Government&amp;#039;s oppressive regime, the Charter 77 activists were denounced as traitors and renegades.\n\n2.2 DO YOU REMEMBER VIETNAM?\n- John Pilger was one of the last journalists to leave Vietnam at the end of the war. Three years later, he returned to examine the state of the country under the new regime.\n\n2.3 VIETNAM: THE LAST BATTLE\n- Nearly twenty years after making his &quot;Do You remember Vietnam?&quot; documentary, and with the embargoes on that country lifted by President Clinton, Pilger returned to Vietnam to review those two decades. He investigates the scandal of cheap labour and the Hollywood-isation of the war.\n\n**** Disc Three ****\n3.1 THE TRUTH GAME\n- An examination of the propaganda and policy surrounding the nuclear arms race - from the initial nuclear detonations over Japan to the stockpiling of arms by world superpowers. It also looks at the way &quot;official truth&quot; is used to condition the public against the real facts of a nuclear war.\n\n3.2 JAPAN BEHIND THE MASK\n- Denied a sense of nationalism since World War Two, Japanese society slowly re-established itself as a &amp;#039;corporate society&amp;#039;. This documentary reports on the contrast between the popular image and stereotypes of Japan and the actuality of the lives of ordinary people who do not fit the image.\n\n3.3 APARTHEID DID NOT DIE\n- Banned in the sixties by South Africa&amp;#039;s oppressive apartheid regime, John Pilger returns to the country to examine the benefits of democracy. He interviews Nelson Mandela and tries to uncover to what extent the black majority has benefited under the new regime.\n\n**** Disc Four ****\n4.1 THE LAST DREAM: HEROES UNSUNG\n- First of a three-part documentary on the history of Australia&amp;#039;s development over the last two centuries. This first show examines the plight of the Aborigines whose land was stolen by British settlers and who are still seeking justice.\n\n4.2 THE LAST DREAM: SECRETS\n- An investigation into the massive racial inequalities in the Australian society between the native Aborigines and the whites. It also examines the massacre of thousands of its indigenous peoples.\n\n4.3 THE LAST DREAM: OTHER PEOPLE&amp;#039;S WARS\n- This third and last part looks at the relationship Australians have with war, often engaging in conflicts that pose no threat to their country.\n\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/John-Pilger-Name-Justice/dp/B000N0WYH4/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1203531843&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/John-Pilger-Name-Justice/dp/B000N0WYH4/ref=pd_bbs_sr_1?ie=UTF8&amp;s=dvd&amp;qid=1203531843&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:6078268de348705ab0ee8c26dccaacc405a28965","amp;dn":"John+Pilger+-+In+the+name+of+justice+%282007%29+%5BDVDRip.Luftwaffe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6078268de348705ab0ee8c26dccaacc405a28965","infoHashBuffer":{"type":"Buffer","data":[96,120,38,141,227,72,112,90,176,238,140,38,220,202,172,196,5,162,137,101]},"announce":[],"urlList":[]}}