{"title":"Revolution Renaissance - New Era (2008) [EAC-FLAC]","uid":4246073,"size":404325077,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:61a17162d6abb0992115b09ca8aca12364b369e6&amp;dn=Revolution+Renaissance+-+New+Era+%282008%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Sworduigi","files":13,"time":1213795167,"description":"Extractor: EAC 0.95 beta 4 \nRead mode   : Secure with NO C2, accurate stream, disable cache\n\nCodec: Flac 1.2.1;  Level 8  \n\nSource: Found (Ripped by Sanbo)\nArtwork: Full Scans.  \n\n\nGeneral Info:\nArtist: Revolution Renaissance\nAlbum: New Era\n\n\n\n                Tracklist:\n   1. Heroes (Sammet)\n   2. I Did It My Way (Kiske)\n   3. We Are Magic (Rantanen)\n   4. Angel (Kiske)\n   5. Eden Is Burning (Rantanen)\n   6. Glorious and Divine (Sammet)\n   7. Born Upon the Cross (Rantanen)\n   8. Keep the Flame Alive (Kiske)\n   9. Last Night on Earth (Kiske)\n  10. Revolution Renaissance (Kiske)\n\n\n\n\n              LINE UP:\n\nMichael Kiske - Vocals\nTobias Sammet - Vocals\nPasi Rantanen - Vocals\n\nTimo Tolki - Guitar\nPasi Heikkila - bass\nMirka Rantanen - Drums\n\n\nReview taken from metal-temple.com:\n\nThe last years were really hard for the guitar virtuoso Timo Tolkki, who recently announced that STRATOVARIUS will be no more. The constant differences (I&amp;#039;d like to call them &quot;artistic&quot;) and - in many cases - arguments convinced Timo that this band could not continue to produce music that could stand beside albums like &quot;Visions&quot; or &quot;Episode&quot;. Personally, I think that it was a fair decision, because it is pretty ugly to follow a band that exists just for the shake of making money.\n\nApparently Timo had composed new music for the album that would succeed the homonymous and last STRATOVARIUS album. So, without loosing time, he formed a band under the symbolic and difficult to pronounce moniker REVOLUTION RENAISSANCE, with some session members and some really interesting guest appearances.\n\nAfter a short intro that reminded me of the &quot;Elements&quot; albums the guitar introduces the opening track, &quot;Heroes&quot;. This song can be characterized as a typical STRATOVARIUS cut, with catchy guitar leads and some supporting keyboards. Tobias&amp;#039; voice fits like a glove to the music and this is to be expected since his band, EDGUY, has many influences from the Finnish metallers. The next song, &quot;I Did It My Way&quot;, literally blew me away! The catchy mid-tempo groove combined to the distinct chorus melody and Michael&amp;#039;s excellent voice were the main reasons for my reaction to this track. I know that Kiske has commented that he is done with Metal but let us hope that he will extend his collaboration with Timo. Power Metal is the main issue in the next faster track, &quot;We Are Magic&quot;, that maybe due to the lyrics or the keyboards or even the vocals, brought to my mind the works of DIO. The album has two power ballads, &quot;Angel&quot; and &quot;Keep The Flame Alive&quot;, that gained additional points to yet another excellent vocal performance by Kiske. Timo has managed to mix in this album almost all musical stops during his STRATOVARIUS days; from the &quot;Elements&quot; songs &quot;Born Upon The Cross&quot; or &quot;Revolution Renaissance&quot; to the faster &quot;Visions&quot; tracks &quot;Glorious And Divine&quot; and &quot;Last Night On Earth&quot;.\n\nI have to confess that I did not expect much from this album since I thought that Timo&amp;#039;s inspiration might have dried out after the end of STRATOVARIUS. Fortunately, I was gloriously proven wrong by these 10 tracks that have spent more time in my CD player than it is necessary to write a proper review. Let us hope that Timmo will find the full-time members for this new band and - why not? - convince Michael to join him!","torrent":{"xt":"urn:btih:61a17162d6abb0992115b09ca8aca12364b369e6","amp;dn":"Revolution+Renaissance+-+New+Era+%282008%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a17162d6abb0992115b09ca8aca12364b369e6","infoHashBuffer":{"type":"Buffer","data":[97,161,113,98,214,171,176,153,33,21,176,156,168,172,161,35,100,179,105,230]},"announce":[],"urlList":[]}}