{"title":"Cowboy Junkies 1992-09-01 @ Bearsville Theater - Woodstock, NY","uid":4057363,"size":422886540,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61db62eea376d7cc72ddee7f6984c34b293c8445&amp;dn=Cowboy+Junkies+1992-09-01+%40+Bearsville+Theater+-+Woodstock%2C+NY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":21,"time":1204432435,"description":"So, the first show is an oldie, an absolute gem, recorded at the musical landmark Woodstock. No, not the farm, but a small theater in the town. The band had released &quot;Black Eyed Man&quot; and was starting to play the material that would make up &quot;Pale Sun, Crescent Moon.&quot; In fact, the Junkies do a great early version of &quot;Pale Sun&quot; here, as well as the rarely played &quot;Hot Burrito #1&quot; and &quot;Lost My Driving Wheel,&quot; a cover that takes on epic proportions live.\n\n \n\nThe recording I have is a soundboard, but it was a little slow. After loading it into my computer, I used Wavelab 4.0 to do a little pitch correction, speeding the recording up 69 cents, a little under one semitone. I did the final correction by ear, trying to match Margo&amp;#039;s voice to what I feel it should be.\n\n \n\nThe band was on tour with Jeffrey Dean Foster and the Carneys at the time. Foster evidently went out behind the theater and found the grave of Albert Grossman, former manager of The Band and Janis Joplin.\n\n \n\nI believe this is a magical recording. I&amp;#039;ve seen partial versions of it at places like archive.org and on various trading lists, but I think this is the complete show. I think it might have originally been done for a radio show, but the details have been lost in the mists of time. I hope you enjoy it.\n\n ","torrent":{"xt":"urn:btih:61db62eea376d7cc72ddee7f6984c34b293c8445","amp;dn":"Cowboy+Junkies+1992-09-01+%40+Bearsville+Theater+-+Woodstock%2C+NY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61db62eea376d7cc72ddee7f6984c34b293c8445","infoHashBuffer":{"type":"Buffer","data":[97,219,98,238,163,118,215,204,114,221,238,127,105,132,195,75,41,60,132,69]},"announce":[],"urlList":[]}}