{"title":"Jackie McLean - Right Now![FLAC - LOSSLESS]","uid":4150551,"size":342648544,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:620d224b0cb312411e252d4e7198e1b400891bdb&amp;dn=Jackie+McLean+-+Right+Now%21%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":12,"time":1208916416,"description":"FLAC files + Covers\nReleased in 1965.\nPersonnel: Jackie Mclean - alto sax , Larry Willis - piano, Bob Cranshaw - bass, Clifford Jarvis - drums.\n\n\nTrack Listing:\n1.Eco\n2.Poor Eric\n3.Christel&amp;#039;s Tune\n4.Right Now\n5.Right Now (Alternate Take)\n\n\nJackie McLean, one of the best and most creative alto saxophonists ever, has been a major force in the world of jazz for over 50 years. Right Now!, a fantastic reissue of a 1964 McLean session, only serves to reinforce this point. It is one of 8 sessions McLean recorded as a leader for Blue Note between August of 1964 and April of 1966. Joined by Larry Willis on piano, Bob Cranshaw on bass, and Clifford Jarvis on drums, Mclean produced a near masterpiece.\nThis intense music approaches free jazz, yet never loses its anchor to McLean&amp;#039;s solid hard bop base. The results are stunning. The original release offered four numbers &quot;Eco,&quot; &quot;Poor Eric,&quot; &quot;Christel&amp;#039;s Tune,&quot; and &quot;Right Now.&quot; This reissue offers an alternate take of the title track. McLean&amp;#039;s playing throughout is always packed full of evocative, uncompromising, and original improvisation. His band members play as an integrated unit.\nDon&amp;#039;t let the label &quot;free&quot; turn you off. This is jazz at its highest and most passionate. The music is still melodic and extremely listenable. &quot;Poor Eric&quot; is a surprise, a wonderful blues played with an emotional urgency that is both sublime and gripping.\nThe civil rights events happening in the world at this time obviously affected McLean. McLean absorbed the emotional complexities of the 1960s and produced a work of art mirroring his emotional state. Do yourself a favor and purchase this recording. Right Now!\n\n(review by Ron Saranich)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:620d224b0cb312411e252d4e7198e1b400891bdb","amp;dn":"Jackie+McLean+-+Right+Now%21%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"620d224b0cb312411e252d4e7198e1b400891bdb","infoHashBuffer":{"type":"Buffer","data":[98,13,34,75,12,179,18,65,30,37,45,78,113,152,225,180,0,137,27,219]},"announce":[],"urlList":[]}}