{"title":"McAfee Total Protection 2008 (Retail)","uid":4270857,"size":94727508,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:62115ea7a4fc0594d9e5bcb90ce8d569a7f922f1&amp;dn=McAfee+Total+Protection+2008+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tamshelt0n66","files":257,"time":1214934494,"description":"Total Protection:\n\n    * Stops viruses: automatically blocks, cleans, and removes viruses so you can surf the Web safely and download files.\n    * Blocks spyware: blocks spyware before it installs on your computer and removes existing spyware so you can surf the Web safely.\n    * Stops hackers: protects and conceals your computer from hackers so you can surf the Internet safely.\n    * Improves PC performance: cleans clutter off of your computer so you can keep your computer healthy and running smoothly.\n    * Backs up and restores files: automated backup and one-click restore so you don&amp;#039;t lose photos, music, and important files.\n    * Secures your identity: protects your online identity so you can shop, bank, email, and instant message worry-free.\n    * Prevents spam and email scams: prevents spam and phishing scams so you can email with friends and family safely.\n    * Protects children online: filters offensive content, pictures, and Web sites so you can keep your children safe when online.\n    * Eliminates network hassles: monitors PCs across your network for security weaknesses, and easily lets you share files and printers.\n    * Protects your wireless network: blocks hackers from attacking your Wi-Fi network and stealing your personal information, so you can safely connect. \n\nAdditional Benefits:\n\n    * Automatically monitors incoming and outgoing Internet activity, looking for suspicious applications and data.\n    * Guards important files stored on your computer, and helps prevent your computer from crashing.\n    * Provides advance warning to help you avoid sites which send spam, install adware, or attempt online scams.\n    * Redesigned for you: Scan your computer, check for updates, and configure your security settings using the new McAfee SecurityCenter. This essential, easy-to-use program gives you one-click access to your computer&amp;#039;s security information.\n    * Always on always protecting: 24/7 virus and threat protection from McAfee AVERT Labs continuously monitors worldwide virus activities and provides immediate anti-virus protection and removal solutions.\n    * Always upgrading, always updating: Daily updates are installed automatically. When a new version of McAfee is available, you get it automatically at no charge during your subscription, ensuring that you always have up-to-date protection.\n    * Convenient ongoing protection: McAfee offers a variety of renewal options to keep your McAfee protection current.\n    * Real people, real help: support from McAfee&amp;#039;s computer security experts, via Internet chat, email, and phone (www.mcafeehelp.com). \n\nNew and Improved Features:\n\n    * New! Integrated anti-virus, anti-spyware, firewall, anti-spam, anti-phishing, and backup technologies work together to combat today&amp;#039;s sophisticated, multi-pronged attacks.\n    * Improved! Spyware protection detects, blocks, and removes spyware and adware.\n    * New! Complete inbound and outbound firewall protection automatically trusts known good applications and helps blocks spyware, Trojans, and key loggers.\n    * New! Automated backup saves copies of your most valuable files wherever you want, encrypting and storing your files on a CD/DVD, USB, or external or network drive.\n    * New! Automatically configured wireless network security safeguards your personal information and transactions.\n    * New! Automatic wireless security key rotation thwarts even the most determined wireless hackers.\n    * New! McAfee ImageAnalysis provides enhanced content protection by protecting your family from potentially offensive content and pictures.\n    * New! McAfee SystemGuards watches your computer for specific behaviors that may signal virus, spyware, or hacker activity.\n    * New! McAfee X-Ray for Windows detects and kills rootkits and other malicious applications that hide from Windows and other anti-virus programs.\n    * New! McAfee SiteAdvisor adds safety ratings to sites and search engine results based on comprehensive spam, adware, and online scam safety tests.\n    * Improved! McAfee SecurityCenter makes it simple to review your computer&amp;#039;s security status, check for updates, and fix potential security issues.\n    * New! Built-in computer health and performance tools keep your computer running at peak performance.\n    * New! Network Manager monitors PCs across your network for security weaknesses so you can easily fix security issues from one centralized network map.\n    * New! McAfee EasyNetwork provides automatic printer sharing and drag-and-drop file sharing across trusted computers on your home network.\n    * New! McAfee Shredder allows you to digitally &quot;shred&quot; confidential files, efficiently removing any and all traces of them from your computer. ","torrent":{"xt":"urn:btih:62115ea7a4fc0594d9e5bcb90ce8d569a7f922f1","amp;dn":"McAfee+Total+Protection+2008+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62115ea7a4fc0594d9e5bcb90ce8d569a7f922f1","infoHashBuffer":{"type":"Buffer","data":[98,17,94,167,164,252,5,148,217,229,188,185,12,232,213,105,167,249,34,241]},"announce":[],"urlList":[]}}