{"title":"Cowboy Junkies 1996-06-06 @ Paolo Soleri - Santa Fe, NM","uid":4057250,"size":543526065,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:621107802f7b9f65187bb64acbcc981542ed644c&amp;dn=Cowboy+Junkies+1996-06-06+%40+Paolo+Soleri+-+Santa+Fe%2C+NM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":28,"time":1204425513,"description":" Paolo Soleri is an open air amphitheater designed to blend into the surrounding countryside. To accomplish this, the venue was dug into the ground. It&amp;#039;s actually sort of hard to find; the venue is behind the Indian school. Soleri himself was born in Italy and received a Ph.D. in architecture  Polytechnico di Torinoin 1946.  He also spent some time in fellowship with Frank Lloyd Wright.\n\nThis is from the Lay It down tour, which produced some great shows. It was one of the last times the band made a conscious push for more radio airplay. I remember the new CD being promoted on KBCO radio here in Denver.\n\nAs the band begins with State Trooper, there are some geese that can be heard in the background. However, after that first song, they quiet down.\n\nA highlight of the show is a four song acoustic set mid-show that includes First Recollection, Sun Comes Up, It&amp;#039;s Tuesday Morning, Ring on the Sill and Powederfinger. While the last doesn&amp;#039;t significantly differ from the CD version, hearing Ring on the Sill and First Recollection reworked is wonderful and really showcases the power of the songs.\n\nThis is the first SOTM from the Lay It Down tour. There have been a lot of shows that have come out from this tour into wider circulation, so I&amp;#039;m not sure how many shows I&amp;#039;ll put out there for download from this tour, but I hope you enjoy this previously unavailable (to my knowledge) gem.","torrent":{"xt":"urn:btih:621107802f7b9f65187bb64acbcc981542ed644c","amp;dn":"Cowboy+Junkies+1996-06-06+%40+Paolo+Soleri+-+Santa+Fe%2C+NM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"621107802f7b9f65187bb64acbcc981542ed644c","infoHashBuffer":{"type":"Buffer","data":[98,17,7,128,47,123,159,101,24,123,182,74,203,204,152,21,66,237,100,76]},"announce":[],"urlList":[]}}