{"title":"After Forever - Exordium [EP]","uid":3232306,"size":64077776,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:625a78c3dd4acd9172ec17e5d6ab05a4f9327913&amp;dn=After+Forever+-+Exordium+%5BEP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"pietjepukje","files":7,"time":1092765734,"description":"After Forever - Exordium [EP]\n2003\n\n01. Line of Thoughts\n02. Beneath\n03. My Choice\n04. Glorifying Means\n05. The Evil That Men Do\n06. One Day I'll Fly Away\n\n\n\nReview by Undercraft\n\nAfter a quite long hiatus (at least for me) After Forever is back, and this time around, things have changed, but don&amp;amp;#8217;t worry, all for good.\nMany say that changes aren&amp;amp;#8217;t good, but I say that changes must be done carefully, and when Mark Jansen left After Forever to form Epica, many thought it was the end of After Forever, but luckily, they were all wrong, because now, After Forever shows us a mini album, and a little hint of what we might found in their third full length.\n\nLet&amp;amp;#8217;s go by steps, first of all and as always, the cover art is amazing, After Forever has always given a lot of attention to this visual details, the booklet of course is magnificent as well (14 page booklet for only a Ep, great!), the Mini Cd which contains 6 songs, comes with an extra Cd, a DVD called &amp;amp;#8220;Insights&amp;amp;#8221;, which contains the video clip of &amp;amp;#8220;My Choice&amp;amp;#8221;, the making of My Choice, some studio recordings, a slide show, and extra artwork, all of this extra features make this Ep a real jewel.\n\nAnyway, in the end, the important part is the music right? So, if you liked After Forever prior efforts, you&amp;amp;#8217;ll like this one too, rest assure that no mayor changes have occurred in the band, hasn&amp;amp;#8217;t go techno or pop, in case you&amp;amp;#8217;ve wandered.\nThe thing that have changed is the lyrical approach of the music, now all lyrics are in charge of Miss Floor Jansen, if you all remember when her brother was in the band, lyrics were dealing with fundamentalism and middle east culture themes, now the prime subject of the lyrics is society and it&amp;amp;#8217;s problems, problems like drug abuse, street rage and other more contemporary issues, very interesting if you ask me.\n\n&amp;amp;#8220;Line Of Thought&amp;amp;#8221; Opens the show, a small instrumental piece that turns into the first real song, &amp;amp;#8220;Beneath&amp;amp;#8221; is a great song with a catchy chorus, and varied elements that make this one a instant winner, the song deals with street rage and a event that occurred in Venlo, Holland, where a young guy was killed for no reason at all.\n&amp;amp;#8220;My Choice&amp;amp;#8221; is the ballad of the album, and the subject of the video clip on the DVD, sadly I don&amp;amp;#8217;t find this song as interesting as the rest in the album, doesn&amp;amp;#8217;t mean that is a bad song, is just not my cup of tea. The song is about all the choices that a human being must do in the term of his life, and how does this choices affect the outcome of his life.\n\nThings get really heavy as soon &amp;amp;#8220;Glorifying Means&amp;amp;#8221; arrives, without a doubt, the hardest song of the mini album, and the only one that have grunts, the song also contains Arabic touches like in the past After Forever albums. I must say that I really missed this, the way that the fantastic voice of Floor Jansen entwines with the grunts is out of this world, add to this the great classical instrumentation, violins and so, and you have a instant hit. The song deals with a very latent issue in almost all societies around the globe, drug addiction.\n\nAt this point the After Forever songs are over, and is time for the two cover songs of the album, first &amp;amp;#8220;The Evil That Men Do&amp;amp;#8221; by Heavy Metal legends, Iron Maiden. These guys read my mind when they did this cover because this is one of my favorite songs of the mighty Maidens. Is great to hear the song with violins and female vocals, that&amp;amp;#8217;s for sure, a very good rendition of this classic. &amp;amp;#8220;One Day I&amp;amp;#8217;ll Fly Away&amp;amp;#8221; is next, a cover of Randy Crawford, I must confess that I&amp;amp;#8217;ve never heard this song neither any work of Randy Crawford, but is a excellent song though.\n\nWell, I think I exposed all you need to know about the comeback of After Forever, this Ep is a small treat of what&amp;amp;#8217;s coming in their next album &amp;amp;#8220;Invisible Circles&amp;amp;#8221;, and let me tell you that if the new album is half as good as this &amp;amp;#8220;Exordium&amp;amp;#8221; I&amp;amp;#8217;ll be more than satisfied.\n","torrent":{"xt":"urn:btih:625a78c3dd4acd9172ec17e5d6ab05a4f9327913","amp;dn":"After+Forever+-+Exordium+%5BEP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"625a78c3dd4acd9172ec17e5d6ab05a4f9327913","infoHashBuffer":{"type":"Buffer","data":[98,90,120,195,221,74,205,145,114,236,23,229,214,171,5,164,249,50,121,19]},"announce":[],"urlList":[]}}