{"title":"Baby Doll.mp4","uid":4144737,"size":1108982451,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6280a41dbb5e95e4027ac53783078707f137a6a3&amp;dn=Baby+Doll.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"friendlytim","files":1,"time":1208669100,"description":"Baby Doll is a 1956 film which tells the story of the childlike bride of a Mississippi cotton gin owner, who becomes the pawn in a battle between her husband and his enemy. It stars Karl Malden, Carroll Baker, Eli Wallach and Mildred Dunnock.[1] This was Wallach&amp;#039;s feature film debut.\n\nThe screenplay was written by Tennessee Williams and was based on his one act play 27 Wagons Full of Cotton. It was directed by Elia Kazan.\n\nBaby Doll won the Golden Globe award for Best Director (Elia Kazan). It was also nominated for four other Golden Globe awards, four Academy awards and one British Academy award.[2]\n\nWhile the costume design was not nominated, the film is credited with both the name and originating the popularity of the babydoll nightgown, which derives from the costume worn by Baker&amp;#039;s character.\n\nThe Catholic Legion of Decency succeeded in having the film withdrawn from release in most U.S. theaters because of their objections over its sexual themes. The movie was banned in many countries like Sweden, due to its allegedly exaggerated sexual content. The film was also condemned by Time, which called it the &quot;dirtiest American-made motion picture that had ever been legally exhibited&quot;.[3]\n\n[edit] ","torrent":{"xt":"urn:btih:6280a41dbb5e95e4027ac53783078707f137a6a3","amp;dn":"Baby+Doll.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6280a41dbb5e95e4027ac53783078707f137a6a3","infoHashBuffer":{"type":"Buffer","data":[98,128,164,29,187,94,149,228,2,122,197,55,131,7,135,7,241,55,166,163]},"announce":[],"urlList":[]}}