{"title":"LOST - The Shape of Things to Come.S04E09.edshrinker.AVI","uid":4154818,"size":458672990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6284c33b078a8498f511530504053636e9a23058&amp;dn=LOST+-+The+Shape+of+Things+to+Come.S04E09.edshrinker.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"edshrinker","files":-1,"time":1209102074,"description":"LOST - The Shape of Things to Come.S04E09.edshrinker.avi\n\nThe Shape of Things to Come&quot;\nSeason 4\nEpisode 9\n\nPlot\nOn the Island\n\nas jack takes antibiotics for his &quot;stomach bug&quot; Kate asks why desmond and Sayid have not returned from the freigther yet. Vincent can be heard barking in the background along with Bernard asking for help in removing the doctor&amp;#039;s body from the ocean.\nFlashforwards\n\nBenjamin Linus wakes up in Tunisia wearing a parka with a DHARMA logo. His arm is injured. Two armed men on horseback approach and as they search him he beats one with a club and shoots the other. He then rides off on one of their horses.\n\nBen checks into a hotel in Tunis, giving the name of Dean Moriarty and introducing himself as a &quot;preferred guest&quot;. He asks about the date - it is October 21, 2005. On the television, he spots Sayid, hounded by the press, who is heading off to &quot;bury his wife&quot;.\n\nIn Tikrit, Iraq, Ben emerges from a taxi and slips up a stairway to the top floor. He pulls a camera with a zoom lens from a bag and snaps a photo of a man watching the funeral procession for Sayid&amp;#039;s wife, Nadia. Sayid spots Ben, who hurries back down stairs. In the street, Sayid assaults Ben, thinking he is paparazzi. Ben tells Sayid he left the island via the Elizabeth and then took a plane to Syria. He also explains that the man at the procession was sent by Charles Widmore to kill his wife in Los Angeles. Sayid vows to kill the man.\n\nBen is watching the man in a cafe and follows him to an alley. He turns on Ben, who asks him to carry a message to Widmore. Just then, Sayid shoots him multiple times. Ben tells him not to succumb to anger over the murder, but Sayid wants revenge, asking &quot;who&amp;#039;s next?&quot; Ben vows to contact him and walks away with a smile.\n\nIn London, Ben emerges from another taxi. He tricks the doorman, claiming to be heading to apartment 4B, but instead uses a key to take the elevator to the penthouse. Here, he enters Charles Widmore&amp;#039;s bedroom.\n","torrent":{"xt":"urn:btih:6284c33b078a8498f511530504053636e9a23058","amp;dn":"LOST+-+The+Shape+of+Things+to+Come.S04E09.edshrinker.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6284c33b078a8498f511530504053636e9a23058","infoHashBuffer":{"type":"Buffer","data":[98,132,195,59,7,138,132,152,245,17,83,5,4,5,54,54,233,162,48,88]},"announce":[],"urlList":[]}}