{"title":"Batman Masterpieces [BBN][h33t]","uid":4046074,"size":58550352,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:62a31bf7d924268b5bb231ef38dba8c23fc70e53&amp;dn=Batman+Masterpieces+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seedYAbastid","files":2,"time":1203923289,"description":"[IMG]http://img301.imageshack.us/img301/9466/w009962su8.jpg[/IMG]\nBatman Masterpieces - Portraits of the Dark Knight and His World\n\n[quote]A new installment of the ongoing Batman/Joker saga as well as hundreds of dazzling illustrations from leading artists make up Batman Masterpieces, the comic book illustration classic now available in affordable paperback! This fabulous book features spectactular paintings from some of today&amp;#039;s best comic book and fantasy artists, who present the Dark Knight and his supporting cast as you&amp;#039;ve never seen them before. Originally produced for the wildly popular DC Comics Batman Master Series trading cards, these lavish illustrations are reprinted here, larger and more astounding than ever. They are creatively combined in a new way to tell an original story by veteran Batman author Doug Moench-a brand-new installment of the ongoing Batman/Joker enmity. Fans and aspiring artists will also be delighted to find dozens of development sketches and notes, which were provided by the famous artists included in this book and which explain the creative approach behind their artwork. For Batman fans, comics lovers, and aspiring artists everywhere, Batman Masterpieces is a fantastic source of never-ending inspiration and excitement![/quote]\n\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:62a31bf7d924268b5bb231ef38dba8c23fc70e53","amp;dn":"Batman+Masterpieces+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62a31bf7d924268b5bb231ef38dba8c23fc70e53","infoHashBuffer":{"type":"Buffer","data":[98,163,27,247,217,36,38,139,91,178,49,239,56,219,168,194,63,199,14,83]},"announce":[],"urlList":[]}}