{"title":"RPG maker VX","uid":4280596,"size":52415385,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63ec802d2df4169e33f983140dc4c8fce3874337&amp;dn=RPG+maker+VX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nedessin","files":151,"time":1215398455,"description":"Make your RPG with simple operation!\n\n&quot;RPG MAKER VX&quot; is a software that enables you to create your original role playing game without any special knowledge. The process is very simple. First, create a map which becomes the stage of your adventure. Secondly, setup the hero, monsters, items, magic, etc,all the things you need to play the RPG. Finally you can complete your very own RPG by creating the events and placing them around the map.\nThe New RPG MAKER is easier!\n\nIn the previous RPG MAKER XP you had to use the script called RGSS but now you can use most of the functions with easier setups. You can save time by making frequent using events with one single command, and by making beautiful maps with little operation.\nNumerous Refined sample Data!\n\nFor players who are unable to prepare character graphics and music by themselves, we have made various sample data. The samples are made to meet specification for the game and tuned to the most attractive high quality level, so that anyone could enjoy the game right away. Of course you can import and use your own original materials as in the previous RPG MAKER XP.\nCreated games are possible to distribute!\n\nAs before, there is a function in which you can save your created game and play it with the computers of other people. It&amp;#039;s possible to burn it on to a disc and give it to your friends or distribute it over the internet for other gamers. It goes without saying that you can market your game as a shareware, too.","torrent":{"xt":"urn:btih:63ec802d2df4169e33f983140dc4c8fce3874337","amp;dn":"RPG+maker+VX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ec802d2df4169e33f983140dc4c8fce3874337","infoHashBuffer":{"type":"Buffer","data":[99,236,128,45,45,244,22,158,51,249,131,20,13,196,200,252,227,135,67,55]},"announce":[],"urlList":[]}}