{"title":"free","uid":4152476,"size":322587472,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:642e3ee66c32ca296b39674089fe80845cff27cf&amp;dn=free&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ScaryBayou","files":25,"time":1209004750,"description":"Computer Shopper May 2008 issue\\\\\\&amp;#039;s 25 free windoz utilities for FREE.\n\nNote: I didn\\\\\\&amp;#039;t include one app from the 25, making this really 24, plus the notes about each program in open document format.. \\\\\\&quot;.odt\\\\\\&quot;. What? don\\\\\\&amp;#039;t have Openoffice.  Good reason to download it then.\n\nSoftware included:\n25 Free Downloads You Need Now\n\nStart Me Up\n\n\nWe love any program that can help speed up boot times, because let\\\\\\&amp;#039;s face it we use Windows. Here are a few apps that can make system loads a little less sluggish.\n\nQuick Startup 2.3\nAs you\\\\\\&amp;#039;re probably well aware, lots of Windows applications take the opportunity to load themselves when you start your PC, whether you want them to or not. Quick Startup shows you all those programs gumming up the works, then allows you to disable the ones you don\\\\\\&amp;#039;t really need to launch at startup.\n\nTweakNow RegCleaner Standard 3.0.1\nA bloated Windows Registry file can cause slow boot-up times and sluggish performance, but manually monkeying with your PC\\\\\\&amp;#039;s Registry can wreak havoc on your system. TweakNow RegCleaner Standard quickly scans your Registry to find and delete obsolete entries left behind by programs you\\\\\\&amp;#039;ve uninstalled and just to be on the safe side, it creates a backup of your Registry file before it changes anything.\n\nFree Registry Defrag 2.35\nAnother quick way to give your system a performance boost is to close up the gaps in your Registry file caused by scattered data. That\\\\\\&amp;#039;s where Free Registry Defrag comes in. It compacts and optimizes your Registry (though it doesn\\\\\\&amp;#039;t remove invalid entries), and it even runs on Windows Vista.\n\nRevo Uninstaller 1.5\nAfter using Quick Startup 2.3, you may find apps on your system that you no longer need (or never wanted in the first place). Revo Uninstaller goes beyond what Windows does with its Add/Remove Programs function, cleaning up any remnants of a removed app (like Registry entries) that Windows might otherwise miss. It also gathers files related to broken applications so you can clean them off your system.\n\nTweak Tools\n\nIf you\\\\\\&amp;#039;re attempting something like overclocking your PC, you need to know what\\\\\\&amp;#039;s going on inside your computer\\\\\\&amp;#039;s case. Here are utilities that can give you a system snapshot, and a couple more that will improve everyday performance.\n\nCPU-Z 1.43\nA tweaker\\\\\\&amp;#039;s godsend, CPU-Z can tell you everything about your PC\\\\\\&amp;#039;s core components, from basic specs like processor name and RAM amount to overclocking essentials such as clock multiplier and voltage settings. If you want to find out what\\\\\\&amp;#039;s going on under the hood of your machine, CPU-Z is essential.\n\nSpeedFan 4.28\nSpeedFan is still one of the best ways to monitor the temperature of components you\\\\\\&amp;#039;ve overclocked (like your processor); it can also control your fan speeds throughout the interior of your case. If your hard drive includes Self-Monitoring Analysis and Reporting Technology (SMART), SpeedFan may be able to read your drive\\\\\\&amp;#039;s temperature, and on select hardware, this utility can even change the front-side-bus speed.\n\nBelarc Advisor 7.2.24\nBelarc Advisor offers PC users the convenience of a full-system scan and a handy hardware and software diagnostic report. It identifies the components in your PC CPU, motherboard, RAM, hard drives, etc. and detects weaknesses in your system\\\\\\&amp;#039;s security. Advisor can also tell if you have Windows vulnerabilities that require running a patch, whether your antivirus software is up to date, and which Microsoft hotfixes your system is missing. It will then create an HTML file of its report so you can easily view it in your Web browser.\n\nProcess Explorer 11.04\nIt might have the least-sexy name of any software ever created, but if you\\\\\\&amp;#039;re a hardcore system mucker frustrated with the limitations of Windows\\\\\\&amp;#039; Task Manager, Process Explorer is the utility for you. Its improvements over Task Manager include displaying icons that are associated with processes and listing any DLL that a process has loaded. It works with every version of Windows, from Windows 95 up to (and including) Vista even the 64-bit version.\n\nRAM Idle LE 1.5\nGive your PC a speed boost by making it allocate available system memory more efficiently. RAM Idle can automatically balance available RAM with the needs of the programs you\\\\\\&amp;#039;re running; it also allows you to manually earmark a certain amount of memory for a particular application. If you can\\\\\\&amp;#039;t add more RAM to your system, RAM Idle is a no-cost answer to memory bottlenecks.\n\nFile Under: Essential\n\nGetting control of the countless files on your computer can be a frustrating chore that never seems to end. These apps will make taming them a little bit easier.\nMissing TrueCrypt 5.0 but if you want it here\\\\\\&amp;#039;s where you can get it: &lt;a href=&quot;\nhttp://www.truecrypt.org/downloads.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.truecrypt.org/downloads.php&lt;/a&gt;\n\nTrueCrypt 5.0\nTrueCrypt lets you create a virtual encrypted disk within a file and mount it as a real disk. You can encrypt an entire hard drive partition or a removable storage device such as a USB flash drive. This latest version adds a pre-boot authentication system that requires users to enter a password before the system loads up.\n\nVunet Find\nVista\\\\\\&amp;#039;s improved desktop search function is an upgrade over those in previous versions of Windows, but it won\\\\\\&amp;#039;t help if you\\\\\\&amp;#039;re running XP or an earlier incarnation. For those who are Vista-less, there\\\\\\&amp;#039;s Vunet Find, which searches all the files on your hard drive the first time it loads, then periodically updates its index instead of performing a full hard drive search each time, as Windows Explorer does.\n\nRecover Files 2\nIs anything more annoying (or, in some cases, terrifying) than deleting a file by accident and being unable to retrieve it? Usually, the file is not actually gone and a free utility like Recover Files 2 can help you get it (and your sanity) back. Whether you deleted something from the Recycle Bin, Windows Explorer, or even a flash-memory card, this software can recover it.\n\nCCleaner 2.05.555\nDon\\\\\\&amp;#039;t let the drab name fool you: CCleaner is one utility you\\\\\\&amp;#039;ll find indispensable. This app rids your system of temporary files from Windows and Internet browsers that fill up your hard drive for no good reason. Plus, it provides a Registry cleaner that removes outdated entries that may be slowing down your PC. It can even remove temporary files from third-party programs such as Microsoft Office, Adobe Acrobat, and WinZip.\n\nDoubleKiller 1.6.2\nOne of the many annoyances of using a computer for several years is the buildup of duplicate files on your hard drive you can\\\\\\&amp;#039;t see them, but you know they\\\\\\&amp;#039;re there. The Windows search function won\\\\\\&amp;#039;t cut it, but DoubleKiller 1.6.2 can do the job. As its name suggests, the utility\\\\\\&amp;#039;s mission is to quickly find doubles in your file library so you can decide whether to delete the copy or not. DoubleKiller also lets you search by file type, which makes it easy if you just want to clean up your MP3 collection.\n\nDoing It All\n\nThese two packages include multiple pieces of free software that can protect, clean up, or otherwise improve your system.\n\nUBCD4Win 3.12\nIf you want a Swiss Army knife of system utilities that you can burn to a bootable CD, UBCD4Win is loaded with everything, from Internet security apps like Spybot Search and Destroy to file utilities and Registry programs to disk tools like MbrFix. As you might expect, the download file is very, very large (over 200MB), and the package sometimes shows up as a false positive in antivirus software but for a no-cost bonanza of useful software, these are minor issues.\n\nAdvanced WindowsCare Personal 2.71\nOne of our favorite paid system utilities is System Mechanic Professional, which diagnoses and fixes PC problems and helps keep your computer secure. For a free alternative that provides many of the same tools, try Advanced WindowsCare Personal. With just a couple of mouse clicks, you can find and remove spyware, detect and fix Registry errors, clean up your startup process, and delete junk files. A $29.95 upgrade to the Professional version gives you always-on, automatically updated PC protection.\n\nDrive Time\n\nYou always hear about how your processor or amount of RAM will impact your system\\\\\\&amp;#039;s speed, but a fragmented, overstuffed hard drive can be a drag on performance as well. Give your disk a little TLC with these drive-related utilities.\n\nWinDirStat 1.1.2\nOne way to figure out what\\\\\\&amp;#039;s been eating your hard drive space is to determine which file types you have the most of. WinDirStat scans your drive and displays each file type in a different color to show you how your disk usage is apportioned. Once you see that you have far, far too many MP3 files for your system\\\\\\&amp;#039;s good, for example, WinDirStat helps you cut things down to size. It\\\\\\&amp;#039;s even clever enough to let you delete files without having to send them to the purgatory of the Recycle Bin first.\n\nAdvanced Disk Cleaner 5.0\nAll kinds of junk files accumulate on your hard drive over the years, but who has time to fish around and delete them? Advanced Disk Cleaner makes such pruning easy. Click a search button, look at the list of garbage files, and then click the Clean button to delete them. The program also has an editing utility to get rid of unnecessary apps lingering in your Windows Registry.\n\nMbrFix 1\nWith its throwback interface (think command lines and neon-green text), this master-boot-record (MBR) app screams, \\\\\\&quot;Advanced users only!\\\\\\&quot; But brave tweakers will find MbrFix useful for such things as deleting Linux partitions from a dual-boot setup, saving your MBR to a file (and then restoring it from a file), and creating a disk signature.\n\nAuslogics Disk Defrag 1.4.11.275\nFor those who don\\\\\\&amp;#039;t know, defragging your hard drive joining fragmented data pieces back together can lead to improved disk performance. For those who do know, defragging can take hours and hours to perform on older, highly fragmented drives. Auslogics\\\\\\&amp;#039; Disk Defrag utility helps speed things up by defragging faster than other, similar apps; it also outputs a summary in HTML format that lets you know which files and folders were defragged and how they were altered.\n\nGParted LiveCD 0.3.4-7\nThis is another great collection for drive experts and Linux lovers. As its name suggests, GParted LiveCD is a set of partition utilities you can burn to disk and run as a Linux-based LiveCD. GParted lets you do almost anything with partitions, including creating, deleting, and copying them. Depending on your drive\\\\\\&amp;#039;s file system, you can also increase or decrease the size of a partition. The download comes as an ISO file, so you\\\\\\&amp;#039;ll need a program that can burn ISO files to disc. If you don\\\\\\&amp;#039;t have one, check out our next download.\n\nGizmo Drive 2.5.11\nWhile the latest version of this program adds the ability to burn ISO files to disc, it\\\\\\&amp;#039;s best known for its ability to mount drive images (like ISO, VSD, and BIN formats) as virtual devices, which will appear in Windows Explorer like a physical drive. This will come in handy, performance-wise, if you otherwise have to run apps from an optical drive. You can even encrypt drive images with Gizmo Drive.\n\nProductivity Boosters\n\nNow that you\\\\\\&amp;#039;ve reenergized your PC with the other downloads, here are a handful of apps that will make your daily computing life more efficient.\n\nPDF SpeedUp 1.32\nPDF files are a great way to send documents to anyone on the Internet, but Adobe has created a bit of a monster with its browser-crashing Acrobat Reader software. PDF SpeedUp eliminates some of the annoying bottlenecks that can stop your Web browsing dead in its tracks, letting you decide which Acrobat plug-ins should be enabled and allowing you to switch off the relentless updater function. You can even stop Acrobat Reader altogether from integrating with your browser.\n\nDesktop Sidebar 1.1.3\nOne of Windows Vista\\\\\\&amp;#039;s coolest features is Sidebar, to which you can affix mini-apps (or Gadgets, in Microsoft-speak) such as a clock, an RSS-feed reader, or stock tickers. If you\\\\\\&amp;#039;re still using Windows XP (or Windows 2000), you can download Desktop Sidebar and enjoy many of the same features offered by the Vista version. Always visible on your desktop, this utility can display task lists, weather forecasts, a calendar, and even a shortcut to Skype\\\\\\&amp;#039;s Internet phone service.\n\nScreenHunter 5 Free\nThis app takes the pain out of grabbing screen captures, making it simple to determine which area of the screen you want to capture, then saving it to BMP or JPG format. It also gives you a choice of two different hotkey options, so screen grabs are just one button away.","torrent":{"xt":"urn:btih:642e3ee66c32ca296b39674089fe80845cff27cf","amp;dn":"free","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"642e3ee66c32ca296b39674089fe80845cff27cf","infoHashBuffer":{"type":"Buffer","data":[100,46,62,230,108,50,202,41,107,57,103,64,137,254,128,132,92,255,39,207]},"announce":[],"urlList":[]}}