{"title":"Samurai.Warriors.2-RELOADED ","uid":4264186,"size":3534678019,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:64811b04aae0fb938e082cf13d43a0f544db3d6f&amp;dn=Samurai.Warriors.2-RELOADED+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hpttpe","files":73,"time":1214607381,"description":"For anyone who thought attacks couldnt get much more devastating or more spectacular than the fully charged Musou think again! Samurai Warriors 2 now gives you the chance to max out your Musou gauge not once, not twice but three times. This adds an exciting new element of strategy as players can choose between saving up their Musou potential until the awesome power of a three bar attack has been reached or using what you have at the time to get yourself out of a sticky situation. Its now up to the player whether they can resist the urge to unleash their Musou for a quick explosion of power and wait for the ultimate in devastating battlefield power and pyrotechnics. Extra spice has been added to the massed battles with the addition of a greater variety of enemy forces. Visually the troops will present a much more diverse spectacle so that different soldiers can be easily recognized and react with a multitude of additional animations. These more varied enemies will also offer greater diversity in attack with different squads preferring to attack in their own particular style making encounters far less predictable. Levelling up has always been a big part of the Samurai Warriors experience but not until now have players been able to level up within a particular level. No longer will you have to wait until a mission has been completed to benefit from your characters newly acquired abilities. Now you can witness the benefits immediately and unleash your new abilities without any pause in the action. However, it is not only through your combat abilities on the battlefield that you will be rewarded with an even stronger, more able warrior. You now have greater choice in just how you boost your characters skills by also being able to level up by stealing from enemy officers under specific conditions and purchasing abilities with any gold youve managed to accumulate. A brand new mode called Sugoroku is added to the usual array of play modes and challenges in the shape of a traditional board game. Except this board game isnt just about rolling dice and moving pieces from square to square. Every single place on the board hides a specific challenge or battle that players will have to engage in in order to take control of that particular square. Up to four players can take part in this mode and it should provide a lengthy challenge as it combines elements of everything from within Samurai Warriors 2 all wrapped up within one totally unique board game experience. Features: ~~~~~~~~~ - 26 playable characters in all! 10 new warriors are ready for battle including the legendary Musashi Miyamoto, the unifier of Japan Ieyasu Tokugawa, and the enigmatic ninja Kotaro Fuma. - Brand new fighting techniques for each warrior add much more depth to the battles. Set traps, summon ninja decoys, and more! - For the first time players have the ability to power up their Musou gauge up to three times for some truly spectacular and awesomely powerful attacks! - Now castle warfare blends seamlessly with field combat. Take control of castles on the battlefield to gain a significant morale advantage. - Experience new tales in Story, Free, and Survival modes. Team up with friends for two-player Co-op play or compete with them at Sugoroku, a bonus party game for up to four players. - Over 70 cinematic sequences supervised by Shinsuke Sato, director of the cult hit, The Princess Blade and new music from fusion artist Minoru Mukaiya. ","torrent":{"xt":"urn:btih:64811b04aae0fb938e082cf13d43a0f544db3d6f","amp;dn":"Samurai.Warriors.2-RELOADED+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64811b04aae0fb938e082cf13d43a0f544db3d6f","infoHashBuffer":{"type":"Buffer","data":[100,129,27,4,170,224,251,147,142,8,44,241,61,67,160,245,68,219,61,111]},"announce":[],"urlList":[]}}