{"title":"EyeTV v3.01","uid":4156756,"size":67004596,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:64839002fe566b78807ff22bf17bc9623a65b798&amp;dn=EyeTV+v3.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tdurden1000","files":3,"time":1209183338,"description":"Turn your Mac into the coolest television in the house. Pause the TV show while you get a snack. Rewind and watch that great play again. Fast forward past the advertisements. Float the EyeTV window on top of other applications to keep an eye on your show while you work or surf the Web, and watch two TV windows Picture-in-Picture.\n\nSit at your desk and navigate with a mouse, or stretch out on the couch with an EyeTV or an Apple Remote. EyeTV?s gorgeous On Screen menu makes it easy to channel surf and move through the Program Guide and menus in the comfort of your living room.\n\nEyeTV puts detailed and up-to-date TV listings at your fingertips, ready to view and search using multiple search criteria and full text search terms. EyeTV?s integrated Program Guide harvests the TV listing data contained in over-the-air digital broadcasts as well as online sources such as TitanTV in the USA.\n\nEyeTV provides detailed information about each television channel. Drag and drop the ones you watch most frequently into a ?favorites? list, or go a step further and organize your sports, news, movie channels and more into their own lists. Each list of channels comes complete with matching Program Guide information. \n\nIf you travel frequently, you can save your channel list configuration for each location and easily switch between them with a click. No more re-auto tuning, renaming, or sorting channels after you?ve used your tuner in a different place.","torrent":{"xt":"urn:btih:64839002fe566b78807ff22bf17bc9623a65b798","amp;dn":"EyeTV+v3.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64839002fe566b78807ff22bf17bc9623a65b798","infoHashBuffer":{"type":"Buffer","data":[100,131,144,2,254,86,107,120,128,127,242,43,241,123,201,98,58,101,183,152]},"announce":[],"urlList":[]}}