{"title":"Access Lock 3.2","uid":4154522,"size":1303149,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:65cf18dc3065c0c0ac91394b3e804ef181a48aa3&amp;dn=Access+Lock+3.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Crazy.Sexy.Dirty.Money","files":9,"time":1209090967,"description":"Access Lock is an easy to use security utility which can help you secure your desktop when you are away from your computer. Just configure the program, define a password and double click the Access Lock system-tray icon every time you need to disable and hide your desktop. While it is locked, the system keys and taskbar are disabled and the mouse cursor is trapped, unauthorized password entries are met with an audio alert and logged to disk.\n\nThe only thing is available in this mode is a pop-up password-entry dialog with an input area for the password that restores your desktop to working condition. Access Lock enables you to lock your PC by two methods. The first one hides your desktop and shows a screen saver while the second one does not hide it allowing others to watch what happens there that is very useful when you would like to demonstrate something to people but do not want them to play with it. Access Lock also prevents unauthorized access on boot and allows people around to leave messages while the system is locked. You will find the program interface very easy to negotiate. Excellent online help is available.\n\n","torrent":{"xt":"urn:btih:65cf18dc3065c0c0ac91394b3e804ef181a48aa3","amp;dn":"Access+Lock+3.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65cf18dc3065c0c0ac91394b3e804ef181a48aa3","infoHashBuffer":{"type":"Buffer","data":[101,207,24,220,48,101,192,192,172,145,57,75,62,128,78,241,129,164,138,163]},"announce":[],"urlList":[]}}