{"title":"Coast to Coast Radio Program! Commercial Free! Feb 24th thru Mar","uid":4061000,"size":438760437,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:666bd46419bf5ed1163f845db58f0d4046ef31d7&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+24th+thru+Mar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":40,"time":1204598454,"description":"Here are eight more broadcasts of the ever-expanding C2C! Download, SEED, and Enjoy! Thanks in advance to all the seeders and those who upload these to the multiple torrent sites out there. I, as well as many others, really appreciate it. Stokeman Out...... Until next week my friends! \n\nSunday February 24th, 2008\nBlack Ops Patches and Torture Taxis\nArtist, writer, and experimental geographer Trevor Paglen joined host George Knapp (email) to discuss his research into black ops programs and CIA-sponsored ?Torture Taxis.? He noted the symbology of patches associated with military black ops programs... \nHost: George Knapp\nGuest(s): Trevor Paglen, Tim Crawford\n\nMonday February 25th, 2008\nThe Human Brain\nNeuroscientist Dr. Sam Wang discussed the human brain and how it&amp;#039;s wired to experience various phenomena. Made of 3 lbs. of tissue with 100 billion neurons, the brain acts as an information processing device and filter. The truth is, we use all parts... \nHost: George Noory\nGuest(s): Dr. Sam Wang, Dr. Roy Spencer\n\nTuesday February 26th, 2008\nRFID &amp; Chip Implants\nConsumer privacy advocate Katherine Albrecht presented an update on RFID and chip implants. Around 300 people have voluntarily had an RFID chip implanted in them, but they could be at an increased risk for cancer, she said. Studies of animals who&amp;#039;ve...\nHost: George Noory\nGuest(s): Gary Ridenour, Katherine Albrecht\n\nWednesday February 27th, 2008\nNoah&amp;#039;s Ark &amp; Creationism\nAuthor and researcher Walt Brown discussed Noah&amp;#039;s Ark, the Great Flood and the debate between creationism and evolution. The Ark might be found surrounded by permanent icecap at 14,000 ft. elevation. Mount Ararat in Turkey or the Zagros Mountains in... \nHost: George Noory\nGuest(s): Dr. Walt Brown, Robert Reed, Christian Wilde\n\nThursday February 28th, 2008\nWorld at Break Point\nAuthor Steve Quayle discussed flash points of increasing tension around the world, including military unrest, financial meltdowns, and UFO activity. A recent fireball in the Pacific Northwest wasn&amp;#039;t actually a meteor-- it was a UFO being shot down by... \nHost: George Noory\nGuest(s): Steve Quayle, Phyllis Curott\n\nFriday February 29th, 2008\n&amp;#039;Leap Year&amp;#039; Open Lines\nDuring Open Lines, George asked for callers to share their most embarrassing moments as well as offered a &amp;#039;Leap Year&amp;#039; hotline for people who were born on February 29th. In the last half hour, George played a classic excerpt from one of Art Bell&amp;#039;s... \nHost: George Noory\nGuest(s): Open Lines, David Flynn\n\nSaturday March 1st, 2008\nNeo-Darwinism &amp; Academic Suppression\nFilm Producer of Expelled: No Intelligence Allowed (view movie trailers), Mark Mathis discussed his research into how the academic world treats university scientists, professors, and researchers who question the theory of Neo-Darwinism. According...\nHost: Ian Punnett\nGuest(s): Mark Mathis, William E. Marks\n\nSunday March 2nd, 2008\nPre-Death Encounters\nKnown for his compassionate care of hundreds of terminally-ill patients, Dr. John Lerma presented his research into hospice patients&amp;#039; pre-death experiences. Such patients shared similarities in their experiences, typically seeing a &quot;light entity&quot; or... \nHost: George Noory\nGuest(s): Dr. John Lerma, Whitley Strieber, Jerome Corsi","torrent":{"xt":"urn:btih:666bd46419bf5ed1163f845db58f0d4046ef31d7","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+24th+thru+Mar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"666bd46419bf5ed1163f845db58f0d4046ef31d7","infoHashBuffer":{"type":"Buffer","data":[102,107,212,100,25,191,94,209,22,63,132,93,181,143,13,64,70,239,49,215]},"announce":[],"urlList":[]}}