{"title":"Vampire The Masquerade Bloodlines HOODLUM [Reseed]","uid":3268403,"size":2394543602,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:66cc96d5f7857d25658ba43972e5afe7a9490b8d&amp;dn=Vampire+The+Masquerade+Bloodlines+HOODLUM+%5BReseed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jibberish","files":7,"time":1103847183,"description":"Vampire: The Masquerade-Bloodlines continues the famous White Wolf\n     gaming tradition in a new role-playing adventure, combining intense\n     first-person shooter combat with an open, non-linear world, rich\n     character development and an immersive storyline. The game plunges\n     you into the dark and gritty vampire underworld of modern day L.A.\n     as a creature of the night, interacting with and battling mortals\n     and other creatures of darkness with an incredible array of vampire\n     powers, skills and traits.\n\n\n     Features:\n\n     * Embrace the darkness as a vampire-Gamers play as a member of one\n       of seven different Vampire Clans, each with their own unique\n       strengths and weaknesses. Utilizing up to 12 different vampire\n       powers including supernatural speed, invisibility, mind control\n       and superhuman strength, embark on quests, earning experience\n       points to build their character and increase powers, skills and\n       traits. Eventually they can rise up through the ranks of Vampire\n       Society and become the most powerful creature of the night.\n       \n     * Next-gen first-person shooter gameplay-Based on Valve's Source\n       Technology, the same game technology used to power Half-Life 2,\n       Vampire: The Masquerade-Bloodlines features fast-action gameplay,\n       detailed graphics, advanced AI and incredible special effects.\n       Gamers take on enemies in intense first-person action combat, with\n       a combination of vampire powers, hand-to-hand combat and an\n       explosive arsenal of weapons including knives, pistols, submachine\n       guns, stake guns, flamethrowers and more.\n     \n     * Immersive RPG adventure-You enter the World of Darkness in L.A.\n       from nightclubs and secret ceremonial caverns downtown to seedy\n       hotels and exclusive mansions on the Hollywood strip - journeying\n       into an open, &amp;quot;living&amp;quot; non-linear world, where every choice may\n       lead to ultimate power or an untimely end. You can choose a path,\n       where each challenge has multiple solutions and each choice has\n       repercussions - help or hurt the denizens of the world while\n       reaping the rewards or suffering the consequences. Replaying the\n       game making different choices, you will find that characters and\n       the environment react differently depending on clans, abilities\n       and the &amp;quot;reputation&amp;quot; developed during the journey.\n       \n     * Online team-based multiplayer-Gamers can go online with friends\n       and join in the ultimate battle of light and darkness. Choosing\n       which team to join, playing as a vampire or as a vampire hunter,\n       with a variety of team-based mission objectives, online combat\n       will always be a unique experience.\n","torrent":{"xt":"urn:btih:66cc96d5f7857d25658ba43972e5afe7a9490b8d","amp;dn":"Vampire+The+Masquerade+Bloodlines+HOODLUM+%5BReseed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66cc96d5f7857d25658ba43972e5afe7a9490b8d","infoHashBuffer":{"type":"Buffer","data":[102,204,150,213,247,133,125,37,101,139,164,57,114,229,175,231,169,73,11,141]},"announce":[],"urlList":[]}}