{"title":"Curse Of The Golden Flower","uid":4021673,"size":685189583,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:670727b7d058156d9b24eb7a05006a6f0b4c0358&amp;dn=Curse+Of+The+Golden+Flower&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pcconsultant2007","files":2,"time":1202689633,"description":"Actors: Yun-Fat Chow, Li Gong, Jay Chou, Ye Liu, Dahong Ni \nDirectors: Yimou Zhang \nFormat: AC-3, Closed-captioned, Color, Dolby, Dubbed, DVD-Video, Subtitled, Widescreen, NTSC \nLanguage: Chinese \nSubtitles: English, French \nRegion: Region 1 encoding (US and Canada only)\nPLEASE NOTE: Some Region 1 DVDs may contain Regional Coding Enhancement (RCE). Some, but not all, of our international customers have had problems playing these enhanced discs on what are called &quot;region-free&quot; DVD players. For more information on RCE, click here. \nAspect Ratio: 2.35:1 \nNumber of discs: 1 \nRating:  \nStudio: Sony Pictures \nDVD Release Date: March 27, 2007 \nRun Time: 114 minutes \n\n`Curse of the Golden Flower&amp;#039; released in `07 is a strange, confusing mixture of genres that leaves one to wonder what was the original intent behind making this film. Is it a period piece, an exotic romance, a tale of political intrigue, an opulent soap opera, or a violent and bloody martial arts epic? Well, it&amp;#039;s all of the above and I guess that&amp;#039;s ok if the formula works. Unfortunately for the majority of the film it doesn&amp;#039;t. \n\nThe movie begins slowly with the Emperor and his royal family doing partaking in long sequences of introductions and posturing. The English subtitles are stiff and lacks substance, too bad I don&amp;#039;t speak Chinese. The film does gain some momentum midway through but then a lot of what it gains is lost in an endless torrent of blood and death at the end. As for the overall message of the film, I would surmise it&amp;#039;s something much like that of `Hero.&amp;#039; The Emperor is always right no matter how wrong he really is. \n\nWhile `Curse of the Golden Flower&amp;#039; does supply the magnificent visuals we&amp;#039;ve come to expect from Chinese epics in recent years the film lacks the artistic style and poetic depth of such classics as `Hero&amp;#039; and the romantic, emotional impact of `Crouching Tiger, Hidden Dragon.&amp;#039; \n\nAnother area where this film falls short of expectations is the dismal soundtrack that is reminiscent of a never-ending funeral dirge. It&amp;#039;s slow, monotonous, boring and pompous. Definitely not something you would listen to on its own. \n\nOn a positive note, the cast is excellent with such well known stars as Chow Yun-Fat and Gong Li and lesser known but fine performances by Chou Jay, Liu Ye and the very lovely Li Man as Chan. \n\nIf you watch it just for the visuals you won&amp;#039;t be disappointed\n\n\nNOTE - For anyone thinking that my torrents are FAKE, please find a life or something else to do besides disrupt someones torrent. \nMy uploads are of good quality, either from Rips, R5 sources or Screeners, \nunless otherwise specified. They DO NOT contain viruses, scams or any other \nnegative information. For someone who has NO uploads of his own to offer anyone, \nyou sure do have alot to say... GO FIGURE...!!! ","torrent":{"xt":"urn:btih:670727b7d058156d9b24eb7a05006a6f0b4c0358","amp;dn":"Curse+Of+The+Golden+Flower","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"670727b7d058156d9b24eb7a05006a6f0b4c0358","infoHashBuffer":{"type":"Buffer","data":[103,7,39,183,208,88,21,109,155,36,235,122,5,0,106,111,11,76,3,88]},"announce":[],"urlList":[]}}