{"title":"PART 2 - Gene Scott - Lectures Removed From Website","uid":4032140,"size":2163984574,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:671792a9ae0358b192d069d513c3604052d585aa&amp;dn=PART+2+-+Gene+Scott+-+Lectures+Removed+From+Website&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ektakrome","files":269,"time":1203223789,"description":"---------------------------------------------------------------\nPART 2 - Gene Scott - Lectures Removed From Website\n---------------------------------------------------------------\n\nThis collection includes the following subject areas:\n\n* Church History\n* Lost Ten Tribes\n* Mean Gene Review\n* Prophecy\n* Spiritual Warfare\n* More from the MYSTERIES subjects (Atlantis, Demonology,\nPyramid, More Mysteries, Stars, UFOs) which were originally\navailable on Dr. Scott's website but were missing from the\noriginal part one torrent collection entitled\n&quot;Gene Scott - Lectures Removed From His Website&quot;.\n\nPlease note that that the talks which were available on Dr. Scott's website are only a small portion of the total material that was once available from him on these subjects.  There are -- or at least WERE -- many many more talks by Dr. Scott available ONLY in albums consisting of 12 cassette tapes each.  These were not on the website, and are therefore not part of this collection.  As rare copies of these tape albums surface, however, thoughtful people will cause them to be digitized and made available for free on the internet.  \n\nThis is a difficult task, however, because the cassette tapes are no longer available from the church and now command exorbitant prices when they are offered for sale used on eBay.   Hopefully, as time goes on, we will be able to obtain more of these and make them available on the internet as well.   This is expensive and laborious work!  If you have tape albums by Gene Scott which are not already available for free MP3 download, please do your part and cause them to be made so available by whatever means are at your disposal.   These are extremely rare recordings and are in danger of extinction.\n\nWHY? \n\nBefore Gene Scott died, many of his lectures were freely available at \nhis website DrGeneScott.com.  Immediately after his death, however,\nhis wife Melissa took over all the operations of the church and removed all\nrecordings of Gene Scott's lectures from public availability.    Not only the \nfree online lectures were removed, but Melissa also ordered all of the thousands\nof cassette tape recordings of Dr. Scott's teachings to be permanently removed\nfrom circulation so that no one would ever hear them again.\n\nGene Scott himself warned that once he died, those who took over the church\nwould destroy his entire life work.  This was because his teachings frequently went into territory far beyond what one would normally expect from an ostensibly &quot;Christian&quot; preacher.  Indeed, he spent much time educating his listeners on subjects which were highly politically sensitive even to this day, and he knew that only he himself could guarantee the continued availability of his teachings.\n\nHis prophecy has unfortunately been fulfilled.\n\nNow if you go to his church, all you will see will be his wife Melissa prancing around on stage in front of a huge American flag which spans the entire back wall.  That is, if you can get in the door at all.   The church is guarded by a virtual army of private security goons masquerading as &quot;ushers,&quot; wearing three-piece suits and ear-phone communication systems.   This has all the earmarkings of a government-sponsored cult operation, working as expected to mind-control its followers and destroy the truth.  \n\nFortunately, before Dr. Scott's free lectures were removed from the website, someone able to see the handwriting on the wall was able to download and save many of them.  The original RealAudio files have been converted to MP3 for maximum portability and convenience to the listener. \n\nThere were a few lectures on the website, however, that did not download correctly and so are not preserved here.   \n\nMelissa Scott is ABUSING her ownership of the copyright to this material as a means to DESTROY AND ERASE the life work of Dr. Gene Scott from the face of the Earth.  We feel that Dr. Scott did not produce his lifetime of work simply so that his former porn-producer wife Melissa aka &quot;Barbie Bridges&quot; could shut it all down the moment he passed on, in order to appease her handlers.  Dr. Scott's work rightfully belongs to the world now, and so we are making it available to everyone free of charge.  \n\n","torrent":{"xt":"urn:btih:671792a9ae0358b192d069d513c3604052d585aa","amp;dn":"PART+2+-+Gene+Scott+-+Lectures+Removed+From+Website","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"671792a9ae0358b192d069d513c3604052d585aa","infoHashBuffer":{"type":"Buffer","data":[103,23,146,169,174,3,88,177,146,208,105,213,19,195,96,64,82,213,133,170]},"announce":[],"urlList":[]}}