{"title":"An Inconvenient Truth tt0497116 (Eng) 2006 (No PassWord) .avi","uid":4044475,"size":2432401236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67e793adf7f126921ef6f36a831af571c21cc518&amp;dn=An+Inconvenient+Truth+tt0497116+%28Eng%29+2006+%28No+PassWord%29+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DougRH","files":2,"time":1203842104,"description":"An Inconvenient Truth tt0497116 (Eng) 2006 (No PassWord).avi\n\nIMDb.Com ID  tt0497116\thttp://www.imdb.com/title/tt0497116/\n\nDirector:\tDavis Guggenheim\n\nFormer USA Presidential candidate Al Gore received a Nobel Peace Prize and two Academy/Oscar awards as well as numerous other awards for this outstanding and much needed documentary movie for raising the consciousness and awareness of both the general public and politicians world wide. A comprehensive and wide ranging overview of the trends, scientific facts and details, dangers and urgency of Global Warming. \n\n                Waiting for the APOCOLYPSE&amp;#039; to happen?\n\n                      It is ALREADY UPON US !! \n\n     Humanity has OVER POPULATED and POISENED OUR HOME and OUR PLANET !!! \n\nFailure to reverse these trends IMMEDIATELY will result in a Global Extinction Level Event (ELE) in the VERY NEAR FUTURE that will make the period that the dinosaurs died off look like the Garden of Eden!   \n\nIn fact the effects are already happening and have already taken a significant toll:\n\nThousands of species have disappeared from our plant already in the last century. \n\nSome low lying oceanic island countries have already been largely destroyed by the rising sea levels and the majority of their population has been displaced.\n\nOf the millions of Manmade chemicals that are registered with the American Chemical Society that never existed in nature before, only 1% of them have been tested. Those that have been are generally tested in isolation and not when they are out in the open environment amongst the millions of other (Bio)Chemicals in the world to interact and react with. Is it any wonder we are experiencing dramatic increases in cancer, diseases, endocrine &amp; hormone disruption &amp; imbalances and genetic damage ? \n\nWE NEED to ACT NOW to SAVE or Home and Our Planet if we want to continue to survive and exsist !!!!! \n\nWe need to find and effect [global] economic models that are NOT based on consumerism and continuous growth in order to be considered, and are, healthy.  \n             It is NOT sustainable as it currently exists!!\n\n\nSincerely,\n    DougRH\n","torrent":{"xt":"urn:btih:67e793adf7f126921ef6f36a831af571c21cc518","amp;dn":"An+Inconvenient+Truth+tt0497116+%28Eng%29+2006+%28No+PassWord%29+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e793adf7f126921ef6f36a831af571c21cc518","infoHashBuffer":{"type":"Buffer","data":[103,231,147,173,247,241,38,146,30,246,243,106,131,26,245,113,194,28,197,24]},"announce":[],"urlList":[]}}