{"title":"The Sensational Alex Harvey Band - Live at the Cleveland Agora (","uid":4099154,"size":511127835,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:67f07a980348d7b995e8a7e6d3608db16b85f2d7&amp;dn=The+Sensational+Alex+Harvey+Band+-+Live+at+the+Cleveland+Agora+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Harveydk","files":36,"time":1206482808,"description":"The Sensational Alex Harvey Band - Live at the Cleveland Agora (1974)\n\nStill missing:\n\nThe Sensational Alex Harvey Band - British Tour 1976 (PLEASE HELP)\nThe Sensational Alex Harvey Band - Live on the Test-1995 (PLEASE HELP)\nThe Sensational Alex Harvey Band - US Tour 1974 (PLEASE HELP)\nAlex Harvey - Ice Cold-2002 or Ray Russell and Alex Harvey - Rock Workshop-1970 (PLEASE HELP)\nAlex Harvey - Roman Wall Blues-1969 (PLEASE HELP)\nAlex Harvey - Soldier On The Wall-1982 (PLEASE HELP)\nAlex Harvey - Teenage A Go Go-2003 or Unreleased Acetates (PLEASE HELP)\nAlex Harvey - The Blues-1964 (PLEASE HELP)\nAlex Harvey - The Mafia Stole My Guitar-1979 (PLEASE HELP)\nAlex Harvey Presents The Loch Ness Monster-1977 (PLEASE HELP)\nAlex Harvey&amp;#039;s Soul Band -1964 (PLEASE HELP)\nHair Rave Up - 1969 (PLEASE HELP)\nTear Gas - Piggy Go Getter-1970 (PLEASE HELP)\nTear Gas-1971 (PLEASE HELP)\n\nAlex Harvey (February 5 1935 - February 4 1982) was a Scottish rock and roll recording artist. With his Sensational Alex Harvey Band, he built a strong reputation as a live performer during the 1970s glam rock era. The band was renowned for its eclecticism and energetic live performance, Harvey for his charismatic persona and daredevil stage antics.\nAlex&amp;#039;s younger brother Leslie Harvey was also a musician and became guitarist for Glasgow band Stone the Crows.\n\nEarly life\nHarvey was born at 49 Govan Road, Kinning Park, Glasgow. His musical roots were in Dixieland jazz and skiffle music, which enjoyed considerable popularity in England and Scotland during the late 1950s. During this period, he won a competition that sought &quot;Scotland&amp;#039;s answer to Tommy Steele&quot;.Alex Harvey was literally the &quot;last of the teenage idols,&quot; a distinction he made much of during his subsequent career - practically worshipped by his fans.\nIn 1959, Harvey formed &quot;Alex Harvey&amp;#039;s Soul Band&quot; and recorded blues and rock and roll material, to modest success. In 1966, Harvey found more success as a member of the cast in the London stage production of the musical Hair. In 1970 he formed Rock Workshop with Ray Russell [1]; their first, self-titled album contained an early version of &quot;Hole In Her Stocking&quot;, later to appear on &quot;Framed&quot;.\n\nSAHB\nIn 1972, Harvey formed the Sensational Alex Harvey Band with guitarist Zal Cleminson, bassist Chris Glen, and cousins Ted and Hugh McKenna on drums and keyboards respectively, all previous members of progressive rock act &quot;Tear Gas&quot;.\nThe Sensational Alex Harvey Band (often shortened to SAHB) produced a succession of highly regarded albums and tours throughout the 1970s, and would give Harvey his greatest successes, both musically and commercially.\nInitially considered a part of the burgeoning glam-rock movement, Harvey&amp;#039;s wild imagination and unusual skiffle background led the band to explore an extremely diverse range of topics and styles in the course of their career, from film-noir &quot;The Man In The Jar&quot; to surf music-tinted tales of shark attacks &quot;Shark&amp;#039;s Teeth&quot;) to ominous odes to demented faith healers (&quot;The Faith Healer&quot;) and epic symphonies about witchcraft (&quot;Isobel Gowdie&quot;).\nPerhaps most unusual for the time were the band&amp;#039;s forays into Broadway, evidenced on tracks such as &quot;Tomorrow Belongs To Me&quot;, which is of course from Cabaret by Kander and Ebb. Other musical styles explored included the folk music of both Harvey&amp;#039;s native Scotland &quot;Anthem&quot; and countries such as Turkey &quot;Action Strasse&quot;.\nThe impression is one of an unhinged circus of free-flowing events and emotions and moods, Harvey as its semi-demented, ironic ring master,something captured brilliantly by the cover art of 1974 album&quot;The Impossible Dream&quot;.\nA strong sense of irony permeates much of the band&amp;#039;s work, however Harvey often juxtaposed his absurdist imagery and wild-eyed imagination with sincere moral messages and affectionate unashamed sentiment and emotion.\nHis live act also usually featured a tale of &quot;Vambo&quot;, an urban superhero who was the subject of some of his more energetic numbers. His performances combined a musical and verbal flair with both humour and sincerity and his songs often contained messages and morals.\nThe Sensational Alex Harvey Band scored chart hits in Britain with the single &quot;Delilah&quot;, a re-make of the Tom Jones hit, and also with &quot;The Boston Tea Party&quot;.\nOn February 4 1982 while waiting to take a ferry back to shore after performing his last concert with his new band, the Electric Cowboys, Harvey suffered a massive heart attack. In an ambulance on the way to the hospital, he suffered a second heart attack, this one fatal. It occurred on the day before his 47th birthday, in Zeebrugge, Belgium.\n","torrent":{"xt":"urn:btih:67f07a980348d7b995e8a7e6d3608db16b85f2d7","amp;dn":"The+Sensational+Alex+Harvey+Band+-+Live+at+the+Cleveland+Agora+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67f07a980348d7b995e8a7e6d3608db16b85f2d7","infoHashBuffer":{"type":"Buffer","data":[103,240,122,152,3,72,215,185,149,232,167,230,211,96,141,177,107,133,242,215]},"announce":[],"urlList":[]}}