{"title":"FM08 Megaayer Picture Pack June 08 Update","uid":4257460,"size":746824677,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6a28e20ff1d00e189d7e59744ad5477e3d88f40d&amp;dn=FM08+Megaayer+Picture+Pack+June+08+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moskollo","files":1,"time":1214314122,"description":"Huge player picture pack for FM08, which should work on older versions of FM. Well, this is for your SERIOUS FM08 addict. It&amp;#039;s my own player picture file, it is a work in progress, I&amp;#039;ve been trying to get rid of the dupes by creating one HUGE player folder working off one config file with player ids. The file is upto over 16,074 &amp;#039;normal size&amp;#039; images for the game, I&amp;#039;ve also been working on a &amp;#039;small size&amp;#039; pictures file as well, this is now upto 4,805 images this too is included.\n\nAs on my other downloads I must make clear, I am not a photographer and have not taken these images. What I have done is put all these images in one place. I have tracked down pictures of the remote players from the 70s and 80s like Viv Anderson or Luther Blissett. I hate seeing the default picture so where I have been able to I&amp;#039;ve found images of the player/coach, Gary Bannister, Colin Pates, Joe McLaughlin, people kids today won&amp;#039;t have heard of now, but were heroes in their time. Tottenham were still shit, even then.\n\nI sorted most of them last year so many of the coaches are unfortunately generally 90 x 90 in size, the more recent players thanks to people who have created them are in the new FM08 style. Any images in the new style were not created by me, so thanks for letting me include them in the pack, you know who you are I presume. \n\nI have also been gradually been trying to get the &amp;#039;regens&amp;#039; working by giving them id numbers relevant to FM08. There are over 1,000 working regens in here.\n\nOnce downloaded, you need to extract this folder using winrar. Once open put the folder into your Sports Interactive/data folder on your C drive and then install your graphics a couple of times.\n\nAs with my other downloads, people now know the Moskollo name and will claim this is a bogus or virus&amp;#039; file. Please don&amp;#039;t give them the satisfaction of scaring you off, I believe in torrent, I love the idea of free films and music for everyone, long may it continue. I&amp;#039;m doing this to try to put something back in, if people can improve their gameplay through downloading this file then that&amp;#039;s why I&amp;#039;m doing it. We live in a selfish world, and I&amp;#039;ve reached the point in my life where I want to try and put something back in, it&amp;#039;s not a big thing but fuck it, if one person likes this download then job done. So, please feel free Mr SI Graphics Forum to nay say my download, if you believe them and there one line of bullshit you stand to lose out, would I write all of this just to put a dodgy torrent out there? It&amp;#039;s easy to write &amp;#039;it&amp;#039;s shit&amp;#039; or &amp;#039;it&amp;#039;s bogus&amp;#039; so believe who you will.\n\nIf you like this I have others on the Pirate Bay for FM08 Backgrounds and an updated database to 24/6/08 so why not try them if you like this...\n\n\nPeace\n\n\nMoskollo\n","torrent":{"xt":"urn:btih:6a28e20ff1d00e189d7e59744ad5477e3d88f40d","amp;dn":"FM08+Megaayer+Picture+Pack+June+08+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a28e20ff1d00e189d7e59744ad5477e3d88f40d","infoHashBuffer":{"type":"Buffer","data":[106,40,226,15,241,208,14,24,157,126,89,116,74,213,71,126,61,136,244,13]},"announce":[],"urlList":[]}}