{"title":"Pandora Battery PSP","uid":4032516,"size":143395548,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:6b866440d1eaeb7654fd989bdc9cde5c9812cfff&amp;dn=Pandora+Battery+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"H4x0RH4M57ER","files":1,"time":1203248368,"description":"\nThis version installs 3.80 M33-5 in the Universal Unbricker menu - other menus \nworks like the original Xi-Bit version of Multi Pandora.\n______________________________________________________________________________\n\n\n\nWelcome to Xi-Bits NewbiInstaller for pandora!\n\nThis version is in:\nDansih\nEnglish\nSpanish (Translation by Babelfish, so it&amp;#039;s not perfect)\n\nThere may be some minor glitches. Please tell me about them!\n\nps2dev.org (Xi-Bit)\n______________________________________________________________________________\n\nInstructions!\n-------------\n\nRun START.exe\nFollow the instructions!\nThat&amp;#039;s simple!\n_______________________________________________________________________________\n\nFat Pandora: (Option 1)\n-----------------------\n\n- Insert Memory Stick into the PSP\n- Remove power cord and insert the JigKick Battery into the PSP.\n- A menu appears when the PSP boots. Follow the onscreen information\n  and instructions.\n\n\n_______________________________________________________________________________\n\nFAT ext complete: (Option 2)\n----------------------------\n\n* Access to the real flash in general:\nIf you run a custom app, or a CFW installer, from this menu, after your application (or the installer) has started, wait a few seconds before actually using it and letting it access the flash!\nThis is because the flash emulation is disabled with a slight delay to give the starting app the chance to load additional modules from the (emulated) firmware before the emulation gets disabled and the app would no longer be able to load modules (since they might no longer be available).\n\n* Custom application to be started with access to the real flash0:/ (and flash1:/ and all the others)\nDefault path for EBOOT to launch is:\n&lt;yourmemstick&gt;:/PSP/GAME/MAINT/EBOOT.PBP\nThe path can be configured, by pressing O or [] while the option is selected. O will let you choose any program from /PSP/GAME and [] will let you choose from /PSP/GAME150.\nThis application can then be started with the &quot;Launch app with flash0:/ access&quot; option from the menu.\nA few seconds after your app has been started you are then be able to access the flash of your PSP using this program.\nVery usefull to perform file operations with tools like PSPFiler from a Pandora boot.\n\n* CFW installer\nDefault path for EBOOT to launch is:\n&lt;yourmemstick&gt;:/PSP/GAME/CFWUPDATE/EBOOT.PBP\nThe path can be configured, by pressing O or [] while the option is selected. O will let you choose any program from /PSP/GAME and [] will let you choose from /PSP/GAME150.\nThis menu lets you start a CFW installer (OE or M33 or whatever) also with flash emulation disabled, so the install WORKS.\nNo need anymore to downgrade to 1.50 first, and then run the CFW installer from there.\nLike with the app above, give the PSP a few seconds before starting the installation to let the flash emulation get propperly disabled.\n\nTA-082/086 NOTE:\n-------------------\nTA-082/086 users that never downgraded their PSP before:\nYou DO NOT NEED to downgrade with the original Pandora function and you DO NOT NEED to patch your idstorage since this will install a 1.50 compatible IPL that also runns fine on TA-082/86! (All credits for this, and I mean 100% all, go to &quot;moonlight&quot; at the PS2DEV forums!!! I only implemented/copied it into my code.)\n\n\n_______________________________________________________________________________\n\nSlim Pandora for FW 3.60: (Option 3)\n------------------------------------\n\nInsert the pandora battery and the memory stick in the psp slim. It will boot. You won&amp;#039;t see\nanything on the screen, because that kernel doesn&amp;#039;t support the slim screen, but it is OK, you\ndon&amp;#039;t need a screen for the installation of 3.60 M33.\n\nFrom here, you have 3 options:\n\n- Press X to install M33. The process will last just few seconds, since the installer only\nneeds to install the M33 custom prx&amp;#039;s and IPL. After the process is finished, the installer\nwill shutdown the psp automatically.\n\n- Press L+R+triangle to uninstall M33 and go back to original 3.60. Note: this can&amp;#039;t unbrick a\npsp slim, it will just remove M33 ipl. There is currently no unbricker for the psp slim, but\nwe plan on doing one in the future.\nAfter uninstallation, psp will be shutdown automatically.\n\n- Press square to dump the PSP Slim nand. Watch out: you need 66 MB of free space in the\nmemory stick for this, otherwise your memory stick may end corrupted.\n\nThis option uses the team C+D nand dumper. When the memory stick orange led stops blinking,\nthe process will have finished, and you can either shutdown the psp, or use one of the two\nprevious options.\n\n\n_______________________________________________________________________________\n\nUniversal Unbrick: (Option 4)\n-----------------------------\n \n- Press X to install 3.71M33-2. \n \n- Press O to install original 3.71 (rest of the process as the X option)\n \n- Press [] to dump nand to nand-dump.bin. When done, psp will auto shutdown.\n \n- Press L+R+HOME+start to restore nand from nand-dump.bin\n \nThis proccess is very dangerous, and you should *just* use it if it&amp;#039;s your\nlast chance to get it working.\n \nThis is a physical restore process (not a logical one), and will try to make \na 100% exact clon of the dump.\n \nIf you are working with a dump that isn&amp;#039;t yours, you will get either a brick\nor a corrupt idstorage, depending on the firmware.\n \nIf while you are restoring your psp have got any damaged block more than \nwhen you dumped it, you might also get a brick, depending on what block is it.\n \nWorks for both PSP and PSP Slim.\n\n\n_______________________________________________________________________________\n\n\nCREDITS!\n\nTO ALL THE DEV&amp;#039;S THAT MADE THIS POSSIBLE!!! THANK YOU! YOU KNOW WHO YOU ARE!\n\n\nNote:\nIf it&amp;#039;s not okay with you guys, please contact me at ps2dev.org (Xi-Bit)","torrent":{"xt":"urn:btih:6b866440d1eaeb7654fd989bdc9cde5c9812cfff","amp;dn":"Pandora+Battery+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b866440d1eaeb7654fd989bdc9cde5c9812cfff","infoHashBuffer":{"type":"Buffer","data":[107,134,100,64,209,234,235,118,84,253,152,155,220,156,222,92,152,18,207,255]},"announce":[],"urlList":[]}}