{"title":"Massive Software Prime 2.0 Video Tutorials &amp; Files.rar","uid":4036823,"size":742761578,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6bd4233bc285bab5c1e6df1f2c7d97c318fcd413&amp;dn=Massive+Software+Prime+2.0+Video+Tutorials+%26+Files.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BuzzCrackit","files":1,"time":1203467839,"description":"Hey guys,\n\nThis pack was put together for two different groups of people: Those who have Massive, and those who don?t.\n\nMy intention was to have access to the tutorial files at all times, rather than within the online system. This meant that I could carry it round and train on any workstation I wished. I also reduced the size of the video tutorials and repacked them to work within my pipeline using Real player Alternative. The many web pages were also converted to single PDFs for ease of access and use. Finally the tutorial files could be kept separate whilst I worked on each chapter without altering the original files.\n\nFor those who already have Massive, you already have access to all this information - so this pack is for your personal reference - if it is a better or more accessible system, please enjoy it.\n\nFor those who don&amp;#039;t have Massive (yet), I hope this pack will show you the capabilities and ease of use of the software. Some people have been scared off after opening up the program, and others who have only heard of the software have had concerns regarding complicated logic systems. Once you see these tutorials you can more comfortably make your purchases!\n\nIt is a great piece of software and the more people who become familiar with it ? the better and more widespread it will become.\n\nD.\n\n\n[Massive Software 2.0 Prime]","torrent":{"xt":"urn:btih:6bd4233bc285bab5c1e6df1f2c7d97c318fcd413","amp;dn":"Massive+Software+Prime+2.0+Video+Tutorials+%26+Files.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bd4233bc285bab5c1e6df1f2c7d97c318fcd413","infoHashBuffer":{"type":"Buffer","data":[107,212,35,59,194,133,186,181,193,230,223,31,44,125,151,195,24,252,212,19]},"announce":[],"urlList":[]}}