{"title":"Alias: The Complete Third Season","uid":4060050,"size":45207241142,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6c9e63831c6fa4044dce7e636637f015e085d096&amp;dn=Alias%3A+The+Complete+Third+Season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zape","files":130,"time":1204571829,"description":".. \n\nAlias: The Complete Third Season \n\nSynopsis \nGolden Globe Award-winning actress Jennifer Garner (Best Actress In A Television Series, 2002) is Sydney Bristow. SydÃ‚Â´s not exactly your average grad student. Her life might appear normal, but sheÃ‚Â´s hiding a secret life working as a spy for the CIA. SydneyÃ‚Â´s world is turned upside down when she learns she may work for the very enemy she thought she was fighting. Now sheÃ‚Â´s entangled in a covert lifestyle where she is forced to question the allegiances of everyone, including those closest to her. Entertainment Weekly says ALIAS is &quot;a spy-fi roller coaster of killer gadgets, double roundkicks, triple crosses, poignant confessionals, cliff-hangers, sliced-off fingers, conspiracies, outrageous outfits, exotic locales, flirtations, mythologies -- and thatÃ‚Â´s just before the first commercial break.&quot; Now see the 22 mesmerizing episodes that launched it all in this 6-disc set. YouÃ‚Â´ll also experience never-before-seen extras that give you special access inside the world of ALIAS. See the show everyone has been talking about that has redefined series television. This edge-of-your-seat collection with its heart-pounding action of unpredictable plot twists will have you gasping for air and begging for Season 2! \n\nOther features \nInteractive Menus, Scene Access, Audio commentaries, TV Spots, &quot;Creating Characters&quot; lecture at the Museum of Television and Radio, &quot;The Animated Alias: Tribunal&quot;: The Missing Two Years Revealed, &quot;Inside Stunts&quot;, &quot;Burbank in Barcelona&quot;: a featurette on production des, &quot;Alias Close-Up&quot;: Behind-the-scenes, &quot;Monday Night Football&quot;: teaser \n\nDirector J.J. Abrams \nCast Jennifer Garner, Victor Garber, Lena Olin, Merrin Dungey, Carl Lumbly, Ron Rifkin, Michael Vartan, Kevin Weisman, David Anders, Bradley Cooper \nLength \nDistributor The Walt Disney Company \nDiscs 6 \nRegion free\nVideo Pal \n1.78:1 , 16:9 \nLanguages Dolby Digital 5.1: English, French . Dolby Digital 2.0: Spanish \nSubtitles English, Spanish, French, Swedish, Norwegian, Danish, Finnish, Iceland, Dutch, English for deaf people \n\nSaludos \n\n..","torrent":{"xt":"urn:btih:6c9e63831c6fa4044dce7e636637f015e085d096","amp;dn":"Alias%3A+The+Complete+Third+Season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9e63831c6fa4044dce7e636637f015e085d096","infoHashBuffer":{"type":"Buffer","data":[108,158,99,131,28,111,164,4,77,206,126,99,102,55,240,21,224,133,208,150]},"announce":[],"urlList":[]}}