{"title":"The Alex Jones Show, Monday, June 23, 2008 - Jordan Maxwell, Mar","uid":4257159,"size":65519624,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6cd3ef70fcde9a82ff79d7ba490e6929b256201e&amp;dn=The+Alex+Jones+Show%2C+Monday%2C+June+23%2C+2008+-+Jordan+Maxwell%2C+Mar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Femacamper","files":1,"time":1214296760,"description":"Veteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you thought-provoking interviews and takes an in-depth look at the news between the daily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom Italy&amp;#039;s La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing personalities in the world from guerrilla journalists to government officials to whistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any other on the air. Jones is a seasoned investigative journalist who has broken hundreds of national stories during his career. He is an aggressive Constitutionalist who digs deeply into the facts to defend property rights, our nation?s borders, and the Second Amendment while he sends out a rallying call to the American people to resist foreign entanglements and wars for corporate interests. Jones eschews the bogus political labels of ?left and right? and instead focuses on what really matters: what?s right and wrong.\n\nMonday, June 23rd, 2008\n\nAlex discusses the latest revelations by Barry Jennings on WTC 7. Guests include preeminent occult and secret society researcher Jordan Maxwell and activist Mark Dice who received a death threat from neocon talk show host Michael Reagan.\n\nHigh-quality precise commercial cut (Audacity) - 4 hours cut down to 3:02, taken from thepodcast. Ipod-friendly with bookmarking and chapters (Podcast genre tagged), audio compressed (4x), informative mp3 tags (Winamp), and station picture (Mp3tag.\n\nToday&amp;#039;s .mp3 in Windows Media Player 11\n\nGo here if there are no seeds:\n\nOr you can do up your own .mp3s here:\n\nFind the latest daily Alex Jones Show here:\n","torrent":{"xt":"urn:btih:6cd3ef70fcde9a82ff79d7ba490e6929b256201e","amp;dn":"The+Alex+Jones+Show%2C+Monday%2C+June+23%2C+2008+-+Jordan+Maxwell%2C+Mar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cd3ef70fcde9a82ff79d7ba490e6929b256201e","infoHashBuffer":{"type":"Buffer","data":[108,211,239,112,252,222,154,130,255,121,215,186,73,14,105,41,178,86,32,30]},"announce":[],"urlList":[]}}