{"title":"Pitfall.The.Lost.Expedition.USA.XBOX-TcH","uid":4169642,"size":768414532,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:6cdfe12716d274a719066723c24efe3cf7db73e1&amp;dn=Pitfall.The.Lost.Expedition.USA.XBOX-TcH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RoadTrain4eg","files":18,"time":1209786256,"description":"Company: ACTIVISION\nReleased:  Feb 18th 2003\nOrigin:       NTSC/USA\nGenre:      Action/Adventure\n\nAssume the role of Harry, a fearless, rough-and-ready treasure seeker who battles evil using his athletic ability and a knapsack filled with adventure gear. Harry must race against a rival explorer to find hidden treasures, which in the wrong hands could spell doom for him and his friends. The vast landscape, ranging from forests to ancient ruins to subterranean mines, provides countless game options as you face the consequences of your decisions. Cross treacherous jungle terrain and dark areas filled with puzzles, tricks and traps, swing on vines, avoid\ncrocodiles and dodge rolling logs as you unearth artifacts and use your cunning to defeat dangerous foes. Plus, unlock the original Atari 2600 versions of Pitfall and Pitfall 2!\n\n* Get a game within a game - Jump between adventure and puzzle levels with fast-paced transitions inspired by the vine-swinging action of the original game.Once  you&amp;#039;re in a level, branching pathways allow you to choose whatever direction you want to travel. Collecting special items allows you to compete for gold in Native Games. Plus tangle with a host of enemies like snakes, scorpions, spiders, bats\njaguars, piranha, insects, natives, mercenaries, bush ninjas and mega monkeys\n\n* Be the hero who has everything - Use a wide range of tools to get the job done: ascend massive glacial cliffs with your trusty ice axes; keep out of harm&amp;#039;s way with your elevating pogo stick; fight-off foes and activate switches with your powerful sling shot; deter pests and shed light on the situation with your blazing torch; and deflect flame jets with your mighty shield. Direct Control allows you to manipulate\nthe objects you&amp;#039;re holding by using your controller&amp;#039;s analog sticks. As you progress in the game, you&amp;#039;ll gain new abilities that assist you in your quest, including a quick dash option and numerous combat maneuvers. Use simple button combinations to turn any of your regular actions into special heroic feats\n\n* Experience top technology - Total Havok physics technology ensures that objects react to their environment in a realistic manner - vines swing and bridges sway. The advanced Edge engine supports next-generation graphics and Dolby surround sound.","torrent":{"xt":"urn:btih:6cdfe12716d274a719066723c24efe3cf7db73e1","amp;dn":"Pitfall.The.Lost.Expedition.USA.XBOX-TcH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cdfe12716d274a719066723c24efe3cf7db73e1","infoHashBuffer":{"type":"Buffer","data":[108,223,225,39,22,210,116,167,25,6,103,35,194,78,254,60,247,219,115,225]},"announce":[],"urlList":[]}}