{"title":"Rockin' from Coast to Coast","uid":4168593,"size":60850343,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d71f1001a5937a3199c1aab0099b16001f40b1e&amp;dn=Rockin%5C%27+from+Coast+to+Coast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jonah111","files":28,"time":1209739979,"description":"Garage rock wasn&amp;#039;t a concept that originated in the mid-&amp;#039;60s. In the aftermath of the initial rock&amp;#039;n&amp;#039;roll explosion, young rockabilly and RB singers brought their unhoned talents into tiny studios throughout the country. This is a compilation of 26 of those efforts, mostly from the late &amp;#039;50s (mostly from 1958, in fact), and mostly for small independent labels, although some of these were leased to major labels, and a few were even recorded for major labels directly. Only one of these was a chart hit (Freddy Cannon&amp;#039;s &quot;Buzz Buzz A-Diddle-It&quot;), and it&amp;#039;s easy to see why, from two points of view. The approaches were too uncompromisingly raw, and the production too crude. On the other side of that coin, the songs themselves were rarely anything special, usually being standard three-chord knockoffs with little to make them stand out besides the ferocious energy of the performances. It&amp;#039;s not great art, but it&amp;#039;s certainly entertaining. That&amp;#039;s especially true when the energy spills over to mania, as on the legendary Tyrone Schmidling&amp;#039;s shambling sides, the incredibly sloppy rendition of &quot;Good Golly Miss Molly&quot; by Sam Cooke proteges the Valiants, or the echoed-to-infinity Tex-Mex-cum-Jerry Lee Lewis of the Rio Rockers (released on Capitol). There are some unexpected appearances by stars as well, such as Eddie Cochran (who plays guitar on Lee Denson&amp;#039;s &quot;New Shoes&quot;), Brenda Lee (the early rockabilly track &quot;Rock the Bop&quot;), a teenaged Joe South, and Roy Clark (heard as a rockabilly singer). The collection&amp;#039;s also educational in its own way, as an illustration of just how extreme and far-flung the rock&amp;#039;n&amp;#039;roll revolution had become at the grass-roots level just a few years after its birth.","torrent":{"xt":"urn:btih:6d71f1001a5937a3199c1aab0099b16001f40b1e","amp;dn":"Rockin%5C%27+from+Coast+to+Coast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d71f1001a5937a3199c1aab0099b16001f40b1e","infoHashBuffer":{"type":"Buffer","data":[109,113,241,0,26,89,55,163,25,156,26,171,0,153,177,96,1,244,11,30]},"announce":[],"urlList":[]}}