{"title":"WWE.Monday.Night.RAW.2008.06.23.The.2008.Draft.WS.PDTV.XviD-433","uid":4257305,"size":1465832463,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6dedcfd935e8540feb1d793d9d1c8d6a1c0bdd03&amp;dn=WWE.Monday.Night.RAW.2008.06.23.The.2008.Draft.WS.PDTV.XviD-433&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ABCD_mOOn","files":101,"time":1214304070,"description":"WWE.Monday.Night.RAW.2008.06.23.The.2008.Draft.WS.PDTV.XviD-433 \n\n\\&amp;#039;. .\\&amp;#039; \n\\&amp;#039;-----\\&amp;#039; \n\nRelease.Date...: 2008, June 24 \nAir.Date.......: 2008, June 23 \nGenre..........: Wrestling \nSource.........: WS PDTV \nFormat........ : PAL (25 fps) (624 x 352) \nType...........: XviD \nAudio..........: VBR MP3 128k \nRuntime........: 140mins 1248 kbps \nSize...........: CD1: 49 x 14.31 CD2: 49 x 14.31 \n\niNFO \n\nThe 2008 WWE Draft \n\nIn the midst of the build-up to Night of Champions, theres one thing on every \nSuperstars mind: the 2008 WWE Draft. For the second year in a row, the Draft will \ntake place on a special three-hour Raw, where all Superstars, all Divas and all \nannouncers from all three brands are eligible. How will the entire landscape of \nsports-entertainment change in the wake of this years Draft? \n\nEven with the Draft dominating Raw next week, Mr. McMahon has announced that theres \nnothing keeping him from giving away another 1 million of his money as part of Mr. \nMcMahons Million Dollar Mania. For your chance to get a share of the Chairmans \ncash, all you have to do is register to win. \n\nTemperatures continue to rise between WWE Champion Triple H and his Night of \nChampions challenger John Cena. Last week, Mr. McMahon was forced to send in a \nreferee to keep The Game and Cena from taking each other apart at the very start of \nRaw, and we still have more than a week to go until Night of Champions, when theyll \nfinally be turned loose on one another. When two competitors this powerful and \nconfident want to compete, is there anything capable of keeping them apart? \n\nAfter being kept away from Cena, Triple H participated in a match against \nIntercontinental Champion Chris Jericho as retaliation for Y2Js cruel treatment of \nShawn Michaels the week before. Jericho has stated that hes tired of being booed for \ndoing the right thing only to see HBK cheered for his dishonest behavior, and to back \nhis claim, he was willing to throw down with not only the WWE Champion but also Ric \nFlair, in the Hall of Famers first appearance since his retirement. After having his \nhead smashed into the Jeri-Tron 6000, Michaels is currently receiving medical care, \nbut how long will it be before he returns to Raw looking for payback? \n\nThough they have had their share of difficulties in prior weeks, the World Tag Team \nChampions Hardcore Holly &amp; Cody Rhodes managed to defeat Cryme Tyme in a non-title \nmatch on Raw. Watching them compete was Ted DiBiase, who along with a partner of his \nchoosing will be challenging Holly &amp; Rhodes at Night of Champions in the \nthird-generation Superstars first in-ring performance. Who is this mystery \ncompetitor, and will the World Tag Team Champions be able to stand up to their \nassault? \n\nTune in to witness sports-entertainment history on a three-hour Monday Night Raw \n\nEnjoy\n\nAll Credits go to original Capper(s)!\nThank You, 433!","torrent":{"xt":"urn:btih:6dedcfd935e8540feb1d793d9d1c8d6a1c0bdd03","amp;dn":"WWE.Monday.Night.RAW.2008.06.23.The.2008.Draft.WS.PDTV.XviD-433","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dedcfd935e8540feb1d793d9d1c8d6a1c0bdd03","infoHashBuffer":{"type":"Buffer","data":[109,237,207,217,53,232,84,15,235,29,121,61,157,28,141,106,28,11,221,3]},"announce":[],"urlList":[]}}