{"title":"Kevin Gilbert - The Shaming of the True","uid":4164996,"size":102264921,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ffc88772c4d40575fa1b4c5e8c6f3e8103c94c3&amp;dn=Kevin+Gilbert+-+The+Shaming+of+the+True&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hasturT","files":14,"time":1209569531,"description":"When Kevin Gilbert died of asphyxiation at 29 in 1996, he left behind enormous unanswered questions about his potential. People magazine may have eulogized him as ``the keyboard player on the Sheryl Crow album `Tuesday Night Music Club,&amp;#039; &amp;#039;&amp;#039; but Gilbert was much more. \n\nHis neglected 1994 solo debut, ``Thud,&amp;#039;&amp;#039; much of which had been recorded at the same sessions as the multiplatinum Crow debut, was a confident, almost glib set of sleek songs that balanced irony with wit, despair with hope. (He was the guy who brought his then-girlfriend Crow to the sessions that produced her hit record in the first place.) \n\nIn his short career, Gilbert saw a lot of Hollywood. He moved south from his San Mateo home at the behest of Madonna&amp;#039;s producer, dabbled on some Michael Jackson sessions, cut a major-label album that bombed and was a key collaborator on the Crow smash. He was an immensely talented musician who could play anything, sing like a bird and hang out with the best of them. His own brush with success came when a Los Angeles radio station picked up a tape of Gilbert&amp;#039;s rejected cut from a Led Zeppelin tribute album -- a cover of ``Kashmir,&amp;#039;&amp;#039; where Gilbert finally straightened out the crooked beat -- and the track turned into a fluke hit. \n\nIn his own recording studio, however, Gilbert poured out his rage and frustration. His friend, ex-manager and executor of his estate, Jon Rubin, supervised the completion of Gilbert&amp;#039;s magnum opus, ``The Shaming of the True,&amp;#039;&amp;#039; a dark, 14-track song cycle that skewers the music business&amp;#039; hypocrisy and decadence. This tortured masterpiece takes its place alongside other depictions of the cruelty of Hollywood such as Nathanael West&amp;#039;s ``The Day of the Locust&amp;#039;&amp;#039; or Billy Wilder&amp;#039;s ``Sunset Boulevard.&amp;#039;&amp;#039;  \n\nThe album is anti-pop -- grandly produced tracks and polished vocals that recall the prog-rock pop magnificence of latter-era Genesis or Yes -- a well-groomed, blue-ribbon show dog ready to bite the hand that feeds it. Rock operas are resolutely out, but Gilbert clearly didn&amp;#039;t care. He was intent on venting his rage and self-loathing in a carefully circumscribed series of closely connected first-person vignettes by a would-be rock star named Johnny Virgil. \n\nVirgil&amp;#039;s rock-star dreams crash on the shoals of A&amp;R men, hangers-on, drugs and the whole Hollywood scene. While he looks for redemption and offers a glimmer of hope at the conclusion, it is easy not to notice. Gilbert&amp;#039;s unflinching detailing of the music world makes the album vivid. While he may be describing his personal nightmare, Gilbert never falters in his assurance, his belief in his own talent, and ``The Shaming of the True&amp;#039;&amp;#039; is his testament. \n","torrent":{"xt":"urn:btih:6ffc88772c4d40575fa1b4c5e8c6f3e8103c94c3","amp;dn":"Kevin+Gilbert+-+The+Shaming+of+the+True","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ffc88772c4d40575fa1b4c5e8c6f3e8103c94c3","infoHashBuffer":{"type":"Buffer","data":[111,252,136,119,44,77,64,87,95,161,180,197,232,198,243,232,16,60,148,195]},"announce":[],"urlList":[]}}