{"title":"Project Epiphany, leak of a Neil Gaiman nerd thriller draft (?)","uid":4024930,"size":1315297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70050a6628af9afa05f254d1e633e249566c90e9&amp;dn=Project+Epiphany%2C+leak+of+a+Neil+Gaiman+nerd+thriller+draft+%28%3F%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Oddball23","files":2,"time":1202861178,"description":"Don&amp;#039;t know if the story is true, so... make up your own mind (and proceed with care -- thar be dragons).\n\nGot this from a friend of mine and supposedly it&amp;#039;s the leak of a draft or outline (or whatever they call it) of a nerd thriller by Neil Gaiman, written under the pen name &amp;#039;Rian Sato&amp;#039;, as he wanted to take this into a direction somewhat different from his other writing (kind of like the Stephen King - Richard Bachmann deal).\n\nSome intern at Gaiman&amp;#039;s agency (Writer&amp;#039;s something, forgot the name friend told me) was tasked to read through the text again for any obviously British English diction conflicting with Rian Sato&amp;#039;s assumed American persona (guess they were well stocked with coffee at the moment and nothing needed to be xeroxed), but instead nabbed the file, took it home and then bragged about it online on some messageboard. Of course nobody believed him, intern threw a fit, board responded &quot;POST PROOF OR STFU&quot; and then the dude really posted the file. When everybody started ridiculing him for the danger he put himself in and serious screw-up he committed, he got scared and pulled the file again while begging everyone not to share it, but...\n\n...well, here it is.\n\nSharing is caring, innit?\n\n\nThe original file, as included, is even still in manuscript formatting (or so I&amp;#039;m told), but there&amp;#039;s also a standard, clear text version.\n\nIt&amp;#039;s a small download (PDF), well worth it, and I&amp;#039;d be laughing so damn hard if this book hit the market in a year or two. I just wonder which name is going to be on the cover.\n\n\nDo you think it&amp;#039;s real?\n\n\n-Oddball","torrent":{"xt":"urn:btih:70050a6628af9afa05f254d1e633e249566c90e9","amp;dn":"Project+Epiphany%2C+leak+of+a+Neil+Gaiman+nerd+thriller+draft+%28%3F%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70050a6628af9afa05f254d1e633e249566c90e9","infoHashBuffer":{"type":"Buffer","data":[112,5,10,102,40,175,154,250,5,242,84,209,230,51,226,73,86,108,144,233]},"announce":[],"urlList":[]}}