{"title":"Coast to Coast Radio Program! Commercial Free! Feb 9th thru Feb ","uid":4033881,"size":442530826,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7072bbb9937bd948e8fcb4475066cd072e3558cf&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+9th+thru+Feb+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":40,"time":1203304109,"description":"Eight more broadcasts for all you C2C freaks to enjoy! Thanks in advance to all the seeders and I will of course be here again next week! Stokeman Out............. \n\nSaturday February 9th, 2008\nStaged Accidents\nAuthor Tom Cain, a pseudonym for British journalist David Thomas, discussed his investigation into staged accidents, as well as evidence that Princess Diana was killed by assassins who made the cause of her death appear to be a car crash...\nHost: Ian Punnett\nGuest(s): Tom Cain, David Mack\n\nSunday February 10th, 2008\nRobots Today and Tomorrow\nRoboticist Daniel H. Wilson returned to the program to talk about the current state of robotics and how robots could be used to battle zombies, invading aliens, werewolves, and ninjas. He detailed the latest evolution in robots that are in the marketplace... \nHost: Ian Punnett\nGuest(s): Daniel H. Wilson, Glynis McCants, Steve Hammons\n\nMonday February 11th, 2008\nGod, Light, &amp; Physics\nAuthor Lee Baumann M.D. described his evolution from an atheist to spiritual perspective, and presented the concept that God could be thought of as light. He cited studies in quantum physics, NDE encounters and religious accounts as all sharing similar... \nHost: George Noory\nGuest(s): T. Lee Baumann, Kevin Mitnick\n\nTuesday February 12th, 2008\nUFOs: Contact &amp; Disclosure\nA special 4-hour show devoted to UFOs featured noted author and UFO researcher Jacques Vallee in the first half. Three of his classic works on alien contact were recently reprinted by Anomalist Books. He spoke about his investigation into a 1977 wave... \nHost: George Noory\nGuest(s): Jacques F. Vallee, Stephen Bassett\n\nWednesday February 13th, 2008\nStem Cell Treatments\nAppearing for all four hours, author Christian Wilde discussed the latest in heart disease prevention, heart health and the advances being made in adult stem cell research. He noted that doctors often fail to spot heart disease risk factors among patients,... \nHost: George Noory\nGuest(s): Christian Wilde, Dr. Warren Sherman, Michel Levesque\n\nThursday February 14th, 2008\nMind-Over-Matter Experiments\nResearcher Lynne McTaggart returned to report on the on-going results of global mind-over-matter experiments (theintentionexperiment.com) that she has sponsored. Because of the way subatomic structures function, the world is not as fixed or final as... \nHost: George Noory\nGuest(s): Lynne McTaggart, John M. Curtis\n\nFriday February 15th, 2008\nCursed Calls\nDuring Open Lines, George offered a &amp;#039;curse&amp;#039; hotline for callers who have either been cursed or have placed a curse on another person. A caller from Canada believes she has been cursed by her former husband. She said her ex has a &quot;powerful mind&quot; and has... \nHost: George Noory\nGuest(s): Open Lines, William Connery\n\nSaturday February 16th, 2008\nThe Future of (Child) Men\nIan spoke with psychologist Dr. Leonard Sax, who discussed the various factors contributing to the steady decline of performance, ambition, and fertility in America&amp;#039;s boys and young men. Sperm counts and testosterone levels of young men in the... \nHost: Ian Punnett\nGuest(s): Dr. Leonard Sax","torrent":{"xt":"urn:btih:7072bbb9937bd948e8fcb4475066cd072e3558cf","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Feb+9th+thru+Feb+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7072bbb9937bd948e8fcb4475066cd072e3558cf","infoHashBuffer":{"type":"Buffer","data":[112,114,187,185,147,123,217,72,232,252,180,71,80,102,205,7,46,53,88,207]},"announce":[],"urlList":[]}}