{"title":"Pink Floyd - Wish You Were Here [UK Q8 Quad Mix] CD","uid":4108807,"size":476157696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70a54d2727f60df3161b5aa1d0d255a68ed446a2&amp;dn=Pink+Floyd+-+Wish+You+Were+Here+%5BUK+Q8+Quad+Mix%5D+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kiefspoon","files":1,"time":1206942506,"description":"Below is the info from the original torrent creator, which was a DTS encoded disc ONLY, so could not be listened on conventional CD players. I listened to the DTS disc of the original British Quad mix, and it sounded great - so I have created a copy via my audio CD burner in real time in uncompressed (no mp3 files here!) audio files.\n\nJust double click the stuffed file, and it&amp;#039;s formatted as Bero disc image. In fact, this disk image will also open in Toast, as I&amp;#039;ve tried it as this is what I use most, but most people seem to use Nero.\n\nAnyway, I hope you all enjoy it - it sounds marvelous, and so much better than the &amp;#039;remasters&amp;#039; etc that have been released over the years.\n\n\n\n\n\nORIGINAL INFO FROM ORIGINAL TORRENT:\n\n**YOU!! YES YOU!! STAND STILL LADDIE!! This is a DTS CD image. If you\ndon\\\\\\&amp;#039;t have a DTS conversion at playback (we\\\\\\&amp;#039;re talking NOT your\ncomputer, we\\\\\\&amp;#039;re talking your stereo/Home Theatre playback system) then\ndon\\\\\\&amp;#039;t download this. All you\\\\\\&amp;#039;ll hear is static if you don\\\\\\&amp;#039;t have a bona\nfide DTS playback chain, happy and working!**\n\nThis is (as I received it) a Nero CD Image (.nrg).  I tried extracting FLAC or WAV tracks from it and posting it that way, but the resulting disc always had problems (drop-outs) so I\\\\\\&amp;#039;m posting it like this.  Let me know if you want the WAVs.\n\nThis is a DTS image of the highly rare Q8 British version of Wish You Were Here by Pink Floyd.  The band originally intended for their audience to hear the album THIS way, but unfortunately QUAD playback didn\\\\\\&amp;#039;t take off like people thought it would.  So, this Q8 was definitely an obscure item; in the UK, 8-Track cartridge technology was not a sought-after mainstay of playback like it was in the US circa the 1970\\\\\\&amp;#039;s.\n\nThe 1970\\\\\\&amp;#039;s British Q8 was an 8-channel, 2 program cartridge. In the US we had 4 programs of stereo; the British cartridge had two programs of Quadrophonic.  Given the source, you can expect that the sound quality will be less than most versions of this album on CD or vinyl. Why post? Because it\\\\\\&amp;#039;s TRUE QUADROPHONIC and really must be experienced to be believed, and especially because it is the rare original mix of a landmark album and, as far as I know, the only surround-sound version available.\t","torrent":{"xt":"urn:btih:70a54d2727f60df3161b5aa1d0d255a68ed446a2","amp;dn":"Pink+Floyd+-+Wish+You+Were+Here+%5BUK+Q8+Quad+Mix%5D+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a54d2727f60df3161b5aa1d0d255a68ed446a2","infoHashBuffer":{"type":"Buffer","data":[112,165,77,39,39,246,13,243,22,27,90,161,208,210,85,166,142,212,70,162]},"announce":[],"urlList":[]}}