{"title":"all else failed discography","uid":4112256,"size":408419110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70dfe8d066493b917e18de1002418c17660b8f9e&amp;dn=all+else+failed+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gtluke","files":99,"time":1207121838,"description":"reupload with corrected torrent name and trackers (new at this)\nadditionally, luke from all else failed appears on &quot;the bad luck 13 riot extravaganza&quot; song called &quot;02. Bad Luck 13 - Oh Rebekkah how you stalk me.mp3&quot; which appears on the album &quot;bad_luck_13-with_friends_like_these_who_needs_enemies&quot;\nwhich you can find here: &lt;a href=&quot;\nhttp://thepiratebay.se/tor/4112250/the_bad_luck_13_riot_extravaganza_discography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/4112250/the_bad_luck_13_riot_extravaganza_discography&lt;/a&gt;\n\n ALL ELSE FAILED is a five piece hailing from Philadelphia, PA. For the last 11 years, they have established a loyal following by continuing to push the envelope of underground heavy music. Nearly every descriptive buzzword has at one time or another been applied to All Else Failed, but the band hopes that only one adjective sticks: intense.\n\nAll Else Failed was formed in the summer of 1995 by Patrick Shannon, Luke Muir and Steve Wiegand. Originally, the youngsters were long on ambition and short on skill; early shows often times consisted of trashed equipment and interband fist fights. The band quickly developed a unique sound, however, one that at the time was called &quot;Metalcore&quot; (back when that term actually applied to bands that took equal influence from hardcore and metal). The band cut its teeth in the burgeoning East Coast scene, sharing the stage on numerous occasions with such legendary bands as Ink and Dagger, Deadguy and Vision Of Disorder. All Else Failed quickly became a household name, as the live shows remained insane, but also started to feature decent songs. They released their debut album, &quot;A Most Bitter Season&quot;, in 1997.\n\nUnfortunately for the band, the lineup change bug bit often, but the three original members stood fast and always kept the band moving forward. They signed to Now Or Never records in 1999 and released their second album, &quot;Archetype&quot;, in 2000. &quot;Archetype&quot; was followed by the bands first forays into extensive touring, seeing the band share stages with fellow up and comers The Dillinger Escape Plan, Darkest Hour and Mastodon. The touring took its toll, however, and the band once again was reduced to the three original members. In 2002, Dave Davies was introduced on guitar and breathed some fresh air into the band. At this point, the band began piecing together material for their third record, 2004&amp;#039;s &quot;This Never Happened&quot;. Still without a full time drummer, the band enlisted Chris Pennie from the Dillinger Escape Plan to perform the lion&amp;#039;s share of the drum tracks for &quot;This Never Happened&quot;. Soon after that record&amp;#039;s release, Chris introduced the band to one of his students, Jimmy Rhodes, who has been with the band ever since. They hit the road again, sharing the stage with bands like Lamb Of God, A Life Once Lost and the Minor Times. After a hiatus in the later part of 2005, the band looks to rev it up again in 2006 with &quot;Good Enough For The Girls We Roll With&quot;, to be released on THORP, which takes a look at all phases of the bands career. It includes five new tracks from the current lineup, combined with out of print and unreleased material from various sessions that have taken place over what has been a long and storied career. ","torrent":{"xt":"urn:btih:70dfe8d066493b917e18de1002418c17660b8f9e","amp;dn":"all+else+failed+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70dfe8d066493b917e18de1002418c17660b8f9e","infoHashBuffer":{"type":"Buffer","data":[112,223,232,208,102,73,59,145,126,24,222,16,2,65,140,23,102,11,143,158]},"announce":[],"urlList":[]}}