{"title":"XPAND.RALLY-ULTIMA","uid":3252227,"size":968371549,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:712c367884e6aa3fcb4023227d5ce6d006efee66&amp;dn=XPAND.RALLY-ULTIMA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BeMyGuest","files":100,"time":1099206817,"description":"XPAND RALLY US FR PL \n\nDeveloper................Techland Âº Relase date.............2004-10-15 \nProtection.......Starforce 3.3+VM Âº Relase type...................Game \nCracker:..............Team Ultima Âº System.........................Win \nProtection rate..............7/10 Âº Game rate.....................8/10 \n\ndezsription \n\nXpand Rally is a breathtaking game that gives you the true to life    \nexperience of driving powerful rally cars amidst photorealistic      \nsceneries. Realistic weather effects, rolling hills, and animated    \nscenery all add to game's visual perfection. Xpand Rally also features \nhighly detailed models of modern rally cars and handling physics      \ndeveloped with the help of rally sport professionals which further    \nenhance the realism of driving experience.                            \n                                                                      \nXpand Rally combines the best elements of Rally and Rally Cross racing \nin one unique gaming experience. The game offers a career mode based  \non time trials during both: individual races and World Championship  \nSeries which will satisfy traditional Rally fans. The Rally Cross fans \nwon't be disappointed either - they can challenge several opponents  \nin head to head racing during competitions based on real and fictitiou \nrace events.                                                          \n                                                                      \nXpand Rally, as the only title on the market, brings the economy facto \ninto a rally game. The player starts with a junk car and competes    \nin races to earn money and acquire upgrades, repair damage, tweak    \nperformance and pay the race entry fees. Along with the tuning-up,    \nthe car's condition affects its handling. Due to accurate damage      \nsystem, it is highly dependent on the player's driving skills.        \nThe physical handling model is also influenced by car parts          \nconfiguration and provides both authentic feel and joy of driving.    \n                                                                      \nThe interactive race track surroundings with enhanced game physics    \nand the innovative approach to changing daytime and weather conditions \nboth influencing the car handling, are other hallmarks of Xpand Rally \nthat distinguish it from other racing games.                          \n                                                                      \nFor the first time among rally games Xpand Rally includes a complete  \nset of easy-to-use editing tools enabling to create new tracks, cars  \nor even game mods.                                                    \n                        www.xpandrally.com                          \n\nWow, very sad they did not officially mention Open Dynamics Engine,  \nwhich was used to achieve those &amp;quot;enhanced game physics&amp;quot;.","torrent":{"xt":"urn:btih:712c367884e6aa3fcb4023227d5ce6d006efee66","amp;dn":"XPAND.RALLY-ULTIMA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"712c367884e6aa3fcb4023227d5ce6d006efee66","infoHashBuffer":{"type":"Buffer","data":[113,44,54,120,132,230,170,63,203,64,35,34,125,92,230,208,6,239,238,102]},"announce":[],"urlList":[]}}