{"title":"[PPKLP] Mala Vita - Disorganizzata (2007) [MP3@320kbps]","uid":4037758,"size":93371956,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72c36d9f5832c767e24d689d03e1ecca7871e40b&amp;dn=%5BPPKLP%5D+Mala+Vita+-+Disorganizzata+%282007%29+%5BMP3%40320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PPKLP","files":16,"time":1203526337,"description":"THE NEW MALA VITA ALBUM \nPRODUCED BY GAMBEAT (MANO NEGRA, RADIO BEMBA SOUND SYSTEM) \n\nBiography: \nPowerful melodies from the Balkans, explosive rhythms from Latin America and lyrics straight from the dark Neapolitan alleys, welcome to the world of Mala Vita! These gypsies from the 21st century know how to energetically summarize the world in a nutshell. A new album, a collaboration with the bassplayer in the band of Manu Chao, an Essent Award, nobody can stop this band! The secret of this success? Bring six musicians together with different nationalities and backgrounds, let them blend and the global sounds of Mala Vita will blow out of your speakers. \n\nThe roots of front man Mickael lay in the sunny and beautiful country of Italy. That is why most of the lyrics are sung in Italian. The other band members from Bosnia, Serbia and The Netherlands complete the international personality of the band. Mala Vita also sings in Spanish, English, Bosnian and French. Or call it ?ItaÃ‚Â±ol?, ?Franglais? or ?Bosniano?, because the idiom of the Malavitosi is just as infinite as their music. \n\nThe strong Balkan sounds are no coincidence. Accordionplayer Emil and drummer Garo are both from the torn country of Bosnia. So they know how to unite Europes far east and west. The songs of the band are full of themes like pain, love and betrayal. But don not expect to be having a melancholic night with Mala Vita, because they will bring you a show of danceable polkapunk, crushing ska and pounding reggae. \n\nIn the spring of 2007 the band releases their first studio album, Disorganizzata. For this album they worked closely together with producer Gambeat, ex-Mano Negra and bassplayer in Manu Chao his notorious band Radio Bemba Sound System. Disorganizzata has been partially recorded in The Netherlands and Barcelona and mixed in Barcelona, the centre of the vivid mestizo-scene. Front man Mickael: ?Gambeat didn?t just produce the album but also participated in the writing process. He really did everything to get the best out of us. Mark my words: 2007 will be the year of Mala Vita!? \n\nThe band developed itself in an incredible speed since they started in 2001. They have played on uncountable stages of venues and festivals throughout Europe. The highlights: two times Lowlands, Noorderslag, PolÃƒÂ© PolÃƒÂ© at the Gentse Feesten, The International Film Festival in Zagreb and the recording of their live album Mani Fiesta in Het Paard van Troje in The Hague. In 2005 the band won a prestigious Essent Award. \n\nThe sound of Mala Vita is difficult to describe, and that is exactly the power of this promising, global, musical sensation. \n\nwww.malavita.net \n\n\nTracklist: \n01 - Disorganizzata \n02 - Il Cuore del Mediterraneo II \n03 - Una Canzone di Dolore \n04 - Senza Malizia \n05 - No Vale la Pena \n06 - Snijeg Pade \n07 - Club Slava \n08 - Nema Problema \n09 - Il Diluvio \n10 - Esa Ciudad \n11 - Pleshi \n12 - El Cerbero \n13 - Malena \n14 - La Mala Vita Disorganizzata \n\nKEYWORDS \n====================================================== \nManu Chao , Mano Negro , Radio Bemba Sound System , Patchanka , Latin \n\n..Please leave a comment and keep seeding as much as possible..\t\t","torrent":{"xt":"urn:btih:72c36d9f5832c767e24d689d03e1ecca7871e40b","amp;dn":"%5BPPKLP%5D+Mala+Vita+-+Disorganizzata+%282007%29+%5BMP3%40320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72c36d9f5832c767e24d689d03e1ecca7871e40b","infoHashBuffer":{"type":"Buffer","data":[114,195,109,159,88,50,199,103,226,77,104,157,3,225,236,202,120,113,228,11]},"announce":[],"urlList":[]}}