{"title":"Wizardry 8-FLT","uid":4022001,"size":1928973768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:72f2271137f3fab9194c8b4c800a93483fcc97a4&amp;dn=Wizardry+8-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"infinite0101","files":131,"time":1202707313,"description":"*******************************************************************************\nWizardry 8\n*******************************************************************************\n\n-------------------------------------------------------------------------------\nGeneral Information\n-------------------------------------------------------------------------------\nType.................: Game\nPlatform.............: Windows 9x/ME/2000\nSerial #.............: N/A\nPart Size............: 14.3(mb)\nNumber of Parts......: 129\nCompression Format...: RAR\nFile Validation......: SFV\nImage Format.........: .iso\nImage Created with...: NMR\n\n-------------------------------------------------------------------------------\nRelease Notes\n-------------------------------------------------------------------------------\n**Wizardry 8**\nWizardry 8 is the 8th title in the Wizardry series of computer role-playing \ngames by Sir-Tech. It is also the 3rd in the Dark Savant trilogy, which includes \nWizardry VI: Bane of the Cosmic Forge and Wizardry VII: Crusaders of the Dark \nSavant. It was published in 2001 by Sir-Tech. Wizardry 8 is unusual in that it \ndoes not have a subtitle and that the numeral in the title isn&amp;#039;t shown as a \nRoman numeral (VIII, in this case).\n\n**Gameplay**\nThe ultimate aim of the game is to collect all three artifacts mentioned in the \nstory, to ascend to the Cosmic Circle, and become a god.\n\nCharacters imported from Wizardry VII: Crusaders of the Dark Savant start in \neither the Umpani stronghold or in the T&amp;#039;Rang stronghold, depending on the \nplayer&amp;#039;s alliance. New characters or unallied characters imported from the \nprevious game start in the Higardi Monastery. Wizardry 8 uses different \nstatistics than the previous games, necessitating conversions from the upper \nlimit of 18 to the new upper limit of 100.\n\nThe game has an automap that expands into a larger map that can be zoomed in and \nout. Players can write notes directly onto the map. The quests are relatively \nsimple to complete (other than the secret areas and the retro dungeons, which \nare not essential to the game). The game provides a journal system, with \nhighlighted items indicating things that warrant further investigation. Games \ncan be saved easily, with an unlimited number of games able to be saved. When \ncharacters die they can simply be resurrected, either with powders and scrolls \n(expensive early in the game), or by casting a resurrection spell later on in \nthe game.\n\nFor the first time in the Wizardry series, players are able to see enemies \napproaching instead of having them popping up randomly. Combat is turn-based, \nalthough a continuous-phase mode can be toggled for those who wish. Because \ncombatants are free to move around during combat, some disadvantages of the \ncombat engine can quickly become apparent. Fights with more than ten enemies can \nbecome tedious, while spells that cause fear can cause the enemies to run away, \neven though the player&amp;#039;s party is still flagged as being in combat. Due to the \nway enemies tend to surround the party, it is often necessary to retreat into \nnooks and crannies in the terrain in order to prevent being flanked, despite \nhaving a very good formation function.\n\nEach race and class has a balance of strengths and weaknesses. The various races \nand classes are designed to be balanced against each other. The game is designed \nso that a wide variety of parties can be assembled and still be playable. \nCharacters may change their class as they advance, allowing a variety of \ncombinations.\n\nMonsters are scaled to the party level; higher level parties will face different \nsets of monsters than a lower level party in the same area. The scaling is \nlimited to allow variation in difficulty.\n\nFor players seeking a more difficult challenge, Sir-Tech brought back an option \nto play using rules from the early Wizardries - the &quot;Iron Man Mode&quot;. In this \n&quot;permadeath&quot; mode, players are not allowed to save the game; instead the game is \nautomatically saved when the player quits. As a result, a death cannot be \ntrivially undone by a simple &quot;Restore Game&quot;.\n\nThere are four main paths to proceed through the game: Allying with either the \nT&amp;#039;Rang or Umpani, allying with both, or else being enemies with both. In \naddition, players can also choose to gain friendship with the Rattkin or the \nTrynnie, and players can choose whether or not to ally with the Rapax, Rattkin \nRazuka or Mook, none of which affects the ending of the game. Diplomacy is a \nmajor factor in the game, and choosing the right words and who to ally with \ngreatly affects how the characters are treated and the prices of various goods.\n\nThere are many secret areas, including &quot;retro dungeons&quot;, something which was \ncopied in the Diablo II expansion packs and Devil Whiskey. Retro Dungeon refer \nto the look of the dungeons in the original Wizardry (Proving Grounds of the Mad \nOverlord). Instead of vast open views, players are greeted with a solid, \ntraditional grid-based dungeon in the style of Eye of the Beholder and the old \nMight and Magic games. Spinners, traps and teleporters combine to make these \noptional areas a challenge and reward for players who wish to test themselves.\n\nThe game received generally good reviews, but failed to increase the size of the \nfranchise&amp;#039;s fanbase. New casual gamers had some difficulty adjusting to the \nold-school RPG feel of the game. With a lack of widespread advertising and \nlimited distribution, the game failed to attract much attention at its release.\n\n**Development**\nWizardry 8 was published nine years after the completion of the previous title, \nWizardry VII: Crusaders of the Dark Savant in 1992, and 5 years after the \ncompletion of Wizardry VII&amp;#039;s Windows 95 version, titled Wizardry Gold in 1996. \nDavid W. Bradley had been the chief designer of Wizardry VI and VII, but he was \nnot involved in the design of the final installment of the trilogy. Linda Currie \nis credited as producer of Wizardry 8.\n\nDuring the production of Wizardry 8, its publisher, Sir-Tech, went bankrupt. The \nfinal production process was rushed, and finally Sir-Tech was forced to sell \nadvertising space within the game itself in order to make budget. This \nadvertising appears when exiting the game.\n\nIn spite of a &amp;#039;final save&amp;#039; prior to the final battle, Sir-Tech has announced \nthat they have no plans to make a sequel. The Dark Savant trilogy is complete, \nand Sir-Tech is out of business.\n\n**User Improvements**\nDespite the closing of the development studio, Sir-Tech continued to provide \nsupport and created several patches or upgrades for the game for years after \nrelease. This support was provided with the collective help of the Wizardry 8 \ndevelopers who dedicated their own time to the overall effort until such a time \nwhen alternate employment made this no longer possible. Fans of the series have \ncontinued the efforts, providing editors, mods and a wealth of game info.\n\nFrom Wikipedia, the free encyclopedia.\n\n[Includes]\nWizardry 8\n-------------------------------------------------------------------------------\nInstall Notes\n-------------------------------------------------------------------------------\n1)Unrar\n2)Mount or Burn\n3)Install\n4)Play :-)\n","torrent":{"xt":"urn:btih:72f2271137f3fab9194c8b4c800a93483fcc97a4","amp;dn":"Wizardry+8-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72f2271137f3fab9194c8b4c800a93483fcc97a4","infoHashBuffer":{"type":"Buffer","data":[114,242,39,17,55,243,250,185,25,76,139,76,128,10,147,72,63,204,151,164]},"announce":[],"urlList":[]}}