{"title":"Allen Collins Band - Here, There &amp; Back","uid":4053014,"size":59892255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:73c0ab018bfbe4cc8c8fc7c27fb8aade16642843&amp;dn=Allen+Collins+Band+-+Here%2C+There+%26+Back&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Rezz1","files":10,"time":1204239038,"description":"Celebrated rock guitarist Allen Larkin Collins was born in Jacksonville, FL, on July 19, (b. 1952). The fame he has reached came from his explosive skill with the guitar and from his founding membership in a band known as Lynyrd Skynyrd.\n\nWhen Collins was 11 years old, he picked up his first guitar, one that belonged to a friend. Collins\\&amp;#039; mother was a single mom, holding down two jobs, struggling financially, but she managed to get her son a guitar of his own. With no money for lessons, the young Collins, through triumphs and failures, taught himself to play the instrument. As soon as he was good enough, he put together a band called the Mods. Not even 13 at the time, Collins\\&amp;#039; next amateur musical device, My Backyard, came together in 1964. The group quickly changed the name to Noble Five. Other members were bassist Larry Junstrum, drummer Bob Burns, guitarist Gary Rossington, and singer Ronnie VanZant.\n\nBy 1965, Collins, Rossington, VanZant, and Burns changed the name of the band once more, this time becoming Lynyrd Skynyrd. Slowly, with years of practice in between, performing for fun turned into performing professionally. The guys even rocked out with the tune \\&quot;Free Bird\\&quot; at Collins\\&amp;#039; wedding to Kathy Johns in 1970. It was musician Al Kooper who first took real notice of these long-haired Southern boys. With his help, Lynyrd Skynyrd saw the release of its debut album in 1973 under the MCA Records label. Collins, as part of Lynyrd Skynyrd, completed a number of albums, with big hits like \\&quot;Saturday Night Special,\\&quot; \\&quot;What\\&amp;#039;s Your Name?,\\&quot; and \\&quot;Sweet Home Alabama.\\&quot; The band toured worldwide and its albums went gold and platinum.\n\nBy early 1977, Lynyrd Skynyrd was a household name and it seemed the band\\&amp;#039;s star would burn forever. Sadly, on October 20th of that very year, a plane crash into the muddy Mississippi swamp land extinguished the flame, claiming the lives of singer Ronnie VanZant, guitarist Steve Gaines, backup vocalist Cassie Gaines (Steve\\&amp;#039;s sister), and the band\\&amp;#039;s manager Dean Kilpatrick. The other members were injured, but survived.\n\nAfter three years of recovery, Collins, Rossington, and some of the other Skynyrd members came back together as the Rossington-Collins Band. In 1980, the group released its first album, Anytime, Anyplace, Anywhere. Just when the stars were coming in reach for Collins once more, death visited another time, taking his wife. In 1983, Collins was still performing, even though Rossington had left and the band was now known simply as the Collins Band. He recorded one more album, Here, There, and Back.\n\nIn 1986 death came yet again and this time Collins was blamed. While driving under the influence of alcohol, he wrecked his car, killing his girlfriend and paralyzing himself from the waist down and reducing the use of his upper body severely enough that he would never play his guitar again. Collins, pleading no contest in court, was convicted of DUI manslaughter. From then on, he used his fame to reach young people and warn them about drinking and driving. In January of 1990, after being diagnosed with pneumonia that was brought on because of his paralyzation, Collins faced death one last time and lost the battle. [allmusic.com]","torrent":{"xt":"urn:btih:73c0ab018bfbe4cc8c8fc7c27fb8aade16642843","amp;dn":"Allen+Collins+Band+-+Here%2C+There+%26+Back","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c0ab018bfbe4cc8c8fc7c27fb8aade16642843","infoHashBuffer":{"type":"Buffer","data":[115,192,171,1,139,251,228,204,140,143,199,194,127,184,170,222,22,100,40,67]},"announce":[],"urlList":[]}}