{"title":"DockChanger 1.5.2","uid":4154560,"size":48271357,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7401abfc2d0443ed2418b517db7cede004a9525a&amp;dn=DockChanger+1.5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DJMac317","files":1,"time":1209091950,"description":"Change the appearance of your Mac OS X 10.5 dock from 3D to 2D and back again  Plus change the dock to any theme to customize your Mac OS X experience.  DockChanger ships with 90 different backgrounds and themes, plus mix and match the separator image and the application indicator image to your own liking.\n\nMore themes available at Leopard Docks.com    \n\n \nDOCKCHANGER\n3/13/08\nFirst 10 changes free\n$10.00 Registration\nPlus you can add your own themes by dragging their respective files to the Themes folder contained in the application.  Every month a new set of themes can be downloaded and installed.  \n\nTo Use: \nSimply choose a theme from the Themes pull down menu, customize the dock separator and the Active Application Indicator, then click Apply Changes.  Your Dock will disappear and reemerge as a beautiful new dock.\n\nTo add themes: \nTake the individual files like &quot;indicator&quot;, &quot;scurve&quot;, &quot;separator&quot; and so on and place them in the respective folders win the themes folder inside the application.  Find DockChanger, control-click on it and choose &quot;Show Package Contents&quot;.  Navigate through /Contents/Resources until you find the &quot;Themes&quot; folder.  Create a name for your theme and create a new folder.  For instance: in the images folder create a folder called &quot;Sponges&quot; in the indicator folder do the same.  Move the files you&amp;#039;ve created into the folders and launch DockChanger.  You&amp;#039;ll notice your new theme in the pull down menus and they are selectable and customizable to your liking.\n\nVERSION CHANGES\nVERSION 1.5.2\n-Minor tweaks to routine that sets the new dock and resets the dock to defaults.\n\n","torrent":{"xt":"urn:btih:7401abfc2d0443ed2418b517db7cede004a9525a","amp;dn":"DockChanger+1.5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7401abfc2d0443ed2418b517db7cede004a9525a","infoHashBuffer":{"type":"Buffer","data":[116,1,171,252,45,4,67,237,36,24,181,23,219,124,237,224,4,169,82,90]},"announce":[],"urlList":[]}}