{"title":"Jack Keane(2008)","uid":4271274,"size":362267967,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7441b16c869951400cab2350e0625dffd38e93da&amp;dn=Jack+Keane%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kingswoodtown","files":1,"time":1214948627,"description":"Jack Keane 2008 ..pc game\n\n\n\nAn out-there nautical adventure powers the plot. You play as Jack Keane, a Han Solo-like British rogue tasked with taking a secret agent for her majesty&amp;#039;s secret service to a rather ominous-sounding destination in the Indian Ocean called Tooth Island. It seems that a madman named Doctor T is threatening to destroy tea plants in the region, which naturally drives the Brits to the point of madness wondering what they&amp;#039;ll drink with their crumpets. The setting is the 19th century, when the sun never set on the British Empire, so get ready for lots of fops, pith helmets, and outrageous moustaches. Resemblances to LucasArts&amp;#039; classic Monkey Island games are entirely intentional, with Jack taking part in a screwball escapade that gets progressively zanier as you unravel the mystery of Doctor T&amp;#039;s fiendish plot. If you&amp;#039;ve played any of those great old Lucas point-and-clickers, you&amp;#039;ll feel right at home by the time you encounter the crazed scientist&amp;#039;s superapes and cannibal plants. \n\nAt times, the storyline may be a little too broad and a touch too childish. It certainly lacks the adult edge of those old LucasArts games. Humor is kind of hit and miss, which probably won&amp;#039;t come as much of a surprise given how hard it is to make people laugh while playing games. There are some nice touches here, however, including a funny Victorian variation on the distinctly modern Nigerian banking scam, a great Star Wars joke or two, a Clouseau-like British secret agent, and Flintstones-styled technology, such as monkey-powered electricity. \n\nVisuals are over the top in a classic Saturday morning cartoon fashion, with lots of deep chins, pop eyes, and exaggerated architecture, so the cornball plot is at least nicely complemented. Voice acting is equally flamboyant, with maaccents on display. Oddly enough, though, the list of characters with outrageous accents doesn&amp;#039;t include Jack Keane himself, who&amp;#039;s voiced by an American despite supposedly being a born-and-bred Londoner. That&amp;#039;s rather odd, especially given how just about everyone else in the game speaks with ridiculous English and Indian accents straight out of old Monty Python sketches","torrent":{"xt":"urn:btih:7441b16c869951400cab2350e0625dffd38e93da","amp;dn":"Jack+Keane%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7441b16c869951400cab2350e0625dffd38e93da","infoHashBuffer":{"type":"Buffer","data":[116,65,177,108,134,153,81,64,12,171,35,80,224,98,93,255,211,142,147,218]},"announce":[],"urlList":[]}}