{"title":"Alex Jones Show, June 25th, 2008 - Pappas, Ryan, Gage, Booth","uid":4260728,"size":69745472,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:749e822cec359e73379669c0e7daf10e7b72609f&amp;dn=Alex+Jones+Show%2C+June+25th%2C+2008+-+Pappas%2C+Ryan%2C+Gage%2C+Booth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Femacamper","files":1,"time":1214452630,"description":"The Alex Jones Show, Enhanced Edition\n\nVeteran Broadcaster, Filmmaker, and Media Analyst Alex Jones brings you thought-provoking interviews and takes an in-depth look at the news between the daily headlines.\n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom Italy\\\\\\\\\\\\\\&amp;#039;s La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nJones has interviewed some of the most amazing minds and the most intriguing personalities in the world from guerrilla journalists to government officials to whistle-blowing intelligence agents.\n\nThe Alex Jones Show is a hard-hitting news and information program unlike any other on the air. Jones is a seasoned investigative journalist who has broken hundreds of national stories during his career. He is an aggressive Constitutionalist who digs deeply into the facts to defend property rights, our nation\\\\\\\\\\\\\\&amp;#039;s borders, and the Second Amendment while he sends out a rallying call to the American people to resist foreign entanglements and wars for corporate interests. Jones eschews the bogus political labels of \\\\\\\\\\\\\\&quot;left and right\\\\\\\\\\\\\\&quot; and instead focuses on what really matters: what\\\\\\\\\\\\\\&amp;#039;s right and wrong.\n\nWednesday, June 25th, 2008\n\nTHE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex welcomes Max Pappas, Policy Director of FreedomWorks, to talk about a Senate bill requiring online transactions to be monitored by the government. Alex also talks with Kevin Ryan, former engineer and site manager for Underwriters Laboratories fired for questioning NIST\\\\\\\\\\\\\\&amp;#039;s explanation of the WTC collapses. Joining Ryan will be Richard Gage, founding member of Architects and Engineers for 9/11 Truth. Finally, Alex welcomes Kevin Booth, director of American Drug War - The Last White Hope.\n\nTotal Recorder 4.4 Capture in 48 kbs stereo from Ku satellite feed or 56 kbs internet streaming audio with commercial edit. Original capture by modemho (all four hours plus overdrive with commercials edited out), modified and re-encoded for ipod podcast compatibility with bookmarking and chapters, added guest picture, show description and informative mp3 tags.\n\nGo here if there are no seeds:  &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg208705#msg208705&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.msg208705#msg208705&lt;/a&gt;\n\nOr you can do up your own .mp3s here:  &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=45157&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=45157&lt;/a&gt;\n\nDownload the daily .mp3 here:  &lt;a href=&quot;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.prisonplanet.com/index.php?topic=38235.0&lt;/a&gt;","torrent":{"xt":"urn:btih:749e822cec359e73379669c0e7daf10e7b72609f","amp;dn":"Alex+Jones+Show%2C+June+25th%2C+2008+-+Pappas%2C+Ryan%2C+Gage%2C+Booth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"749e822cec359e73379669c0e7daf10e7b72609f","infoHashBuffer":{"type":"Buffer","data":[116,158,130,44,236,53,158,115,55,150,105,192,231,218,241,14,123,114,96,159]},"announce":[],"urlList":[]}}