{"title":"Alias xbox","uid":3266183,"size":3274702848,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:75f43f75ca9c517c3d2f87ad85fa8f16890c8aa8&amp;dn=Alias+xbox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"elgekko","files":1,"time":1103327165,"description":"Special Features \nOriginal story and script from the writers of &amp;quot;Alias.&amp;quot; \nGame play offers a blend of combat, espionage and stealth. \nIncredible combat system enables players to simultaneously fight multiple opponents in fierce hand-to-hand combat. \nFully interactive environments allow players to use objects as weapons or to create diversions. \nThe latest in state-of-the-art gadgetry designed by Marshall from &amp;quot;Alias.&amp;quot; \nUnique camera direction - utilizing multiple, simultaneous angles.\n \n\nReview \nAfter two years of being a double agent inside the criminal organization, SD-6,Sydney Bristow thought she'd brought it down from the inside. She thought her mission was over. She thought she was getting out of the CIA. But when you're a spy, the truth is never that simple... Arvin Sloane, the mastermind behind SD-6, remains at large. And as long as he's out there, Sydney will never be safe. \n\n\n&amp;quot;Alias&amp;quot; is a third-person action adventure video game that allows players to step into the role of the series' lead character, Sydney Bristow, an agent for the CIA. Bristow must use her cunning, extensive knowledge of martial arts and array of high-tech gadgetry to accomplish dangerous missions. &amp;quot;Alias&amp;quot; will encompass all of the key elements behind the series' success, including high-action combat, stealth missions and time-based objectives, espionage, intriguing plot twists, high-tech weaponry and stunning gameplay locations that span the globe. \n","torrent":{"xt":"urn:btih:75f43f75ca9c517c3d2f87ad85fa8f16890c8aa8","amp;dn":"Alias+xbox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75f43f75ca9c517c3d2f87ad85fa8f16890c8aa8","infoHashBuffer":{"type":"Buffer","data":[117,244,63,117,202,156,81,124,61,47,135,173,133,250,143,22,137,12,138,168]},"announce":[],"urlList":[]}}