{"title":"Eoin Colfer - Artemis Fowl (Unabridged)","uid":3344272,"size":176354700,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:7614617ff587e693ff8fc6b488d9478c531369da&amp;dn=Eoin+Colfer+-+Artemis+Fowl+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"psychobabble111","files":82,"time":1118703977,"description":"Title: Artemis Fowl\n(Book 1 in the series)\nAuthor: Eoin Colfer\nNarrated by: Nathaniel Parker\nUnabridged, 6 Hours\n64kbps, mono, 44kHz\n\nAn entertaining 10-and-up listen featuring an ingenius anti-hero.  Should appeal to fans of Harry Potter, though, truthfully, the two are nothing alike.\n\nFrom Amazon:\nEoin Colfer describes his new book, Artemis Fowl, as &quot;Die Hard with fairies.&quot; He's not far wrong.\n\nTwelve-year-old Artemis Fowl is the most ingenious criminal mastermind in history. With two trusty sidekicks in tow, he hatches a cunning plot to divest the fairyfolk of their pot of gold. Of course, he isn't foolish enough to believe in all that &quot;gold at the end of the rainbow&quot; nonsense. Rather, he knows that the only way to separate the little people from their stash is to kidnap one of them and wait for the ransom to arrive. But when the time comes to put his plan into action, he doesn't count on the appearance of the extrasmall, pointy-eared Captain Holly Short of the LEPrecon (Lower Elements Police Reconnaisance) Unit--and her senior officer, Commander Root, a man (sorry, elf) who will stop at nothing to get her back.\n\nFantastic stuff from beginning to end, Artemis Fowl is a rip-roaring, 21st-century romp of the highest order. The author has let his imagination run riot by combining folklore, fantasy, and a fistful of high-tech funk in an outrageously devilish book that could well do for fairies what Harry Potter has done for wizardry. But be warned: this is no gentle frolic, so don't be fooled by the fairy subject matter. Instead, what we have here is well-written, sophisticated, rough 'n' tumble storytelling with enough high-octane attitude to make it a seriously cool read for anyone over the age of 10. \n","torrent":{"xt":"urn:btih:7614617ff587e693ff8fc6b488d9478c531369da","amp;dn":"Eoin+Colfer+-+Artemis+Fowl+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7614617ff587e693ff8fc6b488d9478c531369da","infoHashBuffer":{"type":"Buffer","data":[118,20,97,127,245,135,230,147,255,143,198,180,136,217,71,140,83,19,105,218]},"announce":[],"urlList":[]}}