{"title":"Pirates vs Ninjas I &amp; II [BBN][h33t]","uid":4047473,"size":183170359,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:769b49cf0b1a71f7cfc9014dcdac361406497e9d&amp;dn=Pirates+vs+Ninjas+I+%26+II+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seedYAbastid","files":13,"time":1203993642,"description":"\n[IMG]http://img519.imageshack.us/img519/8443/pvn1ce7.png[/IMG]\n\nPirates vs Ninjas I 1-4 (of 4)\n[quote]The pirate versus ninja debate has been going on since the mid-1960s, and it&amp;#039;s a question that instantly gets your imagination racing. And precisely because your imagination is filled with tons of imagry and a host of different scenarios, almost any interpretation of that is going to fall short. (Rule of thumb: interpretations always fall short of your imagination.)\nBut in the case of Antarctic Press&amp;#039; Pirates vs. Ninjas, we&amp;#039;re treated to every highlight of every pirate versus ninja debate since the idea was first introduced. We&amp;#039;ve got pirates brushing off throwing stars, ninja stealth gliders, pirates chopping off ninja heads, ninjas sneaking aboard a pirate ship, pirates being fired out of cannons... but, I&amp;#039;m getting ahead of myself.\nThe story (yes, we have an actual story on top of cool fight scenes!) revolves around an ancient map the pirates have to the treasure of the old gods. The scrawlings on the map are so obscure that only one navigator can interpret them, and the ninjas swoop in to try to capture the navigator and the map for themselves, in the hope of reviving Raiga, father of ninjutsu. The ninjas succeed and the issue ends with the navigator in the clutches of the ninja.\nThe prologue sets up most of the story for us in the first five pages. The ninjas reveal their plot on the last page. Just about everything in between is a rip-roaring fight between the pirates and the ninjas. It&amp;#039;s just all-out fun across the board -- the pirates act exactly as you&amp;#039;d expect and the ninja act exactly as you&amp;#039;d expect. Every reason you&amp;#039;ve heard why a pirate or a ninja should or shouldn&amp;#039;t win a fight is on display and, what&amp;#039;s more, many of the qualities that some people cite as advantages are simultaneously used as disadvantages. Sure, the pirates are drunk, but that also means they don&amp;#039;t feel the little pin pricks caused by the ninja&amp;#039;s small blades. Sure, the ninjas are practiced and orderly, but that doesn&amp;#039;t mean didly in the chaos that is a pirate ship.\nLet me put this succinctly: Pirates vs. Ninjas is a fun book. It could easily have relied too heavily on the concept and let details like art and storytelling and dialogue fall to the wayside, but the book lives up to (and indeed exceeds) my expectations.\nLike Marvel&amp;#039;s promotions of &quot;Civil War&quot;, Antarctic Press has used a &quot;Whose Side Are You On?&quot; campaign slogan to tout the book. Unlike Civil War, though, Pirates vs. Ninjas is well worth the price of admission![/quote]\n\n\n[IMG]http://img205.imageshack.us/img205/3051/pvn2ha6.png[/IMG]\n\nPirates vs Ninjas II 1-8 (of 8 )\n[quote]Yarr, if history teaches us anything, there is only one thing to do with a sequel: Up The Ante! Now in full, glorious color, the critically acclaimed, blockbuster series returns in this all-new, epic tale! First there were Pirates, then there were Ninjas, then came fire and the wheel. Then, on the seventh day came the Vikings! The world will disintegrate and your brain will melt in your skull as these three ancient enemies wage their eternal war. Pirates, Ninjas, Vikings - it`s a trilemma! Whose side aren`t you on? You`ll witness every earth-crushing moment![/quote]\n\n\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:769b49cf0b1a71f7cfc9014dcdac361406497e9d","amp;dn":"Pirates+vs+Ninjas+I+%26+II+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"769b49cf0b1a71f7cfc9014dcdac361406497e9d","infoHashBuffer":{"type":"Buffer","data":[118,155,73,207,11,26,113,247,207,201,1,77,205,172,54,20,6,73,126,157]},"announce":[],"urlList":[]}}