{"title":"Men in Trees S01E10 - Heimweh (German)","uid":4028852,"size":411201536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:76ca74aac0a708026ab77a1e59efa54bd4280887&amp;dn=Men+in+Trees+S01E10+-+Heimweh+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gwodus","files":1,"time":1203065334,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nMarin ist zurueck in ihrem geliebten New York und erfreut sich all der Dinge, die sie in Elmo entbehren musste - ihre Designerdusche, den prallgefuellten Schuhschrank und den grossstaedtischen Trubel auf den Strassen. Auch in beruflicher Hinsicht erlebt sie einen enormen Aufschwung: Seit das erste Kapitel ihres neuen Buches im New Yorker erschienen ist, reissen sich die Verleger um sie. Doch als Jane sie auf eine Buchparty schleppt, auf der Marin weitere Interessenten kennenlernen soll, wird ihr die laute Musik und das Geplappere der Gaeste ploetzlich zu viel. Sie sehnt sich nach Elmo.\n\nDort laufen unterdessen die Vorbereitungen fuer das anstehende Thanksgiving-Fest auf Hochtouren. Patrick, der urspruenglich mit Annie nach New York zu ihrer Familie fahren wollte, entscheidet sich, in Alaska zu bleiben, um mit seiner neuen Familie zu feiern. Und auch Annie bleibt gezwungenermassen in Elmo - ein Sturm verhindert ihre geplante Reise. Doch als sie schliesslich gemeinsam mit Patrick, Mai, Buzz und Celia am reichgedeckten Tisch sitzt, stellt sie fest, dass sie eigentlich nur das fuenfte Rad am Wagen ist...\n\nIn New York muessen Jane, Marin und ihre Schwester Liza Thanksgiving in einem heruntergekommenen Schnellimbiss verbringen, da ein Wasserschaden Marins Kueche unter Wasser gesetzt hat. Voellig unerwartet taucht ploetzlich Sam, der Schneepflueger aus Elmo, auf und Jane ist ausser sich vor Freude. Als Marin sieht, wie verliebt sich die beiden kuessen, weiss sie ploetzlich, was sie zu tun hat...","torrent":{"xt":"urn:btih:76ca74aac0a708026ab77a1e59efa54bd4280887","amp;dn":"Men+in+Trees+S01E10+-+Heimweh+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76ca74aac0a708026ab77a1e59efa54bd4280887","infoHashBuffer":{"type":"Buffer","data":[118,202,116,170,192,167,8,2,106,183,122,30,89,239,165,75,212,40,8,135]},"announce":[],"urlList":[]}}