{"title":"This is the Sea 3 PAL.ISO","uid":4111480,"size":4681461760,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:76cb768fa73ffb3db96302bb44c8569ba6a1a59d&amp;dn=This+is+the+Sea+3+PAL.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kickdog","files":1,"time":1207081232,"description":"This is the Sea 3\n=================\n\nANTARCTICA (40 mins) - A dramatic tale of 3 Australians who paddle 800km down the Antarctic Peninsula. Andrew McAuley and team are trapped by moving ice, plagued by injuries &amp; encounter winds so strong that they fear for their lives. Equally terrifying, stunning and hilarious.\n\nSCOTTISH TIDAL RACES (15 mins) - Fantastic action including loops, swims, and sweet surfs on the meaty Falls of Lora.\n\nPAUL CAFFYN (15 mins) - A rare insight into the legendary expeditioner who has circumnavigated Australia, New Zeeland, Great Britain, Japan and Alaska.\n\nCHERI PERRY &amp; FREYA HOFFMEISTER (15 mins) - 2 of the worlds best Greenland style rollers share their philosophies. Clear underwater footage of Cheri performing many different rolls. Freya showing off her famous headstand and other tricks.\n\nTHE FAROE ISLANDS (25 mins) - Justine Curgenven's expedition to these stunning European islands. Gales break her tent, tidal races and fog challenges her on the water and local people invite her into their homes.\n\nSHETLAND (10 mins) - Birds and caves in the beautiful Shetland islands in northernmost Scotland. An open crossing in the thunder storm to remote Foula.\n\nNEW ZEELAND BEACH SURF - Great on-board footage of Steve Knowels ripping it up.\n\nDOUBLE TROUBLE (7 mins) - Some of Britain's best seakayakers try to transfer their skills to double seakayaks, with mixed results!\n\nSEAKAYAK CARTWHEEL - Got to be seen to be believed!\n","torrent":{"xt":"urn:btih:76cb768fa73ffb3db96302bb44c8569ba6a1a59d","amp;dn":"This+is+the+Sea+3+PAL.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76cb768fa73ffb3db96302bb44c8569ba6a1a59d","infoHashBuffer":{"type":"Buffer","data":[118,203,118,143,167,63,251,61,185,99,2,187,68,200,86,155,166,161,165,157]},"announce":[],"urlList":[]}}