{"title":"Under Construction  - The Wall Demo album","uid":3326809,"size":434442681,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7716d80545fa527303e56aa00fe9925528296e91&amp;dn=Under+Construction++-+The+Wall+Demo+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"floydianslip","files":39,"time":1115421083,"description":"Tracklist:\n01. In The Flesh\n02. The Thin Ice\n03. Another Brick In The Wall, Part I\n04. The Happiest Days Of Our Lives\n05. Another Brick In The Wall, Part II\n06. Mother\n07. Goodbye Blue Sky\n08. Empty Spaces, Part I\n09. Young Lust (instrumental)\n10. One Of My Turns\n11. Don't Leave Me Now\n12. Empty Spaces, Part II/What Shall We Do Now?\n13. Another Brick In The Wall, Part III\n14. Goodbye Cruel World\n15. Is There Anybody Out There? Part I\n16. Vera\n17. Bring The Boys Back Home\n18. Is There Anybody Out There? Part II\n19. Is There Anybody Out There? Part III\n20. Comfortably Numb\n21. Hey You\n22. The Show Much Go On\n23. In The Flesh\n24. Run Like Hell (instrumental)\n25. Waiting For The Worms\n26. Stop\n27. The Trial\n28. Outside The Wall\n\n\nPink Floyd's The Wall (1979) stands as one of Pink Floyd's greatest achievements, as well of one of the greatest achievements in rock music and live concert production. The album spawned a tour, a film, a book of the film (now quite collectible), and eventually an all-star revival concert in Berlin, and finally in 1999 a double live album.\n\nBut before The Wall was a film, a concert, or even an album, The Wall was just an idea... an idea under construction. The Wall went through at least two  stages. The first was a crude recording of Roger Waters strumming his guitar and singing alone. Presented by Waters at the same time as another concept called The Pros and Cons of Hitch Hiking, Waters' first demo - still uncirculated even today - was deemed unlistenable by the rest of the band, but they felt it had potential. The Hitchhiking demo was set aside, but The Wall demo was developed further.\n\nMany writing sessions later, Pink Floyd - probably with assistance from Bob Ezrin - recorded a second, more complete demo. The lyrics were not polished, and neither was the music. Thankfully, lyrics like I am a physician/ who can handle your condition/ like a magician; would be entirely discarded and rewritten before the songs were finally committed to tape in a studio, but the rough lyrics and the risky musical experiments which appeared in that second demo have finally made it to the public.\n\nThese demo tapes have circulated among just a very few collectors since about 1999. Now it is available for all fans. This recording presents the entire 'work in progress' in the best sonic quality available on CD.\n\nThis recording was produced by fans for fans and is strictly not for sale. Do not pay for this recording! Many fans will trade it to you for free. If you have the ability to burn CDRs, please feel free to distribute this recording to others who are interested.","torrent":{"xt":"urn:btih:7716d80545fa527303e56aa00fe9925528296e91","amp;dn":"Under+Construction++-+The+Wall+Demo+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7716d80545fa527303e56aa00fe9925528296e91","infoHashBuffer":{"type":"Buffer","data":[119,22,216,5,69,250,82,115,3,229,106,160,15,233,146,85,40,41,110,145]},"announce":[],"urlList":[]}}