{"title":"Tiny USB office","uid":4134666,"size":2500546,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:773b234ed77a578123b02190ef6d1481675003be&amp;dn=Tiny+USB+office&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oncommingstorm","files":1,"time":1208205246,"description":"Windows only. Tiny USB Office is freeware.\n\nIf your thumb drive is already scrimping for space, and you just want a few super-lightweight apps that can handle most general office tasks, from word processing and spreadsheets to email and file sharing, the Tiny USB Office might be for you. Weighing in at under 2.5 megabytes.\n\nTiny USB office is a portable productivity software suite which offers a collection of unique standalone free software applications. If you find yourself working on different machines and like the idea of having portable software that you can access hassle-free from any computer, then this is the package for you.\n\nWhether you need to create rich-text word processing documents, share files across multiple computers, transfer files, create MS Excel compatible spreadsheets, comma-delimited database files, email your contacts, talk to your friends or co-workers on MSN, create pdf files, or securely encrypt or delete files - this is the perfect software package for you! When it comes to portable productivity, Tiny USB Office offers you the biggest bang for your buck - all under 2.5 megabytes of space! Hope you find it useful.\n\nTiny USB Office features all of these programs, which are accessible with one click with the included Qsel portable program launcher software:\n\n* Database Creation - with CSVed\n* Data Encryption - with DScrypt\n* Email Client Software - with NPopUK\n* File Compression - with 100 Zipper\n* File Sharing - with HFS\n* File Transfer - with FTP Wanderer\n* Flowchart Creation - with EVE Vector Editor\n* MSN Messenger Client - with PixaMSN\n* Tree-Style Outliner Software - with Mempad\n* PDF Creation - with PDF Producer\n* Password Recovery - with XPass\n* Secure Deletion - with DSdel\n* Spreadsheet Creation - with Spread32\n* Text Editing - with TedNotepad\n* Word Processing - with Kpad\n* Program Launching - with Qsel\n\nTiny USB Office can do all this and more at under 2.5 megabytes!\n\nGiven the fact that Tiny USB Office is so small in size, this is definitely a software bundle worth having on your flash drive, or keeping around for a rainy day. Sure, it is not a replacement for your standard office business applications, but it is the perfect basic portable office solution for anyone who is on the road a lot, or who finds themselves working on different or older, sluggish PCs.\n","torrent":{"xt":"urn:btih:773b234ed77a578123b02190ef6d1481675003be","amp;dn":"Tiny+USB+office","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773b234ed77a578123b02190ef6d1481675003be","infoHashBuffer":{"type":"Buffer","data":[119,59,35,78,215,122,87,129,35,176,33,144,239,109,20,129,103,80,3,190]},"announce":[],"urlList":[]}}