{"title":"CRYSIS  - FULL WORKING GAME","uid":4247468,"size":6482196480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:77a4b628e268b7c3cd3532948c515ed15a096ff2&amp;dn=CRYSIS++-+FULL+WORKING+GAME&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"themadgam3r","files":1,"time":1213850448,"description":"Earth, 2019.\nAfter an asteroid strikes a remote archipelago, the North Korean Government quickly\nseals off the island chain, claiming the mysteries of the asteroid for themselves. The\nUnited States responds by dispatching an elite team of Delta Force Operators to recon\nthe situation and report back to the Pentagon. Amid rising tensions between the US\nand North Korea, the asteroid suddenly bursts open, revealing a massive, 2 km high\nalien ship. The ship generates an immense force sphere, freezing a vast portion of\nthe island and drastically altering the global weather system.\nThe invasion of Earth has begun.\n\nPlayers take the role of Jake Dunn though you are only referred to as NOMAD in the game,\na US Army Delta Force Soldier, sent into an island in the South China Sea to investigate\nthe disappearance of a US Archaeologists&amp;#039; team who went missing after uncovering a\nmysterious artifact.\n\nKey Features:\nA unique three-act structure forces the player to use real-time armor and weapons\ncustomization to adapt constantly to an ever-changing world.\nEncounter a frightening and totally original alien species: they use their senses\nintelligently and work together to present the most challenging enemy yet in an FPS.\nControl of a variety of land, sea, and air vehicles including trucks, tanks,\nboats, and helicopters.\nExplore a living, dynamic world where earthquakes, breaking ice, landslides, and\ntornados pose an ever-present threat.\n32-player multiplayer with real-time armor and weapons customization, plus an all-new\nmultiplayer mode that combines player modification and tactical objectives.\nEmergent gameplay means that in-game actions affect future outcomes and give each\nplayer a unique experience.\nHighly robust and easy-to-use mod toolset allows players to create their own expansive\nlevels for both multiplayer and single-player modes.\nThe CryENGINE 2 engine delivers the most realistic environments, spectacular special\neffects, physics game engine, lighting system, and enemy Al.\n\nWhat can i say, this is Crysis, arguably the #1 First Person Shooter out today, and probably ever.\nIt&amp;#039;s gonna take a really Major release to knock this king off it&amp;#039;s hill !!! (and it will probably be from Crytek!)\n\nCrysis\nDeveloper............: Crytek\nRelease Date.......: Nov. 13, 2007\nDiscs....................: 1\nSize......................: 6GB\nGame Type...........: FPS\nProtection............: SecuROM &amp; serial\nImage Type..........: iso\nFile Type...............: split rar 100MB\nInclusions.............: Razor 1911 XP &amp; Vista Cracks, Patch v1.1, Patch v1.2, ViTaLiTY Vista x64 Crack, Crysis User Manual PDF ","torrent":{"xt":"urn:btih:77a4b628e268b7c3cd3532948c515ed15a096ff2","amp;dn":"CRYSIS++-+FULL+WORKING+GAME","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77a4b628e268b7c3cd3532948c515ed15a096ff2","infoHashBuffer":{"type":"Buffer","data":[119,164,182,40,226,104,183,195,205,53,50,148,140,81,94,209,90,9,111,242]},"announce":[],"urlList":[]}}