{"title":"Dario Argento's Mother Trilogy","uid":4026451,"size":2612365036,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77bb2d5e5c870cb81b3d6b758e8b6b125dbfe7c4&amp;dn=Dario+Argento%5C%27s+Mother+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Bethlehelle","files":4,"time":1202940473,"description":"THE TRILOGY IS\n\nSuspiria is a 1977 Italian horror film directed by Dario Argento, and co-written by Argento and actress Daria Nicolodi, with whom Argento was romantically involved at the time. Nicolodi claims the plot was inspired by an experience of her grandmother&amp;#039;s. The setting was originally to be a children&amp;#039;s school, but was later changed to a dance school for older teens. Entertainment Weekly rated the film #18 in its top 25 scariest movies of all time and said it had &quot;the most vicious murder scene ever filmed.&quot; Suspiria is often considered Argento&amp;#039;s finest film and a classic of the horror genre.\nThis movie was number 24 on the cable channel Bravo&amp;#039;s list of the &quot;100 Scariest Movie Moments&quot;.\nSuspiria is the first film in a trilogy Argento refers to as &quot;The Three Mothers,&quot; about evil forces attempting to break through to the earth and wreak merciless havoc. Argento&amp;#039;s next film, Inferno (1980), was the second in the trilogy. The third film is The Mother of Tears.\n\n\nInferno is a 1980 Italian supernatural horror film written and directed by Dario Argento. The film stars Irene Miracle, Leigh McCloskey, Eleonora Giorgi, Daria Nicolodi, and Alida Valli. The cinematography was by Romano Albani, and Keith Emerson composed the film&amp;#039;s thunderous musical score. The convoluted story concerns a young man&amp;#039;s investigation into the disappearance of his sister, who had been living in a New York City apartment building that also served as a home for a powerful, centuries-old witch.\nA thematic sequel to Suspiria (1977), the film is the second part of Argento&amp;#039;s &quot;The Three Mothers Trilogy&quot;. The long-delayed concluding entry, The Mother of Tears, was released in 2007. All three films are partially derived from the concept of &quot;Our Ladies of Sorrow&quot; (Mater Lachrymarum, Mater Suspiriorum, and Mater Tenebrarum) originally devised by Thomas de Quincey in his book Suspiria de Profundis (1845).\nUnlike Suspiria, Inferno received a very limited theatrical release and the film was unable to match the box-office success of its predecessor. While the initial critical response to the film was mostly negative, its reputation has improved considerably over the years. Kim Newman has called it &quot;...perhaps the most underrated horror movie of the 1980?s.?[2] In 2005, the magazine Total Film named Inferno one of the 50 greatest horror films of all time.[3]\n\n\nThe Mother of Tears (La Terza madre, &quot;The Third Mother&quot; in Italian) is an Italian/American horror film and the concluding installment of Dario Argento&amp;#039;s supernatural horror trilogy The Three Mothers. The film depicts the confrontation with the final &quot;Mother&quot;, the witch known as Mater Lachrimarum.\nThe film has also been billed in English speaking media as Mater Lachrymarum, The Third Mother, and Mother of Tears: The Third Mother.\nThe Third Mother premiered at the Toronto International Film Festival on 6 September 2007, just moments before midnight and Argento&amp;#039;s 67th birthday (on the 7th).[1] The film debuted in Italy on 24 October 2007 at the Rome Film Fest.[2] Its Italian wide release occurred on 31 October 2007, Halloween.[3] In the United States, Myriad will release the film uncut in select cities in February of 2008.[4] The Weinstein Company will release the film on DVD later in 2008.\n\n\n\n\n###########################&lt;{0}&gt; Conspiratorrent &lt;{0}&gt;#############################","torrent":{"xt":"urn:btih:77bb2d5e5c870cb81b3d6b758e8b6b125dbfe7c4","amp;dn":"Dario+Argento%5C%27s+Mother+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77bb2d5e5c870cb81b3d6b758e8b6b125dbfe7c4","infoHashBuffer":{"type":"Buffer","data":[119,187,45,94,92,135,12,184,27,61,107,117,142,139,107,18,93,191,231,196]},"announce":[],"urlList":[]}}