{"title":"Leisure Suit Larry 7 - Love For Sail","uid":3226460,"size":745488407,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:78191278b3b905af9dd7987da5b9bd3fcf6b5f95&amp;dn=Leisure+Suit+Larry+7+-+Love+For+Sail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rooban","files":4,"time":1090444145,"description":"&lt;img src=&quot;http://www.cdaccess.com/gifs/shared/front/large/larry7.gif&quot;&gt;\n\nLarry's libido is put to the test yet again in Leisure Suit Larry 7: Love For Sail! - the latest in Sierra's swinging series. Who knew you could stick so many sexual innuendoes on one CD-ROM? This time Larry is the happy captive on a cruise. Clever little remarks like &quot;Leisure Suit Larry fills his rubber dingy with sea men,&quot; fill the disc. Raunchy, yes. Funny? Not for long. Unless you're the proud owner of the Three's Company box set, this game will likely get old quick. And the gameplay? There's nothing new to see. \n\n\nAfter escaping a house fire and the fiery clutches of Larry's vindictive girlfriend, the great polyestered one takes to the seas. Impossibly voluptuous creatures like Captain Thygh, Dewmi Moore, and Wydoncha and Nailmi Jugg prance around the ship, and your job is to have your way with them. But it doesn't come easy. You have to employ exactly the right moves and grooves to score. The biggest difference between the latest Larry incarnation and more recent chapters is that Love for Sail! borrows from the old days of the game series. You can interact with other characters by picking from a list of dialog options, or you can use the classic text interface. In fact, you won't solve many of the scenes without using the text interface, which helps to keep things challenging. \n\n\nIf things get too challenging, wait around and you'll hear audio clues. But you probably won't need much help at all. There are hours of senseless rhetoric, ranging from the mildly amusing to the downright disgusting. Little tricks like a scratch and sniff game (a device taken straight from the Infocom classic Leather Goddesses of Phobos) and a raunchy take off of Where's Waldo are amusing and help give the game a little more staying power. But once the initial joke wears thin, you're basically done. You will probably be more amused coming up with dirty knock-knock jokes.\n\n\n","torrent":{"xt":"urn:btih:78191278b3b905af9dd7987da5b9bd3fcf6b5f95","amp;dn":"Leisure+Suit+Larry+7+-+Love+For+Sail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78191278b3b905af9dd7987da5b9bd3fcf6b5f95","infoHashBuffer":{"type":"Buffer","data":[120,25,18,120,179,185,5,175,157,215,152,125,165,185,189,63,207,107,95,149]},"announce":[],"urlList":[]}}