{"title":"Claude Reboul - L'Organiste Barbare [1999] French organ g","uid":4160207,"size":54909184,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78f1e57019babedf8b706113bd7bde6abde8b0d1&amp;dn=Claude+Reboul+-+L%5C%27Organiste+Barbare+%5B1999%5D+French+organ+g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"john111111111111111111111","files":14,"time":1209336132,"description":"CD from the French organ grinder Claude Reboul. I bought this CD from him as he was playing outside the Pompidou Centre in Paris in 1999. I can&amp;#039;t find any info on him on the internet, but I like listening to his music. Here&amp;#039;s some more info about organ grinders. And yes, he did have a monkey :-)\n\nThe organ grinder was a musical novelty street performer of the 19th century and the early part of the 20th century, and refers to the operator of a street organ.\n\nPeriod literature often represents the grinder as a gentleman of ill repute or as an unfortunate representative of the lower classes. Newspaper reporters would sometimes describe them cynically or jocularly as minor extortionists who were paid to keep silent, given the repetitious nature of the music. Later depictions would stress the romantic or picturesque aspects of the activity. Whereas some organ grinders were itinerants or vagabonds, many were recent immigrants who chose to be street performers in order to support their families. Those who actually owned their barrel organs were more likely to take care of them and pursue the &quot;profession&quot; more seriously. A few organ grinders still remain, perhaps most famously Joe Bush in the United States.\n\nExceptionally, the grinder could be a woman, or small child, cranking away on a smaller organ or on a large organ mounted on a pushcart that was sometimes pulled by a donkey. More often than not the grinder was a man, bearing a medium sized barrel organ held in front of him and supported by a hinged or removable wooden stick or leg that was strapped to the back of the organ. The strap around his neck would balance the organ, leaving one hand free to turn the crank and the other to steady the organ. A tin cup on top of the organ or in the hand of a companion (or an animal) was used to solicit payments for his performance. There was an endless variation in the size of the organ. The size varied from a small organ with only 20 notes weighing only 18 pounds to a huge barrel organ with hundreds of pipes weighing several hundred pounds. Larger organs were usually mounted on a cart, although organ grinders were known to carry an instrument weighing over 100 pounds. The most elaborate organs could even have mechanical figures or automata mounted on top of or in the front of the case.","torrent":{"xt":"urn:btih:78f1e57019babedf8b706113bd7bde6abde8b0d1","amp;dn":"Claude+Reboul+-+L%5C%27Organiste+Barbare+%5B1999%5D+French+organ+g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78f1e57019babedf8b706113bd7bde6abde8b0d1","infoHashBuffer":{"type":"Buffer","data":[120,241,229,112,25,186,190,223,139,112,97,19,189,123,222,106,189,232,176,209]},"announce":[],"urlList":[]}}