{"title":"Aravind Eye Care - Infinite Vision - Documentary","uid":4137655,"size":255563774,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7b324e8a5623379c9602291a1091ed955f1c717b&amp;dn=Aravind+Eye+Care+-+Infinite+Vision+-+Documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"itsnikki123","files":1,"time":1208342169,"description":"Infinite Vision is the story of Dr V(enkataswamy), the legendary eye surgeon from South India who made it his mission to restore sight to the blind and whose work has resulted in one of the world&amp;#039;s most extraordinary models of service delivery.\n\nIn a little over 25 years Dr V and his team have turned what started out as an 11-bed eye clinic in an old temple-city into the largest and most productive eye care facility in the world. Taking its compassionate services to the doorstep of rural India, Aravind&amp;#039;s stunningly effective strategies vault barriers of distance, poverty and ignorance have created a self-sustaining system that now treats over 1.4 million patients each year, two-thirds of them, for free.\n\nToday the Aravind Eye Care System is an international resource and training center that is revolutionizing hundreds of eye care programs in developing countries.\n\nThrough interviews with patients, doctors, students, admirers, and 85 year old Dr. V himself, Infinite Vision follows the inspiring life of this unlikely hero, from his childhood in a farmer&amp;#039;s family through his years as a young surgeon struggling with a crippling illness onto his pioneering efforts to eliminate needless blindness.\n\nThe film looks at the forces and ideals that shaped and guided his life and work, through the teachings of Mahatma Gandhi and the spiritual teacher Sri Aurobindo and traces the ever widening sphere of his influence as he lived these teachings drawing first his family, later other health workers and today thousands of people from different disciplines all over the world, to both his inner and outer missions.\n\nDirected by a first-time filmmaker from India, shot and edited by a communications student from the United States, and supported by several other volunteers from both sides of the world who believed in its subject, this 35-minute film explores the unique perspective and practices of a humble man who dreamed of combining spiritual aspirations and service to humanity with the best of modern-day management systems and technology, and who then went on to live that dream with unprecedented results.\n\n&quot;In the world of blindness he has performed a miracle&quot;\n- Ram Dass, author  &quot;Be Here Now&quot;\n\n\nMore Info : http://en.wikipedia.org/wiki/Aravind_Eye_Hospital\t","torrent":{"xt":"urn:btih:7b324e8a5623379c9602291a1091ed955f1c717b","amp;dn":"Aravind+Eye+Care+-+Infinite+Vision+-+Documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b324e8a5623379c9602291a1091ed955f1c717b","infoHashBuffer":{"type":"Buffer","data":[123,50,78,138,86,35,55,156,150,2,41,26,16,145,237,149,95,28,113,123]},"announce":[],"urlList":[]}}