{"title":"Cucusoft Ultimate DVD + Video Converter Suite","uid":4272640,"size":9299832,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7b7484ae26e26a83e67799a6f19ca16f896c00da&amp;dn=Cucusoft+Ultimate+DVD+%2B+Video+Converter+Suite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"echris03","files":1,"time":1215019119,"description":"Cucusoft Ultimate DVD + Video Converter Suite converts DVD&amp;#039;s and videos to play on almost any portable device including iPod, iPod touch, iPod video nano, iPhone, Zune, PSP, video capable MP3 players, video capable mobile phones, and Pocket P.C., etc. Meanwhile, it can also support output almost any audio/video format including Video format(H264, MP4, WMV, AVI, MOV, RM, 3GP, flv, SWF, mpeg-1, mpeg-2, VCD, SVCD, DVD, etc.) and Audio format(AC3, AAC, MP2, MP3, MP4, RA, WMA, etc.). You can enjoy your Audio/Video life with this all in one Ultimate DVD + Video Converter Suite from now on.\n\nThe latest version includes three running modes, the first is &quot;Direct Mode&quot;, the second is &quot;Batch Mode&quot; and the last one is &quot;1 Click Mode&quot;.\n--&quot;Direct Mode&quot; means that user can directly click the DVD Menu to select the movie they want to rip. This mode is very easy for ripping a movie DVD&amp;#039;s.\n--&quot;Batch Mode&quot; means that user can select the DVD titles/chapters they want to rip via checkbox list. This mode is very easy for batch ripping Music DVD&amp;#039;s, MTV DVD&amp;#039;s and Episodic DVD&amp;#039;s.\n--&quot;1 Click Mode&quot; means that user just clicks 1 click to open a DVD, then the rest task will be done automatically. This mode is designed for dummies. (New)\nSupport for Subtitle Selection, eg. English Subtitle, French Subtitle ....\n--Under &quot;Direct Mode&quot;, through DVD menu.\n--Under &quot;Batch Mode&quot;, through DVD Title list.\n\nSupport for Audio Track Selection, eg. English audio track, French audio track.....\n--Under &quot;Direct Mode&quot;, through DVD menu.\n--Under &quot;Batch Mode&quot;, through DVD Title list.\nVarious kinds of video crop mode. eg. 16:9, 4:3, full screen and so on.\nSupport almost any video file as input, including DVD, vob, DivX, XviD, MOV, rm, rmvb, MPEG, WMV, AVI, dvr-ms, MP4, TiVo, .mkv etc. to iPod video format.\nVarious kinds of video resize mode, eg. &quot;Keep aspect ratio&quot; and &quot;stretch to fix screen&quot;.\nSupport splitting output video by DVD chapters, and titles. Fully support MTV DVDs and Episodic DVDs.\nSupport customize output video file size and video quality.\nProvide flexible output profiles, user can easily customize the video properties.\nSupport Dolby, DTS Surround audio track.\nSupport convert DVDs/Video to any audio format, including AC3, AAC, MP2, MP3, MP4, RA, WMA, etc.\nSupport convert DVDs/Video to any video format, including H264, MP4, WMV, AVI, MOV, RM, 3GP, flv, SWF, mpeg1, mpeg2, VideoCD, SuperVideoCD, DVD, etc.\nSupport convert DVDs/Video to any (portable) device including iPods(iPod video, iPod touch, iPod video nano), Zune, PSP, iPhone, Apple TV, PPC, PDA, PS2, PS3, Xbox, Xbox 360, etc.\nSupport customize your own (new) device profiles. ","torrent":{"xt":"urn:btih:7b7484ae26e26a83e67799a6f19ca16f896c00da","amp;dn":"Cucusoft+Ultimate+DVD+%2B+Video+Converter+Suite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b7484ae26e26a83e67799a6f19ca16f896c00da","infoHashBuffer":{"type":"Buffer","data":[123,116,132,174,38,226,106,131,230,119,153,166,241,156,161,111,137,108,0,218]},"announce":[],"urlList":[]}}