{"title":"Cabelas Deer Hunt 2005 Season USA XBOX-GLoBAL","uid":3238031,"size":786858750,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:7b93caef9a691d92532403a61aefffffb138dbe9&amp;dn=Cabelas+Deer+Hunt+2005+Season+USA+XBOX-GLoBAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"djfrazz","files":19,"time":1094896974,"description":"Raising the barrel for the hunting console genre, &amp;quot;Cabela's(R) Deer Hunt 2005 Season&amp;quot; is much more than a sequel. With 18 all new missions, private game ranches and clay and skeet shooting for the first time ever, players will experience realism like never before. Exotic species, branded animal calls, all new deer modeling and action-packed missions will allow players to feel even closer to the action. The game is currently available in North American retail stores and all versions carry a &amp;quot;T&amp;quot; for &amp;quot;Teen&amp;quot; rating from the ESRB. \n\n&amp;quot;Cabela's is the world's number one hunting brand, and we wanted to take players deeper into the hunt,&amp;quot; says Patrick Kelly, Vice President of Studios, Activision Value Publishing, Inc. &amp;quot;We have created a new standard of realism using advanced technology to make the player feel like he or she is deep in the woods and face to face with the prey.&amp;quot; \n\nIn &amp;quot;Cabela's Deer Hunt 2005 Season,&amp;quot; destinations include new private game ranches, each with distinct terrain, and three all new never-before-sought-after genetic anomalies; Piebald, Albino and Melanistic species. Players can choose from thousands of authentic Cabela's gear options and four unique vehicle types with advanced physics, and monitor their strength and well being throughout their adventure. For the first time ever players will get to experience Trap, Skeet and Sporting Clay shooting. Just like the real thing, real-life rules and regulations apply and are enforced, if an illegal or unethical hunting act is performed, a player will be disciplined. \n\n&amp;quot;Cabela's(R) Deer Hunt 2005 Season&amp;quot; features two gameplay modes, &amp;quot;Career Hunt&amp;quot; and &amp;quot;Quick Hunt.&amp;quot; &amp;quot;Career Hunt'&amp;quot; allows a player the ability to unlock levels, items, missions and clay shooting mini-games. &amp;quot;Quick Hunt,&amp;quot; provides the player instant action and gratification\n","torrent":{"xt":"urn:btih:7b93caef9a691d92532403a61aefffffb138dbe9","amp;dn":"Cabelas+Deer+Hunt+2005+Season+USA+XBOX-GLoBAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b93caef9a691d92532403a61aefffffb138dbe9","infoHashBuffer":{"type":"Buffer","data":[123,147,202,239,154,105,29,146,83,36,3,166,26,239,255,255,177,56,219,233]},"announce":[],"urlList":[]}}