{"title":"Melencolia Estatica (2008) - Letum (V0) *Italian BM*","uid":4270721,"size":81213275,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7be107d0add9642632f787c49e0505781704297d&amp;dn=Melencolia+Estatica+%282008%29+-+Letum+%28V0%29+%2AItalian+BM%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoltaXebec1968","files":8,"time":1214927745,"description":"1.\tLetum I\t09:13\t\n2.\tLetum II\t06:44\t\n3.\tLetum III\t08:14\t\n4.\tLetum IV\t06:38\t\n5.\tLetum V\t06:40\t\nTotal playing time\t37:29\n\nReview from vampire-magazine.com\n\n&quot;Letum&quot; is the second full-length release from Italian melodic miserablists Melencolia Estatica, the creative force behind which is Absentia Lunae guitarist Climaxia (stop sniggering at the back). Like ME&amp;#039;s eponymous 2006 debut, &quot;Letum&quot;, meaning &amp;#039;death&amp;#039;, is aptly described by the band&amp;#039;s moniker, as it pitches between emotional highs and lows, packing in abundant mournful passion.\n\nFeeling and melancholy may be the order of the day, but Melencolia Estatica aren&amp;#039;t some lame goth band. For a start, vocalist Solitudo has an extremely harsh style, barely intelligible up until &quot;Letum III&quot;, at which point he lapses into a spitting, aggressive spoken word, sounding all the more evil for being in the native tongue. A lot of the guitar work on &quot;Letum&quot; has a vintage feel, with directional switches straight out of the 90s textbooks and a lot of lonely, reverberating leads lending a grim and malignant tone.\n\nThe foundation, therefore, is classic, grim and under-polished, with a lot of aggressive pacing and intensity, but layered over this are the epic, melodic, delicate features that give Melencolia Estatica their true character. The contrast heightens the effect nicely, especially on &quot;Letum II&quot; where the busy guitars and crashing toms of the opening juxtapose sweetly against a more modern, depressive-sounding emphasis on drama and unabashed sadness. &quot;Letum V&quot; is another good example of Melencolia&amp;#039;s grown-up structuring and cohesive style, and begins with a particularly powerful, rolling, layered opening which will stay embedded in the mind.\n\nIn all, &quot;Letum&quot; is a firm stepping stone from Melencolia Estatica&amp;#039;s debut. The song writing has progressed, and where performance or production are occasionally sloppy, the ideas are fresh and sharp. Repetition is part of the mournful atmosphere, but avoids becoming boring. Shades of ME&amp;#039;s stated influences- early Katatonia and Agalloch- can be caught if your ears are good, along with the slabs of sound crafted by Ulver, as well as the more recent, depressive sound which finds so many proponents in Scandinavia and North America. Familiar but interesting for its beauty, &quot;Letum&quot; is something for the mournful and the melodic amongst you to explore.\n\nEAC Lame 3.97 v0 VBR with log","torrent":{"xt":"urn:btih:7be107d0add9642632f787c49e0505781704297d","amp;dn":"Melencolia+Estatica+%282008%29+-+Letum+%28V0%29+%2AItalian+BM%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7be107d0add9642632f787c49e0505781704297d","infoHashBuffer":{"type":"Buffer","data":[123,225,7,208,173,217,100,38,50,247,135,196,158,5,5,120,23,4,41,125]},"announce":[],"urlList":[]}}