{"title":"Torrent Pack","uid":4030035,"size":26022856,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c767a37fbee11a90fa1b417ad014ed710bca2a3&amp;dn=Torrent+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aldenray","files":1,"time":1203123978,"description":"Limewire Pro 4.16.2\n\nLimeWire is a fast, easy-to-use file sharing program that contains no spyware, adware or other bundled software. Compatible with all major platforms and running over the Gnutella network.\n\nAzureus\n\nAzureus is a easy-to-use Java BitTorrent client, with support for 27 languages. Azureus connects to the BitTorrent network. BitTorrent is a peer-to-peer protocol designed to transfer files. Users connect directly to send and receive portions of a file, while a central tracker coordinates the action of all peers and manages connections without knowledge of the contents of the files being distributed. With BitTorrent, users upload at the same time they download, so network bandwidth is managed as efficiently as possible. BitTorrent is designed to work better than other file-transfer protocols as the number of people interested in a certain file increases.\n\nBitcomet\n\nBitComet is a fast and easy-to-use BitTorrent/HTTP/FTP download client. It is P2P file-sharing freeware and one of the most popular P2P protocols designed for high-speed distribution. BitComet supports simultaneous downloads, DHT networks (trackerless), a download queue, selected downloads in the Torrent package, fast-resume, disk caching, speed limits, auto port mapping, proxies, and IP filtering.\n\nUtorrent\n\nuTorrent is a powerful and efficient BitTorrent client for Windows. Most of the features present in other BitTorrent clients are present in uTorrent, including bandwidth prioritization, scheduling, RSS auto-downloading, and Mainline DHT. Additionally, uTorrent supports the protocol encryption joint specification and peer exchange. Unlike many torrent clients, it does not hog valuable system resources--typically using less than 6MB of memory, allowing you to use the computer as if it weren\\&amp;#039;t there at all.\n\nFrostwire 4.13.4\n\nFrostWire is a fork of the very popular LimeWire PRO Gnutella/Bittorrent client. The purpose of FrostWire is to keep and maintain the freedoms that LimeWire LLC may be forced to withdraw. Share any type of file on Gnutella and the Bittorrent network. Version 4.13.4 improves connection bootstrapping.\n\nBitLord\n\nBitLord is a p2p file-sharing program fully compatible with .torrent files, which is one of the most popular p2p protocol designed for high-speed distribution of 100MB or GB-sized files. BitLord supports simultaneous downloads, download queue, selected downloads in torrent package, fast-resume, chatting, disk cache, speed limits, port mapping, proxy, and IP-filter.\n\n\n\nNo Virus, Spyware, or adware.\nScanned with AVG, Symantec AntiVirus, and Spybot SD Resident.","torrent":{"xt":"urn:btih:7c767a37fbee11a90fa1b417ad014ed710bca2a3","amp;dn":"Torrent+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c767a37fbee11a90fa1b417ad014ed710bca2a3","infoHashBuffer":{"type":"Buffer","data":[124,118,122,55,251,238,17,169,15,161,180,23,173,1,78,215,16,188,162,163]},"announce":[],"urlList":[]}}