{"title":"Raxco DiskState 2.86 *retail*","uid":3347175,"size":1484240,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d677b7947dc2b2a75d08a8441110902289a530e&amp;dn=Raxco+DiskState+2.86+%2Aretail%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toolboy","files":1,"time":1119392477,"description":"\nDiskStateâ„¢ is a powerful disk analysis tool that allows you to browse through your disk space to find out total, used and free space and file system info on your drives. Get detailed info on the biggest folders on selected volume. Eliminate wasted disk space by deleting old and temporary files at your command or on a schedule. In addition, get a complete listing of duplicate files over all your drives using a powerful 128-bit MD5 signature to ensure that files actually are equal.\n\nCapture disk states, generate reports, schedule a deletion engine, and even extract boot blocks for multiboot and other system tools. DiskState's charting capabilities presents information so that it can quickly and easily be analyzed and interpreted.\n\nFeatures:\n\n    *  Complete overview of disk space usage - Browse through your disk space to find out total, used and free space and file system on your drives. Data is continuously updated and summarized.\n    * Administer disk space - Get detailed info on the biggest folders on selected volume. Fast and efficient browsing through folders.\n    * Eliminate wasted disk space - Free up that precious disk space by deleting old or temporary files.\n    * Find duplicate files - Get a complete listing of duplicate files on all your drives. DiskState doesn't rely on just the file name to detect duplicate files, it also uses 128-bit MD5 signatures to ensure that files are truly duplicates.\n","torrent":{"xt":"urn:btih:7d677b7947dc2b2a75d08a8441110902289a530e","amp;dn":"Raxco+DiskState+2.86+%2Aretail%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d677b7947dc2b2a75d08a8441110902289a530e","infoHashBuffer":{"type":"Buffer","data":[125,103,123,121,71,220,43,42,117,208,138,132,65,17,9,2,40,154,83,14]},"announce":[],"urlList":[]}}