{"title":"No quarter (Jimmy Page, Robert Plant) - Unledded","uid":4053868,"size":7681951744,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7d6788a7dc941612e3f85d39435ca15d50c6eeb4&amp;dn=No+quarter+%28Jimmy+Page%2C+Robert+Plant%29+-+Unledded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"niunclavel","files":20,"time":1204279638,"description":"Amazon.co.uk Review\nDecades after the death of drummer John Bonham and, for all intents and purposes, the demise of the group, Led Zeppelin&amp;#039;s popularity continues unabated--and why not, as long as they keep coming up with offerings as worthy as No Quarter: Jimmy Page &amp; Robert Plant Unledded. Originally released on CD in 1994 and then in a remastered version simultaneously with this DVD, the 115-minute program (including bonus footage) was recorded on a London soundstage, in the hills of Snowdonia, Wales, and outdoors in Marrakech, Morocco. It finds guitarist Page, vocalist Plant, and an array of other musicians performing some new material, but for the most part, the repertoire focuses on their Led Zep legacy--not a surprise, considering that what they did together in that group was better than anything they&amp;#039;ve done separately, including some pretty good Plant solo efforts and Page&amp;#039;s regrettable stint as a member of the Firm. Yet instead of simply parroting their Zeppelin period (and relying on tired warhorses like &quot;Stairway to Heaven&quot; and &quot;Whole Lotta Love&quot;), they&amp;#039;ve given the music new life, adding exotic instruments like the bodhran (an Irish drum) and the hurdy-gurdy (played by cranking a rosined wheel against a set of strings) to less familiar fare like &quot;The Battle of Evermore&quot; and &quot;Gallows Pole.&quot; Add to that three brilliant new songs performed with a quartet of Moroccan players, a full complement of strings from the London Metropolitan Orchestra (on &quot;Since I&amp;#039;ve Been Loving You&quot; and others), and a host of Egyptian percussion and strings on an epic version of &quot;Kashmir&quot; (also from the London session), and you&amp;#039;ve got a world music blend that is at times genuinely thrilling--especially for those with 5.1 Surround Sound capability. --Sam Graham\n\nSpecial Features\n- &quot;Black Dog&quot; live at the American Music Awards - &quot;Most High&quot; bonus video - Interview - Montage footage from Morocco\n\n\n1.- No Quarter  \n2.- Thank You  \n3.- What is And What Should Never Be \n4.- The Battle Of Evermore  \n5.- Gallows Pole  \n6.- Nobody&amp;#039;s Fault But Mine \n7.- City Don&amp;#039;t Cry  \n8.- The Truth Explodes \n9.- Wah Wah  \n10.- When The Levee Breaks  \n11.- Wonderful One  \n12.- Since I&amp;#039;ve Been Loving You \n13.- The Rain Song  \n14.- That&amp;#039;s The Way  \n15.- Four Sticks  \n16.- Friends  \n17.- Kashmir  \n\nDD 5.1, DTS, DD 2.0\n4:3\nPPPPPPPPPPPPPPPPPPPPPPPPPPPPPAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAALLLLLLLLLLLLLLLLLLL\n\nsubt.:english,deutsch,nederlands,francais,italiano,espaÃƒÂ±ol, portugues","torrent":{"xt":"urn:btih:7d6788a7dc941612e3f85d39435ca15d50c6eeb4","amp;dn":"No+quarter+%28Jimmy+Page%2C+Robert+Plant%29+-+Unledded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d6788a7dc941612e3f85d39435ca15d50c6eeb4","infoHashBuffer":{"type":"Buffer","data":[125,103,136,167,220,148,22,18,227,248,93,57,67,92,161,93,80,198,238,180]},"announce":[],"urlList":[]}}