{"title":"BBC.Timewatch.2006.The.Battle.of.the.River.Plate.DVB.Xvid.mp3.g6","uid":4101533,"size":782157824,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e7803d68ea2d7b28837bff9885c25dd56d02f00&amp;dn=BBC.Timewatch.2006.The.Battle.of.the.River.Plate.DVB.Xvid.mp3.g6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":9,"uploader":"gavin63","files":1,"time":1206605091,"description":"On December 13th 1939, the first great naval battle of World War Two exploded into action off the coast of South America. Against overwhelming firepower, three British ships took on the pride of the German fleet, the pocket battleship Admiral Graf Spee.\n\nIt would become known as the battle of the River Plate and pit two great naval officers against each other in a deadly duel. The Graf Spee was commanded by Captain Hans Langsdorff, a decorated hero from the First World War. Facing him was Commodore Henry Harwood, a brilliant naval tactician.\n\nA deadly game of cat and mouse at sea, culminated in a bloody naval fight. As the world watched, the battle moved ashore in a gripping story of deception, and one of the biggest bluffs of the Second World War.\n\nBy the end of this story, one of the two captains would be declared a hero, the other branded a coward and lose his ship, his reputation and eventually his life.\n\nThe Battle of the River Plate tells the full story of this epic battle through the families and crews of the two commanders. Exclusive access to the personal archives of the two captains and interviews with their children bring a new understanding of the men behind the uniforms. Interviewed for the first time on television, Captain Langsdorff daughter gives a unique insight into Langsdorff the man and reads from his poignant final letter home. Even her children have never seen this letter which she has kept hidden away for 66 years.\n\nCommodore Harwood&amp;#039;s two sons bring a personal understanding of their father&amp;#039;s motivation and character. There are hitherto unseen home movies and footage shot by the Commodore himself whilst on patrol in the South Atlantic, and his letters home written during the battle.\n\nSurvivors from both sides give powerful personal accounts describing the terror of the battle and its bloody aftermath Dr Eric Grove - eminent naval historian and author of a recent definitive history of the battle, re-examines how the cat and mouse battle at sea turned into an intriguing cloak and dagger battle of wits ashore, culminating in the first great media event of the war. \n\n\n\n\n[b]Technical Specs[/b]\n\n[i]Video Codec:[/i] XviD MPEG-4 codec\n[i]Video Bitrate:[/i] 2021 KB/s\n[i]Video Aspect Ratio:[/i] 16:9\n[i]Video Resolution:[/i] 704 x 400\n[i]Audio Codec:[/i] MPEG-1 Audio layer 3 (mp3)\n[i]Audio BitRate:[/i] 160 KB/s (CBR)\n[i]Audio Channels:[/i] 2 Ch\n[i]RunTime:[/i] 47mn 36s\n[i]Framerate[/i]: 25 FPS\n[i]Number Of Parts:[/i] 1\n[i]Part Size:[/i] 746 MB\n[i]Encoded by:[/i] [b]gavin63[/b]\n\n","torrent":{"xt":"urn:btih:7e7803d68ea2d7b28837bff9885c25dd56d02f00","amp;dn":"BBC.Timewatch.2006.The.Battle.of.the.River.Plate.DVB.Xvid.mp3.g6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e7803d68ea2d7b28837bff9885c25dd56d02f00","infoHashBuffer":{"type":"Buffer","data":[126,120,3,214,142,162,215,178,136,55,191,249,136,92,37,221,86,208,47,0]},"announce":[],"urlList":[]}}