{"title":"12 OCLOCK HIGH 212-213 [retr?tv] ","uid":4052179,"size":730957871,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ef012fac673d62f719fe870e26b8d7564947a04&amp;dn=12+OCLOCK+HIGH+212-213+%5Bretr%3Ftv%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":3,"time":1204216191,"description":"12 O&amp;#039;CLOCK HIGH\n\n212. We&amp;#039;re Not Coming Back   11/29/1965  \nThe start of the Shuttle raid Gallagher briefs his crew . They will be bombing Wessellhafen then flying into North Africa, refueling, bombing a target in France, &amp; then returning. Over Wellhausen, Oberst Falkenstein leads a training group to attack the formation. Gallagher is forced to land in Yugoslavia. Captain Lowell is wounded. \n  Guest star: Seymour Cassel (Captain Johnson) , Ina Balin (Mara Vellich), George Voskovec (Nicolas Vellich), John Hoyt (General von Leyden), Gunnar Hellstrom (Colonel Falkenstein), William Arvin (Capt. Lowell)\n\n213. The Jones Boys   12/6/1965 \nOff the base, Jaydee Jones is working up the nerve to go on his next mission. He gets Lt Jan Warner to sneak him back on base. He gets spotted by Chapman who is stealing pistols to sell . JayDee&amp;#039;s older brother Frank talks to him and tells him to straighten up. JayDee says he has had enough, he wants out. Jones &amp; Chapman make briefing at 04:30. On takeoff Jaydee over-revs engines, and they don&amp;#039;t have enough speed to take off, his co-pilot tries to help but the plane flips over killing the bombardier and badly injuring the co-pilot who dies later. Frank covers for his brother and says it could be a maintenance problem. Colonel Hunter the Wing G-4 (Supply) comes to investigate. Chapman sells his pistols to an Englishman who gets caught. Captain Mason from CIC comes to investigate the stolen guns. Jones co-pilot dies. Chapman &amp; JD talk, Chapman says he will back Jones up. Hunter &amp; Gallagher interrogate JayDee Jones, Frank Jones &amp; Chapman. Chapman backs Jones who still can not remember what really happened.\n  Guest star: Andrew Prine (Lieutenant Jaydee Jones), Bruce Dern (Technical Sergeant Frank Jones), Burt Reynolds (Technical Sergeant Chapman), Peter Mark Richman (Colonel Kendall Hunter), Susan Seaforth Hayes (Lieutenant Warner)\n\nXviD/640x480/47min\n\nLeave a comment if you&amp;#039;d like me to continue this series. :)","torrent":{"xt":"urn:btih:7ef012fac673d62f719fe870e26b8d7564947a04","amp;dn":"12+OCLOCK+HIGH+212-213+%5Bretr%3Ftv%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef012fac673d62f719fe870e26b8d7564947a04","infoHashBuffer":{"type":"Buffer","data":[126,240,18,250,198,115,214,47,113,159,232,112,226,107,141,117,100,148,122,4]},"announce":[],"urlList":[]}}