{"title":"Peep.Show.1965.J.X.Williams.[Goetterstum.DivX].avi","uid":3346743,"size":349862698,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7fd88bde7429fb0ab3e0e5c85ded7b08bf76e746&amp;dn=Peep.Show.1965.J.X.Williams.%5BGoetterstum.DivX%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fudoh","files":1,"time":1119284599,"description":"Peep Show by J. X. Williams from 1965. ripped from VOD divx source. b/w, divx6, 352x288, 333mb. \n\nPLOT DESCRIPTION \nA secret history of crime, politics, and entertainment is played out in the back of a car in this long-lost exploitation feature restored for reissue by Noel Lawrence. In Chicago in 1961, a cab driver picks up a fare only to discover that his passenger is holding a gun and a large wad of cash. The driver is convinced something is up, and he's right, but it's not what he expects. As the taxi cruises the streets, the passenger tells a long and convoluted story about his career as a gunman and go-fer for Mafia kingpin Sam Giancana, including tales of controlling unions, rigging elections, procuring abortions, distributing stag movies, turning strippers into international spies, and trying to get Frank Sinatra hooked on dope. Giancana has some incriminating photos of J. Edgar Hoover which keep the feds off his back, but just how long can Giancana and his crew stand up to Bobby Kennedy's Justice Department? Peep Show was written and directed by J.X. Williams, an obscure exploitation filmmaker whose career took him from directing stag loops to creating bizarre left-wing horror flicks...or at least that's what filmmaker and cinema historian Noel Lawrence tells us; Lawrence appears to be the only person who has actually spoken with the reclusive Williams or documented his long and unusual career in film, leading some to speculate that J.X. Williams is a fictional creation, a charge Lawrence flatly denies. ~ Mark Deming, All Movie Guide \n\ninfo: http://www.othercinema.com/otherzine/otherzine6/peepshwrevw.html \n\nhttp://www.corkfilmfest.org/2004/programme04/peep.html","torrent":{"xt":"urn:btih:7fd88bde7429fb0ab3e0e5c85ded7b08bf76e746","amp;dn":"Peep.Show.1965.J.X.Williams.%5BGoetterstum.DivX%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd88bde7429fb0ab3e0e5c85ded7b08bf76e746","infoHashBuffer":{"type":"Buffer","data":[127,216,139,222,116,41,251,10,179,224,229,200,93,237,123,8,191,118,231,70]},"announce":[],"urlList":[]}}