{"title":"Operation Blackjack- winter soldier- activist IDM-Iraq war-320kp","uid":4280539,"size":10714620,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:800c3b6f2a45b06949eb9ecbf1da51f24bd7c8dc&amp;dn=Operation+Blackjack-+winter+soldier-+activist+IDM-Iraq+war-320kp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sabotsabot","files":1,"time":1215395812,"description":"So, this all started when I watched/listened to a great deal of testimony from the ?winter soldier? conference that transpired recently on the east coast.. I was moved to sadness, not only by the testimony offered, but also by the all-but-ZERO coverage this conference and these brave soldiers got from the mainstream media.\n\nSo here is some of my coverage.. hopefully with more to follow for as long as we all have electricity. (not long?)\n\nI am drawing influence from a number of artist? these days, autechre and aphex twin.. but back in the day skinny puppy and front 242. (both had a journalistic/activism bent that DID reach me as a young person.)\nThere are some ?sampled? bits of testimony, but also some longer phrases.. (2 ?stories?) that I have done my best to illuminate and animate.. please give it a listen, seed and spread.\n\n(..and that is MLKjr in the ?bridge?, for those who are not familiar.)\n\nAND ALSO, please take a moment and visit these umbrella organizations for support of resisting GIs;\nwww.ivaw.org\nand\nwww.couragetoresist.org\n????.\nfeel free as well to send your love/hate mail to zxzxzxii (at) hotmail.com.\n(miracle encouragement/adventure funding via paypal @ above email address.)\n\nSo now a stream-of-consciousness keyword splurgit;\nGI resistance winter soldier ivaw vvaw anarchist anti war anti-war anarchism anarchy democracy freedom first amendment dissident Chomsky Zinn the corporation endgame derrick jensen john zerzan George orwell smedly butler Vietnam IDM drum n? bass ambient downbeat martin luther king jr. MLK civil rights liberties liberty law justice unwelcome guests slavery unionism resistance revolution refusal ward Churchill Iraq Iran Afghanistan  rebellion documentary media journalism.\n\n","torrent":{"xt":"urn:btih:800c3b6f2a45b06949eb9ecbf1da51f24bd7c8dc","amp;dn":"Operation+Blackjack-+winter+soldier-+activist+IDM-Iraq+war-320kp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800c3b6f2a45b06949eb9ecbf1da51f24bd7c8dc","infoHashBuffer":{"type":"Buffer","data":[128,12,59,111,42,69,176,105,73,235,158,203,241,218,81,242,75,215,200,220]},"announce":[],"urlList":[]}}