{"title":"Crime Cities","uid":4278140,"size":1101952863,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:806af874e423ab65e257e5fc70a450c5799fb313&amp;dn=Crime+Cities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zephirius","files":3,"time":1215281778,"description":"Developed by Techland, also known for Call of Juarez and Chrome.\n\n\\&quot;Once planetside, Garm, alias Johnny Red, effectively becomes a gun for hire within this lawless society, exactly what the Human Federation had planned. At the start of the game he is equipped with a small yet highly manoeuvrable flying combat craft, plus a small amount of credits in his bank account. In Crime Cities, missions are offered to Garm via his GloAdam Hartleyet computer and can be accepted or turned down at the player\\&amp;#039;s discretion. Objectives include such activities as elimination of targets, search and rescue and bodyguard roles, with some of these having to be completed in a specific time.\n\nAll of the action takes place from the flying craft as you dogfight your way through each city\\&amp;#039;s myriad of skyscrapers. Correctly identifying targets as you fly through the dense traffic is critical, launch an attack on a neutral pilot by mistake and the police will soon be on your tail. And remember, they are unaware Garm is undercover and have orders to shoot to kill. Successful completion of a mission results in various rewards such as money - with which you can upgrade your craft and an improved standing within the criminal fraternity. This increased credibility will lead to better missions being offered and hence quicker movement up the criminal hierarchy and the eventual goal of uncovering the criminal mastermind.\\&quot;\n\nCaution - May crash to desktop if not run in windows 98 compatibility mode. Have yet to test other modes, feel free to inform me.","torrent":{"xt":"urn:btih:806af874e423ab65e257e5fc70a450c5799fb313","amp;dn":"Crime+Cities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"806af874e423ab65e257e5fc70a450c5799fb313","infoHashBuffer":{"type":"Buffer","data":[128,106,248,116,228,35,171,101,226,87,229,252,112,164,80,197,121,159,179,19]},"announce":[],"urlList":[]}}