{"title":"VA - (IBM) ITALIAN BODY MUSIC VOL.3 (2006)","uid":4252129,"size":104256964,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8089702f9b110ca58e411741ce5cfaa4da31af75&amp;dn=VA+-+%28IBM%29+ITALIAN+BODY+MUSIC+VOL.3+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"darkmatter88","files":22,"time":1214063662,"description":"VA - (IBM) ITALIAN BODY MUSIC VOL.3 (2006)\n\nITALIAN BODY MUSIC\n\na project by Alberto Brandi (dj NOX) and Luca Anselmi (ElectroWorld)\n\nTitle: Italian Body Music Vol.3\nGenre: Electro, EBM, Noise, Ambient, Industrial\nRelease date: 03.11.2006\n\nFREE NET RELEASE\n\nVisit www.italianbodymusic.com for free download and more infos about the bands.\n\n\nTracklist:\n01. Adam - Dead Walking Machine\n02. Bahntier - Entrap Voices (Cagemix)\n03. Deviated Sister TV - Mekkanoise\n04. Don DKG - Interference [ItalianBodyMusic Edit]\n05. First Black Pope - Alive in Hell\n06. Klonavenus - Sermons\n07. Lecxe - Cyber Tribe I\n08. My Divine Angel - This Is Not Me\n09. Noorglo - Bedroom Corrosion\n10. :Nydhog: - My Cold Sun\n11. Perverse Stuff - Prey\n12. Sandblasting - A Better Tomorrow\n13. Sound Destruction Unit - On The Knee\n14. Splinter vs Stalin - Moustache District\n15. Stendeck - They&amp;#039;ve Tried To Drive Away But...\n16. The Clone DJ - Ciao Ibiza!\n\n\n--------------------                    --------------------                    --------------------\n\n\n...and the Italian Body Music Project has completed its third chapter, ready to propose and provide the ultimate and most up-to-date vibes belonging to the Italian EBM-Industrial-Electro scene.\n\nWhat we had stated concerning the first two volumes is today even more true: don?t let yourself be fooled by the (somewhat ironic) name we?ve chosen for this series of compilations?Italian Body Music DOES NOT want to propose exclusively ?pure? (!?) ?body music?, but a wide range of dark and alternative electronica, surely closely related to the Industrial scene, but also rich of the most various influences.\n\nIn the first volume there was a strong presence of guitars and metal-oriented sounds, in the second it was the turn of big drone, ambient and (traditional) industrial names to accompany the other bands. Vol. 3 goes even further, proposing a diverse selection of bands, ranging from dark and aggressive EBM to trance and harddance inspired material, all ? of course ? in the vein of the underground and alternative spirit of the IBM Project. In the course of the 18 months of life of this project we?ve seen bands who participated to our compilations playing in the major European festivals, producing great albums and generally being noticed by the international Industrial scene. Of course this isn?t solely the result of our promotion, but we like to think that this has helped; our project has attracted the attention of magazines, djs and radios all over the world, and all of this represents exactly the spirit of our initiative.\n\nThis is not just another internet-release. Its purpose and direction is clear from the start and won?t change: we want to provide the scene with an overview of our best acts. This doesn?t mean providing an average, overheard product; we want to remind you that ALL the tracks present from IBM vol. 2 are either EXCLUSIVE songs composed for the compilation or previously UNPUBLISHED remixes or versions.\n\nCheck out regularly our website for the latest info and initiatives related to the IBM Project.\nWe are preparing for you many interesting things.\n\nThe best way you have to help us is to SUPPORT the bands we support ourselves and the project, helping the promotion by djing the tracks, reviewing the compilations, and by the good old word-of-mouth that will help us spreading even more this initiative.\n\nBUT! If you want to help us in concrete and sound ways as well, we have now a support IBM page thanks to which you can donate and help the IBM-cause. Of course ALL the money will be used for the printing of promo-CDs, merchandise and for mantainance of this website.\nIt?s enough to donate 1 EUR, 2 EUR?hell 5 EUR if you feel like doing it.\n\nITALIAN BODY MUSIC is as always\nAlberto Brandi (dj NOX) and Luca Anselmi (ElectroWorld)\n\n\n--------------------                    --------------------                    --------------------\n\n\nIBM Vol.3 was made by:\n\nAlberto Brandi a.k.a. Dj NOX (ideation, organization, press-shit and what?s in between)\nLuca Anselmi (project development, ideation and maintenance of the website, organization and sonic assistance)\nAnna Taschini (CD graphics and lay-out)\nElena De Venezia (graphic tools and name of the compilation)\n\n\n--------------------                    --------------------                    --------------------","torrent":{"xt":"urn:btih:8089702f9b110ca58e411741ce5cfaa4da31af75","amp;dn":"VA+-+%28IBM%29+ITALIAN+BODY+MUSIC+VOL.3+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8089702f9b110ca58e411741ce5cfaa4da31af75","infoHashBuffer":{"type":"Buffer","data":[128,137,112,47,155,17,12,165,142,65,23,65,206,92,250,164,218,49,175,117]},"announce":[],"urlList":[]}}