{"title":"Richard Lester - The Bed Sitting Room (1969) - Freakyflicks","uid":4040863,"size":615360582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:814f22ded0ee873766c74f949734ede607f1f376&amp;dn=Richard+Lester+-+The+Bed+Sitting+Room+%281969%29+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clownmonkey","files":1,"time":1203669004,"description":"An IMdB user comment:\n\nThis is a wonderful surreal comedy based on the play by Spike Milligan and John Antrobus. You know that it is going to be an odd film right at the beginning, when the opening credits list the cast in order of their height. The film begins with the BBC (Frank Thornton) telling us through the facade of an old television that this is the third, or is it the fourth?, anniversary of the shortest war in history, lasting 2 hours and 28 minutes. England is now a barren landscape, littered with derelict cars and buildings, hills of old boots, broken crockery, and other debris. Forty million people perished and there are only 20 known survivors. The Queen did not survive, and of the 20 known survivors the next in line for the throne is a Mrs Ethel Schroake of 393a High Street, Leytonstone. Among the other survivors are Ralph Richardson (O Lucky Man!) as Lord Fortnum of Alamein, who isn\\&amp;#039;t looking forward to his impending mutation into a bed sitting room. Michael Hordern is Bules Martin, who wears a 18-carat Hovis bread ring. Spike Milligan is a postman who wanders around and delivers some memorable dialogue, for example: \\&quot;And in come the three bears - the daddy bear said, \\&amp;#039;Who\\&amp;#039;s been sleeping in my porridge?\\&amp;#039; - and the mummy bear said, \\&amp;#039;that\\&amp;#039;s no porridge, that was my wife\\&amp;#039; \\&quot;. Arthur Lowe is slowly turning into a parrot (which is then eaten by Spike Milligan), while his wife, the owner of her own death certificate, turns into a wardrobe. His daughter is pregnant with a strange creature, which she has held inside her for seventeen months. Peter Cook and Dudley Moore are a pair of policemen who perpetually tell the others to \\&quot;keep moving!\\&quot;. Moore growls a lot and turns into a dog at the end. Marty Feldman is a wellington-boot-wearing nurse. It\\&amp;#039;s a hilarious, absurdist treat, and one of my treasured filmic pleasures.\n\n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\&amp;#039; ","torrent":{"xt":"urn:btih:814f22ded0ee873766c74f949734ede607f1f376","amp;dn":"Richard+Lester+-+The+Bed+Sitting+Room+%281969%29+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"814f22ded0ee873766c74f949734ede607f1f376","infoHashBuffer":{"type":"Buffer","data":[129,79,34,222,208,238,135,55,102,199,79,148,151,52,237,230,7,241,243,118]},"announce":[],"urlList":[]}}