{"title":"Crossing Arizona","uid":4151044,"size":347521068,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81986ff8a647f87c404bd6c2505dd5d3d3d16488&amp;dn=Crossing+Arizona&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"tpbistoday","files":3,"time":1208944171,"description":"Crossing Arizona.avi\n1 hour 16 minutes 43 seconds\nVIDEO\n640 x 360\nXVID MPEG-4\nAC-3 Audio\n\nWith Americans on all sides of the issue up in arms and Congress embroiled in a knock-down-drag-out policy battle over how to move forward, CROSSING ARIZONA shows how we got to where we are today . . .\n\nHeightened security in California and Texas has pushed illegal border-crossers into the treacherous Arizona desert in unprecedented numbers ? an estimated 4,500 a day. Most are men in search of work, but increasingly the border-crossers are women and children seeking to reunite with their families. This influx of migrants crossing through Arizona and the attendant rising death toll have elicited complicated feelings about human rights, culture, class, labor and national security.\n\n?Crossing Arizona? examines the crisis through the eyes of those directly affected by it. Frustrated ranchers go out day after day to repair cut fences and pick up the trash that endangers their livestock and livelihoods. Humanitarian groups place water stations in the desert in an attempt to save lives. Political activists rally against anti-migrant ballot initiatives and try to counter rampant fear mongering. Farmers who depend on the illegal work force face each day with the fear that they may lose their workers to a border patrol sweep. And now there are the Minutemen, an armed citizen patrol group taking border security into their own hands. As up-to-date as the nightly news, but far more in-depth, ?Crossing Arizona? reveals the surprising political stances people take when immigration and border policy fails everyone.\n &lt;a href=&quot;\nhttp://www.crossingaz.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.crossingaz.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:81986ff8a647f87c404bd6c2505dd5d3d3d16488","amp;dn":"Crossing+Arizona","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81986ff8a647f87c404bd6c2505dd5d3d3d16488","infoHashBuffer":{"type":"Buffer","data":[129,152,111,248,166,71,248,124,64,75,214,194,80,93,213,211,211,209,100,136]},"announce":[],"urlList":[]}}