{"title":"LIE - Long Island Expressway widescreen (800X600).avi","uid":4137452,"size":849312138,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81bda26e76914a1d6b0082699e2b8fd9b4a25f25&amp;dn=LIE+-+Long+Island+Expressway+widescreen+%28800X600%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"howard251a","files":1,"time":1208330199,"description":"No audio to video sync problems.\n\nFormat: Wide Screen\nVideo width &amp; height 800X600\n29 frames/second\nVideo data rate: 146kbps\nAudio data rate: 160kbps\n\nL.I.E (Long Island Expressway)\n\nRelease Date: 2001\nRunning Time: 97 minutes\n\nAudio: English\n\nIMDB Rating: 7.2/10\n\nA teenaged boy in desperate need of a father figure finds one in a place no one should ever have to look in this controversial drama. Howie (Paul Franklin Dano) is a 15-year-old who has been emotionally at sea ever since the death of his mother in an auto accident several years before. Howie\\\\\\&amp;#039;s father Marty (Bruce Altman) is also having trouble dealing with the loss, and distracts himself with empty sex while avoiding authorities attempting to prosecute him for using unsafe materials in his building contracting business. Howie falls in with a group of homeless delinquents his own age, becoming especially close to streetwise Gary (Billy Kay). In time, Howie begins to wonder if his feelings for Gary go past ordinary friendship, but the issue of his sexuality is forced into a very different light after Gary persuades Howie to join him in robbing the home of middle-aged former Marine Big John Harrigan (Brian Cox). It doesn\\\\\\&amp;#039;t take long for Big John to track down the culprits after Howie and Gary steal several guns from his house, but Howie learns that Big John and Gary have met before -- Gary sometimes works as a male prostitute, and Big John, whose tastes run to boys in their early teens, is a regular customer. When Gary runs away to California, Big John proposes that Howie work off their debt by having sex with him; while Howie is hardly comfortable with this arrangement, he has nowhere else to go after his father ends up in jail, and he finds an unexpected degree of emotional support in his relationship with the curiously compassionate pedophile, who comes to understand just how badly Howie needs help. L.I.E. (the title stands for \\\\\\&quot;Long Island Expressway\\\\\\&quot;) premiered at the 2001 Sundance Film Festival. ~ Mark Deming, All Movie Guide\n","torrent":{"xt":"urn:btih:81bda26e76914a1d6b0082699e2b8fd9b4a25f25","amp;dn":"LIE+-+Long+Island+Expressway+widescreen+%28800X600%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81bda26e76914a1d6b0082699e2b8fd9b4a25f25","infoHashBuffer":{"type":"Buffer","data":[129,189,162,110,118,145,74,29,107,0,130,105,158,43,143,217,180,162,95,37]},"announce":[],"urlList":[]}}