{"title":"Super Hits Of The Seventies Vol 1","uid":3343521,"size":86902198,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82c54ad0009a4cc7751df38ff9dd4aa617c2dfe9&amp;dn=Super+Hits+Of+The+Seventies+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boogazm","files":12,"time":1118543126,"description":"Volume 1 of the &quot;Have a Nice Day&quot; series showed great promise for a series that unfortunately only delivered in spotty fashion. However, this first disc is tremendous.\n\nThe selection of music is an overview of the many disparate styles that would form the sound of the seventies. Starting with the decades first mega-hit, &quot;NaNa HeyHey Kiss Him Goodbye&quot;, these dozen tracks cover a little bit of everything. Yes, this track and a few others here were released in late 1969, but hit their stride in the winter and spring of 1970.\n\nFor middle-of-the-road pop, there is Vanity Fair's &quot;Early in the Morning&quot;, the Spiral Staircase's &quot;More Today than Yesterday&quot; and Mark Lindsay's &quot;Arizona.&quot; For those who prefer a softer sound, there is the Sandpiper's mellow and lovely &quot;Come Saturday Morning&quot; and The Flying Machine's &quot;Smile a Little Smile for Me.&quot; Mountain gives a preview of the harder side of the decade with &quot;Mississippi Queen&quot; while Shocking Blue checks in with &quot;Venus.&quot; There's even a bit of an oddity in Billy Joe Royal's only hit that wasn't squeaky clean, the transparently suggestive &quot;Cherry Hill Park.&quot;\n\nAs with all of the discs in this series, the mastering is magnificent and all songs are originals (some in the set could have been better edited, but that's nitpicking). Many later volumes had difficulty coming up with twelve strong entries, but not Volume 1. This is a truly excellent value; twelve tracks, twelve great songs. Highly recommended.","torrent":{"xt":"urn:btih:82c54ad0009a4cc7751df38ff9dd4aa617c2dfe9","amp;dn":"Super+Hits+Of+The+Seventies+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c54ad0009a4cc7751df38ff9dd4aa617c2dfe9","infoHashBuffer":{"type":"Buffer","data":[130,197,74,208,0,154,76,199,117,29,243,143,249,221,74,166,23,194,223,233]},"announce":[],"urlList":[]}}