{"title":"Police Interceptors S01 WS PDTV XviD AcidXP","uid":4275850,"size":2695638798,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:82e32da608dce47ad7afc932f7908ae0dbabc974&amp;dn=Police+Interceptors+S01+WS+PDTV+XviD+AcidXP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"acidxp","files":8,"time":1215183142,"description":"Police Interceptors\n\nThis action-packed documentary series profiles the work of a high-speed police interception unit in Essex. Led by specially trained officers and equipped with the fastest vehicles in the force, the team tackles the most difficult-to-catch criminals on a daily basis. \n\nSeries 1\n\nEpisode 1\nAir Date: 09/05/08\nNew series profiling the work of a high-speed police interception unit in Essex. Police chase a drug dealer on a motorway at night, a drunk driver endangers his life in a bid to avoid arrest and the team of interceptors pursue one of the area\\&amp;#039;s most wanted car thieves.\n \nEpisode 2\nAir Date: 16/05/08\nThe Essex-based high-speed police interception unit pursue a gang of would-be jewellery thieves, while a burglar leads the team on a car chase.\n\nEpisode 3\nAir Date: 23/05/08\nThe high-speed police interception unit pursue a thief in a souped-up Ford Mondeo who outwits their turbocharged cars and causes chaos when he drives up a one-way street in the wrong direction. After one of their vehicles is rammed, the officers decide to use a stinger device to stop the criminal in his tracks.\n\nEpisode 4\nAir Date: 30/05/08\nThe police pursue an escaped prisoner driving a getaway car down the wrong side of a dual carriageway and a stolen van being driven erratically through the streets of Essex. Plus, the Air Support Unit\\&amp;#039;s helicopter is called into action late at night to look for an armed robber.\n\nEpisode 5\nAir Date: 06/06/08\nA police chase ends with the driver of a stolen Lexus crashing the luxury motor, and the police interception unit deal with a car which is deemed too sexy by officers. Elsewhere, a high-speed pursuit results in a head-on collision with one of the team\\&amp;#039;s hi-tech vehicles.\n\nEpisode 6\nAir Date: 13/06/08\nThe team discover the garage hideout of a gang of burglars in a country lane, and pursue a BMW driver who endangers his life by running across four lanes of a busy dual carriageway to escape with a suspicious package. The police interceptors also apprehend a mother driving with no tax, insurance or MOT, who turns out never to have passed her driving test.\n\nEpisode 7\nAir Date: 20/06/08\nRepeat of the best bits of Series 1.\n\n\nPlease Note: I have not recorded these episodes, I have simply collected them into one torrent from many different websites and sources.\n\nEnjoy!\n\nAcidXP","torrent":{"xt":"urn:btih:82e32da608dce47ad7afc932f7908ae0dbabc974","amp;dn":"Police+Interceptors+S01+WS+PDTV+XviD+AcidXP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e32da608dce47ad7afc932f7908ae0dbabc974","infoHashBuffer":{"type":"Buffer","data":[130,227,45,166,8,220,228,122,215,175,201,50,247,144,138,224,219,171,201,116]},"announce":[],"urlList":[]}}