{"title":"Raggedy Ann &amp; Andy (1977) The Little Island (1958) Widescreen -","uid":4149320,"size":4695716697,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:83afed19fe98cbb2a928e5ec986a4e3b487a8b86&amp;dn=Raggedy+Ann+%26+Andy+%281977%29+The+Little+Island+%281958%29+Widescreen+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tygerbug","files":32,"time":1208865482,"description":"RAGGEDY ANN &amp; ANDY/THE LITTLE ISLAND\nRichard Williams - Widescreen 16x9\n1977/1958\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0076593/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0076593/&lt;/a&gt;\n\nFor the first time on DVD, and the first time ever in its full widescreen\n cinemascope ratio, here is the 1977 animated feature Raggedy Ann &amp; Andy:\nA Musical Adventure. Lovingly restored from an original 35mm film print\nwith input from several notable animation scholars, and now provided to\nyou, by the same fellow who gave you Richard Williams&amp;#039; more popular\nfeature, The Thief and the Cobbler: Recobbled Cut.\n\n(The Thief and the Cobbler: Recobbled Cut Mark 3 is also currently available\nat The Pirate Bay.)\n\nRespect copyright! Please purchase all official DVD and Blu-ray versions of this film that are released ... whenever that happens.\n\nAlso included is Richard Williams&amp;#039; first ever film from 1958, the 30 minute\nexperimental, philosophical epic, The Little Island. Also lovingly transferred\nfrom 35mm film, this classic short looks great on DVD.\n\nThis is the 16x9 version of this Raggedy Ann &amp; Andy DVD - the original ratio\nof the film was cinemascope ratio, which is wider than the DVD ratio of 16x9.\nI stretched the image vertically to fit the 16x9 ratio of DVD, so that you\nget a higher quality image - just a bit taller vertically. I thought that\nmight play better in this high definition age. A cinemascope ratio version\nof the DVD was also prepared, with black bars placed on top and bottom of\nthe image. However, since the 16x9 version is higher resolution, this is\nthe version I&amp;#039;ve chosen to share on the internet.\n\nSpecial Features:\n\n- Animated Menus\n- Richard Williams&amp;#039; first film - &quot;The Little Island&quot; (1958)\n- Restoration Comparison - see how missing frames on the film print were\nrestored from various sources.\n- Disco Dolly - A disco version of &quot;I&amp;#039;m Just a Rag Dolly,&quot; rediscovered\nfrom a cassette tape of the very rare audio from a 1977 segment on the\nkid&amp;#039;s show Wonderama, hosted by Bob McAllister and featuring guest Joe\nRaposo. I&amp;#039;ve prepared a new music video for this shocking bit of late-70s\nbad taste, for you to enjoy. The original segment apparently involved\ndancers dressed as Raggedy Ann &amp; Andy.\n- TV spot: &quot;11 Stars&quot; - an ad in which kids give high marks to the film.\nA mother rolls her eyes.\n- 16mm promo clip - a very bad print of &quot;I Look, and What Do I See&quot; that\nwe found on 16mm - the color has gone to red. It was either an unfinished\nattempt at a trailer for the film, or a special clip designed to be shown\non TV shows promoting the film.\n\nJoin America&amp;#039;s favorite doll on a whirlwind journey through fantasyland!\nYour family will love this first feature from 3-time Oscar-winning animator\nRichard Williams (Who Framed Roger Rabbit?, The Thief and the Cobbler),\nwith sixteen songs by Joe Raposo of &quot;Sesame Street&quot; fame. When little\nMarcella is away, her playroom comes to life - and Raggedy Ann &amp; Andy go\non a surreal adventure! Babette, a spunky French doll, has been kidnapped\nby an amorous pirate, The Captain. Can they free Babette and make it back\nto the nursery before daybreak? Or will they get eaten by the Greedy, or\ncaught by King Koo Koo?\n\n87 minutes, color, 1977\nRated G\n\nSpecial thanks to Ridgeshark for converting this to 16x9. I&amp;#039;ve issued a\n16x9 version of this film before, but he did a better job than I, so \n revised version I&amp;#039;ve used his transfer.\n\n\nDVD, editing, and restoration by OCP\n35mm film and &quot;Disco Dolly&quot; provided and transferred by KA\n16mm tv spot provided by and 16mm transfers done by BJ\n16mm promo clip provided by SS\nTransfers done at Crest Digital\n\n\n\n\n#  Claire Williams spoke with a British dialect, so her voice was dubbed by a\n young, American actress.\n\n# The film was intended to be released in time for Christmas, 1976, but\nproduction ran three months over schedule.\n\n\n# Didi Conn had laryngitis when her vocals were recorded. The actress was\n disappointed that her voice wasn&amp;#039;t what it could have been during the song \n&quot;Home,&quot; but director Richard Williams thought her hoarseness added to the \nemotion of the song.\n\n# Songwriter Joe Raposo and director Richard Williams contributed voices to \npirate extras. One little elfin pirate is intended to represent Richard \nWilliams - King Koo Koo says &quot;fire him!&quot;\n\n# In Loonyland, the entrance is lit up with the letters NY and LA \nhighlighted - representing the production done in New York under Richard \nWilliams, as well as the Los Angeles production.\n\n# Most of Raggedy Andy&amp;#039;s song &quot;I&amp;#039;m No Girl&amp;#039;s Toy&quot; was animated by director \nRichard Williams.\n\n# At least ten additional songs were written for the film but rejected before \nthe recording sessions. They included Raggedy Andy&amp;#039;s song &quot;I Like Rasslin&amp;#039;&quot; \n(which was similar in sentiment to &quot;I&amp;#039;m No Girl&amp;#039;s Toy), a dance \nThe Raggedy Rag,&quot; an anthem for the Loonies of Loonyland, a song about \nRaggedy Ann and Marcella, and a song about &quot;Fifi&quot; (who was eventually \nrenamed &quot;Babbette&quot;).\n\n# The Camel was not intended to have a Southern accent. The accent was \nsuggested to actor Fred Stuthman during the auditions and once he had done \nthe voice, the Camel instantly became a country singer.\n\n# Emery Hawkins animated three different versions of the opening of The \nGreedy&amp;#039;s sequence before grasping how he felt the character should move.\n\n\n# In early drafts of the story, Babbette&amp;#039;s name was Fifi.\n\n# The Raggedy Ann, Raggedy Andy, Topsy-Turvy and Sockworm dolls seen in \nthe live-action portion of the film were made by director Richard Williams&amp;#039; \nmother.\n\n# The characters in the film, with the exception of the Camel, do not blink. \nThis decision was made to make them seem more like dolls, and to keep the film \nfrom seemingly like a Disney movie.\n\n# Art Babbitt animated the Camel in three different sections and treated him \nas if he were three different characters: a dumb back end, a slightly smarter \nfront end, and a head.\n\n# The first scene animated by Tissa David, who animated the largest chunk \nof the film, was the six minute &quot;Candy Hearts and Paper Flowers&quot; sequence.\n\n# The first song written for the project was &quot;I Look and What Do I See?&quot;","torrent":{"xt":"urn:btih:83afed19fe98cbb2a928e5ec986a4e3b487a8b86","amp;dn":"Raggedy+Ann+%26+Andy+%281977%29+The+Little+Island+%281958%29+Widescreen+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83afed19fe98cbb2a928e5ec986a4e3b487a8b86","infoHashBuffer":{"type":"Buffer","data":[131,175,237,25,254,152,203,178,169,40,229,236,152,106,78,59,72,122,139,134]},"announce":[],"urlList":[]}}