{"title":"Shinobi - Winds of the 34 Generations","uid":4147622,"size":704760882,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:840ba0e36ddb1cfce943067ee97ecee98620279c&amp;dn=Shinobi+-+Winds+of+the+34+Generations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"synistron","files":1,"time":1208800199,"description":"h++p://www.shinobiwinds.com/\n\nTrailer:\n\n\n  \tUsing a variety of ancient weapons, traditional training footage and informal travelogues - filtered through interviews with top practitioners - the myths and mysteries surrounding the creation and transmisson of Ninjutsu&amp;#039;s &amp;#039;Shadow Art&amp;#039; are clarified for the practitioner of today.\n\n[b]This is the most in depth and comprehensive documentary ever undertaken to chronicle the factual events and history behind the legendary &quot;ninja&quot; guerilla warrios or medieval Japan.[/b]\n\nIncludes rare interviews with such world-renowned ninjutsu authorities and master practitioners as Dr. Masaaki Hatsumi, Fumio Manaka, Stephen Hayes, Bud Malmstrom, Shawn Havens, Rumiko Hayes, and Isamu Shiraishi. Also included are excerpts and interviews with such highly regarded martial arts practitioners and executive protection experts as Robery Bussey, David Dow, Marc Franco, Peter Steeves, and Matthew Woodard.\n\nIn this film, you will travel along as such relevant historical sights such as Yagyu village, Iga-Ueno, Enryaku-ji, and the hidden falls of Mt. Maya are explored and centuries long misconceptions of these long misunderstood phantom warriors are unraveled.\n\nRelive the rare of the filmmakers as they meet with Mr. Mikio Momochi, present day descendant of the legendary sixteenth century ninjutsu master Sandayu Momochi, at the Momochi home in Nabari. ","torrent":{"xt":"urn:btih:840ba0e36ddb1cfce943067ee97ecee98620279c","amp;dn":"Shinobi+-+Winds+of+the+34+Generations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840ba0e36ddb1cfce943067ee97ecee98620279c","infoHashBuffer":{"type":"Buffer","data":[132,11,160,227,109,219,28,252,233,67,6,126,233,126,206,233,134,32,39,156]},"announce":[],"urlList":[]}}