{"title":"Myspace Friendblasterpro","uid":4158505,"size":2667920,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:84762d1e7941f0f47895c3e861def9c7ab772b24&amp;dn=Myspace+Friendblasterpro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BrooklynStar","files":2,"time":1209258755,"description":"FriendBlasterPro leverages the newest marketing medium for you. MySpace is a social network site where millions of people go to set up accounts about themselves and to interact with others. These members add each other as friends and take part in the many features MySpace has, creating an extremely large social network.\n\nUsing this social network to market your products, services, events or bands is an extremely powerful new method of advertising. The process is very easy. You start by creating an account for your product on MySpace. You then send friend requests to other MySpace members, either targeting specific users or sending random invitations. Once you have your own network of friends who are interested in your product, you can send messages directly to them about product information, upcoming events, etc. As your list of friends grows, so does your profits.\n\nFriendBlasterPro handles all of the work for you and includes the following features:\n\n-- Target your market based on a members age, sex, geographic location, interests, and more.\n-- Gather friend(s) id&amp;#039;s from browsing the groups, forums, friend lists, classifieds or any other area of MySpace.\n-- Gather friend(s) id&amp;#039;s from Google!\n-- Auto Messenger that allows you to send out messages to all of your friends or to any specified target market.\n-- Send message along with Friend Request feature that allows you to send both a message and a Friend Request to the same person.\n-- Auto Commenter feature that allows you to send out comments to all of your friends.\n-- Option to remove all pending friend request (this feature is great when you start to have a large list of pending friend request!).\n-- Create a &quot;Black List&quot; for ID&amp;#039;s you don&amp;#039;t want to send to.\n-- Timed Bulletins feature that gives you full control of &quot;how many&quot; and &quot;when&quot; to send out Bulletins.\n-- Accept Friends feature that allows you to accept all pending friend request and also allows you to send out a comment or message along with accepting your new friends.\n-- Invite all Friends to Current Event Feature.\n-- Invite all Friends to Current Group Feature.\n-- Comes with a FriendBlasterPro News Bulletin to keep you up to date with the latest news.\n-- Free product updates Support and technical assistance.\n-- NEW! Multiple registered accounts can now be chained together!\n-- NEW! Set FriendBlasterPro to auto start (with use of Multiple account Feature).\n-- NEW! Time-delay feature!\n-- And still much, much more!\n\n--People say this application is useless but I beg to differ. I just hate having to get a new version every few months, but I still swear by it. \n\nAvoid the fakes, this is the real deal.\n\n~One.","torrent":{"xt":"urn:btih:84762d1e7941f0f47895c3e861def9c7ab772b24","amp;dn":"Myspace+Friendblasterpro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84762d1e7941f0f47895c3e861def9c7ab772b24","infoHashBuffer":{"type":"Buffer","data":[132,118,45,30,121,65,240,244,120,149,195,232,97,222,249,199,171,119,43,36]},"announce":[],"urlList":[]}}