{"title":"A Lethal Dose of Hard Psych","uid":4027265,"size":138352319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:84a68a11738ab86b40235fe3920283ba94f9d58d&amp;dn=A+Lethal+Dose+of+Hard+Psych&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"extraneous","files":26,"time":1202986026,"description":"Size:\nBitrate: 256\nmp3\nRipped By: ChrisGoesRock\nArtwork Incuded\n\nWith twenty-three very rare singles, originating from all over North America, from 1966-70 (dates are not given for a couple but they certainly fit the time frame), this is very much in the Pebbles garage compilation mentality. The key difference is that the focus is on a later era -- only two to three years later on the average, mind you, but a significant difference when we&amp;#039;re talking about the sixties, when styles and sounds changed very quickly. It logically begats another difference between this and yer average garage compilation: there is much more weight given to hard, even heavy, guitar rock and psychedelic lyrics. Nonetheless, much of the fuzz guitar and cheesy organ texture typical of &quot;classic&quot; garage music remains. You have to dig pretty deep even for any names that are known by association on this comp, as all of the groups are unknown: three members of Adam went on to the Balloon Farm, Light&amp;#039;s &quot;Back Up&quot; was produced by Music Machine producer Brian Ross, and Steve Cropper co-produced the Aardvarks&amp;#039; &quot;Subconscious Train of Thought.&quot; For all the effort involved in locating these 45s, and the informed and entertaining liner notes, it&amp;#039;s not scintillating stuff, either on its own merits or in comparison to similar psych/garage comps. There&amp;#039;s a dearth of outstanding material, and the blurry guitars and organs yield a somewhat monotonous, homogenous effect over the course of the 70-minute disc. You get some interesting moments here and there, usually in off-the-wall vocal or instrumental distortions, but the melodies are usually mopey and unimaginative. ~ Richie Unterberger (All Music Guide)\n\nBuckle up--ARF! ARF! presents the third dose of our psychedelic trilogy. Featured on this 70+ minute collection is the more bombastic and harder slice of &amp;#039;60s American Psych. You&amp;#039;ll find a glorious deluge of overdriven fuzz guitar, swirling surreal sounds, hallucinogenic lyrical content and superb songwriting. As with our previous two installments, fans of Vernon Joynson&amp;#039;s Fuzz Acid &amp; Flowers book will discover plenty of massively cool testaments from this by-gone era. Changin&amp;#039; Tymes: Blue Music Box, Catfish Knight And The Blue Express Deathwise, Bondsmen: Our Time To Try, Flower Power: I Can Feel It, Adam: Eve, Aardvarks: Subconscious Train Of Thought, Factree: Kaleidoscope, Light: Back Up, Dutch Masters: The Expectation, Sidells: Watch Out Mother, Zoser: Dark Of The Morning, Tom Dae Turned On: I Shall Walk, Cardboard Box: Come On Baby Legend: Enjoy Yourself, Crystal Rain: Hey Ma Ma, Sound System: Take A Look At Yourself, Lovechain: Step out Of Your Window You Can Fly, Inner Light: Temptation, Mammoth: Mammoth, Lazy Nickels: 35 Design, Enoch Smoky: It&amp;#039;s Cruel, Haymarket Riot: Leaving, Mind Garage: Asphalt Mother.I believe this is the third in Arf Arf&amp;#039;s psych comp series, adding Hard to the previous Heavy and Light discs. As with those collections, there are plenty of songs here that will make you cringe and thank your maker that the performers are now safely away from the public ear somewhere in the working sector. Then there are bands like Bondsmen (&quot;Our Time To Try&quot;), Mind Garage (&quot;Asphalt Mother&quot;), Legend (&quot;Enjoy Yourself&quot;) and Enoch Smoky (&quot;It&amp;#039;s Cruel&quot;) that had exactly what it took to open for Iron Butterfly back in the day, and these songs are what makes being a garage psych fan a pleasure. Taken as a whole, Lethal Dose is, at the very least, interesting, a hodgepodge of everything from spirited fuzzfests from groups with dubious vocal skills to absolute mind-expansion from groups from which a contact high can somehow still be obtained just by listening. For those of you who collect garage gems from obscure bands of the 60s, this is all moot. You&amp;#039;ll snag it regardless. For the casual fans, I recommend this as an entertaining artifact and a 70 minute mind trip.(D.j Johnson)\n\n1. Blue Music Box - Changin&amp;#039; Tymes  \n2. Deathwise - Catfish Knight And The Blue Express   \n3. Our Time To Try - Bondsmen   \n4. I Can Feel It - Flower Power  \n5. Eve - Adam   \n6. Subconcious Train Of Though - Aardvarks    \n7. Kaleidoscope - Factree    \n8. Back Up - Light     \n9. The Expectation - Dutch Masters    \n10. Watch Out Mother - Sidells     \n11. Dark Of The Morning - Zoser   \n12. I Shall Walk - Tom Dae Turned On     \n13. Come On Baby - Cardboard Box    \n14. Enjoy Yourself - Legend     \n15. Hey Ma Ma - Crystal Rain     \n16. Take A Look At Yourself - Sound System    \n17. Step Out Of Your Window You Can Fly - Lovechain    \n18. Temptation - Inner Light   \n19. Mammoth - Mammoth    \n20. 35 Design - Lazy Nickels     \n21. It&amp;#039;s Cruel - Enoch Smoky    \n22. Leaving - Haymarket Riot     \n23. Asphalt Mother - Mind Garage  \n","torrent":{"xt":"urn:btih:84a68a11738ab86b40235fe3920283ba94f9d58d","amp;dn":"A+Lethal+Dose+of+Hard+Psych","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84a68a11738ab86b40235fe3920283ba94f9d58d","infoHashBuffer":{"type":"Buffer","data":[132,166,138,17,115,138,184,107,64,35,95,227,146,2,131,186,148,249,213,141]},"announce":[],"urlList":[]}}