{"title":"Requiem: Bloodymare Client","uid":4057301,"size":2133987524,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:84d809020da4830b635677f14e4f639e19fa6c7f&amp;dn=Requiem%3A+Bloodymare+Client&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"phrogxix","files":1,"time":1204428137,"description":"Requiem: Bloodymare is a massively multiplayer online game for mature audiences that pits you, the player, into a dark, violent and bloodstained world devastated by generations of scientific misuse and magic. Fight for your own survival against the grotesque monsters that stalk the cursed land or band together with fellow survivors to fend off the stronger, bloodthirsty creatures that awaken only at night to prey upon the weak. Use a wide selection of weapons and the mysterious powers of beast possession to viciously slay down your enemies with destructive force. Requiem is set in a grim, persistent world combined with violent, blood-spattering action to provide gamers a refreshingly new and innovative approach to online game design.\n\nKey Game Features:\n\n*Face your worst Nightmare\n      Even the most experienced of players will cringe when darkness falls in the world of Requiem. The bloodthirsty Nightmare Monsters that appear at night will ravage even the strongest of parties if not well prepared for battle.\n    \n*Weapon Enhancements\n      With several different item enhancement systems, players can create new items or upgrade and customize existing ones to best suit their needs.\n    \n*Beast Possession System\n      Unleash the incredible power of the beast within by transforming your character into a ferocious creature. Level-up your Beast Possession to equip it with an even deadlier selection of various skills and abilities needed to survive.\n    \n*Epic Player-vs-Player (PvP) battles\n      Prepare to battle your foes on an enormous scale. Requiem features 8-vs-8, 16-vs-16, 32-vs-32, and a colossal 96-vs-96 battlefield, where only the victorious are rewarded with special items used for obtaining the rarest of weapons and armor!\n    \n*DNA System\n      Boost your character strengths and minimize their weaknesses by reorganizing their DNA as you see fit. Having full control over their evolution leads to a wide variety of character builds sharing the same class and race.\n    \n*Group Zones\n      Jump over obstacles, collect items and more needed to pass through locked areas as you venture in a group to discover what terror lies before you. These areas are designed especially for groups of players to experience an intense series of battles with high rewards.\n\nThe Requiem: Bloodymare Closed Beta Launch is scheduled to officially begin\nFriday February 29th.\n\nTo guarantee access to the Requiem: Bloodymare closed beta you will need to acquire a Closed beta access code for the registered account, which will become available from the following sources.\n\n    * Starting Tuesday February 26th, Fileplanet will have a limited quantity of Closed Beta codes for Requiem, available only for Fileplanet registered users.\n    * Friday February 29th, MMORPG.com will have closed beta codes available.\n    * And also on Friday February 29th, MMOSITE.com will also have a limited quantity of closed beta codes available.\n\nAs a special promotion for early registrations by Fileplanet registered users, those accounts will have access to Requiem, 3 days before other users, starting\nTuesday February 26 at 4pm PST.\n\nFor those that register on the website but are not able to acquire a closed beta access code for that account we will be offering another chance to participate in the closed beta. As space allows we will randomly select from the pool of registered, but not game-accessible, accounts and grant them access to the Closed Beta as the Beta period progresses.\n\nThe closed beta period is scheduled to run from\nTuesday February 26, at 4pm PST until Wednesday March 26, 10am PST\n\nThe registration page for both the Forums and the Website will be made available on\nMonday February 25th.","torrent":{"xt":"urn:btih:84d809020da4830b635677f14e4f639e19fa6c7f","amp;dn":"Requiem%3A+Bloodymare+Client","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84d809020da4830b635677f14e4f639e19fa6c7f","infoHashBuffer":{"type":"Buffer","data":[132,216,9,2,13,164,131,11,99,86,119,241,78,79,99,158,25,250,108,127]},"announce":[],"urlList":[]}}