{"title":"Robbie Fulks-Revenge [Live] (2CD-2007-VBR-Country)","uid":4050083,"size":104030700,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:85d6d60261c2ac41691cd5883e30d8c7c1d0cb8e&amp;dn=Robbie+Fulks-Revenge+%5BLive%5D+%282CD-2007-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cheng","files":26,"time":1204121813,"description":"[img]http://ecx.images-amazon.com/images/I/51cYtaND1DL._SS500_.jpg[/img]\n[b]Tracker URL:[/b]\nhxxp://tpb.tracker.thepiratebay.se/announce\nhxxp://vip.tracker.thepiratebay.se/announce\n\n[b][color=#FF0000]Amazon Review[/color][/b] by Roy Kasten\n\nFifteen years of recording and alt-country&amp;#039;s smartest smartass has never released a live album or a greatest-hits collection (the odds &amp;#039;n&amp;#039; sods Very Best Of doesn&amp;#039;t count). This two-disc set just about settles the score. On disc one, a good slice of Fulks&amp;#039;s best songs gets the full roots-rock-weirdo treatment with his longtime road band: the closing triad &quot;Rock Bottom, Pop. 1,&quot; &quot;Cigarette State,&quot; and &quot;Let&amp;#039;s Kills Saturday Night&quot; shows Fulks on top of his skewed country-rock game. On stage, he may distort and twist lines like a psycho-hillbilly jazz singer, but he&amp;#039;ll never sing a song the same way twice. On the superior second disc, however, he plays acoustic, showing just how much he learned as a bluegrasser and just home much he&amp;#039;s willing to chop and screw those lessons. His deathless folk homage, &quot;In Bristol Town One Bright Day,&quot; is transformed into a fractured guitar epic, and his take on Cher&amp;#039;s &quot;Believe&quot; (complete with hiccups to mimic the diva&amp;#039;s robotic pitch-shifting) is as passionate as it is hilarious. Fulks claims he hates live albums: they&amp;#039;re just rip-offs, with weaker versions of old songs, he says. So he adds a good number of unreleased covers and new original songs: &quot;The Bluebirds Are Singing for Me,&quot; &quot;On a Real Good Day,&quot; and &quot;That&amp;#039;s a Good Enough Reason&quot; are especially fine. Yet if you&amp;#039;re looking for an accurate document of what a Fulks show is like, you won&amp;#039;t find it here. Jokes, banter, and spontaneous crowd interaction are minimized--with the notable exception of an extended intro to &quot;I Like Being Left Alone,&quot; a sweet and sour comedy, and the best of his new tunes--and most tracks fade down over applause. As a record maker, Fulks&amp;#039;s heart really wasn&amp;#039;t into releasing a live set; as a performer, though, his heart, even at its most sarcastic, is never in doubt. One listen to the closing hootenanny stomp (featuring Kelly Hogan on harmonies) of the Carter Family&amp;#039;s &quot;Away On the Old Saint Sabbath&quot; is all the evidence you need.\n\n[b][color=#FF0000]AMG Review[/color][/b] by Mark Deming\n\nOn the opening cut of Robbie Fulks&amp;#039; album Revenge, Fulks and his band are interrupted while singing about the dubious joys of life on tour by a phone call from one of the head honchos at Yep Roc Records, who informs Fulks that the label wants a new record, but it has to be delivered fast and cheap since his previous effort didn&amp;#039;t move that many units. All of which serves as a curious but entertaining set-up for this double-disc live album, divided into a &quot;Standing&quot; set with a full electric band and a &quot;Sitting&quot; acoustic set featuring minimal accompaniment. Exactly who Robbie Fulks is wreaking vengeance upon (beyond the larger music-buying public who have failed to make him wealthy and famous) is never made clear, but this album is an accurate re-creation of the &quot;Live Robbie Fulks Experience&quot; for the fans at home. Fulks and his band are in superb form on disc one, especially guitarist Grant Tye and drummer Gerald Dowd, sounding tight and sympathetic as they swing from the weepy &quot;The Buck Starts Here&quot; to the swinging &quot;Cigarette State&quot; and closing out with the high-test rock &amp; roll of &quot;Let&amp;#039;s Kill Saturday Night.&quot; The acoustic disc is no less accomplished, if a bit less user friendly, as it features both a Cher cover (&quot;Believe&quot;) and an enthusiastic celebration of misanthropy (&quot;I Like Being Left Alone&quot;), though Fulks&amp;#039; duet with Kelly Hogan on the Carter Family&amp;#039;s &quot;Away out on the Old Saint Sabbath&quot; is beautiful stuff. On a good night, Fulks is one of the most exciting and entertaining singer/songwriters to emerge from the alt country scene with a band to match, and Revenge documents two very good shows with Fulks and his compatriots firing on all cylinders, even if his curiously smug sense of humor intrudes upon the proceedings every once in a while. \n\n[code]\n________________________________________\n\nRobbie Fulks - Revenge\n________________________________________\n\n\nBitrate : VBRkbps\nGenre   : Country\nRlsDate : 27.05.2007\nTracks  : 23\nYear    : 2007\nSource  : CDDA\nSize    : 99,2 MB\n\n________________________________________\n\n   Tracklist:\n________________________________________\n\ncd1                                     \n                                        \n01.We&amp;#039;re on the Road            [03:30] \n02.You Shouldn&amp;#039;t Have           [04:15] \n03.Fixin&amp;#039; to Fall               [02:54] \n04.Mad at A Girl                [03:41] \n05.The Buck Starts Here         [04:33] \n06.Good Bye Good Lookin&amp;#039;        [03:10] \n07.Busy Not Cryin&amp;#039;              [03:16] \n08.You Don&amp;#039;t Mean it            [03:57] \n09.Rock Bottom                  [02:48] \n10.Cigarette State              [04:41] \n11.Let&amp;#039;s Kill Saturday Night    [03:28] \n                                        \ncd2                                     \n                                        \n01.Introductory Remarks by Amy  [00:17] \nWarren                                  \n02.That&amp;#039;s A Good Enough Reason  [04:10] \n03.Believe                      [03:45] \n04.In Bristol Town One Bright   [05:40] \nDay                                     \n05.I Wanna Be Mama&amp;#039;d            [06:16] \n06.Fake Jews Everywhere,the     [02:54] \nDeath of Enthusiasm                     \n07.I Like Being Left Alone      [03:14] \n08.Bluebirds Are Singing for Me [03:34] \n09.On A Real Good Day           [05:08] \n10.President Garfield&amp;#039;s         [04:43] \nHornpipe,suza                           \n11.Kelly Hogan&amp;#039;s Looking        [00:52] \nHot,closing Remarks                     \n12.Away Out on the Old Saint    [03:58] \nSabbath                                 \n                                        \n                               =========\n                               84:44 Min\n                                99,2 MB \n\n________________________________________\n\n[/code]\n","torrent":{"xt":"urn:btih:85d6d60261c2ac41691cd5883e30d8c7c1d0cb8e","amp;dn":"Robbie+Fulks-Revenge+%5BLive%5D+%282CD-2007-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85d6d60261c2ac41691cd5883e30d8c7c1d0cb8e","infoHashBuffer":{"type":"Buffer","data":[133,214,214,2,97,194,172,65,105,28,213,136,62,48,216,199,193,208,203,142]},"announce":[],"urlList":[]}}