{"title":"EBN--Emergency Broadcast Network--VHS Rip","uid":4106758,"size":452224937,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:86e89fa4ecdcf29426f5b55bcd5a8abf1134b996&amp;dn=EBN--Emergency+Broadcast+Network--VHS+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dersh","files":12,"time":1206839360,"description":"***One of the EBN VHS copies is back! \nIt is one of the clearest versions I have ever found. I have seen an original VHS tape in the early 90s, and to my memory this seems like it, however short it was. Is also very hard to find any EBN video material since most of it was contained on VHS and those tapes never last after many years of use. So if you own an original VHS of ANY EBN work, please rip it and upload for the community, thanks alot!*** \n\n***What is EBN? To put it short they were a music group that put songs together from splices of TV and other audio clips. EBN kicks ass, do download away!***\n\n***Contained Within(videos-Xvid) are:\n01 - Psychoactive Drugs.avi\n02 - Get Down, Get Down.avi\n03 - Station Identification.avi\n04 - Don&amp;#039;t Back Down.avi\n05 - I Will Teach You.avi\n06 - Behaviour Modification-We Will Rock You.avi\n07 - I Am A Man.avi\n08 - Lawrence Welk Is Dead.avi\n09 - Watch Television.avi\n10 - Syncopated Ordinance Demonstration #1.avi\n11 - Operational Report.avi\nFolder.jpg--Its only 14kb but whatever, might as well throw everything in this.***\n\n\nAlleged History\nBelow is from Wikipedia--http://en.wikipedia.org/wiki/Emergency_Broadcast_Network\n\nEmergency Broadcast Network is the name of a multimedia performance group formed in 1991 that took its name from the Emergency Broadcast System. The founders were Rhode Island School of Design graduates Joshua Pearson, Gardner Post and Brian Kane (author of the Vujak VJ software). Kane left EBN in 1991.\n\nJosh Pearson, EBN&amp;#039;s charismatic front man and principal performance artist, was also EBN&amp;#039;s music composer and main video editor. The music and video editing techniques he personally developed and refined have been hugely influential on a generation of advertising and music video editors.\n\nThe first EBN video project was a musical remix of the Gulf War, created in 1991 as the war was still ongoing. The VHS tape of the remix project, which contained the George H.W. Bush &quot;We Will Rock You&quot; cover, became a viral underground hit, and was distributed widely by fans as bootleg copies. In the summer of 1991, EBN traveled with the first Lollapalooza tour, distributing tapes and showing their videos on a modified station wagon with TVs on the roof. The group also became well known for their media sculptures and stage props which were created by Gardner Post.\n\nThe EBN Live Team included DJ Ron O&amp;#039;Donnell, video artist/technologist Greg Deocampo (founder of Company of Science and Art (CoSA), and founding CTO of IFILM.com), artist/designer Tracy Brown and technologist Mark Marinello.\n\nThe EBN modus operandi was to take cable television broadcasts and remix them with a funky beat, often having the lyrics &quot;sung&quot; not by a singer but by half-second sound clips from TV, spliced together. For example, the lyric &quot;electronic behavior control system&quot; would be created with a clip of Ross Perot saying &quot;electronic&quot;, followed by a clip of George H. W. Bush saying &quot;behavior&quot;, then Ted Koppel saying &quot;control&quot;, and finally a clip of Bill Clinton saying &quot;system&quot;. This technique has been named video scratching.\n\nAmong their videos are &quot;Get Down and Electronic Behavior Control System&quot; from their 1995 album Telecommunication Breakdown, which mocks the way television controls our lives. Another was a cover of &quot;We Will Rock You&quot; by Queen, with a vocal track made up of remixed clips of George H. W. Bush making announcements about the Gulf War. Bono of U2 took notice of their work and hired them to provide visuals for their Zoo TV Tour. EBN&amp;#039;s video work featured prominently into the show, and their &quot;We Will Rock You&quot; cover was played at the beginning of each show. EBN also produced visuals for The Edge&amp;#039;s performance of &quot;Numb&quot; on the 1993 MTV Video Music Awards. In addition to the visuals, audio from those clips were featured in the live performance to create rhythmic effects.\n\nBrian Kane has since worked a number of times with British AV artists Addictive TV on many of their projects, both live and recorded - including Mixmasters and at London&amp;#039;s Institute of Contemporary Arts.\n\nGreg Deocampo continues his video remixes independently today, using footage from the 2003 invasion of Iraq (which he refers to as Gulf War II). In 2006, Deocampo started working with a trio of London video turntablists, Eclectic Method: Jonny Wilson, Ian Edgar, and Geoff Gamlen.\n\n\n***Much love from Canada!***","torrent":{"xt":"urn:btih:86e89fa4ecdcf29426f5b55bcd5a8abf1134b996","amp;dn":"EBN--Emergency+Broadcast+Network--VHS+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86e89fa4ecdcf29426f5b55bcd5a8abf1134b996","infoHashBuffer":{"type":"Buffer","data":[134,232,159,164,236,220,242,148,38,245,181,91,205,90,138,191,17,52,185,150]},"announce":[],"urlList":[]}}