{"title":"uoml_setup.exe","uid":4052696,"size":798463305,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:86f72391b5b070d310692f74060d6041510baf65&amp;dn=uoml_setup.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ScissorMan","files":1,"time":1204230158,"description":"The Ultima Online - Player Run Shard Golden Client Installation\n\nThis installation package is an unmodified version of the Ultima Online game client captured at a particular point in time (patch level). This version of the UO client is known to be compatible with many Player Run Shards.\n\nThis installation package includes: only those files distributed by OSI/EA, and configuration files created and managed by the client software (macro files and client config file.) The executable files and image data are unmodified.\n\nPatching:\n\nFurther patching is not recommended as it may make certain features of your preferred Player Run Shard unavailable. \n\nWhat good is this installation package?\n\nThis installation package is designed to give those players that wish to play on most Player Run Shards a stable and robust client. \n\nWhile OSI/EA continues to improve their client software and update their image data, many Player Run Shards have settled on a snapshot in time which may be incompatible with these changes. These changes sometimes cause conflicts with the existing Player Run Shards. I.e., the new Kingdom Reborn client changed the map which causes problems with certain Player Run Shards. \n\nThis Ultima Online Golden Client is not recommended for players that are currently playing on OSI/EA shards because the patch level is not up to date.\n\nBut what if I want to play OSI/EA?\n\nThe latest OSI/EA client will probably work with your preferred Player Run Shard. These older clients are just a bit more stable for use with several of the more popular Player Run Shards. In any case; the good news is that because OSI/EA makes their client software freely available, players can easily always uninstall this Player Run Shard Golden Client and reinstall the current OSI/EA client software.\n","torrent":{"xt":"urn:btih:86f72391b5b070d310692f74060d6041510baf65","amp;dn":"uoml_setup.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f72391b5b070d310692f74060d6041510baf65","infoHashBuffer":{"type":"Buffer","data":[134,247,35,145,181,176,112,211,16,105,47,116,6,13,96,65,81,11,175,101]},"announce":[],"urlList":[]}}