{"title":"No Country for old Men DVDRip (2007)","uid":4169577,"size":734182979,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:870fe38d3c09121af5ac4fd2dd784695f915c5a7&amp;dn=No+Country+for+old+Men+DVDRip+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nowgulli","files":2,"time":1209782930,"description":"No Country for Old Men is as exceptional a mix of two creative talents- the Coen brothers, Joel and Ethan Coen, and author Cormac McCarthy (recent winner of the Pulitzer for The Road, his own masterpiece) as one could imagine, as they converge on a story that in lessor hands would be just a B movie. The story concerns an average Joe out hunting one day in Texas who comes across a bunch of dead bodies, heroin, and a satchel with 2 million in cash. He takes it, but without knowing that a true embodiment of a psychopath (Javier Bardem) is on his trail, and as he evades him it becomes more and more clear the fatalism that lies in store, as a weathered sheriff (Tommy Lee Jones) is also on the trail with perpetulally sad eyes looking on from his stolid demeanor. \n\nMore than this, it&amp;#039;s also about as good a morality play as one could ask for, because it plays and tools and makes very serious questions about what is moral, or what isn&amp;#039;t, or what is so ambiguous that it&amp;#039;s all up to the toss of a coin or a chance ride out of town. There are a few interpretations to Bardem&amp;#039;s character Anton that could be taken, but one thing is certain- he&amp;#039;s less a symbol than a real presence, a &quot;ghost&quot; as Jones&amp;#039;s sheriff calls him that can come around at the drop of a pin, usually in the dark, and strike the utmost fear (or confusion if you&amp;#039;re a clerk) in the hearts of men and women. You&amp;#039;ll never look at a coin toss the same way again. Or an air-gun. Or fixing a bullet wound in a leg. Or a hunt at a motel. Or even the aftermath of a car crash.\n\n","torrent":{"xt":"urn:btih:870fe38d3c09121af5ac4fd2dd784695f915c5a7","amp;dn":"No+Country+for+old+Men+DVDRip+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870fe38d3c09121af5ac4fd2dd784695f915c5a7","infoHashBuffer":{"type":"Buffer","data":[135,15,227,141,60,9,18,26,245,172,79,210,221,120,70,149,249,21,197,167]},"announce":[],"urlList":[]}}