{"title":"Steptoe and son MP3 as complete as I can get them","uid":4041074,"size":1066846050,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87fcd07512af684ca6945f173f50cbcf0a577438&amp;dn=Steptoe+and+son+MP3+as+complete+as+I+can+get+them&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Welshguy","files":40,"time":1203685645,"description":"Steptoe and Son is a British sitcom written by Ray Galton and Alan Simpson about two rag and bone men living in Oil Drum Lane, a fictional street in Shepherd's Bush, London. Four series were aired on the BBC from 1962 to 1965, followed by a second run from 1970 to 1974. Its theme tune, &quot;Old Ned&quot;, was composed by Ron Grainer. In a 2004, BBC, poll to find &quot;Britain's Best Sitcom&quot;, Steptoe and Son was voted 15th best British sitcom of all time.[1]\n\nThe show had its roots in a 1962 episode of Galton &amp; Simpson's Comedy Playhouse entitled &quot;The Offer&quot;. Galton &amp; Simpson had split from Tony Hancock, for whom they had written Hancock's Half Hour, and had agreed to write a series of six comedy shows for the BBC. The fifth in the series, &quot;The Offer&quot;, was born partly out of writer's block, and partly from budgetary contraints. Earlier shows in the series had cost more than expected, and so Galton &amp; Simpson decided to write a two-hander set in one room.\n\nAlthough Galton &amp; Simpson had initially expected a different pilot from the series to have been commissioned (&quot;Clicquot Et Fils&quot; starring Eric Sykes as a French undertaker), they were reportedly overwhelmed by the reaction to &quot;The Offer&quot;, and later that year, the first of eight series was commissioned, the first four of which were made in black and white. Each series comprised five to eight half-hour episodes, and the last was transmitted in 1974. At the peak of the series' popularity, it commanded viewing figures of some 28 million per episode. In addition, the early 1970s saw two feature films, two 45-minute Christmas specials and a number of radio shows based on the TV scripts. In 2005, the play Steptoe and Son in Murder at Oil Drum Lane, written by Ray Galton and John Antrobus, brought the storyline to a close.\n\nThe series was one of the first UK situation comedy programmes to employ actors rather than comedians in the principal roles. Galton and Simpson had decided themselves that they wanted to try to write for performers who &quot;didn't count their laughs&quot;.\n\n\n\nPlease seed after you download!!","torrent":{"xt":"urn:btih:87fcd07512af684ca6945f173f50cbcf0a577438","amp;dn":"Steptoe+and+son+MP3+as+complete+as+I+can+get+them","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87fcd07512af684ca6945f173f50cbcf0a577438","infoHashBuffer":{"type":"Buffer","data":[135,252,208,117,18,175,104,76,166,148,95,23,63,80,203,207,10,87,116,56]},"announce":[],"urlList":[]}}