{"title":"Monster Hunter Portable 2nd G for PSP","uid":4258659,"size":783398087,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:8933643ba01f0661def668b71b2aaa08c5a3154f&amp;dn=Monster+Hunter+Portable+2nd+G+for+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"topdsmis","files":1,"time":1214355352,"description":"Monster Hunter Portable 2nd G is the latest game in the Monster Hunter franchise for PlayStation Portable. It is an expansion to the original Monster Hunter Freedom 2 (Monster Hunter Portable 2nd in Japan) and was released on March 27, 2008 in Japan. Capcom has no plans to release the game in other countries.\n\nAs for the release in Japan - a special edition PSP bundle was announced for 25.000 Yen (roughly 230 USD), which includes the game, two pouches of different sizes, a strap, and a decorated bronze/brown PSP. In addition to this bundle, people who pre-ordered the game in Japan received a black, hairy strap. The hair on the strap is meant to be that of a monster exclusive to the game - the Narugakuruga.\n\nNew for this expansion is new monsters, new weapons, a whole new area called Ocean of Trees, G-Rank missions, and the option of hiring a Felyne Warrior to help the player on missions. The maximum HR that can be achieved is 9, weapons and armour now go up to rarity 10, weapons now have a new sharpness level &quot;purple&quot;. Players who have the previous game Monster Hunter portable 2 can transfer their character and all their weapons and armour to the new game.\n\nMonster Hunter Portable 2nd G also allows for players to install all media files to the memory stick - further improving loading times.","torrent":{"xt":"urn:btih:8933643ba01f0661def668b71b2aaa08c5a3154f","amp;dn":"Monster+Hunter+Portable+2nd+G+for+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8933643ba01f0661def668b71b2aaa08c5a3154f","infoHashBuffer":{"type":"Buffer","data":[137,51,100,59,160,31,6,97,222,246,104,183,27,42,170,8,197,163,21,79]},"announce":[],"urlList":[]}}