{"title":"WindowBlindsEnhanced.v6.2.Build.43_GzT","uid":4162978,"size":67342077,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8a09ccfcf5f41ef25fdea211baddbc6c6e534ecd&amp;dn=WindowBlindsEnhanced.v6.2.Build.43_GzT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"raizenpk","files":54,"time":1209470158,"description":"Tired of your computer having the same old look as every other computer? Want to give your Windows PC its own unique style? Stardock WindowBlinds will let you apply thousands of different skins (visual styles) to change the look and feel of your entire desktop. WindowBlinds is so flexible that users can create skins that mimic the look and feel of other operating systems.\n\n\nCustomize the look &amp; feel of Windows\nTired of your computer having the same old look as every other computer? Want to give your Windows PC its own unique style? Stardock WindowBlinds will let you apply thousands of different skins (visual styles) to change the look and feel of your entire desktop. WindowBlinds is so flexible that users can create skins that mimic the look and feel of other operating systems.\n\nNot Just Eye Candy\nWindowBlinds doesn&amp;#039;t just make Windows look better, it can make it more functional. You can create your own skins that add additional buttons to the title bar that provide additional functionality such as roll-up buttons, link buttons, program short cuts, even media player controls. Moreover, because WindowBlinds uses the latest features of your graphics card, it can make Windows even faster than the default Windows XP or Aero style.\nYou are in control\n\nEven with thousands of different visual styles to choose from, you can customize those visual styles as well. WindowBlinds gives you total control over your graphical user interface. WindowBlinds will let you change the color of your Windows GUI, change your wallpaper, give different windows their own specific look, choose a new Windows taskbar and Start button.\n\nImprove your productivity\nWindowBlinds has features that significantly enhance a user&amp;#039;s productivity when it comes to interacting with windows. For example, you set WindowBlinds to minimize windows just by right-clicking on the title bar, a great feature for minimizing several windows quickly without having to resort to minimize all.\n\n\n\nFeatures:\nNew start menu animation support\nCategory filtering on skins in wbconfig\nTag filtering on wallpapers in wbconfig\nRandom skin support\nThe ability to save a re-coloring of a skin as a preset\nAdvanced HSL re-coloring where you pick a single color and a range in a skin and you can just change that color instead of the entire skin\nAbility to edit the system colors from wbconfig\nAbility to change skin fonts from wbconfig\nAbility to control transparency and blur on start menu, menus, taskbar &amp; window frames.\nAbility to save such changes as a preset\nVista-Ize me function which sets some defaults to have a more vista like look\nAbility to skin the sidebar\nAbility to edit a sidebar skin from within wbconfig\nImproved WB skin install when handling upgrades of skins\nAbility to alter the mouse over animation speed\nAbility to alter the default button pulsing speed\nSupport for explorer background bitmaps\nAbility to use the Aero frames with the rest of the skin\nBlur support in title bars (and menus on vista)\nLots of new sections for new Vista specific parts\nIncluding IE navigation arrows, IE tabs, start menu shutdown/lock buttons\nSkins virtually every aspect of the Windows GUI\nClean and easy configuration dialog.\nTons of configuration options for users\nAnimation supported on titlebars, buttons, and many other elements.\nChange the color of any visual style on the fly\nPer-application visual styles\nDoesn&amp;#039;t alter any system files\nSafe, reliable way to change the look and feel of Windows\n\nInstall notes:\n\n1) Install WindowBlinds\n\n2) Close Activation Window (twice)\n\n3) Start Task-Manager and End Process:\nVista: WbVista.exe (and VistaSrv.exe if listed)\nXP...: WBINST~1.exe\n\n4) Start the Patcher and apply the patch to WbSrv.dll\n\n5) Use the Save License option in the same folder as above.\n\nEnjoy ;)","torrent":{"xt":"urn:btih:8a09ccfcf5f41ef25fdea211baddbc6c6e534ecd","amp;dn":"WindowBlindsEnhanced.v6.2.Build.43_GzT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a09ccfcf5f41ef25fdea211baddbc6c6e534ecd","infoHashBuffer":{"type":"Buffer","data":[138,9,204,252,245,244,30,242,95,222,162,17,186,221,188,108,110,83,78,205]},"announce":[],"urlList":[]}}