{"title":"Eckhart Tolle and Oprah Live Webcast Even DivX MedRes 01","uid":4111603,"size":293497852,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a6c5cdc2b1eb280cf895c3253f6b67f200f4f33&amp;dn=Eckhart+Tolle+and+Oprah+Live+Webcast+Even+DivX+MedRes+01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Communi_Tea","files":1,"time":1207086345,"description":"This is the first Oprah-Eckhart Tolle live webcast\n\nvideo Codec: DivX\nVideo Bitrate: 1000kbps\nAudio Codec: mp3\nAudio Bitrate: 128kbps\nI converted this to Avi format for those of you who find it easier to work with the more familiar avi format. I converted it at medium quality for easier download, I will also creat a higher quality torrent for those of you who want the crispy picture and don&amp;#039;t mind a bigger download. The medium quality file is not a bad piture quality at all considering the file size of just 279mb. I hope you enjoy this video as much as I do.\n\nThis is the first Oprah-Eckhart Tolle live webcast\n`````````````````````````````````````````````````````````````````````\nAre You Ready to Be Awakened?\n\nFor the first time ever, you can join Oprah Winfrey and Eckhart Tolle, as they teach how you can experience A New Earth in Oprah&amp;#039;s worldwide classroom live Tuesday morning/afternoons in Australia on Oprah.com.\n\nBy reserving your seat for this 10-week interactive webinar, you&amp;#039;ll be able to:\n\n    * Watch and participate in the live classroom webcasts\n\n    * Ask Oprah and Eckhart Tolle questions before and during class\n\n    * Connect with others who are seeking to become more aware of themselves?and the world around them\n\n    * Download and save your thoughts in an exclusive workbook\n\n    * Access the classroom video archives?and more! \n\nRemember, you need to join Oprah&amp;#039;s book club to participate in these Webcasts. You can register now -- just &gt;Click Here\n\nIn order to view the A New Earth Web Event, you will need to install a special media player from Move Networks. The player will enable you to watch Oprah and Eckhart Tolle in a personal, extraordinary viewing experience!\n\nThe installation process will only take several minutes to complete. First, go to this page, then click on the &quot;Install Now&quot; button.\n\nBe sure to set your (Outlook) calendar to remind you to go to Oprah&amp;#039;s site for the link to her Book Club on Tuesdays from March 4th to May 6th for viewing in Australia.\n\nObviously, you will get the most from the Web course if you&amp;#039;ve read or are reading A New Earth. Eckhart&amp;#039;s book can be obtained from most good bookstores or you can order it in print or on CD from Clearsight in Fremantle, Western Australia. \n\nAbout the Author\n\nEckhart Tolle Eckhart Tolle, 59, who was born in Germany and educated in Britain, has for more than a decade made his home in Vancouver, where he now lives close to the University of British.Columbia. campus.\n\nTravelling widely to lecture, while inspiring a global network of study groups for those interested in his teachings, Eckhart will join Oprah in early March to lead readers around the world in free, weekly, live classroom discussions of each chapter of A New Earth.\n\nEckhart&amp;#039;s earlier work, The Power of Now, is already a best-seller and one of Oprah&amp;#039;s Favourite Books on her Web site.\n\nThe Power of Now, which forms the foundation of A New Earth, shows readers how to find freedom form mind-made suffering and total identification with the ego. This can lead to the discovery of our true nature which many refer to as an Awakening. ","torrent":{"xt":"urn:btih:8a6c5cdc2b1eb280cf895c3253f6b67f200f4f33","amp;dn":"Eckhart+Tolle+and+Oprah+Live+Webcast+Even+DivX+MedRes+01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a6c5cdc2b1eb280cf895c3253f6b67f200f4f33","infoHashBuffer":{"type":"Buffer","data":[138,108,92,220,43,30,178,128,207,137,92,50,83,246,182,127,32,15,79,51]},"announce":[],"urlList":[]}}