{"title":"Adult Entertainment A Psychosocial Study of an American Obsessio","uid":4242687,"size":123486202,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8b8388db7002a5800e1c84e6bd6b366981d5d0b9&amp;dn=Adult+Entertainment+A+Psychosocial+Study+of+an+American+Obsessio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cic","files":3,"time":1213630514,"description":"Adult Entertainment A Psychosocial Study of an American Obsession?Educator?s Edition\n\nAward-winning director Lance Tracy balances serious science with tongue-in-cheek humor to create a documentary scrutinizing the scope and effects of pornography that is informative, compelling, and unsettling. Constructing an experiment to identify attitudinal and behavioral changes that manifest as a result of viewing porn?a study in the manner of the Annenberg School of Communications and California State University studies?Tracy tracks two men, one single and one married, for 60 days. The effects of a 30-day regimen of X-rated DVDs, Internet porn, adult mags, sex shops, and strip clubs, followed by a 30-day readjustment period, are both illuminating and dismaying. Porn addiction, the sex-industrial complex, and porn-related freedom of speech issues are also explored. Commentary by the University of Pennsylvania?s Mary Anne Layden; Judith Reisman, author of ?Soft Porn? Plays Hardball; Robert Weiss, of the Sexual Recovery Institute; Michael Castleman, author of Great Sex; and psychologist Daniel Linz is featured. Contains mature themes and explicit language and imagery. Some language may be offensive. Viewable/printable documents such as the actual 88-question study survey and the survey results for the single subject, the married subject, and his wife are available online. (55 minutes)","torrent":{"xt":"urn:btih:8b8388db7002a5800e1c84e6bd6b366981d5d0b9","amp;dn":"Adult+Entertainment+A+Psychosocial+Study+of+an+American+Obsessio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8388db7002a5800e1c84e6bd6b366981d5d0b9","infoHashBuffer":{"type":"Buffer","data":[139,131,136,219,112,2,165,128,14,28,132,230,189,107,54,105,129,213,208,185]},"announce":[],"urlList":[]}}