{"title":"The Fugitive S01E02 The Witch DVDRip DivX","uid":4257283,"size":419756062,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8b955bf744b70a47a79581f0fd94af7d3ce8a77f&amp;dn=The+Fugitive+S01E02+The+Witch+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":3,"time":1214302659,"description":"The Fugitive Season 1 (1963)\nS01E02 The Witch\nFirst aired: 9/24/1963 \nWhile working as a handyman in a backwater community in Missouri, Kimble has a few run-ins with a young girl named Jenny Ammory, who is a pathological liar and speaks to a rag doll she calls &amp;#039;Nyet,&amp;#039; which she keeps at a nearby pond. Jenny uses Kimble as an excuse when she&amp;#039;s late for school when she claims that a man attacked her. When Kimble shows up making a routine delivery of supplies to the school, Jenny identifies him as the man who attacked her. As Jenny&amp;#039;s teacher, Emily Norton, speaks to Kimble about Jenny&amp;#039;s compulsive lying, Jenny runs home and tells her mother she saw her teacher and the local handyman kissing in the barn. Kimble gets roughed up by his co-workers while Emily gets fired and both are advised to leave town. Kimble goes to a school hearing on Emily&amp;#039;s behalf and tries to clear her by catching Jenny in a lie. But his plan backfires when the skeptic townspeople believe Jenny and decide to form a lynching party to track Kimble down. Elisha Cook Jr. guest stars.\n(There was a movie remake of the 1936 movie &quot;These Three&quot; (Miriam Hopkins, Merle Oberon) called &quot;The Children&amp;#039;s Hour&quot; (Lillian Hellman play, 1934) starring Shirley McClaine and Audrey Hepburn that had this same plot that came out in 1962.)\n\nCast: David Janssen as Dr. Richard Kimble, Barry Morse as Lt. Philip Gerard, Bill Raisch as Fred Johnson (The One-Armed Man), Diane Brewster (flashbacks) as Helen Kimble, J.D.Cannon as Lloyd Chandler, William Conrad as Narrator (voice).\n\nGuest cast: Crahan Denton (H. R. Ammory) , Pat Crowley (Emily Norton), Madeleine Sherwood (Mrs. Ammory), Arch Johnson (Ty Tyson), Gina Gillespie (Jenny), Elisha Cook Jr. (Sailor), George Mitchell (Mr. Sturgis), Ray Teal (McNary), Claudia Bryar (Mrs. Sturgis) \nDVD&gt;DivX/640x480/972kbps/23.976fps/mp3/48KHz/stereo/103Kbps/51min/400Mb","torrent":{"xt":"urn:btih:8b955bf744b70a47a79581f0fd94af7d3ce8a77f","amp;dn":"The+Fugitive+S01E02+The+Witch+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b955bf744b70a47a79581f0fd94af7d3ce8a77f","infoHashBuffer":{"type":"Buffer","data":[139,149,91,247,68,183,10,71,167,149,129,240,253,148,175,125,60,232,167,127]},"announce":[],"urlList":[]}}