{"title":"Horny young lezzies do naughty threesome [ Caught in the Act ]","uid":4250193,"size":110906196,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:8c90925f17b5fabf18c547f9d2ba4324d3fe2679&amp;dn=Horny+young+lezzies+do+naughty+threesome+%5B+Caught+in+the+Act+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"johnywong","files":1,"time":1213973872,"description":"You see me lying on the bed naked with my legs spread open. There is a head between my legs but this head is definitely not male. Your eyes become adjusted to the dim light and you recognize the head between my legs. Even from behind you know the long red hair that belongs to my friend Rachael. Realization hits you like a gale force wind! It is Rachael giving such intimate attentions to my pussy not a man but Rachael my friend my girlfriend. You are witnessing my first bi-sexual experience. Immediately your member becomes stiff within your pants as you watch the beautiful site before you.\n\nSuddenly my eyes open wide and connect with your own. There is no fear or anger in my eyes only an acceptance and a pleasure in your presence like I was hoping you would make an appearance. My eyes close once again as Rachael s talented tongue sends me spiraling into orgasmic oblivion. You do not want to interrupt the sight before you afraid that if you interfere it will stop never to be repeated. Quietly you make your way across my bedroom with your sites set upon a chair placed in a dark corner. You sit in that chair and turn your attentions on the action on the bed and watch. That is all you do you just watch.\n\nYou sit in excited silence in your dark corner of the room. You watch the action on the bed like your own lesbian porno played out for your own pleasure. You attempt to photograph each image within your mind never to forget the beautiful site before your eyes.\n\nYou watch Rachael s backside her long straight electric red hair cascading down her backside contrasting with her porcelain white skin. Her arms were tightly wrapped around my thighs and her head is moving slightly as her tongue continues to tease into the depths of my aroused sex. You look upon Rachael s body being able to view her naked backside for the first time her full figure curving provocatively into the perfect full hour glass shape her creamy white buttux wiggling slightly as she works diligently to satisfy my passions.\n\nFinally you turn your attentions to me your highly sexual and newly bi-sexual girlfriend. You watch as my body convulses as orgasm after torturous orgasm rips it s way through my body. My long mane of curly light brown hair is spread out in a halo around my head a contrasting color to that of my burgundy comforter. You watch as my face contorts into pleasure filled expressions. My chest rises and falls with each rapid breath my handful sized breast rounding into my armpits and my dusky nipples standing erect against the tissue of my chest.\n\nThe room is filled with an assortment of aromas the smell of vanilla the joining of two perfumes one you recognize as mine the other you figure belonging to Rachael a slight hint of jasmine. Also there is the potent smell of arousal and just as with the perfumes you recognize not only my smell but also a new enticing smell. You know this new scent must be the scent of Rachael and you can t help but wonder how wet she is becoming as she intently works her tongue to please my aroused pussy.\n\nYou already know that my pussy is drenched in my juices because you hear the passionate noises as orgasms spasm through me. You watch as I begin to play with my breasts squeezing and kneading the tissue and running the palms of my hands over the marble hard sensitive buds. You so enjoy seeing me playing with myself and you watch intently as I please and tease my wondrous hard nipples.\n\nThe whole scene plays out in front of you and it has you harder than ever before. Your arousal throbbingly builds up stiff in your pants. A few times you have to make slight adjustments so you erection isn t pinned in a painful direction.\n\nWith your high level of arousal the thought of joining the foray on the bed cannot help but cross your mind. Even though you cannot help the workings of your mind you can help your body. So there you stay suffering in your own arousal because this was my wish.\n\n*** You think back to a conversation we had about this exact situation. It was an easy afternoon and the thought of a three-way had just crossed your mind. Of course the only three-way you could consider was a two female and one male type of three-way though this wasn t my only idea of a three-way. We had a very honest and open relationship so you felt no nervousness at telling me your thoughts. The thought came really for no particular reason other than it was there.","torrent":{"xt":"urn:btih:8c90925f17b5fabf18c547f9d2ba4324d3fe2679","amp;dn":"Horny+young+lezzies+do+naughty+threesome+%5B+Caught+in+the+Act+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c90925f17b5fabf18c547f9d2ba4324d3fe2679","infoHashBuffer":{"type":"Buffer","data":[140,144,146,95,23,181,250,191,24,197,71,249,210,186,67,36,211,254,38,121]},"announce":[],"urlList":[]}}