{"title":"SuperDuper 2.5 + serial (Leopard)","uid":4046737,"size":3189714,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8cf1a222634e7a8b50b31494d620d1f37711821e&amp;dn=SuperDuper+2.5+%2B+serial+%28Leopard%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mackenneth","files":1,"time":1203962796,"description":"Product Description:\nCarbon copies. And a whole lot more. \nThe 2005 and 2006 Eddy Award winning SuperDuper is the most advanced, yet easy to use disk copying program available for OS X. It can, of course, make a straight copy, or \\&quot;clone\\&quot; -- useful when you want to move all your data from one machine to another, or do a simple backup. In moments, you can completely duplicate your boot drive to another drive, partition, or image file. \n\nClones, though, don\\&amp;#039;t work very well when it\\&amp;#039;s time to recover from an unexpected system disaster - like a bad driver or OS update. Unless you take specific steps, restoring a drive image restores everything on the drive, overwriting both the system and user files. If that\\&amp;#039;s what you want to do, great. But it\\&amp;#039;s usually not, since all the work you\\&amp;#039;ve done since the backup would be lost! \n\nClones for safety. \nTo ensure you can safely roll back a system after the unexpected occurs, SuperDuper doesn\\&amp;#039;t stop there. \n\nWith a few clicks, you can easily \\&quot;checkpoint\\&quot; your system, preserving your computer\\&amp;#039;s critical applications and files while you run on a working, bootable copy. If anything goes wrong, just reboot to the original. When you do, your current Documents, Music, Pictures -- even iSync data -- are available! You can get back to work immediately! \n\nClones for industry! \nSuperDuper has enough features to satisfy the advanced user, too. Its simple-but-powerful Copy Script feature allows complete control of exactly what files get copied, ignored, even aliased (\\&quot;soft linked\\&quot; for the Unix inclined) from one drive to another! \n\nSuperDuper is perfect for software developers, software \\&quot;seed\\&quot; sites, QA testers, even system administrators.\n\nWhat\\&amp;#039;s new in this version:\nFull Leopard support\nCan store a bootable backup side-by-side with a Time Machine backup on a single volume\nCan copy Time Machine backup volumes to other drive when you need more space (or want to back up your archived data)\n\\&quot;Run Now\\&quot; button for scheduled copies\nAutomatic preservation of any custom icon on the destination volume\nImproved Spotlight handling\nPerformance and other improvements\nOf course, the new SuperDuper 2.5 still improves on the acclaimed original in many ways, including:\nThe ability to easily schedule backups\nAdditional imaging options\nMore control over shutdown\nBetter AppleScript support\nHundreds of UI improvements\nGrowl support\nAnd a completely rewritten, task-based User\\&amp;#039;s Guide.\n\nOperating System Requirements:\n\nThis product is designed to run on the following operating systems:\nMac OS X 10.5 Intel\nMac OS X 10.5 PPC\nMac OS X 10.4 Intel\nMac OS X 10.4 PPC\n\nAdditional Requirements:\nDoes not support optical or tape drives.","torrent":{"xt":"urn:btih:8cf1a222634e7a8b50b31494d620d1f37711821e","amp;dn":"SuperDuper+2.5+%2B+serial+%28Leopard%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf1a222634e7a8b50b31494d620d1f37711821e","infoHashBuffer":{"type":"Buffer","data":[140,241,162,34,99,78,122,139,80,179,20,148,214,32,209,243,119,17,130,30]},"announce":[],"urlList":[]}}