{"title":"Squash Bowels - Love songs (www.metal-legions.com)","uid":4035623,"size":43182414,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d2340bc3af10c2bbb903940d8ef8d68e9f0a0a6&amp;dn=Squash+Bowels+-+Love+songs+%28www.metal-legions.com%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jimbolic666","files":16,"time":1203420319,"description":"www.metal-legions.com Presents A darker Site of Torrents release\n\n[quote]Biography:\nSQUASH BOWELS came into being in April 1994, with the line-up: Rogal - drums, Lechu - guitar, Arthutr - bass, voc , Marius - voc. In July &amp;#039;94, with this line-up, they recorded a demo tape &quot;Furgott&quot;. The same material was supposed to be released as a split 7&quot;EP with CATASEXUAL URGE MOTIVATION on Extermination Rec. In the end of November &amp;#039;95 SQUASH BOWELS recorded a second demo &quot;Dead?&quot;. The same material was supposed to be released as &quot;Something Nice&quot; 7&quot;EP on Obliteration Rec. from Japan. After the recording Lechu (guit.) left the band and he was replaced by Zibi (guit.). The band recorded &quot;International Devastation&quot; demo the same year. Demo was released as a split CD with MALIGNANT TUMOUR on Obscene Productions. After the release Marius left the band so they continued as a 3-piece: Zibi (guit., voc.), Arthur (bass, voc.), Rogal (dr., voc.). \nIn April 1997 Rogal left the band and was replaced by Olek (dr.). After that SQUASH BOWELS played a few little tours in Poland and Europe and recorded lots of songs which appeared on Split 7&amp;#039;EP with BIRDFLESH (Fudgeworthy Records), Split 7&amp;#039;EP with DISGORGE - mex. (Bizzare Leprous Prod.) and Split 7&amp;#039;EP with COCK AND BALL TORTURE (Bizzare Leprous Prod.). After that the same line up recorded long awaited first album &quot;Tnyribal&quot;, on Obscene Productions. \nAfter the tour Maly and Olek left the band and were replaced by two brothers Psychoradek (dr.) and Pierscien (git.,voc.) - both from NEUROPATHIA and INCARNATED. In this line up Squash Bowels recorded second CD &quot;The Mass Rotting...The Mass Sickening&quot;. The cd was released on Obscene Production also, so band played at Obscene extreme Festival 2002 and &quot;The Mass Rotting Tour 2002&quot; together with ABORTION. In 2003 SQUASH BOWELS recorded last album &quot;No Mercy&quot; for Obscene Production and Pierscien decided to leave the band. He was replaced by Andy (guit.) - also guitarist of DAMNABLE.\nIn this line-up band played at &quot;Grind Tour de Pologne IV&quot; with CEREBRAL TURBULENCY and PARRICIDE and after that at the Obscene Extreme Festival 2004.\nIn Autumn 2004 they played &quot;Grind Invasion Tour&quot; in Slovakia and Czech Republic together with ABORTION and NEEDFUL THINGS.\nIn March &amp;#039;05 SQUASH BOWELS recorded 14 new songs. After the recording band played complete European No Mercy Days Tour together with other polish band PARRICIDE. \nNew CD &quot; Love songs&quot; was released in Lifestage Production, new label of Arthur (bass player of SB) in November 2005. \nIn Autumn 2005 (November) they played &quot;Baltic Assault Tour&quot; in Poland, Estonia and Finland together with INFERIA.\nHere is actual line up: Andy (guit.), Arthur (bass, voc.), Psychoradek (dr.) \n[/quote]\n\n[img]http://s142.photobucket.com/albums/r85/onekillwonder666/th_images-3.jpg[/img]\nTracklist - \n1. DEAD FIELD\n2. GRIND STANDART\n3. UNGOVERNABLE\n4. SYRINGE WITH WIT\n5. SEARCHING FOR THE KILL\n6. STINKER SPOILING FOR A FIGHT\n7. MORE OUR COLOURS\n8. TO FLASH THE HASH...\n9. RUTHLESS RABBLE\n10. SWINISH SNOUT - LIAR\n11. NAIVE...\n12. WOUND FUCK (GUT - cover)\n13. FUCK INSTRUCTOR\n14. neuron  - bonus\n15. sick control - bonus[/center]","torrent":{"xt":"urn:btih:8d2340bc3af10c2bbb903940d8ef8d68e9f0a0a6","amp;dn":"Squash+Bowels+-+Love+songs+%28www.metal-legions.com%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d2340bc3af10c2bbb903940d8ef8d68e9f0a0a6","infoHashBuffer":{"type":"Buffer","data":[141,35,64,188,58,241,12,43,187,144,57,64,216,239,141,104,233,240,160,166]},"announce":[],"urlList":[]}}