{"title":"Tim Russert - Big Russ &amp; Me (Audiobook)","uid":4255352,"size":384752303,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8d4dfeb78d74dbaf759373b33e2efa660cf62c4f&amp;dn=Tim+Russert+-+Big+Russ+%26+Me+%28Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":54,"time":1214219641,"description":"Title: Big Russ and Me - Father and Son: Lessons of Life (Read by the Author)\nAuthor: Tim Russert\nFormat: Audio MP3 (160Kbps)\nSize: 5 Discs at 366 MBs\n\nDescription: Veteran newsman and Meet the Press moderator Tim Russert is known for his direct and unpretentious style and in this charming memoir he explains why. Russert&amp;#039;s father is profiled as a plainspoken World War II veteran who worked two blue-collar jobs while raising four kids in South Buffalo but the elder Russert&amp;#039;s lessons on how to live an honest, disciplined, and ethical life are shown to be universal. Big Russ and Me, a sort of Greatest Generation meets Tuesdays with Morrie, could easily have become a sentimental pile of mush with a son wistfully recalling the wisdom of his beloved dad. But both Russerts are far too down-to-earth to let that happen and the emotional content of the book is made more direct, accessible, and palatable because of it. The relationship between father and son, contrary to what one would think of as essential to a riveting memoir, seems completely healthy and positive as Tim, the academically gifted kid and later the esteemed TV star and political operative relies on his old man, a career sanitation worker and newspaper truck driver, for advice. Big Russ and Me also traces Russert&amp;#039;s life from working-class kid to one of broadcast journalism&amp;#039;s top interviewers by introducing various influential figures who guided him along the way, including Jesuit teachers, nuns, his dad&amp;#039;s drinking buddies, and, most notably, the late New York Senator Daniel Patrick Moynihan, whom Russert helped get elected in 1976. Plenty of entertaining anecdotes are served up along the way from schoolyard pranks to an attempt to book Pope John Paul II on the Today Show. Though not likely to revolutionize modern thought, Big Russ and Me will provide fathers and sons a chance to reflect on lessons learned between generations. --Charlie Williams","torrent":{"xt":"urn:btih:8d4dfeb78d74dbaf759373b33e2efa660cf62c4f","amp;dn":"Tim+Russert+-+Big+Russ+%26+Me+%28Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d4dfeb78d74dbaf759373b33e2efa660cf62c4f","infoHashBuffer":{"type":"Buffer","data":[141,77,254,183,141,116,219,175,117,147,115,179,62,46,250,102,12,246,44,79]},"announce":[],"urlList":[]}}