{"title":"Devi (Bengali) [Dir: Satyajit Ray}","uid":4044320,"size":733786112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8e4f0f8217f2c00039acac4d80d738eca23e72de&amp;dn=Devi+%28Bengali%29+%5BDir%3A+Satyajit+Ray%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mainak1985","files":1,"time":1203828842,"description":"Producer:  \tSatyajit Ray Productions\nScreenplay &amp; Direction: \tSatyajit Ray, Based on the short story - &amp;#039;Devi&amp;#039; by Prabhat Kumar Mukherjee\nCinematography: \tSubrata Mitra\nEditing: \tDulal Dutta\nArt Direction: \tBansi Chandragupta\nSound: \tDurgadas Mitra\nMusic: \tUstad Ali Akbar Khan\n\t \nCast \t \nCharacter: \tPerformer\nDoyamoyee: \tSharmila Tagore\nKalikinkar Roy: \tChhabi Biswas\nUmaprasad: \tSoumitra Chatterjee\nTaraprasad: \tPurnendu Mukherjee\nHarasundari: \tKaruna Banerjee\nBhudeb: \tAnil Chatterjee\nKhoka: \tArpan Chowdhury\nProfessor Sarkar: \tKali Sarkar\nSummary\nThe film is set in 1860 at Chandipur, in rural Bengal, India. Doyamoyee (Sharmila Tagore) and her husband Umaprasad (Soumitra Chatterjee) live with his elder brother (Purnendu Mukherjee), his wife (Karuna Banerjee) and wealthy father, Kalikinkar Roy (Chhabi Biswas).\n\nKalikinkar Roy, the patriarch, is an aging widower. He is a respected landlord and a devotee of the Hindu goddess, Kali. Umaprasad, Doyamoyee&amp;#039;s husband, is away to study in Calcutta. She looks after her old father-in-law. She has a soft corner for her nephew Khoka, with whom she enjoys a fond relationship.\n\nRoy has a revelation in a dream that his daughter-in-law Doyamoyee is an incarnation of the goddess Kali. He insists she be worshiped. Then, a dying child is placed at her feet and he is miraculously cured. As the news spreads, the aged, sick and the poor come in hundreds; seeking cures and comfort. As Doyamoyee&amp;#039;s husband Umaprasad learns about the events, he returns home to her rescue. Umaprasad attacks the tradition and tries to reason with his father and tells him that he has gone insane. The father is unmoved. To him, the miracle cure demonstrates the truth of the his beliefs.\n\nUmaprasad tries to take her away, but to his surprise finds that she too has become convinced of her divine status. Doyamoyee&amp;#039;s nephew, the child Khoka, falls ill and is placed in her care. The child dies for lack of medical treatment in her arms. Her husband tries again to persuade her but it is too late. The child&amp;#039;s death has shattered her. Doyamoyee, the proclaimed goddess has gone mad. As he calls her, she is seen running away into a field and vanishing into the mist.","torrent":{"xt":"urn:btih:8e4f0f8217f2c00039acac4d80d738eca23e72de","amp;dn":"Devi+%28Bengali%29+%5BDir%3A+Satyajit+Ray%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e4f0f8217f2c00039acac4d80d738eca23e72de","infoHashBuffer":{"type":"Buffer","data":[142,79,15,130,23,242,192,0,57,172,172,77,128,215,56,236,162,62,114,222]},"announce":[],"urlList":[]}}