{"title":"Orin Meditations - The Millennium Journeys by Orin - Part 4","uid":4033599,"size":119830483,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8f4eda5770e3bbbee4bc1311c7eedc1d875ac77a&amp;dn=Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SuperManny","files":14,"time":1203287362,"description":"Meditations by Orin and Sanaya Roman\n Vol. 4 - Building a Radiant Aura\n\nThe Millennium Journeys by Orin\n &lt;a href=&quot;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm040d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm040d&lt;/a&gt;\n\n\nProgram 1:  Spirit Shining Through -- Bring the light of your spirit into your aura. Let it shine through and transform your mind, emotions, and body with its radiant light.\n\nProgram 2: Meeting the Angel of the Devas -- Meet the radiant angel who directs the devas, those tiny angelic beings who will assist you in building a radiant aura. Picture your environment beautiful with music, colors, flowers and all those things that draw the angelic kingdom to you.\n \nProgram 3: Spirit Devas -- Watch as these tiny butterfly-like angelic beings bring the light of spirit into every level of your aura?your etheric body; chakras; emotional, mental, physical bodies; atoms and cells.\n\nProgram 4: Radiant Mind Devas -- Imagine viewing your thoughts as they come from your higher mind into your mind. Let these sparkling, golden devas surround emerging thoughts with their light so that they emerge into your mind as clear ideas, insights, and guidance from your spirit and soul.\n\nProgram 5: Solar Devas?Work with the solar devas who bring you Solar light and all its gifts, then return to the Solar light carrying any denser energies that are ready to be transformed.\n \nProgram 6: Dimensional Devas -- Receive a constant, steady of light from higher dimensions and sources as you work with the devas who form a bridge with their bodies and build a channel for light to flow into you.\n\nProgram 7: Star Devas ?- Meet the tiny, five-pointed star devas who draw the energy of the stars into their points, then focus the light and transmit it to you, creating a channel for light from the Great Bear, Sirius, and the Pleiades to flow into your aura.\n\t\t\nProgram 8: Vision Devas -? These devas build light into the aura around your eyes so you can see and sense subtle energies. You can awaken your clairvoyant sight as you work with the angelic beings who assist you in having clear vision.\n\nProgram 9: Purifying Your Aura -- Learn how to work with your soul to repel energies you do not want. Meet and work with the angelic beings who clear and purify your aura, release lower energies, and then fill these places with light so you can become magnetic to all that is good and beautiful.\n\nProgram 10: Refining Your Aura -? Birth more light into your aura at subtler levels. Meet the devas that create a blue mist that does not allow lower energies to penetrate, and that carries the light of Sirius?the light of love and liberation from the influence of matter?into your cellular and atomic levels.\n\nProgram 11: Chakras Devas -- These are the devas who assist you in evolving your chakras through transferring the energy of your base center into your head center, your sacral center into your throat center, and your solar plexus center into your heart center. With these transferences you can express your soul&amp;#039;s purpose through your words, actions, and livelihood.\n\nProgram 12: Oneness Devas -- These little angelic beings weave lines of light to link you with the oneness of all life. Strengthen your connection to the earth, sun, Solar Light, Spiritual Sun, stars, and the Body of the One. Know yourself as a point of light within a greater light. \n","torrent":{"xt":"urn:btih:8f4eda5770e3bbbee4bc1311c7eedc1d875ac77a","amp;dn":"Orin+Meditations+-+The+Millennium+Journeys+by+Orin+-+Part+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f4eda5770e3bbbee4bc1311c7eedc1d875ac77a","infoHashBuffer":{"type":"Buffer","data":[143,78,218,87,112,227,187,190,228,188,19,17,199,238,220,29,135,90,199,122]},"announce":[],"urlList":[]}}