{"title":"Alex Jones Movies - iPod","uid":4245398,"size":3803394446,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:8f915e9dc7365856e245aff4f9eebd71f3466795&amp;dn=Alex+Jones+Movies+-+iPod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chakra71","files":6,"time":1213759961,"description":"----Terrorstorm-----\n\nThroughout history, criminal elements inside governments have carried out terror attacks against their own populations as a pretext to enslave them. TERRORSTORM reveals how, in the last hundred years, Western leaders have repeatedly murdered their own citizens while posing as their saviors.\n\nIn TERRORSTORM you will discover that September 11th, the attacks of 7/7 in London, and many other terrorist events were self-inflicted wounds. You will witness British Special Forces troops caught in the act of staging terror attacks in Iraq and see official US government documents laying out plans to hijack passenger planes by remote control. You will learn how the Reichstag fire, the Gulf of Tonkin, and the US-backed Iranian coup of 1953 are all interconnected false-flag terror events.\n\t\nThis powerful documentary explores the mindset of the average brainwashed Westerner. It delves deeply in to the systems of control which have been scientifically-crafted to imprison their minds and keep their eyes closed to the realities of the world around them. \n\n\nGeneral #0\nFormat                       : MPEG-4\nFile size                    : 571 MiB\nPlayTime                     : 2h 9mn\nMovie name                   : Terrorstorm\nPerformer                    : Alex Jones\nWriting application          : HandBrake 0.9.2 2008022300\n\nVideo #0\nCodec                        : AVC\nCodec/Info                   : H.264 (3GPP)\nPlayTime                     : 2h 9mn\nBit rate                     : 500 Kbps\nWidth                        : 640 pixels\nHeight                       : 480 pixels\nDisplay Aspect ratio         : 4/3\nFrame rate                   : 29.970 fps\nMinimum frame rate           : 29.963 fps\nMaximum frame rate           : 29.981 fps\nBits/(Pixel*Frame)           : 0.054\nStreamSize                   : 464 MiB\n\nAudio #0\nCodec/Info                   : AAC Low Complexity\nPlayTime                     : 2h 9mn\nBit rate mode                : VBR\nBit rate                     : 111 Kbps\nChannel(s)                   : 2 channels\nChannel positions            : L R\nSampling rate                : 48 KHz\nResolution                   : 16 bits\nStreamSize                   : 103 MiB\n\n\n-----Endgame-----\n\nJones chronicles the history of the global elite's bloody rise to power and reveals how they have funded dictators and financed the bloodiest warsÃƒÂ¢??creating order out of chaos to pave the way for the first true world empire.\nÃƒÂ¢?Ã‚Â¢ Watch as Jones and his team track the elusive Bilderberg Group to Ottawa and Istanbul to document their secret summits, allowing you to witness global kingpins setting the world's agenda and instigating World War III.\nÃƒÂ¢?Ã‚Â¢ Learn about the formation of the North America transportation control grid, which will end U.S. sovereignty forever.\nÃƒÂ¢?Ã‚Â¢ Discover how the practitioners of the pseudo-science eugenics have taken control of governments worldwide as a means to carry out depopulation.\nÃƒÂ¢?Ã‚Â¢ View the progress of the coming collapse of the United States and the formation of the North American Union.\n\nFormat                       : MPEG-4\nFile size                    : 700 MiB\nPlayTime                     : 2h 19mn\nBit rate                     : 701 Kbps\nStreamSize                   : 4.06 MiB\nMovie name                   : Endgame\nPerformer                    : Alex Jones\nWriting application          : HandBrake 0.9.2 2008022300\n\nVideo #0\nCodec/Family                 : AVC\nCodec/Info                   : H.264 (3GPP)\nPlayTime                     : 2h 19mn\nBit rate                     : 570 Kbps\nWidth                        : 640 pixels\nHeight                       : 368 pixels\nDisplay Aspect ratio         : 16/9\nFrame rate                   : 29.970 fps\nMinimum frame rate           : 29.963 fps\nMaximum frame rate           : 29.981 fps\nBits/(Pixel*Frame)           : 0.081\nStreamSize                   : 569 MiB\n\nAudio #0\nCodec                        : AAC LC\nCodec/Info                   : AAC Low Complexity\nPlayTime                     : 2h 19mn\nBit rate mode                : VBR\nBit rate                     : 127 Kbps\nChannel(s)                   : 2 channels\nChannel positions            : L R\nSampling rate                : 48 KHz\nResolution                   : 16 bits\nStreamSize                   : 127 MiB\n\n\n-----911: The Road to Tyranny-----\nTHE GOVERNMENT NEEDED A CRISIS TO CONVINCE THE PEOPLE TO WILLINGLY GIVE UP THEIR LIBERTY IN EXCHANGE FOR SAFETY. NOW THE PAINFUL FACTS ARE IN.\n\nTHE DARK FORCES OF GLOBAL GOVENMENT ARE FUNDING, TRAINING AND PROTECTING TERRORIST NETWORKS WORLDWIDE. 911 THE ROAD TO TYRANNY PART II DOCUMENTS THE RUTHLESS HISTORY OF GOVERNMENTS \n\nORCHESTRATING TERRORIST ATTACKS AGAINST THEIR OWN PEOPLE TO SCARE THEM INTO TOTAL SUBMISSION.\n\nIN THIS BRUTAL EXPOSE YOU WILL WITNESS THE BIRTH OF A GLOBAL POLICE STATE THAT SURPASSES ORWELL'S NIGHTMARISH VISION. IT'S ALL HERE: THE HISTORY OF GOVERNMENT-SPONSORED TERRORISM, THE MODERN IMPLEMENTATION OF FEAR-BASED CONTROL AND, MOST FRIGHTENING OF ALL, THE NEW WORLD ORDER'S FUTURE PLANS. THIS IS ONE FILM YOU CANNOT AFFORD TO IGNORE. THE FUTURE OF FREE PEOPLE EVERYWHERE IS AT STAKE.\n\nFormat                       : MPEG-4\nFile size                    : 768 MiB\nPlayTime                     : 2h 49mn\nBit rate                     : 632 Kbps\nStreamSize                   : 4.94 MiB\nMovie name                   : 911 - The Road to Tyranny\nPerformer                    : Alex Jones\n4-02 21:47:09\n\nVideo #0\nCodec                        : AVC\nCodec/Info                   : H.264 (3GPP)\nPlayTime                     : 2h 49mn\nBit rate                     : 500 Kbps\nWidth                        : 640 pixels\nHeight                       : 480 pixels\nDisplay Aspect ratio         : 4/3\nFrame rate                   : 29.970 fps\nMinimum frame rate           : 29.963 fps\nMaximum frame rate           : 29.981 fps\nBits/(Pixel*Frame)           : 0.054\nStreamSize                   : 608 MiB\n\nAudio #0\nCodec                        : AAC LC\nCodec/Info                   : AAC Low Complexity\nPlayTime                     : 2h 49mn\nBit rate mode                : VBR\nBit rate                     : 128 Kbps\nChannel(s)                   : 2 channels\nChannel positions            : L R\nSampling rate                : 48 KHz\nResolution                   : 16 bits\n\n\n-----Martial Law 9-11: The Rise of the Police State-----\n\nEvil has spread across the land. Martial Law: 9/11 Rise of the Police State exposes the high-tech control grid that is being set up across America.\n\nOut of the ashes of the September 11th tragedy, a dark empire of war and tyranny has risen. The Constitution has been shredded and America is now a Police State. This film exposes not just who was behind the 9-11 attacks, but the roots and history of its orchestrators.\n\nLEARN THE TERRIFYING SECRET THAT HOLDS THE FUTURE OF THE WORLD IN ITS GRASP\n\nFrom the frontlines of the Police State to the darkest sanctum of the secret society that controls it, Martial Law reveals the master plan of a group hell-bent on capturing America today -- and tomorrow the world.\n\nTHE NEW WORLD ORDER HAS SET IN MOTION THE FOURTH REICH\n\nMartial Law is a blazing spotlight piercing the electronic Berlin Wall of controlled corporate media. Plumb the depths of the Elite's minds: their ideology, their driving philosophy and uncover the power-mad 'cult of Death' that is sworn to turn the Earth into a prison planet. \n\nDiscover the documented truth yourself -- before it's too late.\n\nFormat                       : MPEG-4\nFile size                    : 631 MiB\nPlayTime                     : 2h 59mn\nBit rate                     : 490 Kbps\nStreamSize                   : 5.23 MiB\nPerformer                    : Alex Jones\n\nVideo #0\nCodec                        : AVC\nCodec/Info                   : H.264 (3GPP)\nPlayTime                     : 2h 59mn\nBit rate                     : 400 Kbps\nWidth                        : 640 pixels\nHeight                       : 480 pixels\nDisplay Aspect ratio         : 4/3\nFrame rate                   : 29.970 fps\nMinimum frame rate           : 29.963 fps\nMaximum frame rate           : 29.981 fps\nBits/(Pixel*Frame)           : 0.043\nStreamSize                   : 515 MiB\n\nAudio #0\nCodec                        : AAC LC\nPlayTime                     : 2h 59mn\nBit rate mode                : VBR\nBit rate                     : 86 Kbps\nChannel(s)                   : 2 channels\nChannel positions            : L R\nSampling rate                : 48 KHz\nResolution                   : 16 bits\nStreamSize                   : 111 MiB\n\n\n-----Order of Death &amp; Dark Secrets in Bohemian Grove-----\n\nTo commemorate the five year anniversary of his historic infiltration of the Bohemian Grove, the occult playground of the global elite, Alex Jones presents his newest film, The Order of Death, an amazing and horrifying look into the rites and rituals of the modern day descendants of Babylonian mystery cults.\n\nJones' &quot;Dark Secrets: Inside the Bohemian Grove&quot; documented the first ever hidden camera incursion into the Grove and the bizzare pagan ritual, the Cremation of Care, practiced by its members, all men, including both Presidents Bush, Bill Clinton, Jimmy Carter, Colin Powell, and Henry Kissenger to name but a few.\n\n&quot;The Order of Death&quot; picks up where &quot;Dark Secrets&quot; leaves off. This new work exposes the connections between the Bohemian Club and Skull and Bones and other occult secret societies. \n\nJones explores the roots of the Grove and its links to occult networks dating back to ancient Egypt and Babylon.\n\nThis new film delves deeply into the history of the Grove where powerful men make decisions that affect the world but are completely hidden from public scrutiny. &quot;The Order of Death&quot; details how the Grove has been the backdrop for some of the most earthshattering events in human history including the development of the Starwars program and the Manhattan Project.\n\nJones' newest forray into revealing the occult also had him butting heads with local protesters of the Grove who, like the owl-worshippers inside, try to conceal their own occult practices.\n\n&quot;The Order of Death&quot; also features never before seen footage captured by a daring former Grove employee including an astounding look inside the owl worshiped at the Cremation of Care ritual.\n\nFormat                       : MPEG-4\nFile size                    : 958 MiB\nPlayTime                     : 2h 2mn\nBit rate                     : 1092 Kbps\nStreamSize                   : 3.57 MiB\nPerformer                    : Alex Jones\nWriting application          : HandBrake 0.9.2 2008022300\n\nVideo #0\nCodec                        : AVC\nCodec/Info                   : H.264 (3GPP)\nPlayTime                     : 2h 2mn\nBit rate                     : 960 Kbps\nWidth                        : 640 pixels\nHeight                       : 480 pixels\nDisplay Aspect ratio         : 4/3\nFrame rate                   : 29.970 fps\nMinimum frame rate           : 29.963 fps\nMaximum frame rate           : 29.981 fps\nBits/(Pixel*Frame)           : 0.104\nStreamSize                   : 842 MiB\n\nAudio #0\nCodec/Info                   : AAC Low Complexity\nPlayTime                     : 2h 2mn\nBit rate mode                : VBR\nBit rate                     : 128 Kbps\nChannel(s)                   : 2 channels\nChannel positions            : L R\nSampling rate                : 48 KHz\nResolution                   : 16 bits\nStreamSize                   : 112 MiB\n","torrent":{"xt":"urn:btih:8f915e9dc7365856e245aff4f9eebd71f3466795","amp;dn":"Alex+Jones+Movies+-+iPod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f915e9dc7365856e245aff4f9eebd71f3466795","infoHashBuffer":{"type":"Buffer","data":[143,145,94,157,199,54,88,86,226,69,175,244,249,238,189,113,243,70,103,149]},"announce":[],"urlList":[]}}