{"title":"Broken Sword 2 - The Smoking Mirror","uid":4271111,"size":105979552,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8fba9098fa30ebba03a9daf4dc3dfa46cdca89b9&amp;dn=Broken+Sword+2+-+The+Smoking+Mirror&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kingswoodtown","files":1,"time":1214942243,"description":"Broken Sword 2 - The Smoking Mirror\n\n\nYou are George Stobbart, an American who is returning to Paris to visit his girlfriend. After some full screen animations setting up the opening of the game, you find yourself in peril, and Nico has been kidnapped. You&amp;#039;ll have to rescue yourself before you can rescue her.\n\nThis game is the second of a series of animated adventure games. Like the previous game Broken Sword: Shadow of the Templars the animations are some the best I&amp;#039;ve seen on a computer game. It feels much more like an animated film, even real game shows some of the best animation that you could want for a game of this type. Some of the full screen animations require a better system than my current setup (don&amp;#039;t panic, it&amp;#039;s a mere 486-100)and get a pixelated if your computer isn&amp;#039;t up to it. The game plays just fine otherwise, even on this machine.\n\nThe great graphics of the game are complemented by very good stereo music and sound effects. Music, voices and sound FX can have their volumes set individually. The actors do a fine job on the characterisations. The second game in the series, much like the first, has a real plot. While games with lots of atmosphere and little plot have their place, it is great to have a serious story to follow.","torrent":{"xt":"urn:btih:8fba9098fa30ebba03a9daf4dc3dfa46cdca89b9","amp;dn":"Broken+Sword+2+-+The+Smoking+Mirror","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fba9098fa30ebba03a9daf4dc3dfa46cdca89b9","infoHashBuffer":{"type":"Buffer","data":[143,186,144,152,250,48,235,186,3,169,218,244,220,61,250,70,205,202,137,185]},"announce":[],"urlList":[]}}