{"title":"AMAZING STORIES 4-6 [retr?tv]","uid":4058327,"size":626691023,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8fcd091a5c0b885f14af2c1164cc62d690d656ef&amp;dn=AMAZING+STORIES+4-6+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":4,"time":1204479530,"description":"AMAZING STORIES (1984)\n\n4. Mummy, Daddy    10/27/1985\nAn actor, Harold, who stars in a mummy film finds himself in serious trouble from frightened people when he leaves the set in full costume to reach his pregnant wife who is about to give birth.\nWriter: Earl Pomerantz\nDirector: William Dear\nGuest star: Tom Harrison (Harold), Bronson Pinchot (Director), Brion James (Willie Joe), Tracey Walter (Ezra), Larry Hankin (Jubal), Lucy Lee Flippin (Librarian), William Frankfather (Mayor), Arnold Johnson (Town Sage), Michael Zand (Ra Amin Kamin), Len Lesser (Old Grave Robber), Billy Beck (Old Blind Man), Brian Bradley (Actor), Pamela Seamon (Assistant Director), Elden Henson (Freckled-faced Kid), Dalton Cathey (Doctor), Oliver Dear (Young Grave Robber), Susan Dear (Harold&amp;#039;s Wife), Bill Martin (Guard), JoAnn Willette (Ruta Mae), Elden Henson (Freckle-Faced Boy)\n\n5. The Mission    11/3/1985\nDuring World War II, men in a air force bomber are caught in a no win scenario when their belly gunner (an amateur artist) is trapped in his seat and the plane has no wheels for landing.\nWriter: Menno Meyjes\nDirector: Steven Spielberg\nGuest star: Kevin Costner (The Captain), Casey Siemaszko (Jonathan), Kiefer Sutherland (Static), J. Jay Cohen (Jake), John Philbin (Bullseye), Gary Mauro (Sam), Glen Mauro (Dave), Terry L. Beaver (Officer), David Grant Hayward (Mechanic #1), Peter Jason (Commander), Karen Kopins (Liz), Anthony LaPaglia (Mechanic #2), Gary Riley (Tail Gunner), Ken Stovitz (Lamar), Nelson Welch (Father McKay)\n\n6. The Amazing Falsworth    11/5/1985\nIn the middle of a performance, a psychic realizes that he is in contact with a serial killer. Unfortunately, he is blindfolded and does not see the killer&amp;#039;s face, a circumstance that causes problems later on.\nWriter: Mick Garris\nDirector: Peter Hyams\nGuest star: Richard Masur (Trent Tinker), Don Calfa (Messenger), Suzanne Bateman (Gail), Robert Lesser (Young Man), Joseph G. Medalis (Jimmy), Sally Stark (Older Woman), Nori Morgan (Showgirl), Gregory Hines (Falsworth)\n\nLeave a comment if you&amp;#039;d like to see more! :)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0088478/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0088478/&lt;/a&gt;","torrent":{"xt":"urn:btih:8fcd091a5c0b885f14af2c1164cc62d690d656ef","amp;dn":"AMAZING+STORIES+4-6+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fcd091a5c0b885f14af2c1164cc62d690d656ef","infoHashBuffer":{"type":"Buffer","data":[143,205,9,26,92,11,136,95,20,175,44,17,100,204,98,214,144,214,86,239]},"announce":[],"urlList":[]}}