{"title":"Frederick Forsyth - The Afghan (Unabridged) 48k .MP3","uid":4107021,"size":231202463,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8fdd1a8cfc37c3fcdb0e81d5fd988eece9c3621d&amp;dn=Frederick+Forsyth+-+The+Afghan+%28Unabridged%29+48k+.MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Diaperzone","files":39,"time":1206860304,"description":"The Afghan (Unabridged)\n\n   Author: Frederick Forsyth\n   Reader: Robert Powell\n   Year  : 2006\n\n48kps .MP3 Audiobook (Fiction)\nCDs 1-9, Run time: 10:41:55\n\nListening to THE AFGHAN is like watching a train wreck. You know it will be grotesque, that there will be bloodied bodies and hideous dismemberments, yet you can&amp;#039;t help yourself. Frederick Forsyth has the ability to mesmerize with an insider&amp;#039;s knowledge, and Robert Powell&amp;#039;s reading is no less insistent. \n\nBritish and American intelligence learn that Al-Qaeda is planning something big. Will it be nuclear? Biological? No one is sure. Someone has to infiltrate, a nearly impossible task. Nearly. British intelligence officer Mike Martin (THE FIST OF \nGOD) is the man for the job. Powell&amp;#039;s performance as an assortment of Brits, Americans, Arabs, Afghans, and Indians is flawless, and Forsyth&amp;#039;s story of imminent disaster is irresistible.\n\nWhile &quot;fresh as this morning&amp;#039;s headlines&quot; has become a rather timeworn expression, it is not at all trite but decidedly true in regard to Frederick Forsyth&amp;#039;s latest spine tingler. Even as I write this we are hearing of another terrorist plot which \nwould have been even more horrific than 9/11 had it not been stopped. Yes, in the very real world we&amp;#039;re the targets of hatred and the fictional world of Forsyth mirrors our plight.\n\nA giant at creating international thrillers (The Day of the Jackal, The Odessa File, The Dogs of War), Forsyth has now crafted a novel so loaded with the latest in espionage technology and tactics that it raises the hair on the back of your \nneck.\n\nThe time is today and the CIA and the British Secret Intelligence Service have learned of a planned terrorist attack. That&amp;#039;s it, that is all they know. In order to circumvent the unthinkable they must infiltrate Al Qaeda and discover the nuts and bolts of this heinous plan - who, what, where.\n\nForty-four year old Mike Martin is a British Special Forces veteran who has seen his share of battle in some of the most volatile spots on our planet. Now retired he only wants to spend the rest of life in peace and quiet. However, he is the one \nperson, the only man for this job. He was raised in Iraq, speaks fluent Arabic, and has skin dark enough to pass for a Middle Easterner.\n\nHe has a double - it is Izmat Khan, an Afghan who has been held at Guantanamo for some five years. After intensive training Martin takes Khan&amp;#039;s place and a fake escape is staged, allowing Martin to eventually contact Al Qaeda.\n\nTrue to form Forsyth leads listeners on a suspense filled trail as Martin attempts to uncover Al Qaeda&amp;#039;s plan. Also true to form, award winning actor Robert Powell delivers a splendid narration adding to the tension and building to a shocking \nfinale.\n","torrent":{"xt":"urn:btih:8fdd1a8cfc37c3fcdb0e81d5fd988eece9c3621d","amp;dn":"Frederick+Forsyth+-+The+Afghan+%28Unabridged%29+48k+.MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdd1a8cfc37c3fcdb0e81d5fd988eece9c3621d","infoHashBuffer":{"type":"Buffer","data":[143,221,26,140,252,55,195,252,219,14,129,213,253,152,142,236,233,195,98,29]},"announce":[],"urlList":[]}}