{"title":"Cat and the Canary 1927 Silent","uid":4164162,"size":1006667646,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90430c8c014ba68583b32dc4021e0ef8eeb475c2&amp;dn=Cat+and+the+Canary+1927+Silent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"choempi","files":3,"time":1209521873,"description":"The 1922 play THE CAT AND THE CANARY was so popular that it made the fortune of author John Willard, who lived to see it filmed no fewer than three times before his death in 1942. Even today the story remains a classic of its kind, inspiring a host of films that mix comedy, mystery, and horror--not to mention still more that focus on suspicious doings in old, dark houses. When questioned by author Gavin Lambert, director James Whale very specifically indicated that the 1927 film version, along with the 1928 THE LAST WARNING, influenced his own work in such films as FRANKENSTEIN and THE OLD DARK HOUSE.\n\nBoth THE CAT AND THE CANARY and THE LAST WARNING were created for Universal by director Paul Leni. But while THE LAST WARNING is not presently available to the home market, THE CAT AND THE CANARY most certainly is, and even some eighty years later is possible to see what all the fuss was about. In term of cinematography, CAT is a remarkably imaginative film, using a series of over-lapping images, close-ups, and dissolves to astonishing effect. In a visual sense it is easily one of the most stylish films of the silent era.\n\nThe plot is a classic of its kind. Like the original Willard play, the film&amp;#039;s story mixes a host of already-clichÃƒÂ©d ideas with several then-new ones. Today, of course, it can be a bit difficult to them apart! But even so it remains a fair amount of fun. An eccentric millionaire has been hounded to death by his greedy relatives--and when he dies he leaves behind a will that imposes a twenty year waiting period between his death and delivery of his estate to his heir. But who will the heir be? The candidates assemble to hear the will at midnight... and no sooner is the heir named than strange doings are afoot.\n\nThe characters are archetypes: the nice girl (Laura La Plante), the mild-mannered boy (Creighton Hale), the fashion princess (Gertrude Astor), the battle ax matron (Flora Finch), and so on. Perhaps most memorable is the housekeeper (Martha Mattox), an exceedingly dour woman most ironically named Mammy Pleasant! Add in an exasperated lawyer, a creepy doctor, secret passages, hairy hands with needle-like finger nails, stolen diamonds, and as many dashes of comedy as you can get away with, mix well, and you have the inspiration for a seemingly endless list of classic films.\n","torrent":{"xt":"urn:btih:90430c8c014ba68583b32dc4021e0ef8eeb475c2","amp;dn":"Cat+and+the+Canary+1927+Silent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90430c8c014ba68583b32dc4021e0ef8eeb475c2","infoHashBuffer":{"type":"Buffer","data":[144,67,12,140,1,75,166,133,131,179,45,196,2,30,14,248,238,180,117,194]},"announce":[],"urlList":[]}}