{"title":"R.Studio.v4.2.Build.125098.Winall","uid":4156820,"size":5797553,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:93bc232117ecd8956cfd0cd4075cfe45ad8e2eec&amp;dn=R.Studio.v4.2.Build.125098.Winall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wsxsun","files":4,"time":1209185570,"description":"R-Studio is a family of powerful and cost-effective undelete and data recovery software. Empowered by the new unique data recovery technologies, it is the most comprehensive data recovery solution for recovery files from FAT12/16/32, NTFS, NTFS5 (created or updated by Windows 2000/XP/2003/Vista), HFS/HFS+ (Macintosh), Little and Big Endian variants of UFS1/UFS2 (FreeBSD/OpenBSD/NetBSD/Solaris) and Ext2FS/Ext3FS (Linux) partitions. It functions on local and network disks, even if such partitions are formatted, damaged or deleted. Flexible parameter settings give you absolute control over data recovery.\n\nR-Studio utilities recover files:\n\nDeleted without Recycle Bin, or when Recycle Bin has been emptied; \nRemoved by virus attack or power failure; \nAfter the partition with the files was reformatted, even for different file system; \nWhen the partition structure on a hard disk was changed or damaged. In this case, R-Studio utilities can scan the hard disk trying to find previously existed partitions and recover files from found partitions. \nFrom hard disk with bad sectors. R-Studio Data Recovery Software can first copy the entire disk or its part into an image file and then process such image file. This is especially useful when new bad sectors are constantly appearing on the hard disk, and remaining information must be immediately saved. ","torrent":{"xt":"urn:btih:93bc232117ecd8956cfd0cd4075cfe45ad8e2eec","amp;dn":"R.Studio.v4.2.Build.125098.Winall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93bc232117ecd8956cfd0cd4075cfe45ad8e2eec","infoHashBuffer":{"type":"Buffer","data":[147,188,35,33,23,236,216,149,108,253,12,212,7,92,254,69,173,142,46,236]},"announce":[],"urlList":[]}}