{"title":"BBC - Are We Alone?","uid":4274364,"size":379903218,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93beff82ad1715b799039a3e52427ec6441e6bc2&amp;dn=BBC+-+Are+We+Alone%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xara_maior","files":1,"time":1215107620,"description":"For fifty years, the Search for Extra Terrestrial Intelligence has been scanning the galaxy for a message from an alien civilisation. So far to no avail, but a recent breakthrough suggests they may one day succeed.\n\nHorizon joins the planet hunters who ve discovered a new world called Gliese 581 c. It is the most Earth-like planet yet found around another star and may have habitats capable of supporting life. NASA too hopes to find fifty more Earth-like planets by the end of the decade, all of which dramatically increases the chance that alien life has begun elsewhere in the galaxy.\n\n++++++++++++++++++++++++++++++++++\n\nPor 50 anos, a Busca por Inteligencia Extra-Terrestre (SETI) tem auscutado a galaxia por uma mensagem de uma civilizacao alieniÃ‚Â­gena ateh agora em vao, mas um sucesso recente sugere que talvez um dia isso aconteca.\n\nA Horizon se junta aos cacadores de planetas que descobriram um novo mundo chamado Gliese 581c. Eh o planeta mais semelhante aa Terra jah encontrado ao redor de outra estrela e talvez possua habitats capazes de sustentar vida. A NASA tambem espera encontrar mais 50 planetas ateh o fim da decada, todos eles aumentando dramaticamente a chance do surgimento de vida alieniÃ‚Â­gena em outro lugar da galaxia.","torrent":{"xt":"urn:btih:93beff82ad1715b799039a3e52427ec6441e6bc2","amp;dn":"BBC+-+Are+We+Alone%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93beff82ad1715b799039a3e52427ec6441e6bc2","infoHashBuffer":{"type":"Buffer","data":[147,190,255,130,173,23,21,183,153,3,154,62,82,66,126,198,68,30,107,194]},"announce":[],"urlList":[]}}