{"title":"Cowboy Junkies 1996-07-11 @ Casino Ballroom - Hampton Beach, NH","uid":4057614,"size":534382193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:941182256765e253b2b86159bc6af25e67186f79&amp;dn=Cowboy+Junkies+1996-07-11+%40+Casino+Ballroom+-+Hampton+Beach%2C+NH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":26,"time":1204451776,"description":" This month, the voters spoke for the older shows. I had offered one show from 2000 and one from 2001 in the options, but most wanted older vintages, and spoke loudly in favor of it. So, here I present the second show from the 1996 tour to be released in the Show of the Month, July 11, 1996.\n\n \n\nThis tour was in support of the Lay It Down album, one of the most solid releases the band put out. One highlight of the album was &quot;Angel Mine.&quot; It seems fans hadn&amp;#039;t heard enough of the tragic heroine of &quot;Misguided Angel&quot; from the band&amp;#039;s defining album &quot;Trinity Sessions,&quot; and people had asked what she had decided and what had happened to her. &quot;Angel Mine&quot; is the response to that question. A cynic might note that the band segued into &quot;Bea&amp;#039;s Song: (River Song Trilogy, part II) from Angel Mine, and that song would later be finished off by &quot;Dragging Hooks: River Song Trilogy, part III), but I&amp;#039;ll remain hopeful!\n\n\nThis show also includes a couple of mid-set acoustic numbers; I really like the acoustic &quot;Sun Comes Up,&quot; and &quot;Powderfinger&quot; is haunting as an acoustic number.\n\n \n\nAnother interesting aspect of this show is that it&amp;#039;s in a very low-key arena. The band always has played in some out-of-the-way places, mixing in larger, more known arenas. I always like the smaller venues, at a preference.\n\n \n\nI hope you all enjoy this excellent show, and keep the votes coming!!","torrent":{"xt":"urn:btih:941182256765e253b2b86159bc6af25e67186f79","amp;dn":"Cowboy+Junkies+1996-07-11+%40+Casino+Ballroom+-+Hampton+Beach%2C+NH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"941182256765e253b2b86159bc6af25e67186f79","infoHashBuffer":{"type":"Buffer","data":[148,17,130,37,103,101,226,83,178,184,97,89,188,106,242,94,103,24,111,121]},"announce":[],"urlList":[]}}