{"title":"Zenwalk Live 5.2","uid":4260781,"size":552308736,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:944bc2920d0222dc9745a475e684d2f4c30396a7&amp;dn=Zenwalk+Live+5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blackangel1","files":1,"time":1214459284,"description":"Zenwalk Live 5.2, the latest Zenwalk in its Live CD format is ready!\n\nBased on Zenwalk Current and a slightly modified version 6.2.3 of the Linux Live Scripts, Zenwalk Live is meant to be an almost perfect clone of Zenwalk standard, although it now uses a slightly modified kernel in order to unlock specific Live CD features such as, for example, the re-mastering of Zenwalk Live on a USB key with persistent changes.\n\nAs always, Zenwalk live features several specific Live CD gui tools which you will find in Zenpanel (Zenwalk&amp;#039;s system configuration panel)... Zen Installer will enable you to install Zenwalk standard on your machine while Live Clone, a WYSIWYG Live CD re-mastering utility, will enable you to generate your very own customized Live CD that will carry any of the changes you may have applied to your Live CD session, whether these changes were simply cosmetic, like a change of wall paper or panel widgets or whether they were more involved like the suppression or addition of different programs, users, etc..\n\nEssential recovery &amp; system tools such as LiloFix, Gparted &amp; Testdisk have not been forgotten &amp; are also available... just in case!\n\nEvidently, Zenwalk Live 5.2 includes all the latest improvements from Zenwalk 5.2 recent release: the suspend and resume refined functions, the new support for blue-tooth input device, the refreshed artwork for the booting menu, boot splash &amp; Xfce environment, as well as the nearly 500 changes to software packages, including Linux kernel 2.6.25.4, Xfce Desktop 4.4.2, Netpkg &quot;new generation&quot; version 4, Xorg version 7.3, Mplayer coupled with the latest dvdnav (DVD menus support), etc..","torrent":{"xt":"urn:btih:944bc2920d0222dc9745a475e684d2f4c30396a7","amp;dn":"Zenwalk+Live+5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944bc2920d0222dc9745a475e684d2f4c30396a7","infoHashBuffer":{"type":"Buffer","data":[148,75,194,146,13,2,34,220,151,69,164,117,230,132,210,244,195,3,150,167]},"announce":[],"urlList":[]}}