{"title":"No.Reservations.Full.Movie.for.Zune","uid":4155671,"size":604814249,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:948aa5aa7f8639277f4d9206d0630deb2ab13dc5&amp;dn=No.Reservations.Full.Movie.for.Zune&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twinkyman","files":1,"time":1209143187,"description":"Title----------------No Reservations\nCategory-------------Dramas, Romance, Comedies, Food\nStudio---------------Warner Home Video\nOrig Year------------2007\nStreet Date----------Feb 12, 2007\nRating---------------PG (MPAA)\nRating Reason--------for some sexuality and language\n\n\nTechnical Details\n\nResolution----------320x180 (Widescreen) (Formatted for ipod/Zune)\nDuration------------1:39:59\n\nAudio Bitrate-------128kbps\nAudio Channels------2 (stereo)\nAudio Sample Rate---44Hz\n\nVideo Bitrate-------650kbps (average)\nVideo Framerate-----25FPS\n\n\nSynopsis\n\nCatherine Zeta-Jones and Aaron Eckhart are charming in the romantic comedy NO RESERVATIONS. Zeta-Jones stars as Kate, an executive chef at a popular restaurant in New York City&amp;#039;s Greenwich Village. She is so dedicated to her job that she has no time for a personal life; she even brings gourmet cuisine to her therapist (Bob Balaban), feeding him food rather than opening up her soul. But her life changes when her sister dies in a car accident, leaving Kate to take care of her sister&amp;#039;s young daughter, Zoe (Abigail Breslin, from LITTLE MISS SUNSHINE). Suddenly, Kate is responsible for more than just fancy dishes; she is responsible for another human being, which confounds her. After taking a few days off, she returns to her kitchen, only to find that the restaurant owner, Paula (Patricia Clarkson), has hired another chef to assist Kate, a playful, talkative, talented man named Nick (Aaron Eckhart) who likes listening to opera while he works (Kate considers that a major distraction) and so wins over the rest of the staff that Kate feels threatened. But deep down, she also feels a little attracted by the attention Nick pours on her. However, Kate is not sure she can mix being a mother, a master chef, and, perhaps, a lover. NO RESERVATIONS, based on the award-winning German film BELLA MARTHA (MOSTLY MARTHA) (Sandra Nettelbeck, 2001), is a satisfying soufflÃƒÂ© of comedy and romance, directed by Scott Hicks (SHINE, SNOW FALLING ON CEDARS) and featuring a piano-based soundtrack by minimalist musician Philip Glass. And just as she did in LITTLE MISS SUNSHINE, Breslin will both charm and break viewers&amp;#039; hearts.\n\n-This movie is formatted to be directly synced to your zune without any additional conversion!\nEnjoy!  =)\n","torrent":{"xt":"urn:btih:948aa5aa7f8639277f4d9206d0630deb2ab13dc5","amp;dn":"No.Reservations.Full.Movie.for.Zune","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"948aa5aa7f8639277f4d9206d0630deb2ab13dc5","infoHashBuffer":{"type":"Buffer","data":[148,138,165,170,127,134,57,39,127,77,146,6,208,99,13,235,42,177,61,197]},"announce":[],"urlList":[]}}