{"title":"THEM.avi","uid":4108396,"size":733898752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9516fbbc5b0dee40d2f5c9902278870bd6783fc0&amp;dn=THEM.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hackenbecker","files":1,"time":1206919572,"description":"&quot;THEM&quot;\n\nNuclear tests in the desert result in the growth of gigantic mutant ants who menace cities in the American south-west as a team of investigators and the army search for a way to control their spread in this Cold War-era monster film. Written by Keith Loh \nAfter several people in the New Mexico desert wind up missing or dead, including an F.B.I. agent and most of his family, police Sgt. Ben Peterson teams up with F.B.I. agent Bob Graham to find out what&amp;#039;s causing the strange occurrences. They find send a strange print found at one of the crime scenes and it is sent to the Department of Agriculture. Doctor Harold Medford and his daughter Doctor Patricia Medford arrive and ask to be taken to the scene of some of the disappearances. When they get there they are shocked to find gigantic ants, whose mutations were caused by the first atomic bomb explosion nine years earlier. They manage to destroy the nest of ants, but not before two winged queen ants and a couple of drones have hatched and escaped the nest. Now it is a race against time to find the two queen ants before they can establish more nests and hatch more queens\n\n\n","torrent":{"xt":"urn:btih:9516fbbc5b0dee40d2f5c9902278870bd6783fc0","amp;dn":"THEM.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9516fbbc5b0dee40d2f5c9902278870bd6783fc0","infoHashBuffer":{"type":"Buffer","data":[149,22,251,188,91,13,238,64,210,245,201,144,34,120,135,11,214,120,63,192]},"announce":[],"urlList":[]}}