{"title":"Crossover Pro 6.2.0.1 Linux","uid":4042642,"size":22302182,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:953ac2035ee558e53efc44fcc260c01f1a2eaf8f&amp;dn=Crossover+Pro+6.2.0.1+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DeathByJayJay","files":1,"time":1203758513,"description":"CrossOver Linux allows you to install many popular Windows productivity applications, plugins and games in Linux, without needing a Microsoft Operating System license. CrossOver includes an easy to use, single click interface, which makes installing a Windows application simple and fast. Once installed, your application integrate seamlessly with your Gnome or KDE environment. Just click and run your application, exactly as you would in Windows, but with the full freedom of Linux.\n\nCrossOver Linux lets you use many Windows plugins directly from your Linux browser. Plugins work on any x86 based Linux distribution and will integrate with most browsers including Firefox 1.x, Netscape 6.x, Konqueror, Mozilla, and Opera. CrossOver also integrates with Gnome and KDE to let you transparently open any Word, Excel or PowerPoint file. But even better, you can open these attachment types directly from any mail client.\nOne Application: Two Delicious Flavors!\n\nWe\\\\\\&amp;#039;ve created two versions of CrossOver Linux Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ Standard and Professional Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ to serve our home-user/enthusiast and corporate markets even better. CrossOver Linux Standard provides individual users with the ability to run a wide variety of Windows software cleanly and economically. CrossOver Linux Professional provides corporate users with the enhanced deployability and manageability features their environments demand.","torrent":{"xt":"urn:btih:953ac2035ee558e53efc44fcc260c01f1a2eaf8f","amp;dn":"Crossover+Pro+6.2.0.1+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953ac2035ee558e53efc44fcc260c01f1a2eaf8f","infoHashBuffer":{"type":"Buffer","data":[149,58,194,3,94,229,88,229,62,252,68,252,194,96,192,31,26,46,175,143]},"announce":[],"urlList":[]}}