{"title":"video2brain - Ruby on Rails - Videotraining - german - deutsch","uid":4263589,"size":2409103360,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:961afcfb28200b1789ec422b3fadcd2846c8e8be&amp;dn=video2brain+-+Ruby+on+Rails+-+Videotraining+-+german+-+deutsch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SantinoC","files":1,"time":1214583793,"description":"Mit dem Webentwickler-Express schneller ans Ziel!\n\nDie Skriptsprache Ruby und das Framework Rails vereinfachen und beschleunigen die Arbeit des Webprogrammierers enorm. Lernen Sie mit diesem Videotraining von der Installation der Entwicklungsumgebung bis zu konkreten Projekten, wie Sie mit Ruby on Rails professionelle Webanwendungen entwickeln.\n\n \nInhalte\n\nEinfÃƒÂ¼hrung und Installation\n\nMichael Raidel fÃƒÂ¼hrt Sie zu Beginn dieses Trainings durch die Installationsprozesse der benÃƒÂ¶tigten Software. AuÃƒ?erdem erfahren Sie, wo Sie diese zum kostenlosen Download im Internet finden.\n\n \n\nBasics\n\nDamit Ruby on Rails auf Ihrem System &amp;#039;rund lÃƒÂ¤uft&amp;#039;, mÃƒÂ¼ssen Sie einiges berÃƒÂ¼cksichtigen: In welchem Verzeichnis finden Sie welche Informationen bzw. Dateien? Wie erzeugen bzw. verwenden Sie eine Datenbank fÃƒÂ¼r Ihre Anwendung?\n\n \n\nView\n\nDer View ist im MVC-System fÃƒÂ¼r die Ausgabe und Formatierung von Daten zustÃƒÂ¤ndig. Welche Befehle hier nun zur Anwendung kommen kÃƒÂ¶nnen und wie prinzipiell eine Syntax aufgebaut ist, erklÃƒÂ¤rt Ihnen der Autor Michael Raidel.\n\n \n\nController\n\nIn diesem Kapitel lernen Sie, was ein Controller ist und wie dieser in den unterschiedlichsten Anwendungen funktioniert. So kÃƒÂ¶nnen beispielsweise Methoden in einem Controller geschÃƒÂ¼tzt werden. Dieses Thema erstreckt sich von der Routenerstellung bis hin zur Verwendung von Cookies, Sessions und Flash-Meldungen.\n\n \n\nRuby-Models\n\nDie Speicherung der Daten in Models ist vielfÃƒÂ¤ltig: Ruby gibt zwar die Benennung vor, bietet Ihnen aber auf der anderen Seite viele Techniken, die das Arbeiten in zunehmend komplexeren Projekten kontrollierbar machen.\n\n \n\nWorkshop\n\nLernen Sie nun anhand eines groÃƒ?en, aber doch ÃƒÂ¼bersichtlichen Projekts die Arbeit mit Ruby on Rails kennen. Ziel des Projekts ist eine Anwendung, mit der Sie Projekte und Notizen verwalten kÃƒÂ¶nnen.","torrent":{"xt":"urn:btih:961afcfb28200b1789ec422b3fadcd2846c8e8be","amp;dn":"video2brain+-+Ruby+on+Rails+-+Videotraining+-+german+-+deutsch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"961afcfb28200b1789ec422b3fadcd2846c8e8be","infoHashBuffer":{"type":"Buffer","data":[150,26,252,251,40,32,11,23,137,236,66,43,63,173,205,40,70,200,232,190]},"announce":[],"urlList":[]}}