{"title":"The Andromeda Strain [DVDrip] Michael Crichton","uid":4160437,"size":1563611136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9669798992406de1aa27d2d49a77f268e98aa889&amp;dn=The+Andromeda+Strain+%5BDVDrip%5D+Michael+Crichton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1209346606,"description":"The Andromeda Strain [DVDrip][Eng](1971) Michael Crichton\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066769/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066769/&lt;/a&gt;\n\nTagline:\nThe picture runs 130 minutes!... The story covers 96 of the most critical hours in man&amp;#039;s history!... The suspense will last through your lifetime!\n\nThe Andromeda Strain (1971)\nUser Rating.: 7.3/10 (6,628 votes)\nCountry.....: USA \nDirector....: Robert Wise\nWriters.....: Michael Crichton (novel)\n              Nelson Gidding (screenplay)\nGenre.......: Mystery / Sci-Fi / Thriller\nPlot Outline: A group of scientists investigate a deadly new alien virus before it can spread.\n\nRuntime.....: 125 min\n\n\nYou alread know how it ends, 13 December 1999\nAuthor: Joe Ekaitis from From Television City in Hollywood!, no, uh, Rialto, California \n\nAnd yet, you just can&amp;#039;t help yourself. Under Robert Wise&amp;#039;s direction, this tale of microbiological Armageddon unfolds with such perfectly metered suspense that by the 100th viewing, you STILL find yourself glued to your couch. You HAVE to see how it turns out, even though you already know.\n\nAlthough the film is well over 20 years old, and the computer equipment at the Wildfire laboratory shows its age, this is a perfect change-of-pace film for any movie monster fan. Heck, you&amp;#039;ve probably already let your kids see the bloody carnage in &quot;Jurassic Park&quot; anyway.\n\nInstead of the usual radioactive mutated towering apparition that flattens cities and topples skyscrapers, the monster in &quot;The Andromeda Strain&quot; is so tiny, it takes powerful electron microscopes to see it. The average movie monster can only cause damage wherever he can stomp, smash or exhale a blast of fiery breath. Andromeda has the potential to be carried to every corner of the world by the winds, where it could conceivably wipe out all life. Try to top THAT, Godzilla!\n\nThe real star of the film is Wildfire itself. A government facility located (we thought) safely away from populated areas, it bristles with everything a microbiologist needs to avert a biological disaster. . .or does it?\n\nSeeking an unprecedented realism, director Robert Wise insisted that everything on the set be real, from the computer terminals (with their quaint light pens) all the way to the electron microscopes. The Wildfire set is every microbiologist&amp;#039;s dream come true and it&amp;#039;s populated by a quartet of actors!\n\nSince the presence of a big-name star might blunt the impact of this high-tech visual feast, Wise carefully assembled a cast of fine actors who just don&amp;#039;t happen to be household names. Without rehashing the characterizations, we&amp;#039;ll just say that Arthur Hill, David Wayne, James Olson and Kate Reid couldn&amp;#039;t possibly have been more perfect for their roles. With a less competent cast, &quot;The Andromeda Strain&quot; could have degenerated into a parody of itself. This is gritty work, saving the world from biological annihilation. It takes real ACTORS, not just pretty-boy movie stars!\n\nGo ahead. Be scared out of your wits by something so tiny, you can&amp;#039;t even see it. I dare you to try and get up before it&amp;#039;s over.","torrent":{"xt":"urn:btih:9669798992406de1aa27d2d49a77f268e98aa889","amp;dn":"The+Andromeda+Strain+%5BDVDrip%5D+Michael+Crichton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9669798992406de1aa27d2d49a77f268e98aa889","infoHashBuffer":{"type":"Buffer","data":[150,105,121,137,146,64,109,225,170,39,210,212,154,119,242,104,233,138,168,137]},"announce":[],"urlList":[]}}