{"title":"Muay Thai - Nai Khanom Tom [Thai Movie]","uid":4056304,"size":1306452868,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9691867501279d6f82126c016631ef09a4ecf307&amp;dn=Muay+Thai+-+Nai+Khanom+Tom+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"poothaijaa","files":2,"time":1204387980,"description":"Detail: Action / Martial arts\nTitle: Muay Thai - Nai Khanom Tom\nStarring : Panutat Rattanatrai, Shinta Sitthikul, Boonthida Nakajareon\n2 VCDs\nSound : Thai\nSubtitle: none\nReleased : 20 November 2003\nInfo: http://www.ethaicd.com/show.php?pid=11507\nIMDB: http://www.imdb.com/title/tt0440644/plotsummary\n\nPlot:\nNai Khanomtom was born in Kum village, near the Burmese border. While he was still a young boy, his village was attacked by the Burmese soldiers, and he fled with his older sister, Aei. Tired of running Aei was caught, raped and killed by the invaders. Khanomtom alone escaped, and came back to the village just in time to cry and hold the bodies of his butchered parents, Kerd and Eee, before they were cremated along with dozens of his country folks. Following the last order he received from his father Kerd, Khanontom goes to the Pekka Temple, in the mountains, to live with the monk Kong. Aeydam, an older boy from the village of Pamok, bullies him all the time, prompting him to leave the temple. In his journey, he takes up Muay Thai lessons from a silent stranger he meets in the forest. Later, the two young men became friends and promised to fight together against the Burmese army that was advancing towards Krungsriayudhaya. Khanomtom and Aeydam split into two groups: Aeydam and his team would fight the Burmese, ambushing them in the villages of Kum and Patok, while Khanomtom&amp;#039;s team went to the main town to help the opposition. On his way, Khanomtom was caught by the Burmese due to treason by a few Thai men. He was imprisoned, escaped, but was caught again. Much later, on the New Chedi celebration day, Prajao Mangra, the king of Burma, was pleased to see how easily his best fighters defeated an even number of boxing and wrestling champions brought on purpose from around the world. Then, he ordered the proud rebel Khanomtom to display his Muay Thai skills against nine of his soldiers; Mangra promised him death if he lost, or freedom and anything he requested if he won. After a tremendous display of technique and endurance, Khanomtom stood proud in the arena, and asked freedom not to himself, but his whole people. The Burmese king was impressed; he said that the Thai were a dangerous people that could fight with bare hands against armed men, and kept his word. For once, the Burmese and Thai peoples had a rest from their ancient struggle.  Written by Artemis-9 ","torrent":{"xt":"urn:btih:9691867501279d6f82126c016631ef09a4ecf307","amp;dn":"Muay+Thai+-+Nai+Khanom+Tom+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9691867501279d6f82126c016631ef09a4ecf307","infoHashBuffer":{"type":"Buffer","data":[150,145,134,117,1,39,157,111,130,18,108,1,102,49,239,9,164,236,243,7]},"announce":[],"urlList":[]}}