{"title":"Theory of a Deadman - Theory of a Deadman, Gasoline and WWE","uid":4024393,"size":201409597,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96b6a8a44ea7d0519f55dce017a7af3d777467c8&amp;dn=Theory+of+a+Deadman+-+Theory+of+a+Deadman%2C+Gasoline+and+WWE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"soxnation85xx","files":24,"time":1202840005,"description":"THIS CONTAINS GASOLINE AND THE SELF TITLED CD, THEIR FIRST TWO PLUS THE SINGLE FROM WWE's RECKLESS INTENT CD\n\nTheory of a Deadman is a rock band from Vancouver, Canada signed by Nickelback's Chad Kroeger to Roadrunner Records.\n\nGroup members are:\nTyler Connolly - Vocals and Guitar\nDave Brenner - Guitar\nDean Back - Bass\nBrent Fitz - Drums\n\nThey released a self-titled album Theory of a Deadman on September 17, 2002.\n\nThe band hit the mainstream with the singles &quot;Nothing Could Come Between Us&quot; and &quot;Make Up Your Mind&quot;.\n\nOn March 29, 2005, Theory released their sophomore album, Gasoline. The first single is &quot;No Surprise&quot;. Before the release of the album the band toured with Shinedown and No Address, and starting March 1 began a promotion tour with headliners Breaking Benjamin and The Exies. Theory's popularity has risen following several songs from Gasoline appearing in the 2005 video game Fahrenheit (Indigo Prophecy) including Santa Monica during the ending credits.\n\nIn the heavy metal scene, outside their own genre, Theory of a Deadman is probably best known as the former band of current Annihilator singer Dave Padden.\n\nThe band performed the theme tune to World Wrestling Entertainment's No Way Out 2006 pay-per-view, a cover version of &quot;Deadly Game&quot; from the WWE Anthology album. The song was released on the WWE Wreckless Intent album.\n\nThey also comprised the majority of the soundtrack for Indigo Prophecy (Fahrenheit in most non-US countries), a PS2/Xbox/PC game that became a cult classic due to its unique control system.","torrent":{"xt":"urn:btih:96b6a8a44ea7d0519f55dce017a7af3d777467c8","amp;dn":"Theory+of+a+Deadman+-+Theory+of+a+Deadman%2C+Gasoline+and+WWE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b6a8a44ea7d0519f55dce017a7af3d777467c8","infoHashBuffer":{"type":"Buffer","data":[150,182,168,164,78,167,208,81,159,85,220,224,23,167,175,61,119,116,103,200]},"announce":[],"urlList":[]}}