{"title":"Captivity (2007) ENG DUTCH SUB by nudaten.net","uid":4140437,"size":4181323776,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9768a0ec52ee6862af8ef66ae002af39b8cd92e7&amp;dn=Captivity+%282007%29+ENG+DUTCH+SUB+by+nudaten.net&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NBCmaster","files":42,"time":1208466078,"description":"Captivity (2007) HORROR .ENG DUTCH SUB by nudaten.net\n\n\nTop cover girl and fashion model, Jennifer Tree has it all - beauty, fame, money and power. Her face appears on covers of hundreds of magazines. At the top of her game, Jennifer is America&amp;#039;s sweetheart. She is loved and adored and sought after. Everyone wants her. But someone out there has been watching and waiting. Someone wants her in the worst way. Out alone at a charity event in Soho, Jennifer is drugged and taken. Held captive in a cell, Jennifer is subjected to a series of terrifying, life-threatening tortures that could only be conceived by a twisted, sadistic mind. It follows the story of one woman who is abducted and tortured, held against her will in a place where days turn into weeks. Written by After Dark Films \n\nA young model is drugged, kidnapped and subject to harrowing torture in a cell of horrors in this spine chilling horror thriller. Jennifer is young, beautiful and famous. Everybody knows her name and her popularity brings her everything she wants in life- but one mans jealousy lures Jennifer to a dimension in torture when she finds herself drugged, captured and held in an underground maze of terror. Taken against her will and subject to psychological punishment, Jennifer soon questions her sanity as her watchful tormentor pits her in numerous twisted traps. After struggling to keep her mind, she meets with Gary, another prisoner in the sick games and together they try their wits to escape from the cells and defeat the madman behind the sick games- but are they already too late when they are bound, gagged and thrust into a world of pain? Written by MovieMagic \n","torrent":{"xt":"urn:btih:9768a0ec52ee6862af8ef66ae002af39b8cd92e7","amp;dn":"Captivity+%282007%29+ENG+DUTCH+SUB+by+nudaten.net","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9768a0ec52ee6862af8ef66ae002af39b8cd92e7","infoHashBuffer":{"type":"Buffer","data":[151,104,160,236,82,238,104,98,175,142,246,106,224,2,175,57,184,205,146,231]},"announce":[],"urlList":[]}}