{"title":"Dinotopia DVDr Swe sub.ISO","uid":4147539,"size":4681410560,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:97ae25955a4e29c90e39dab327415658e3bdc8ff&amp;dn=Dinotopia+DVDr+Swe+sub.ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dr.drago87","files":1,"time":1208797565,"description":"Plot: Kids will love this sweeping story of two brothers whose plane crashes on a mysterious island called Dinotopia, where human beings live in harmony with dinosaurs--the herbivores, anyway. The carnivores present a problem, as the humans&amp;#039; defenses against them--a mystical power source called sunstones--are losing strength. As they try to save the island, Carl and David (Tyron Leitso and Wentworth Miller) struggle not only with tyrannosaurs and prehistoric crocodiles, but also with repressive Dinotopian traditions and a scheming malcontent (David Thewlis) who stirs up all kinds of trouble. Meanwhile, they also wrestle with each other over the lovely daughter of the mayor of Waterfall City (Katie Carr). The pacifist ideals of Dinotopia are refreshing, but it&amp;#039;s the special effects that will hook viewers: riding on the backs of brachiosaurs, flying atop pteranadons, arguing in court with triceratops and ankylosaurs--anyone fascinated with dinosaurs (and who isn&amp;#039;t?) will enjoy this whimsical fantasy. A host of British character actors also helps keep the human side of this four-hour miniseries lively; Alice Krige (also known as the Borg Queen in Star Trek: The Next Generation) gets a much more benevolent role here. \n\nTaken from http://www.flixster.com/movie/dinotopia\n\nMy first DVDr","torrent":{"xt":"urn:btih:97ae25955a4e29c90e39dab327415658e3bdc8ff","amp;dn":"Dinotopia+DVDr+Swe+sub.ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ae25955a4e29c90e39dab327415658e3bdc8ff","infoHashBuffer":{"type":"Buffer","data":[151,174,37,149,90,78,41,201,14,57,218,179,39,65,86,88,227,189,200,255]},"announce":[],"urlList":[]}}