{"title":"Chaplin.05.18.The.Great.Dictator.DVD1","uid":4032863,"size":6321660494,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9858ceeefa1def661b7628147d8209f1d3fdf88c&amp;dn=Chaplin.05.18.The.Great.Dictator.DVD1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"omestre","files":17,"time":1203262599,"description":"El gran dictador\n\nThe Great Dictator\n\nInformaciÃƒÂ³n artÃƒÂ­stica:\n\nAÃƒÂ±o: 1940\nDuraciÃƒÂ³n: 1 hora 59 minutos\nGÃƒÂ©nero: Comedia satÃƒÂ­rica\nNacionalidad: USA\nDirector: Charles Chaplin\nMÃƒÂºsica: Charles Chaplin\nDirecciÃƒÂ³n Musical: Meredith Wilson\nFotografÃƒÂ­a: R.H. Totheroh y Karl Strauss\nGuiÃƒÂ³n: Charles Chaplin\nActores: Charles Chaplin (Dictador Hynkel y Barbero judÃƒÂ­o), Jack Oakie (Dictador de Bacteria), Paulette Goddard (heroÃƒÂ­na del ghetto),Reginald Gardiner, Henry Daniell, Billy Gilbert, Grace Hayle, Carter De Haven, Maurice Moscovitch, Emma Dunn, Bernard Gorcey, Paul Weigel, Chester Conklin, Esther Michelson, Hank Mann, Florence Wright, Eddie Gribbon, Robert O. Davis, Eddie Dunn, Peter Lynn, Nita Pike.\nSinopsis: La primera guerra mundial acaba con la derrota de Tomania. Un barbero judÃƒÂ­o (Charles Chaplin) soldado tomaniano, ingresa en un hospital con amnesia y allÃƒÂ­ se queda olvidado por todos durante veinte aÃƒÂ±os. Entre tanto, el pueblo de Tomania vive en la miseria; y, valiÃƒÂ©ndose de falsas promesas, Hinkel (Charles Chaplin) que es igual fÃƒÂ­sicamente que el barbero, hace que se le aclame como dictador. Buscando un chivo expiatorio a todos los males de Tomania, Hynkel recurre al antisemitismo y comienza una desigual lucha sin cuartel, entre sus camaradas y los judÃƒÂ­os del ghetto.\nPor fin el barbero recuerda parte de su vida, se escapa del hospital, y regresa a su barberÃƒÂ­a en pleno ghetto. AllÃƒÂ­ es vÃƒÂ­ctima de los atropellos de los secuaces de Hynkel; se revela contra esos abusos y acaba por ser detenido y enviado a un campo de concentraciÃƒÂ³n.\nHynkel, buscando la revancha a la derrota de Tomania, sueÃƒÂ±a con dominar el mundo y decide empezar por la conquista de Austerlich, de donde son sus orÃƒÂ­genes. Para ello desea una alianza con Napaloni (Jack Oakie) el brabucÃƒÂ³n dictador de Bacteria, que tiene los mismos sueÃƒÂ±os de grandeza y desea revivir al imperio romano.\nSe reÃƒÂºnen los dos dictadores y, luego de duras negociaciones, llegan a un acuerdo y, ya sin ataduras, Hynkel ultima los preparativos de la invasiÃƒÂ³n.\nCon el fin de distraer la atenciÃƒÂ³n finge normalidad yendo a cazar patos en un bote, con tan mala suerte, que cae de la barca al hacer un disparo. Cuando logra llegar a la orilla, es detenido al ser confundido con el barbero, que se habÃƒÂ­a evadido del campo de concentraciÃƒÂ³n; al tiempo que toman al barbero por el dictador, y es escoltado a la radio para que anuncie la invasiÃƒÂ³n de Austerlich. El barbero pronuncia un vibrante discurso; pero exhorta a la paz, defiende la democracia y propugna la igualdad.\nCalificaciÃƒÂ³n: Todos los pÃƒÂºblicos\n\n\nComentarios:\nUn clÃƒÂ¡sico de la historia del cine, donde Charles Chaplin desarrolla una parodia de Hitler, y donde Jack Oakie interpreta a Mussolini. Como era de esperar en Hollywood, no consiguiÃƒÂ³ ningÃƒÂºn Oscar aunque alcanzÃƒÂ³ cinco nominaciones.\nAbsoluta obra maestra del cine, ingeniosÃƒÂ­sima parodia antifascista que obtuvo 5 nominaciones a los Oscar: mejor pelÃƒÂ­cula, guiÃƒÂ³n original, actor principal -Chaplin: Hitler-, actor secundario -Jack Oakie: Mussolini- y banda sonora. Su visiÃƒÂ³n resulta imprescindible.\n1938. El partido nazionalsocialista lleva cinco aÃƒÂ±os gobernando Alemania. Las potencias mundiales intuyen que algo peligroso se cuece en el paÃƒÂ­s teutÃƒÂ³n. Ante la grandiosidad, la preciosidad y la belleza apabullante del ejercito hitleriano, poca gente es capaz de rechistar. Pero en ese aÃƒÂ±o, el cÃƒÂ³mico mÃƒÂ¡s famoso y mejor pagado del mundo, se propone hacer frente con las armas de la risa y la imagen en movimiento al poderoso Tercer Imperio alemÃƒÂ¡n. A Chaplin nadie le apoyÃƒÂ³. Todo fueron consejos para disuadirlo de hacer una producciÃƒÂ³n harto temeraria. Pero Chaplin no desistiÃƒÂ³ y tuvo que financiar la producciÃƒÂ³n enteramente de su bolsillo, ante la negativa de las Mayors para financiar el proyecto. Finalmente, el 15 de octubre de 1940 se estrenaba El gran dictador, entre el clamor de la muchedumbre de estrellas de Hollywood que fueron a verla.\nChaplin comentÃƒÂ³ que se arrepentÃƒÂ­a en cierta manera de &quot;El gran dictador&quot; por cuanto habÃƒÂ­a utilizado como motivo para la hilaridad un hecho real que se habÃƒÂ­a transformado en el verdugo genocida de millones de personas. Es ahÃƒÂ­ donde reside el dilema de los momentos cÃƒÂ³micos de esta pelÃƒÂ­cula. Ã‚Â¿De quÃƒÂ© nos reÃƒÂ­mos? Ã‚Â¿De cÃƒÂ³mo un demente dictador torturaba a poblaciones enteras de judÃƒÂ­os y cristianos? Ã‚Â¿De cÃƒÂ³mo hacÃƒÂ­a lo posible por provocar una guerra mundial? Puede que algÃƒÂºn aguafiestas piense asÃƒÂ­. Pero cuando uno ve las escenas mÃƒÂ­ticas del afeitado al ritmo de la Danza HÃƒÂºngara de Brahms, de los discursos en el subanestrugenbajen deutsch, o el mano a mano entre los hermanos dictadores, se estÃƒÂ¡ riendo de Chaplin. De hecho, el propio Adolf Hitler pidiÃƒÂ³ ver la pelÃƒÂ­cula en dos ocasiones y un miembro de su cÃƒÂ­rculo de allegados afirmÃƒÂ³ que se habÃƒÂ­a reÃƒÂ­do.\nTardÃƒÂ³ casi cuarenta aÃƒÂ±os en estrenarse en EspaÃƒÂ±a.\n\n\nDiscurso final:\nLo siento pero yo no quiero ser emperador, no es mi oficio, no quiero gobernar ni conquistar a nadie, sino ayudar a todos si fuera posible, judÃƒÂ­os y gentiles, blancos o negros, tenemos que ayudarnos unos a otros, los seres humanos somos asÃƒÂ­, queremos hacer felices a los demÃƒÂ¡s no hacerlos desgraciados, no queremos odiar ni despreciar a nadie, en este mundo hay sitio para todos, la buena tierra es rica y puede alimentar a todos los seres, el camino de la vida puede ser libre y hermoso, pero lo hemos perdido, la codicia a envenenado las almas, a levantado barreras de odio, nos ha empujado hacia la miseria y las matanzas. Hemos progresado muy deprisa pero nos hemos encerrado a nosotros, el maquinismo que crea abundancia nos deja en la necesidad, nuestro conocimiento nos ha hecho cÃƒÂ­nicos, nuestra inteligencia, duros y secos, pensamos demasiado y sentimos muy poco. Mas que mÃƒÂ¡quinas, necesitamos humanidad, mas que inteligencia tener bondad y dulzura, sin estas cualidades la vida serÃƒÂ¡ violenta, se pedrera todo. Los aviones y la radio nos hacen sentirnos mas cercanos, la verdadera naturaleza de estos inventos exige bondad humana, exige la hermandad universal que nos una a todos nosotros, ahora mismo mi voz llega a millones de seres en todo el mundo, a millones de hombres desesperados, mujeres y niÃƒÂ±os, vÃƒÂ­ctimas de un sistema que hace torturar a los hombres y encarcela a gentes inocentes, a los que puedan oÃƒÂ­rme les digo: No desepereis, la desdicha que padecemos no es mÃƒÂ¡s que la pasajera codicia y la amargura de hombres que temen seguir el camino del progreso humano, el odio de los hombres pasara y caerÃƒÂ¡n los dictadores, y el poder que le quitaron al pueblo se le reintegrara al pueblo, y asÃƒÂ­ mientras el hombre exista la libertad no perecerÃƒÂ¡.\n\nSoldados no os rindÃƒÂ¡is a esos hombres que en realidad os desprecian, os esclavizan, reglamentan vuestras vidas y os dicen lo que tenÃƒÂ©is que hacer, que pensar y que sentir, os barren el cerebro, os ceban, os tratan como a ganado y como a carne de caÃƒÂ±ÃƒÂ³n, no os entreguÃƒÂ©is a esos individuos inhumanos, hombres mÃƒÂ¡quinas con cerebros y corazones de mÃƒÂ¡quinas, vosotros no sois mÃƒÂ¡quinas, no sois ganado, sois hombres, llevÃƒÂ¡is el amor de la humanidad en vuestros corazones no el odio, solo los que no aman odian, los que no aman y los inhumanos. Soldados no luchÃƒÂ©is por la esclavitud sino por la libertad.\n\nEn el capitulo XVII de San Lucas se lee: El Reino de Dios esta dentro del hombre, no de un hombre ni de un grupo de hombres, sino de todos los hombres, en vosotros, vosotros el pueblo tenÃƒÂ©is el poder de hacer esta vida libre y hermosa, de convertirla en una maravillosa aventura, en nombre de la democracia utilicemos ese poder actuando todos unidos, luchemos por un mundo nuevo, digno y noble que garantice a los hombres trabajo y de a la juventud un futuro y a la vejez seguridad. Con la promesa de esas cosas las fieras alcanzaron el poder, pero mintieron no han cumplido sus promesas y nunca las cumplirÃƒÂ¡n, los dictadores son libres solo ellos pero esclavizan al pueblo, luchemos ahora para hacer realidad lo prometido, todos a luchar para libertar al mundo, para derivar barreras nacionales, para eliminar la ambiciÃƒÂ³n, el odio y la intolerancia, luchemos el mundo de la razÃƒÂ³n un mundo donde la ciencia, donde el progreso nos conduzca a todos a la felicidad.\n\nSoldados, en nombre de la democracia debemos unirnos todos.\n\n\nInformaciÃƒÂ³n web: &lt;a href=&quot;\nhttp://imdb.com/title/tt0032553/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0032553/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.culturalianet.com/art/ver.php?art=2833&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.culturalianet.com/art/ver.php?art=2833&lt;/a&gt;\n\n\nInformaciÃƒÂ³n extracciÃƒÂ³n:\nTamaÃƒÂ±o: 5&amp;#039;88 GB\nRecompresiÃƒÂ³n: No\nPartes eliminadas: Ninguna\n\nContenido: \nPelÃƒÂ­cula: Con acceso a escenas. \n\nIdiomas del menÃƒÂº: EspaÃƒÂ±ol, inglÃƒÂ©s, alemÃƒÂ¡n y ruso.\nAudio: VersiÃƒÂ³n original (1.0 mono y remasterizada 5.1 canales - AC3, Dolby Digital), espaÃƒÂ±ol y alemÃƒÂ¡n.\nSubtÃƒÂ­tulos: InglÃƒÂ©s, francÃƒÂ©s, castellano, italiano, alemÃƒÂ¡n, portuguÃƒÂ©s, danÃƒÂ©s, finlandÃƒÂ©s, hebreo, islandÃƒÂ©s, noruego, sueco, croata, eslovaco, checo, griego, hÃƒÂºngaro, polaco, turco y ruso.\nSubtÃƒÂ­tulos para sordos: InglÃƒÂ©s y alemÃƒÂ¡n.","torrent":{"xt":"urn:btih:9858ceeefa1def661b7628147d8209f1d3fdf88c","amp;dn":"Chaplin.05.18.The.Great.Dictator.DVD1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9858ceeefa1def661b7628147d8209f1d3fdf88c","infoHashBuffer":{"type":"Buffer","data":[152,88,206,238,250,29,239,102,27,118,40,20,125,130,9,241,211,253,248,140]},"announce":[],"urlList":[]}}