{"title":"black.books.s01e01.ws.dvdrip.internal.xvid-omicron","uid":3268425,"size":244373504,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:98689fcf312a816ec8c2441140b8e64f9057cc05&amp;dn=black.books.s01e01.ws.dvdrip.internal.xvid-omicron&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"katching","files":1,"time":1103849402,"description":"The first episode of this amazing british sitcom. If you like it, I will seed more eps!\n\nhttp://www.imdb.com/title/tt0262150/\n\n\nPlot Summary for\n&quot;Black Books&quot; (2000)\n\nBernard Black runs his own bookshop even though he doesn't much like people who buy books and hates having customers. Next door to Bernard's shop is the Nifty Gifty gift shop run by Fran, probably Bernard's only friend in the world. When Bernard's accountant goes on the run Bernard employs stress victim, Manny to help in his shop. This leads to a series of surreal adventures around the shop.\n\nSummary written by PH Moo\n\nMeet Bernard Black. Bernard is an anti-social, heavy drinking chain-smoker who owns a small London bookshop - an unusual vocation, given that he detests customers and delights in physically and verbally abusing them at every opportunity. His best (and only) friend in the world is his lunch time drinking partner Fran, a neurotic and boyfriend-desperate woman who owns the pretentious arts and crafts shop next to his. Bernard is cynical, abrasive and lazy, and is perfectly happy that way - but his life takes an unexpected turn when he sells 'The Little Book of Calm' to hyper-stressed accountant Manny Bianco, who against all odds ends up swallowing it. When the dust is settled, Manny will have a new job, Fran will have a new friend, and Bernard's life will be far more surreal (if that's possible).\n\nSummary written by Scott","torrent":{"xt":"urn:btih:98689fcf312a816ec8c2441140b8e64f9057cc05","amp;dn":"black.books.s01e01.ws.dvdrip.internal.xvid-omicron","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98689fcf312a816ec8c2441140b8e64f9057cc05","infoHashBuffer":{"type":"Buffer","data":[152,104,159,207,49,42,129,110,200,194,68,17,64,184,230,79,144,87,204,5]},"announce":[],"urlList":[]}}