{"title":"VectorDesigner 1.0.3 [k'd] (MacHeist 2)","uid":4035555,"size":5081638,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:98ddd41f2abda5a1a07f778577f232ce9f574503&amp;dn=VectorDesigner+1.0.3+%5Bk%5C%27d%5D+%28MacHeist+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kantijob","files":1,"time":1203414959,"description":"VectorDesigner 1.0.3\n\nVectorDesigner is a new vector drawing application designed to be simple, intuitive and powerful to use. \n\nIt has everything you need to create fancy vector graphics such as posters, brochures, stickers, logos, web design, t-shirt and more. \n\nIt features a wide range of tools: smart shapes such as rectangles, ovals, rounded rectangles, polygons, stars, bezier creation and editing and even conversion from raster to bezier. \n\nBoolean tools let you can combine shapes using unite, subtract, intersect and xor. \n\nText can be constrained within a shape or along a path preserving all the text editing capability of Mac OS X. \n\nThe integrated flickr browser lets you search texture and images by tag or by color and download it directly inside the document. \n\nAll the filters and composition available on Mac OS X can be applied in a non destructive way to shapes and images. \n\nPrinters are using a different technology to create colors (CMYK) so they are not able to reproduce all the colors that you can see on screen. VectorDesigner solves the problem automatically softproofing the document and displaying on screen a very close representation of what you will get on paper. \n &lt;a href=&quot;\nhttp://www.tweakersoft.com/vectordesigner/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tweakersoft.com/vectordesigner/&lt;/a&gt;\n\n------------\n\nThis program is [k&amp;#039;d], unlike the rest of my uploads, so you don&amp;#039;t need to enter a serial or license key.  However, DO NOT UPDATE THIS VERSION TO 1.0.4.  It will break it and you will be left with the trial version of 1.0.4 that will expire after 14 days.\n\n(Part of the Mac Heist 2 bundle, but not updatable)","torrent":{"xt":"urn:btih:98ddd41f2abda5a1a07f778577f232ce9f574503","amp;dn":"VectorDesigner+1.0.3+%5Bk%5C%27d%5D+%28MacHeist+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ddd41f2abda5a1a07f778577f232ce9f574503","infoHashBuffer":{"type":"Buffer","data":[152,221,212,31,42,189,165,161,160,127,119,133,119,242,50,206,159,87,69,3]},"announce":[],"urlList":[]}}