{"title":"Misantropical Painforest - Winds Saturate... *Finnish BM*","uid":4257791,"size":113792850,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98fc79138e1413f702da9a32dd2c9de72c2a110e&amp;dn=Misantropical+Painforest+-+Winds+Saturate...+%2AFinnish+BM%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VoltaXebec1968","files":11,"time":1214327670,"description":"1.\tDemons Haunt this Forest\t02:40\t\n2.\tWinds Saturate With Inhumane Longing\t07:23\t\n3.\tPast the Stonecircle Clearing\t13:20\t\n4.\tBesmeared the Tunic of Honour\t09:01\t\n5.\tTo Bequeath the Tranquil Waters\t13:29\t\n6.\tWood Chain Summoning\t12:33\t\n7.\tJourneying (T)here\t07:28\t\n8.\tInstrumental Longing Winds\t05:19\t\nTotal playing time\t01:11:13\n\nReview from vorfeed.net\n\nThis is the first album from Misantropical Painforest, a solo project from Kutcheck Gorealis of Hail and Legacies Unchain.\n\nThe style on this album is quite difficult to describe. There are doomy moments, heavy-metal guitar leads, Burzum-esque atmospheric work, and repetitive, hypnotic riffing. Through it all are powerful vocals that range from shouting and howling on through to clean singing. The impressive thing is that these disparate elements aren&amp;#039;t just thrown together, nor do they really alternate. Instead, they&amp;#039;re combined into a single whole that sounds very little like any other band. One could draw comparisons to Kutcheck Gorealis&amp;#039; other bands, but even that fails. Hail has a doomier, more typically black metal sound, and Legacies Unchain is far more chaotic. Neither has as much heavy metal influence as one can hear on &quot;Winds Saturate&quot;. This album stands alone.\n\n&quot;Demons Haunt This Forest&quot; is the album&amp;#039;s short intro track, a chaotic wall of drums, guitar, and declarative vocals. It&amp;#039;s easily my least-favorite track on the album, but it&amp;#039;s still a good introduction to Misantropical Painforest&amp;#039;s sound, so I can&amp;#039;t really fault it.\n\n&quot;Winds Saturate With Inhumane Longing&quot; starts things off with a drum roll and a shout. This song is aggressive and direct, with a repeated, cyclic guitar theme and an amazing bass line. The latter is almost funky in the way it clatters along; its complete disregard for black metal convention gives this song a very distinctive sound. The end of this track builds up to a frantic conclusion before coming to a halt.\n\n&quot;Past the Stonecircle Clearing&quot; features some of the best vocal work on the album. Double-tracking allows for two vocal parts: a snarling voice and bombastic clean singing. The voices seem to fit the main riff perfectly, even as it smashes through chaotic breaks and variations. About halfway through, this song seems to transform into something else entirely. A long, extended section of screams, groans, and doomy guitars breaks out into heavy-metal triumph for a moment, only to return to slow, painful progression. The last few minutes of this one are quite experimental and strange, yet still very heavy.\n\n&quot;Besmeared the Tunic of Honour&quot; starts out with a moment of doom, but speeds up very quickly. This one features some especially interesting lead guitar work, which approaches a classic metal sound at times. After four minutes or so, the song grows frantic, thrashing about before settling into something reminiscent of themes heard earlier. A while before the end, there&amp;#039;s a brilliant combination of soloing and bass work, after which the song races toward its conclusion.\n\n&quot;To Bequeath the Tranquil Waters&quot; is, to my ears, an instant classic. The melancholy main theme is powerfully memorable, and the subtle variation and careful repetition in its use give this song a strong identity. The vocals here are quite understandable, and fit the music perfectly; taken as a whole, the song is a slow meditation on loss and the inevitability of change. It&amp;#039;s the drumming that makes this song truly unique -- by the end, frantic stick taps and shifting drum fills are the chief source of variation, enhancing the repetition of the main theme. The last few minutes create a powerful sense of duty and finality in the listener.\n\n&quot;Woodchain Summoning&quot; is the most aggressive song on the album, with a vicious, stomping riff and rasping shouts. The drums are front-and-center here, adding to the punishing sound. Snarling, mid-paced anger alternates with blasting sections throughout this song. Unearthly, howling cries echo during the closing half of the song, bringing strange rituals to mind. During the ending, speed variation on the main guitar lead lends the song a meandering feel, even as the underlying riffing and drums charge straight ahead.\n\n&quot;Journeying (T)here&quot; is a combination of sounding, echoing guitar and wrenching vocals. It&amp;#039;s easily the most experimental song on the album, in terms of structure, with very little in the way of ordinary metal progressions. The constant rise and fall of the guitar brings to mind waves, wind, the void of space, and other implacable features of nature. At the last, the vocals and guitar combine in triumphant celebration, before the whole thing ends with a proclamation: &quot;Nowhere is everywhere!&quot; Powerful stuff.\n\n&quot;Instrumental Longing Winds&quot; is a repetition of the first track, instrumental-only, with added soloing. It&amp;#039;s interesting to hear the difference between this and &quot;Winds Saturate...&quot;, considering that the basis for both is the same.\n\nThis is easily the least derivative thing I&amp;#039;ve heard in several years, and one of the best. It sounds like nothing else out there -- just as I&amp;#039;ve come to understand a part of it, it defies categorization again. That alone makes this an essential purchase for those looking for powerful, original black metal. Highest recommendations.\n\nStandout tracks: &quot;To Bequeath the Tranquil Waters&quot;, &quot;Woodchain Summoning&quot;, &quot;Journeying (T)here&quot; \n &lt;a href=&quot;\nhttp://www.metal-archives.com/band.php?id=30945&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.metal-archives.com/band.php?id=30945&lt;/a&gt;","torrent":{"xt":"urn:btih:98fc79138e1413f702da9a32dd2c9de72c2a110e","amp;dn":"Misantropical+Painforest+-+Winds+Saturate...+%2AFinnish+BM%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98fc79138e1413f702da9a32dd2c9de72c2a110e","infoHashBuffer":{"type":"Buffer","data":[152,252,121,19,142,20,19,247,2,218,154,50,221,44,157,231,44,42,17,14]},"announce":[],"urlList":[]}}