{"title":"Cowboy Junkies 1990-05-04 @ Berklee Performing Arts Center - Bos","uid":4057346,"size":805317313,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9916552960b77b55a37d6481cf429a0f207b7d99&amp;dn=Cowboy+Junkies+1990-05-04+%40+Berklee+Performing+Arts+Center+-+Bos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":32,"time":1204431161,"description":"So, oldies seem to be a favorite here. This show is an audience recording from the Caution Horses tour. The performance is interesting. &quot;Coast of Peru&quot; haunts me every time I hear it. Margo&amp;#039;s voice is one of the most exquisite in music, and this little intro really showcases it. &quot;Five Room Love Story&quot; started to appear, as well as the story of Joseph and Lillian&amp;#039;s love. Additionally, several tracks from what would become &quot;Black Eyed Man&quot; were being tested on audiences. Listen to the very interesting &quot;If You Were the Woman and I Was the Man&quot; at the start of CD2. It&amp;#039;s an interesting arrangement.\n\n \n\nThe true showstopper is the extended &quot;Shining Moon.&quot; The band plays with fascinating dynamic shifts, dropping the music to a whisper midway through, then building a jam that ends in a rousing crescendo and turns into a quiet ending. This is perhaps THE best performance of &quot;Shining Moon&quot; I&amp;#039;ve heard.\n\n \n\nThere are some technical glitches on the recording. At the end of several tracks, the tape momentarily stopped, so there are some abrupt transitions back into the songs. None of the actual music is missing, save the last song, which on the recording I have lasts for about 45 seconds. As such, I decided to cut it out. Better no &quot;Blue Moon&quot; than a tease, I felt.\n\n \n\nThe filler is a radio/soundboard from Mountain Stage in 1994. There are several good songs on it. I think this is out there already, but it was on the DAT so I thought, why not? I&amp;#039;ve especially been listening to as many performances of &quot;Lungs&quot; as I can find lately, and the one here is fabulous.\n\n ","torrent":{"xt":"urn:btih:9916552960b77b55a37d6481cf429a0f207b7d99","amp;dn":"Cowboy+Junkies+1990-05-04+%40+Berklee+Performing+Arts+Center+-+Bos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9916552960b77b55a37d6481cf429a0f207b7d99","infoHashBuffer":{"type":"Buffer","data":[153,22,85,41,96,183,123,85,163,125,100,129,207,66,154,15,32,123,125,153]},"announce":[],"urlList":[]}}