{"title":"L.G.03","uid":4276021,"size":4511184896,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:995ea1c22d456f6d969e1afab8605d9781ba8a9f&amp;dn=L.G.03&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Oboz","files":39,"time":1215189663,"description":"TIERRA DE GIGANTES fue otra gran creaciÃƒÂ³n del mago de la ciencia-ficciÃƒÂ³n Irwin Allen para la cadena de TV ABC. Se comenzÃƒÂ³ a emitir el 22 de septiembre de 1968 y concluyo el 22 de marzo de 1970, solo cubriÃƒÂ³ dos temporadas. Por aquel entonces fue la serie de mayor presupuesto de TV. Con un costo de 250,000 dÃƒÂ³lares por episodio, Tierra de Gigantes fijo un nuevo record de audiencia.\n \nTRAMA ARGUMENTAL:\n \nEl &quot;Spindrift&quot; es una aeronave diseÃƒÂ±ada para vuelos comerciales. En uno de ellos, volando de Nueva York a Londres, se pierde al atravesar una extraÃƒÂ±a nube en la ÃƒÂ³rbita terrestre, y la nave se verÃƒÂ¡ obligada a aterrizar en un planeta &quot;gemelo&quot; de la Tierra, pero con una pequeÃƒÂ±a diferencia..., Ã‚Â¡Ã‚Â¡ todo tiene un tamaÃƒÂ±o GIGANTESCO !!.\n \nDesde el momento en que aterrizan en ese insÃƒÂ³lito lugar, serÃƒÂ¡n perseguidos por el gobierno totalitario de dicho planeta, que intentarÃƒÂ¡ &quot;cazarlos&quot; al conocer su existencia. AdemÃƒÂ¡s, se verÃƒÂ¡n expuestos a los diferentes peligros que les acecharÃƒÂ¡n, dada su &quot;minÃƒÂºscula&quot; estatura, en un planeta habitado por &quot;seres gigantes&quot;.\n\nLa serie fue creada por Irwin Allen con el sello de Lost in Space (Perdidos en el espacio). No hace falta decir que sigue las pautas de sus anteriores series: Perdidos en el espacio y el tÃƒÂºnel del tiempo creando un personaje similar psicologicamente al Dr Zachary Smith.\n ","torrent":{"xt":"urn:btih:995ea1c22d456f6d969e1afab8605d9781ba8a9f","amp;dn":"L.G.03","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"995ea1c22d456f6d969e1afab8605d9781ba8a9f","infoHashBuffer":{"type":"Buffer","data":[153,94,161,194,45,69,111,109,150,158,26,250,184,96,93,151,129,186,138,159]},"announce":[],"urlList":[]}}