{"title":"BitDefender TOTAL Security 2008, CRACK INCLUDED","uid":4043485,"size":51311614,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:99a7dfa24e974a701cd0eb288f61f5711d91d494&amp;dn=BitDefender+TOTAL+Security+2008%2C+CRACK+INCLUDED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wildorfi","files":1,"time":1203789825,"description":"BitDefender Total Security 2008 - the Ultimate Proactive Protection for Your PCs \nBitDefenderÂ®, a global provider of award-winning antivirus software and data security solutions, has launched BitDefender 2008 ? its new line of security solutions providing state-of-the-art proactive protection from today?s most damaging viruses, spyware, hackers, spam, phishing attacks, and other common Internet security threats. \nThe BitDefender 2008 product line, which includes BitDefender Antivirus 2008, Internet Security 2008 and Total Security 2008, is designed to protect a wide variety of computer usage scenarios ranging from individual PC users and multi-PC families to SoHo businesses. \n\nBitDefender Total Security 2008 provides the ultimate proactive protection for your PCs. It combines state of the art protection against viruses, spyware, hackers, spam and other Internet security threats. Moreover, its system maintenance and PC backup tools keep your PC running fast and protected from data loss. \n\nBitDefender Total Security 2008 is designed for users who desire the ultimate in protection from Internet security threats and data loss, with integrated backup and PC maintenance tools to keep their PC running at peak performance. Total Security includes all of the features and benefits of Antivirus 2008 and Internet Security 2008, as well as the following new features: \n? Data backup ? safeguarding data by creating backup copies to local and removable drives, CD-R/RW or DVD-R/RW \n? PC Tune-up ? improving PC performance by removing unnecessary files and registry entries \n? Trace clean-up ? which completely erases files and ?traces? of files from disks to prevent recovery \n\n?BitDefender 2008 provides home and SMB users with an unmatched level of protection that defends against tomorrow?s threats today,? said Bogdan Dumitru, BitDefender CTO. ?As hackers and spammers rapidly change their tactics, our patent-pending B-HAVE heuristics technology provides users with the highest levels of proactive protection from zero-day and unknown malware threats. The new capabilities offered in BitDefender 2008 ? including 64-bit support and the Gamer Mode ? also demonstrate BitDefender?s ongoing commitment to evolve its offerings to meet the needs of today?s latest applications.? \n\nMain Features: \n\nANTIVIRUS &amp; ANTISPYWARE \n* Protects your PC in real time from known viruses, spyware and other malware with hourly updates \n* Blocks unknown viruses using advanced proactive detection techniques \n* Monitors and prevents spyware threats in real-time \n* Detects and removes the newest breed of hidden threats known as rootkits \n* Provides a smooth gaming experience by reducing the system load to a minimum \n\nANTI-PHISHING \n* Protects against phishing attacks by filtering all accessed web pages for fraud attempts \n* Reduces the risk of identity theft by preventing personal information leaks via e-mail or web. \n\nFIREWALL \n* Controls applications? access to the Internet while ?hiding? your computer from hackers \n* Helps prevent unauthorized access to your Wi-Fi network by notifying you when computers log in to the network. \n\nANTISPAM \n* Prevents different types of spam and scam e-mails from reaching your Inbox \n* Now responds faster to new spamming techniques with new adaptive engines \n\nPARENTAL CONTROL \n* Blocks access to inappropriate websites and e-mail \n* Allows or blocks web access during specified time periods \n\nBACKUP \n* Safeguards your data by creating backup copies to local and removable drives, CD-R/RW or DVD-R/RW \n* Automatically backs up only new files, based on a pre-set schedule. \n\nTUNE-UP \n* Improves your PC performance by removing unnecessary files and registry entries \n* Completely erases files and &quot;traces&quot; of files from disk to prevent recovery \n\nBitDefender 2008 is compatible with Windows 2000 (with service pack 4), Windows XP (with service pack 2) and Windows Vista and supports Microsoft Outlook 2000, 2003, and 2007, Outlook Express, Windows Mail, and supports Mozilla Thunderbird 1.5 and 2.0.\n","torrent":{"xt":"urn:btih:99a7dfa24e974a701cd0eb288f61f5711d91d494","amp;dn":"BitDefender+TOTAL+Security+2008%2C+CRACK+INCLUDED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99a7dfa24e974a701cd0eb288f61f5711d91d494","infoHashBuffer":{"type":"Buffer","data":[153,167,223,162,78,151,74,112,28,208,235,40,143,97,245,113,29,145,212,148]},"announce":[],"urlList":[]}}