{"title":"Veritas 1x07","uid":4255425,"size":355487744,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9a458619b38df2bbbd951734ee2d8f449cc2d524&amp;dn=Veritas+1x07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NITRISH","files":1,"time":1214180528,"description":"Ã‚Â¿QuÃƒÂ© ocurrirÃƒÂ­a si vieras a tu madre desaparecer misteriosamente en una antigua tumba? Ã‚Â¿QuÃƒÂ© pasarÃƒÂ­a si descubrieras que tu padre no es quien parecÃƒÂ­a ser? Ã‚Â¿Y si en el peor de tus dÃƒÂ­as comenzase la aventura mÃƒÂ¡s importante de tu vida? \n\nEn Veritas conoceremos a Nikko Zond (Ryan Merriman, Abducidos), un super inteligente pero rebelde adolescente que todavÃƒÂ­a llora la muerte de su madre, una afamada arqueÃƒÂ³loga, y su padre Solomon (Alex Carter), adicto al trabajo y para el que Nikko es casi un extraÃƒÂ±o. El dÃƒÂ­a que Nikko es expulsado del ÃƒÂºltimo centro de una larga lista de colegios, descubre que la carrera de su padre como profesor universitario es sÃƒÂ³lo una tapadera. Solomon es el responsable de la FundaciÃƒÂ³n Veritas, cuyo objetivo es la bÃƒÂºsqueda de la verdad sobre los misterios de la Historia y sus civilizaciones. \n\nFormando equipo por primera vez con su padre, Nikko encuentra en sÃƒÂ­ mismo el mismo espÃƒÂ­ritu aventurero de sus padres, al involucrarse involuntariamente en las peligrosas peripecias de su padre. Pronto entrarÃƒÂ¡ a formar parte de un mundo de alta tecnologÃƒÂ­a e informes clasificados en la FundaciÃƒÂ³n Veritas, embarcÃƒÂ¡ndose en un viaje que le conducirÃƒÂ¡ al descubrimiento de misterios universales y al reencuentro emocional con su propio padre. ","torrent":{"xt":"urn:btih:9a458619b38df2bbbd951734ee2d8f449cc2d524","amp;dn":"Veritas+1x07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a458619b38df2bbbd951734ee2d8f449cc2d524","infoHashBuffer":{"type":"Buffer","data":[154,69,134,25,179,141,242,187,189,149,23,52,238,45,143,68,156,194,213,36]},"announce":[],"urlList":[]}}