{"title":"(Indie Rock) Dead Red Sea - Birds (Deep Elm)","uid":4114909,"size":32909858,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9ab33766b094e596a22e98c90c69e205a7a70eb8&amp;dn=%28Indie+Rock%29+Dead+Red+Sea+-+Birds+%28Deep+Elm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Falleen_Fan_No_1","files":11,"time":1207254499,"description":"A dark and poignant merging of indie rock, hardcore and blues, DEAD RED SEA strikes with a hushed aggression. Alienation and intensity mark the candid lyrics of frontman Ryan Shelkett (ex-Cross My Heart) who plays the melancholy everyman on BIRDS - his voice familiar and connecting - uncovering the charred aspects of his naked psyche. Through musical memoirs about insecurity, mistrust and self-loathing, he reveals the person trapped within his scrambled sense of self. The softly treading rhythm section provides the perfect accompaniment for Shelkett&amp;#039;s earnest pop poetry. Weaving between sobering states of depression and energizing encounters with clarity, BIRDS is an exquisitely intimate affair flagged with songs that are soulful, drenched in feeling and charming. \n\n&quot;With Birds from Dead Red Sea, moody and caressing waves of lyrical beauty fall over you, inspiring you to sing along before you even know the words. The emotions capture you and steal you away, until you&amp;#039;re lost within the music. The sadness, the loss, the angst, are rendered in shades of truth and energy. The songs roll into a dynamic swirl of melodic aggression, with the vocals keeping the music moving forward until, with a soft sigh, you&amp;#039;re at the end.&quot; - Big Takeover \n\n&quot;Dead Red Sea&amp;#039;s unique blend of melodic indie rock and bluesy beats give the songs on Birds a sort of soothing, melancholy mood, while the music itself is something to lie back, tap your heels and snap your fingers to. The effect floors me more each time I hear it. Birds is full of monumental, awe-inspiring songs that demand to be heard - or rather absorbed - time and again with their hook-filled rhythmic guitars and pacifying vocals. Birds is now one of the most cherished records in my entire collection...another gem stamped with a Deep Elm logo. Songs like Obscene Calls and Somewhere In The Universe are likely to remain among my most-played tracks for a long time.&quot; - Punk International \n\n01. Love Is In The Air And Is Floating Away  \n02. Bad Man  \n03. Humanoid  \n04. The Rain \n05. Somewhere In The Universe \n06. It&amp;#039;s So Hard To Be Alive \n07. Obscene Calls \n08. We&amp;#039;re Not Kids Anymore \n09. Birds \n10. The Red Sea \n11. Nowhere, Nothing \n\n\nIf you like this, please check out my other torrents.  I only upload quality stuff!\n\n\n\nfor lyrics, go here: &lt;a href=&quot;\nhttp://www.deepelm.com/sum/391_sum.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.deepelm.com/sum/391_sum.html&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:9ab33766b094e596a22e98c90c69e205a7a70eb8","amp;dn":"%28Indie+Rock%29+Dead+Red+Sea+-+Birds+%28Deep+Elm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab33766b094e596a22e98c90c69e205a7a70eb8","infoHashBuffer":{"type":"Buffer","data":[154,179,55,102,176,148,229,150,162,46,152,201,12,105,226,5,167,167,14,184]},"announce":[],"urlList":[]}}