{"title":"4  Female Fronted Bands","uid":3251911,"size":211833246,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9ae7d9e8ee517f8a631a52ec919a4c55fd61f537&amp;dn=4++Female+Fronted+Bands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"darklotus69","files":45,"time":1099096048,"description":"Daisy Chainsaw - Eleventeen (vbr) [i think thats what you put when it varies from about 350-700kbs]\n\nKatie Jane Garside was the quirky starlet of the U.K. band Daisy Chainsaw. Her naive stage persona of torn dresses smeared with dirt was a disturbing yet enchanting look into the punk-pop four-piece who had a short-lived spot in alternative music. Joining Garside was bassist Richard Adams, drummer Vince Johnson, and guitarist Crispin Grey, and together the band made their debut with 1991's LoveSickPleasure EP. One Little Indian took notice, signing the band and issuing Daisy Chainsaw's full-length studio effort Eleventeen the following year\n\nSiouxsie and the Banshees - The Peel Sessions (256kbs)\n\nSiouxsie &amp;amp; the Banshees were among the longest-lived and most successful acts to emerge from the London punk community; over the course of a career which lasted two decades, they evolved from an abrasive, primitive art-punk band into a stylish, sophisticated unit which even notched a left-field Top 40 hit.\n\n\nLene Lovich - Stateless (128kbs)  [woops,how did that get in there?]\n\nOne of Stiff Records' most stable staples, the truly alternative Lene Lovich laid much of the groundwork for an entire generation of singers left to pick up the pieces in the wasteland of the post-punk era. Her stunning debut, 1979's Stateless...Plus, was so unique, so vibrant, and her vocal stylings so unusual that the LP not only put her right at the front of the pack of nascent new wavers, it also sounded a commercial death knell of sorts, relegating her to the realms of novelty acts -- at least as far as the mainstream was concerned.\n\nWendy O Williams &amp;amp; The Plasmatics - Maggots:The Record (vbr)\n\nMore of an audio play than a music album, a Rod Serling-like narrator takes listeners through a disturbingly graphic story depicting genetically mutated maggots breeding exponentially until mankind is exterminated. Not for the squeamish; explicit dialogue and detailed descriptions of characters and their horrible deaths by the disgusting creatures are told with fantastic horror. Providing interlude are six apocalyptic Plasmatics songs embellishing the plot and displaying Wendy O. Williams' distinctive machine-gun caterwauling. &amp;quot;You're a Zombie,&amp;quot; &amp;quot;The Day of the Humans Gone,&amp;quot; &amp;quot;Brain Dead,&amp;quot; and &amp;quot;Finale&amp;quot; are surprisingly decent '80s punk metal anthems with all the trimmings: chanted vocals, pounding militia-marching drums, and crunching guitar work. Once tossed off as gory camp, realized environmental changes and threats of biological terrorism made this prophetic release particularly unnerving.\n\nPlease help seed and\nENJOY!\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9ae7d9e8ee517f8a631a52ec919a4c55fd61f537","amp;dn":"4++Female+Fronted+Bands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae7d9e8ee517f8a631a52ec919a4c55fd61f537","infoHashBuffer":{"type":"Buffer","data":[154,231,217,232,238,81,127,138,99,26,82,236,145,154,76,85,253,97,245,55]},"announce":[],"urlList":[]}}