{"title":"Ragnarok Royale [Free to play MMORPG]","uid":4059202,"size":1391219996,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9b347fca8626e44855b629405f11dda7e8d56bba&amp;dn=Ragnarok+Royale+%5BFree+to+play+MMORPG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ragnarok-royale","files":1,"time":1204517571,"description":"--Introduction--\n\nRagnarok Royale is a completely free gameserver and is based on the populair Korean MMORPG Ragnarok Online. It has gone for a fresh new start on Februari the 27th, after running more than 3 years! If you wish to to be part of a great community from the beginning, this will be your chance! You can register an account at www.ragnarok-royale.net for free. Be quick, as there&amp;#039;s currently a &gt;&gt; free 100 kafra points give-away &lt;&lt; at registration! This client is fully updated and contains the Royale Lite client in combination with the latest Korean Sakray client.\n\n--Features--\n\nHere is a short list of what Ragnarok Royale has to offer you. To get a better impression you might want to check out some of the screenshots that can be found at our website.\n\n+ Using AEGIS technology\nThe official software, which means stability and very few bugs! Most servers out there use so-called emulators, which are trying to imitate exactly what our software is already doing.\n\n+ Lowrates 7x/7x/3x\nThese rates provide a long-term playability and balance. Altough leveling may seem slow at first, most people will prefer it after they obtained a character that really feels as theirs.\n\n+ Earn free Kafra Points, no donation needed!\nNo need to spend your money to buy those rare shop-only items, you can earn by simply voting every day and by participating in events such as loading screen contests and fanart.\n\n+ Up to Episode 11.3: Nameless Island\nIncluding monsters such as Beelzebub and Ragged Zombie. As an extra we also have the new Moscovia maps and mobs!\n\n+ Official Quests\nWe have most of the official quests available, which include the well-known The Sign, Kiel Hyre and all of the general town quests up to the city of Rachel. All quests for the Veins region will soon be implemented.\n\n+ Including a Cloth Dyeing NPC\nThere&amp;#039;s no need to look exactly the same as other players, you can pick a dye that suits you and create your own trademark!\n\nIf you have any questions, or troubles you can try your question at the forum, or check the FAQ.\n\nWebsite: http://www.ragnarok-royale.net\nForum: http://www.ragnarok-royale.net/forum","torrent":{"xt":"urn:btih:9b347fca8626e44855b629405f11dda7e8d56bba","amp;dn":"Ragnarok+Royale+%5BFree+to+play+MMORPG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b347fca8626e44855b629405f11dda7e8d56bba","infoHashBuffer":{"type":"Buffer","data":[155,52,127,202,134,38,228,72,85,182,41,64,95,17,221,167,232,213,107,186]},"announce":[],"urlList":[]}}