{"title":"The Melancholy of Haruhi Suzumiya Complete - ZangetsuZero","uid":4115692,"size":18558766303,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9b9db02e3ffaae7c7116f1350f8f660388dfb842&amp;dn=The+Melancholy+of+Haruhi+Suzumiya+Complete+-+ZangetsuZero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZangetsuZero","files":6,"time":1207298715,"description":"--- How To Burn These ISOs ---\n\nDo it your way or use the included software (DVD Decrypter). \n\n1) Install DVD Decrypter \n2) At the top go to Mode &gt; ISO &gt; and select Write\n3) Under \\\\\\&quot;Source\\\\\\&quot; click on the brown folder and select the ISO you want to burn\n4) Under \\\\\\&quot;Destination\\\\\\&quot; select your DVD burner\n5) Under \\\\\\&quot;Settings\\\\\\&quot; in the lower right-hand corner, select your Write Speed\n6) Click on the image of a HDD pointing to a disc to begin burning\n\nGenre: Comedy / Supernatural (Age Rating 13+)\nFormat: DVD (All Regions!)\nLength: Vol #1-2: 100 Minutes, Vol #3-4: 75 Minutes\nLanguage: Bilingual - Japanese w/ English Subtitles and English Dubbed\nRelease: Bandai\n\nOn the first day of high school a beautiful girl named Haruhi Suzumiya introduces herself as having \\\\\\&quot;no interest in ordinary humans\\\\\\&quot;.\n\nShe asks for any aliens, time travelers, sliders or espers to join her. Watching her weird behaviour is Kyon a boy who sits in front of Haruhi and is the only person who talks to her. Commenting on Haruhi\\\\\\&amp;#039;s joining every club in school and then quitting Kyon unwittingly gives Haruhi an idea to start her own after school club.\n\nThereafter Kyon and several others find themselves literally dragged into the Save our world by Overloading it with fun Suzumiya Haruhi\\\\\\&amp;#039;s Brigade (the S.O.S. Brigade for short).\n\nVolume #1 Episodes 00 to 3\n\nI thought that when I entered high school, my days of believing in aliens, time travelers and ESPers were over. That was, until she introduced herself. Claiming to be interested in only aliens, time travelers, and ESPers, Haruhi Suzumiya was the strangest girl I\\\\\\&amp;#039;d met in a long time... Before I knew what was going on, I\\\\\\&amp;#039;d been dragged into her weird club, and it looks like I\\\\\\&amp;#039;m not the only one who has been drafted into this \\\\\\&quot;SOS Brigade\\\\\\&quot; of hers, because there are three other students here who don\\\\\\&amp;#039;t seem to be so ordinary themselves. Either way, we\\\\\\&amp;#039;ve all found ourselves caught up in Haruhi\\\\\\&amp;#039;s quest to search for all things extraordinary. And what\\\\\\&amp;#039;s this I hear about us making a movie...?\n\nVolume #2 Episodes 4 - 7\n\nAliens, time travelers, and ESPers... I used to believe that none of these could possibly exist. But now everything I once believed to be the subject of TV specials, comic books and an over-active imagination have all come tumbling into my life! And apparently they\\\\\\&amp;#039;ve all gathered because of Haruhi! The appearance of these fantastical beings is occurring right under Haruhi\\\\\\&amp;#039;s nose and to make matters worse, she\\\\\\&amp;#039;s getting bored! And when Haruhi gets bored, it can lead to some full blown trouble... In order to deal with her boredom, I\\\\\\&amp;#039;m going to have to escape from homicidal classmates, a grey world filled with gigantic beings bent on its destruction, and win a game of baseball! And what does Snow White have to do with all of this?\n\nVolume #3 Episodes 8 - 10\n\nIt seems that Haruhi has made a full recovery from her state of melancholy, and is back to doing whatever she wants. And even though all club activities are supposed to be suspended for the exam season, the SOS Brigade still continues to meet. But at least we\\\\\\&amp;#039;ve got something to do this time, as the computer club\\\\\\&amp;#039;s president has gone missing and his girlfriend has sent us to look for him! But what does it have to do with the new SOS Brigade logo that Haruhi\\\\\\&amp;#039;s come up with? The SOS Brigade finally gets a vacation when Haruhi drags us off to an island villa owned by one of Itsuki\\\\\\&amp;#039;s relatives. But when does the SOS Brigade really take a break? We\\\\\\&amp;#039;re going from a closed space to a closed circle as we find ourselves trapped in the middle of a freak storm. To make matters worse, there\\\\\\&amp;#039;s a murderer on the loose. This couldn\\\\\\&amp;#039;t be all Haruhi\\\\\\&amp;#039;s wish could it? She wouldn\\\\\\&amp;#039;t want anybody to die... right?\n\nVolume #4 Episodes 11 - 13\n\nThe annual school culture festival has begun, and with it comes the debut of Haruhi\\\\\\&amp;#039;s surreal film! Who did she threaten this time to have her movie shown? More importantly, what other event has she schemed up and what impact will it have on the rest of the SOS Brigade? At least I\\\\\\&amp;#039;ve got Mikuru and the cosplay cafe to look forward to, but perhaps someone should explain to Yuki that fortune-telling isn\\\\\\&amp;#039;t about eerie accuracy! The computer club counter-attacks! After Haruhi extorted the club\\\\\\&amp;#039;s president for their best computer they challenge the SOS Brigade to a not-so-friendly strategy game. How are we going to win when our chief\\\\\\&amp;#039;s strategy doesn\\\\\\&amp;#039;t exist? We should just raise the white flag and give up. Can we win without the help of Yuki\\\\\\&amp;#039;s bogus magic or will defeat drive Haruhi into a world-ending rampage? Its a slow day for us in the club room - that is, until Haruhi arrives. She\\\\\\&amp;#039;s somehow managed to swindle a heater from one of our movie\\\\\\&amp;#039;s sponsors. I hope Mikuru\\\\\\&amp;#039;s okay while I\\\\\\&amp;#039;m forced to make the exhausting trek in the rain to retrieve it. What bizarre activity will Haruhi force upon our club members while I\\\\\\&amp;#039;m gone?\n\nEmail: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a5ebc0ddd1efcccbe2c4c8c0d7e5dcc4cdcaca8bc6cac8&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; ","torrent":{"xt":"urn:btih:9b9db02e3ffaae7c7116f1350f8f660388dfb842","amp;dn":"The+Melancholy+of+Haruhi+Suzumiya+Complete+-+ZangetsuZero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b9db02e3ffaae7c7116f1350f8f660388dfb842","infoHashBuffer":{"type":"Buffer","data":[155,157,176,46,63,250,174,124,113,22,241,53,15,143,102,3,136,223,184,66]},"announce":[],"urlList":[]}}