{"title":"MotionArtist 4","uid":4274391,"size":162423431,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9c4e4d4cde7a3f65d78600ffbe571a59a3511a30&amp;dn=MotionArtist+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"etistuk","files":7,"time":1215109034,"description":"Create professional Flash animations in minutes with no scripting required! Intuitive yet powerful, MotionArtist includes wizards, templates, and built in animation to easily create impressive Flash banners, websites, photo albums and presentations. Plus it provides ready-to-use content to help you make your first animations look great!\n\nKey Features\n?Script Free Flash Action - With MotionArtist, point-and-click button features replace the complicated scripting typically required for Flash animation, putting interactive banners, navigation buttons, menus, and photo albums right at your fingertips! \n?Built-in Animation Effects - Built-in animation effects add life to your artwork. Easily animate banners, share photo albums, stylize web pages and presentations. \n?Templates &amp; Wizards - MotionArtist&amp;#039;s wizards and templates lead you step-by-step to building your own outstanding web pages, banners, web comics, presentations and digital photo albums! \n?Intuitive User Interface - Drag-and-Drop functionality and a colorful, editable timeline make Flash creation a snap! View imported MP3 files on your timeline in waveform display! MotionArtist&amp;#039;s updated interface design makes it even easier to use than ever!\n?1500 Ready-to-Use Graphics - Over 1500 pieces of ready-to-use content - buttons, animations, characters, backgrounds, borders, and special effects. Drag-and-drop objects to use with your own sounds and images to create a look tailored to you!\n?SWF, AVI &amp; MOV Publishing Software - MotionArtist outputs industry-standard Web-ready SWF, AVI and MOV files.\n?Import/Export - Import BMP, GIF, JPG, PNG, WMF and Consecutive Images. Export SWF, MOV and AVI.\nNew in MotionArtist 4\n?Improved Timeline - Edit object properties such as display times, animation length, fades and music with ease.\n?Updated Text Tool - Easily add text with complete control over color. \n?Browser Preview - Preview your Flash project in action with the browser of your choice. \n?Improved Cell Mode Animation - Animate image frames easily and quickly. With a few clicks, MotionArtist will automate the whole process so you don?t have to. Import image sequences from Poser, Shade or Anime Studio Pro and easily animate them!\n?Improved Clip List - Includes a dozen sample clips to get you started! \n?Movie Output - Save your animations into Windows (AVI) or Macintosh (MOV) friendly file formats! MotionArtist is perfect for adding titling effects to your home made movies!\n?&amp;#039;Now Loading&amp;#039; Pages - Choose from many built-in &amp;#039;Now Loading&amp;#039; pages or create your own!\n?New Templates &amp; Wizards \noDigital Photo Albums - Use templates to easily create flash-based digital photo albums with your own photos.\noWeb Page Templates - Create new web pages or add life to existing content in half the time with built-in page templates.\noPresentation Templates - Quickly create Flash presentations for your business meetings.","torrent":{"xt":"urn:btih:9c4e4d4cde7a3f65d78600ffbe571a59a3511a30","amp;dn":"MotionArtist+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c4e4d4cde7a3f65d78600ffbe571a59a3511a30","infoHashBuffer":{"type":"Buffer","data":[156,78,77,76,222,122,63,101,215,134,0,255,190,87,26,89,163,81,26,48]},"announce":[],"urlList":[]}}