{"title":"Scallywag: In the Lair of the Medusa","uid":4262064,"size":103273347,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9c65c202b9963c03ffa626b58af466dda160f0ba&amp;dn=Scallywag%3A+In+the+Lair+of+the+Medusa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kasadra","files":3,"time":1214517698,"description":"...a dank and dark cave that oozed evil, a terrible open sore in the \nland that spewed forth nightmares... \n\nThe Gosling valley was once a valley of peace and prosperity. In Gosling \nit seemed the sun always shined, your neighbors smiled, and the harvests \nwere bountiful. Yes, life in the valley was good. Factor in the \nmushrooms, and well, life wasn&amp;#039;t just good, it was great! \n\nAh yes, the mushrooms. The valley was full of them, and each one was \nspecial. There were enormous mushrooms that were used as homes, and \nsmall ones that could be brewed into liquor (including everyone&amp;#039;s tavern \nfavorite, ShroOOom! ale). Some mushrooms were best buttered and fried, \nwhile other mushrooms were typically dried and smoked. There were \nmushrooms that healed the sick, and even some that could make magic! \n\nThen the troubles began. Bizarre creatures prowled the valley, the \nwildlife fled, and once full larders laid bare. The citizens of Gosling \nsmiled at each other no more, instead spending their days hiding in \nterror. Worse, with the blight upon the land the mushrooms that once \nprovided so much now provided so little. Even the casks of ShroOOom! ale \nwere almost dry! \n\nBig Will, an old farmer, sought out the source of the evil. Nestled high \nin the hills, he found the source: a dank and dark cave that oozed evil, \na terrible open sore in the land that spewed forth nightmares. Big Will \ndid not go in, though. He&amp;#039;d let someone else have all the glory. \nSomeone, such as YOU! \n\nYou are Rapius, mighty farm laborer. The blood of the Gods do not flow \nin your veins. You were not prophesized about a thousand years prior by \nthree blind crones. Yet it is you, Rapius, that will seek out and \ndestroy the source of evil. \n\nBash zombies, do &amp;#039;shrooms, grab loot, burn oil, learn to fly, learn \nmagic, explore worlds, get drunk, get fast, get lost, get found, get the \nrope, get out!","torrent":{"xt":"urn:btih:9c65c202b9963c03ffa626b58af466dda160f0ba","amp;dn":"Scallywag%3A+In+the+Lair+of+the+Medusa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c65c202b9963c03ffa626b58af466dda160f0ba","infoHashBuffer":{"type":"Buffer","data":[156,101,194,2,185,150,60,3,255,166,38,181,138,244,102,221,161,96,240,186]},"announce":[],"urlList":[]}}