{"title":"Ghost.Recon.Advanced.Warfighter.2-ThePiraten","uid":4150936,"size":3592314880,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9c99ac9e27c9e612845489bab8c305f0b8f15e3c&amp;dn=Ghost.Recon.Advanced.Warfighter.2-ThePiraten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ThePiraten_","files":1,"time":1208937398,"description":"RELEASE DATE : 07-07-07 PROTECTION : Serial\nGAME TYPE : Tactical DISKS : 1 DVD\n\nRelease Notes:\n\nYES, the leading force is once again back to kick ass on pc.\nWe&amp;#039;re not sorry for the crappy Model Train 3D release, not at\nall actually. We believe that this game release will prove to\nall the nonbelievers, that SKID ROW are back in business for\nreal. We&amp;#039;re here to release, not to judge the game titles we\nwill release or have released in the past. We can assure any\nof you, that we&amp;#039;re damn serious on bringing the success from\nour amiga days on to the pc and even build more to it. We have\nbeen rebuilded before on pc, but this time, we&amp;#039;re stronger,\nmore passionable and finally we&amp;#039;re better prepared than never\nbefore. It&amp;#039;s time to bring some scene feeling into the game\niso scene.\n\nForget about the stories, forget about the rumours, forget\nabout the past, because SKID ROW is like no other group, that\never existed.\n\nWe&amp;#039;re still looking for qualified skilled people to fill the\nranks. Don&amp;#039;t hesitate to contact us, if you can find us.\n\nWe&amp;#039;re also looking for other things, that can be of value to\nus. Hurry up and contact us right now, you won&amp;#039;t regret it.\n\nNever forget, twice the fun, double the trouble!\n\nSKID ROW 2007\n\nOn with the game info:\n\nTom Clancy&amp;#039;s Ghost Recon Advanced Warfighter 2 builds off of\nthe events in the first game and places gamers in control of\nthe U.S. military&amp;#039;s elite fighting unit, the Ghosts. In the\nyear 2014, the rising conflict between Mexican loyalists and\ninsurgent rebel forces has thrown Mexico into full-scale civil\nwar. Under the command of Captain Scott Mitchell, the Ghosts\nare called upon to face an imminent threat to the United\nStates. The fate of two countries now lies in the hands of the\nGhosts as they fend off an attack on U.S. soil. Equipped with\nthe most cutting-edge weaponry and technology, the Ghosts must\nbattle on both sides of the border to neutralize the\nescalating rebel threat.\n\nGroundbreaking Visual Experience: The war zone in Tom Clancy&amp;#039;s\nGhost Recon Advanced Warfighter 2 comes to life as you\nnavigate through trash-strewn streets and pick off enemies\nfrom behind bomb-scarred structures. The cutting-edge physics\nand particle systems will show you some of the most intense\nand realistic explosions, smoke, and environment destruction\never seen in a video game. Dynamic lighting and shadows will\nmorph as real-time day/night cycles and a constantly changing\nweather system require you to adjust to the changing\nconditions on the fly.\n\nAll-New Battlegrounds: For the first time ever, the Ghosts\nwill defend U.S. soil from a cross-border attack, taking the\nfight to all-new locations. The Ghosts will battle enemies in\nmountain terrains, barren deserts and even on their home turf\nin El Paso, Texas. Each environment presents its own benefits\nand challenges and will call for fresh tactical approaches.\n\nVastly Improved Artificial Intelligence (AI): Watch your back\nas rebels send their own team members to flank your position\nor gain vantage points by utilizing vertical gameplay to pick\nyou off from the rooftops above. Improved squad-mate AI will\nnow feed you more of the information you need with descriptive\ncommands like &quot;enemy spotted behind red truck\nahead.&quot;\n\nImproved Cross-Com: The revolutionary new Cross-Com 2.0 will\ngive the player more information than ever before. You will be\nable to see what your friendly forces see in the top left\ndisplay and the click of a button will expand that to\nfull-screen view for a clearer and more precise picture. This\nwill give you a more comprehensive view of the entire\nbattlefield. The new Full Command View will allow\nunprecedented precision in developing and issuing tactical\nplans on the battlefield.\n\nExpanded Support: Command lethal air strikes with jet\nfighters, gain mobile cover for otherwise impassable\nsituations and replenish armaments on the battlefield using an\nunmanned artillery MULE. Players can now heal their team on\nthe battlefield, including squad leader Scott Mitchell, with\nan all-new Medic class of soldier.\n\nInstall Notes:\n\n1. Unpack Release\n2. Mount Image using latest daemon tools or burn it\n3. Install Game, use this serial: HQVX-463P-9F49-PBHJ\n4. Play the game (DVD dont have to be mounted/Inserted\n\nRemember to check our cracktro first!","torrent":{"xt":"urn:btih:9c99ac9e27c9e612845489bab8c305f0b8f15e3c","amp;dn":"Ghost.Recon.Advanced.Warfighter.2-ThePiraten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c99ac9e27c9e612845489bab8c305f0b8f15e3c","infoHashBuffer":{"type":"Buffer","data":[156,153,172,158,39,201,230,18,132,84,137,186,184,195,5,240,184,241,94,60]},"announce":[],"urlList":[]}}