{"title":"Catch Your Dreams.avi","uid":4263543,"size":1086433886,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9e3609f93c4301f517c88c322400635fe831a6c2&amp;dn=Catch+Your+Dreams.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"smurfix","files":1,"time":1214582216,"description":"This comment from IMDB says it all:\n\nIt is now close to 14 years since I saw this film. It has haunted me since that time, as the very finest, most delicately handled erotic film that I have ever seen (not that I have seen that many, but enough to know their range of quality).\n\nIt is hardcore, make no mistake. But it was handled with taste and elegance. A group of people, strangers all, find themselves invited to a weekend at a castle...and the expectable begins to happen. But with such subtlety and attention to the art of the visual, that I knew at once I was watching something special.\n\nIt is odd, but I had not remembered that it was in German. I forgot the title, and the friend I went with could not recall it, so there was no way of seeking to find it again when the memory finally prodded me to do so. And thus the frustration, for the past decade. But in going over some old journaling, just the other day, I came across an entry that told me the date I had seen it...and from there it was simply a matter of digging back through the local press.\n\nNow, of course, I am just as frustrated, because there appears to be no way of getting ahold of a video copy. Either it was not done on video, or perhaps it is only available in Germany, I do not know. However, I write this in case there is anyone out there who happens to know where I might find one, as I would leap on the opportunity. Please DO see it, if you ever get the chance.","torrent":{"xt":"urn:btih:9e3609f93c4301f517c88c322400635fe831a6c2","amp;dn":"Catch+Your+Dreams.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3609f93c4301f517c88c322400635fe831a6c2","infoHashBuffer":{"type":"Buffer","data":[158,54,9,249,60,67,1,245,23,200,140,50,36,0,99,95,232,49,166,194]},"announce":[],"urlList":[]}}