{"title":"ConvertXToDVD Ver.3.0.0.9 (03-29-2008)","uid":4108201,"size":15318292,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9e3a8c71d92251279ee1618b0865a98bfec3f77b&amp;dn=ConvertXToDVD+Ver.3.0.0.9+%2803-29-2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1988keneth","files":2,"time":1206913672,"description":" VSO ConvertXtoDVD 3.0.0.9 FINAL\n\n\n\n\nChanges in ConvertXtoDVD - 3.0.0.9 ( Released the 26nd of March 2008 ):\n=======================================================================\n* Add Neerlandese translation.\n* Full unicode support - Any languages will use the correct characters with any windows locale version (provided you have installed the correct font set on your version of Windows).\n* Memory manager fixes - Should prevent many access violation crashes.\n* Subtitle fixes (SUB/IDX)\n\n- 0001690: [Bug] Japanese translation issues\n- 0001702: [Bug] v3.0.0.4 Access violation at address 0040355B\n- 0001701: [Crash] Access violation + possible application crash when converting a specific vob file\n- 0001706: [Bug] Exception [List index out of bounds (5)] while reading packet #xxxx - Skipped\n\n- Fix Update link\n- Fix assertion failure in rare case\n- 0001716: [Feature Request] Upgrade URL always refer to VSO Shop and not upgrade page\n- 0001703: [Suggestion] Portuguese text to be changed\n- 0001714: [Bug] &quot;Exception Assertion failure (SttrleCodec) while reading packet xxx&quot; error when converting mkv file\n- 0001712: [Bug] Subtitle Style Editor : &quot;Opaque Box&quot; &amp; &quot;Square Outline&quot; functions seems to be inoperant.\n========================================================================\n\n\n\nConvertXtoDVD (formerly DivXtoDVD) is a software to convert and burn your videos to DVD. With ConvertXtoDVD and in a few clicks you can backup your movies to DVD playable on any home DVD player.\nConvertXtoDVD supports most popular format such Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV and stream formats. It converts your files into a compliant DVD Video set of files and burns it on a DVD media.\nThe aspect ratio can be automatically selected or forced to a specific format. The program works for NTSC and PAL video formats and creates chapters automatically. Multiple audio tracks are supported. Version 2 uses a completely rewritten interface with subtitles support and a lot of new settings.\n\n\n\n\n\nFEATURES:\n*********\n* Video formats supported: avi, divx, xvid, mov, mkv, flv, mpeg-1, mpeg2-, mpeg-4, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, \nexisting files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download\n* Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n* Conversion advisor wizard, control of the conversion speed vs. quality\n* Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n* Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n* Custom and or automatic chapter creation with markers and preview window\n* Advanced file merging possibilities\n* Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more...\n* Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA with color and font selection, and supports tags like italic, bold\n* Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Boradcast D1, Half D1, SIF), or\n choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n* Video post processing settings like video resize-pad/cropping and de-interlacing options\n* Multilingual support\n* Optimized for Windows 2000 / XP / Vista","torrent":{"xt":"urn:btih:9e3a8c71d92251279ee1618b0865a98bfec3f77b","amp;dn":"ConvertXToDVD+Ver.3.0.0.9+%2803-29-2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3a8c71d92251279ee1618b0865a98bfec3f77b","infoHashBuffer":{"type":"Buffer","data":[158,58,140,113,217,34,81,39,158,225,97,139,8,101,169,139,254,195,247,123]},"announce":[],"urlList":[]}}