{"title":"History of Shit by Dominique Laporte","uid":4058710,"size":19106957,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e3b143b5d90d33786658fcc344c98ba0e62f8ad&amp;dn=History+of+Shit+by+Dominique+Laporte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rastiazul","files":1,"time":1204493096,"description":"Written in Paris after the heady days of student revolt in May 1968 and before the devastation of the AIDS epidemic, History of Shit is emblematic of a wild and adventurous strain of 1970s&amp;#039; theoretical writing that attempted to marry theory, politics, sexuality, pleasure, experimentation, and humor. Radically redefining dialectical thought and post-Marxist politics, it takes an important--and irreverent--position alongside the works of such postmodern thinkers as Foucault, Deleuze, Guattari, and Lyotard.\n\nLaporte&amp;#039;s eccentric style and ironic sensibility combine in an inquiry that is provocative, humorous, and intellectually exhilarating. Debunking all humanist mythology about the grandeur of civilization, History of Shit suggests instead that the management of human waste is crucial to our identities as modern individuals--including the organization of the city, the rise of the nation-state, the development of capitalism, and the mandate for clean and proper language. Far from rising above the muck, Laporte argues, we are thoroughly mired in it, particularly when we appear our most clean and hygienic.\n\nLaporte&amp;#039;s style of writing is itself an attack on our desire for &quot;clean language.&quot; Littered with lengthy quotations and obscure allusions, and adamantly refusing to follow a linear argument, History of Shit breaks the rules and challenges the conventions of &quot;proper&quot; academic discourse. ","torrent":{"xt":"urn:btih:9e3b143b5d90d33786658fcc344c98ba0e62f8ad","amp;dn":"History+of+Shit+by+Dominique+Laporte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3b143b5d90d33786658fcc344c98ba0e62f8ad","infoHashBuffer":{"type":"Buffer","data":[158,59,20,59,93,144,211,55,134,101,143,204,52,76,152,186,14,98,248,173]},"announce":[],"urlList":[]}}