{"title":"Decoy S01E24_E25 DVDRip DivX","uid":4275913,"size":419754490,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9eb7c77807628c8979e2611f0fe8c462935b31a2&amp;dn=Decoy+S01E24_E25+DVDRip+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":4,"time":1215184948,"description":"Decoy Season 1 (1957-58)\nS01E24 Saturday Was Lost, S01E25 High Swing\n&quot;Decoy&quot; starred Beverly Garland as Patricia &quot;Casey&quot; Jones, an no-nonsense undercover police officer with the New York Police Department, the antithesis of June Cleaver. A U.S. television drama broadcast 1957-58, Decoy was an excellent, ahead-of-its-time show in the style of Dragnet, complete with Garland providing a Jack Webb-style narration. \n\nMs. Garland is ofen required, in her role as undercover policewoman Patricia &quot;Casey&quot; Jones, to play a different role in each of the 39 episodes filmed, the &quot;decoy&quot;. The episodes focused on women being victimized by crime, and Policewoman Casey Jones&amp;#039; efforts to right wrongs. The cast changed each week with Garland the only main continuing character. \n\nDecoy is of historical significance as it was the first American television series to focus on the work of a female police officer. The series also featured early performances by actors such as Larry Hagman, Peter Falk, Al Lewis and Martin Balsam. Each episode was dedicated to the Bureau of Policewomen of the New York Police Department.\n\nAbout a dozen Decoy shows have been released to DVD, with varying video and audio quality. It&amp;#039;s a shame that this show was not shown the care in remastering that other shows of this time period were shown. Quality notwithstanding, the shows are well-written and well-acted with good plot and storylines and are extremely watchable. It&amp;#039;s Beverly Garland as I think she really was, tough, gritty, and caring - before she became Tv&amp;#039;s favorite wife and mother.\n\n\nS01E24 Saturday Was Lost \nFirst aired: 3/24/1958 \nDuring a murder investigation, Casey arrests a drug-addicted young woman who has lost her memory after an all-night pot party. Larry Hagman guest stars.\n\nStarring Beverly Garland as Patricia &quot;Casey&quot; Jones\n\nGuest star: Barbara Lord, Simon Oakland, Larry Hagman \nWriter: Leon Tokatyan \nDirector: Stuart Rosenberg\nDVD&gt;DivX/512x384/947kbps/23.976fps/mp3/48KHz/stereo/109Kbps/26min/200Mb\nDecoy S01E24 Saturday Was Lost DVDRip DivX\n\nS01E25 High Swing \nFirst aired: 3/31/1958 \nCasey goes undercover and acts as bait to befriend a seemingly benign elderly couple who are actually plotting a series of muggings and robberies.\n\nStarring Beverly Garland as Patricia &quot;Casey&quot; Jones\n\nGuest star: Edith Atwater, Albert Dekker \nWriter: Don Ettlinger \nDirector: David Alexander\nDVD&gt;DivX/512x384/941kbps/23.976fps/mp3/48KHz/stereo/110Kbps/26min/200Mb\nDecoy S01E25 High Swing DVDRip DivX","torrent":{"xt":"urn:btih:9eb7c77807628c8979e2611f0fe8c462935b31a2","amp;dn":"Decoy+S01E24_E25+DVDRip+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eb7c77807628c8979e2611f0fe8c462935b31a2","infoHashBuffer":{"type":"Buffer","data":[158,183,199,120,7,98,140,137,121,226,97,31,15,232,196,98,147,91,49,162]},"announce":[],"urlList":[]}}