{"title":"Soundblaster Live! 24-Bit STOCK CD Drivers","uid":4156154,"size":250434406,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a12f92e8a9b4ff16f44367845f170329e607cbe5&amp;dn=Soundblaster+Live%21+24-Bit+STOCK+CD+Drivers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cyrylwolf","files":2,"time":1209160130,"description":"These are the ORIGINAL, STOCK drivers from the disc that comes with the card itself. They&amp;#039;re ripped into a ZIP format and work just fine as if from the CD.\n\nI&amp;#039;m doing this because Creative Labs have been complete douche bags about their drivers for some time now. I actually received this disc by mail after FIGHTING with those people over the phone for several hours. I had bought the card but did NOT receive the driver disc with it.\n\nThe problem with the online drivers is that they DO NOT include software that enables you to adjust bass and treble to your preference...as well as a few other major shortcomings.\n\nThey wanted $5 for the disc. I DEMANDED that they send it to me anyway. They argued the point. I told them to go F themselves.\n\nLater on, a MANAGER calls me... By then I had FINALLY found an ISO image after weeks of searching. I told him to go F himself, too and that I had &quot;already found what I needed from the UNDERGROUND.&quot; He didn&amp;#039;t like that too much and said, &quot;Well I WAS going to send you a disc...but now I&amp;#039;m not.&quot; I said, &quot;Dude... What part of GO F YOURSELF didn&amp;#039;t you get? You had your chance.&quot; and hung up on them.\n\nThey sent it to me anyway. *shrugs* They make NO SENSE.\n\nAnyway... I posted this on a site at one point a couple years back and have recently received requests for it by the email address I left there. Figured that it&amp;#039;d be a good thing to just seed it out.\n\nEnjoy...and FIGHT DOUCHE-BAGGERY by seeding it out to ALL who rightfully deserve it.\n\nThe CUSTOMER.\n\nCyryl","torrent":{"xt":"urn:btih:a12f92e8a9b4ff16f44367845f170329e607cbe5","amp;dn":"Soundblaster+Live%21+24-Bit+STOCK+CD+Drivers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a12f92e8a9b4ff16f44367845f170329e607cbe5","infoHashBuffer":{"type":"Buffer","data":[161,47,146,232,169,180,255,22,244,67,103,132,95,23,3,41,230,7,203,229]},"announce":[],"urlList":[]}}