{"title":"Dragon Ball. La Bella Durmiente En EL Castillo Del Mal","uid":4112815,"size":342132736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a24b756827fb0a43341e12a5940db20ce88efbc9&amp;dn=Dragon+Ball.+La+Bella+Durmiente+En+EL+Castillo+Del+Mal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cazomdb","files":1,"time":1207152798,"description":"Goku conoce a Krilyn en Kame House, el hogar de Kame Sennin, que inmediantamente les propone una misiÃƒÂ³n como condiciÃƒÂ³n de aceptarles como discÃƒÂ­pulos: Traer a una chica atractiva. DespuÃƒÂ©s de algunas confusiones, consiguen traer a Lunch, una chica que al estornudar cambia de personalidad, a decir verdad, muy violenta. A continuaciÃƒÂ³n, Goku y Krilyn tendrÃƒÂ¡n que realizar una segunda misiÃƒÂ³n: rescatar a la bella durmiente, actualmente prisionera en el castillo del mal. Yamcha, Pooal, Lunch, Woolong y Bulma se unen a esta aventura...\nAhora el nuevo enemigo de Son Goku es Lucifer, rey de los demonios (algo parecido a Piccolo Daimaoh). Inmediatamente Bulma parece verse atraÃƒÂ­da por el aspecto del monstruo. El objetivo de Lucifer es destruir el sol con un caÃƒÂ±ÃƒÂ³n de energÃƒÂ­a. Finalmente la bella durmiente es una joya que sirve de foco al caÃƒÂ±ÃƒÂ³n. El verdadero aspecto de Lucifer aparece y Bulma queda decepcionada. Goku se convierte en Ohzaru y comienza a destruir el castillo. Goku y los demÃƒÂ¡s se encuentran con grandes dificultades, hasta que al primero se le ocurre utilizar utilizar un Kame Hame Ha u onda vital al estilo de Kame Sennin. Por fin, Gku y Krilyn han cumplido la misiÃƒÂ³n, mÃƒÂ¡s difÃƒÂ­cil de lo que parecÃƒÂ­a. Ahora podrÃƒÂ¡n entrenar con Kame Sennin.\nEl oscuro castillo de Lucifer tiene un aspecto peculiar: una mano negra alzada al cielo que intenta agarrar algo. Precisamente el castillo se llama Akuma No Te, que viene a significar algo como &quot;la mano del demonio&quot;. Goku y Krilyn habÃƒÂ­an conseguido superar a los secuaces de Lucifer: un demonio rojo y un demonio tuerto y jorobado. Una vez mÃƒÂ¡s los acontecimientos son parecidos a los de los episodios de la serie.","torrent":{"xt":"urn:btih:a24b756827fb0a43341e12a5940db20ce88efbc9","amp;dn":"Dragon+Ball.+La+Bella+Durmiente+En+EL+Castillo+Del+Mal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a24b756827fb0a43341e12a5940db20ce88efbc9","infoHashBuffer":{"type":"Buffer","data":[162,75,117,104,39,251,10,67,52,30,18,165,148,13,178,12,232,142,251,201]},"announce":[],"urlList":[]}}