{"title":"Everclear - Sparkle and Fade - TQMP slavetothesound","uid":4161783,"size":316190281,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2631cbbd576620522de2520ef79415e6875df9a&amp;dn=Everclear+-+Sparkle+and+Fade+-+TQMP+slavetothesound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slavetothesound","files":18,"time":1209409405,"description":"One of my all time favorites - and don&amp;#039;t judge me for liking Everclear, they used to be a great band back in &amp;#039;94.  Listen to this album and you&amp;#039;ll know what I&amp;#039;m talking about! (I had a huge grunge phase for a few years)  I love this album so much that I don&amp;#039;t even know how to explain it. I&amp;#039;m gonna let someone else do the talking..\n\n&quot;Sparkle and Fade is the high point of Everclear&amp;#039;s career and one of the very best (maybe THE best) albums of the &amp;#039;90s. It&amp;#039;s full to bursting with amazing melodies and moving lyrics, and performed with blistering intensity. Not a word or note is misplaced. The only thing missing is the playfulness and experimentation of Everclear&amp;#039;s later, more eclectic records-- this is straight-ahead, meat-and-potatoes rock. But it&amp;#039;s so expertly written and played, so colorful and vital, it&amp;#039;s hard to find any room for improvement. I can&amp;#039;t recommend this album enough.&quot; - review from Amazon.com\n\nTrack List:\n01. Electra Made Me Blind    [0:03:43.50]\n02. Heroin Girl    [0:02:23.05]\n03. You Make Me Feel Like A Whore    [0:02:47.07]\n04. Santa Monica    [0:03:11.35]\n05. Summerland    [0:03:42.45]\n06. Strawberry    [0:02:35.45]\n07. Heartspark Dollarsign    [0:02:52.23]\n08. The Twistinside    [0:04:37.02]\n09. Her Brand New Skin    [0:02:02.05]\n10. Nehalem    [0:01:53.73]\n11. Queen Of The Air    [0:02:59.52]\n12. Pale Green Stars    [0:04:17.10]\n13. Chemical Smile    [0:01:49.65]\n14. My Sexual Life    [0:03:51.63]\n\nA good place to start if you don&amp;#039;t know what to expect is with Santa Monica, their big radio hit from the album, then move on to Pale Green Stars, The Twistinside, Summerland, ... hell, you might as well just play the whole thing all the way through. There are so many good songs it&amp;#039;s hard to go wrong. It just gets better and better as it progresses. \n\nIf there are any other old school Everclear fans out there, I&amp;#039;d be happy to upload World of Noise and White Trash Hell as well. I also have been buying the newer albums, with the exclusion of the newest 2 because I got tired of the disappointment. \n\n- Do you have an appreciation for great sound quality and hate those fuzzy mp3s? Join the The Quality Music Project and put up all your releases in a Lossless format like FLAC. Then tag them with TQMP in the title so that people know your ears can&amp;#039;t be fooled: you don&amp;#039;t want that low resolution mp3 crap and you won&amp;#039;t ever ruin someone else&amp;#039;s musical experience by giving it to them. Only high quality releases will come from you and the TQMP. PM me or post below if you&amp;#039;d like your screen name added to the list of faithful members.\n\nIf you don&amp;#039;t know much about the differences between mp3 and lossless formats, but have an appreciation for sound quality, you may be interested in this article: http://www.stereophile.com/features/308mp3cd/\n\n- slavetothesound","torrent":{"xt":"urn:btih:a2631cbbd576620522de2520ef79415e6875df9a","amp;dn":"Everclear+-+Sparkle+and+Fade+-+TQMP+slavetothesound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2631cbbd576620522de2520ef79415e6875df9a","infoHashBuffer":{"type":"Buffer","data":[162,99,28,187,213,118,98,5,34,222,37,32,239,121,65,94,104,117,223,154]},"announce":[],"urlList":[]}}