{"title":"Fedex Flight 705","uid":4256488,"size":399556224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a5a04b3fa6a825091f547fe93a8c874e8adbd487&amp;dn=Fedex+Flight+705&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rar.rar","files":1,"time":1214264338,"description":"This a true story about three brave men, and one worthless nigger.\n\n\nFlight Engineer Auburn Calloway knew his career was about to end. His employer, Federal Express, had recently uncovered a series of irregularities and outright falsification in both his original employment application and in hundreds of hours of flight records. He was ordered to appear at a disciplinary hearing in the second week of April, 1994. He understood that the likeliest outcome of such a hearing would be his termination, and subsequently the loss of his FAA flight certification.\nHis solution was as simple as it was horrifying. He would provide for his family financially, end his own life, and in the process he would punish Fed Ex in the worst way imaginable.\n\nApril 7, 1994: Fed Ex Flight 705 was scheduled to depart the company?s home hub of Memphis, Tennessee for a routine flight to San Jose, California at a little after 3:00 in the afternoon. As Captain David Sanders, First Officer Jim Tucker and Flight Engineer Andy Peterson boarded the aircraft, they were somewhat startled to see Auburn Calloway already on board, settled into the Flight Engineer?s station and initiating pre-flight procedures. Although it was not unusual for Fed Ex employees to hitch rides on regular flights - a practice termed ?jumpseating? - it was a pronounced breach of protocol for such deadheaders to interfere with flight operations. They said nothing, though, and Calloway wordlessly gave his seat to Andy Peterson. He strapped himself into a jumpseat aft of the cockpit. At his feet was a guitar case, the only baggage he had brought on board.\n\nLess than thirty minutes into the flight, the bloodbath began.\n\nThe weapons that Calloway chose for his attack seem bizarre and indicative of a deranged mind. When one understands the cold calculation of his plan, though, the terrible logic becomes clear. The guitar case contained two claw hammers, two sledge mallets, a knife and a speargun. Calloway could have easily smuggled a gun on board Flight 705, but he wanted to inflict no injuries that were inconsistent with an air crash?for that was at the heart of his plan. Having already purchased thousands of dollars worth of death and dismemberment insurance, he planned to bludgeon to death the crew of Flight 705, then crash the DC-10 into the terminal of the Memphis Superhub. His own death would secure his family?s future, while the devastating crash would likely destroy Fed Ex. But first he had to kill the crew; it was their will to survive that foiled Auburn Calloway?s plan.\n\nNone of the three men heard Calloway enter the cockpit. Sanders suddenly became aware of a struggle, and heard the awful sound of hammer blows raining down upon his crewmates. He turned to see both men slumped in their chairs, injured terribly, and a blood-soaked Auburn Calloway moving toward him. I can not tell you the rest of what hapins, that would be no fun. You will have to download the video to find out what happins! (It does have a happy ending)","torrent":{"xt":"urn:btih:a5a04b3fa6a825091f547fe93a8c874e8adbd487","amp;dn":"Fedex+Flight+705","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a04b3fa6a825091f547fe93a8c874e8adbd487","infoHashBuffer":{"type":"Buffer","data":[165,160,75,63,166,168,37,9,31,84,127,233,58,140,135,78,138,219,212,135]},"announce":[],"urlList":[]}}