{"title":"No.Country.For.Old.Men.2007.DvDRip.Eng-FxM.avi","uid":4159733,"size":733906944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6b7848a54e598fa699c12b7d01f9a103f404b18&amp;dn=No.Country.For.Old.Men.2007.DvDRip.Eng-FxM.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GG12","files":1,"time":1209319036,"description":"The film opens with a shot of desolate, wide-open country in West Texas in June 1980. In a voice over, the local sheriff, Ed Tom Bell (Tommy Lee Jones), tells of the changing times: in the old days, some sheriffs never wore guns, as did his late father, who was the sheriff before him; in the modern day and age, however, Bell once sent an unrepentant teenage boy to the electric chair who had killed a girl simply because he wanted to kill someone, had been &quot;fixin&amp;#039;&quot; to do it for some time, and would do it again if he had the chance.\n\nA man named Anton Chigurh (Javier Bardem) is being arrested by a deputy (Zach Hopkins). Back at the otherwise empty police station, the deputy describes on the phone Chigurh&amp;#039;s strange possession - a compressed-air gun used to put down cattle - which the deputy believes is an oxygen tank. The deputy is on the phone with Sheriff Bell, but has his back to Chigurh, who sneaks up behind him and garrotes him with his handcuffs. Chigurh falls back on the floor with the deputy, a strange grin washing across his face, as his wriggling victim finally expires. After cleaning himself up in the station bathroom, Chigurh pulls over a man in a Ford with the deputy&amp;#039;s police car. Politely asking the man to step out the car, Chigurh puts his hand on the man&amp;#039;s head like a faith-healer and shoots the cattle gun through the man&amp;#039;s skull. Chigurh then drives off in the man&amp;#039;s car.\n\nElsewhere, Llewelyn Moss (Josh Brolin) is hunting pronghorns. Setting the sights of his hunting rifle on one, he fires, scattering the animals. Walking to where the herd stood, he notices a trail of blood. Realizing the pronghorn left in a different direction from the blood trail, he spies a wounded pit bull hobbling away. Retracing the dog&amp;#039;s trail, Moss eventually comes upon several trucks parked in the middle of the wilderness. Coming closer, he finds several bodies shot to death, most appearing to be Mexican, and even a dead pit bull. Under a tarp in a pickup, Moss sees what appears to be a great deal of heroin. Opening one of the trucks, he finds a man who is still alive, but badly injured. The panting stranger begs Moss for &quot;agua&quot;, but Moss says that he has no water. Moss asks the man where the &quot;last man standing,&quot; the winner, is, but doesn&amp;#039;t get an answer. He takes the man&amp;#039;s submachine gun and follows another blood trail, this time it leads to a clump of trees where he sees someone is sitting. Eventually, he makes his way to the trees to see that the man under the trees is dead. The dead man has a silver Colt .45 pistol and a satchel, which Moss finds to hold $2 million dollars.\n","torrent":{"xt":"urn:btih:a6b7848a54e598fa699c12b7d01f9a103f404b18","amp;dn":"No.Country.For.Old.Men.2007.DvDRip.Eng-FxM.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6b7848a54e598fa699c12b7d01f9a103f404b18","infoHashBuffer":{"type":"Buffer","data":[166,183,132,138,84,229,152,250,105,156,18,183,208,31,154,16,63,64,75,24]},"announce":[],"urlList":[]}}