{"title":"Steely Dan - Gaucho","uid":3334299,"size":36760821,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a718dc15404d37c0c8db4fe991dd2f21c905f712&amp;dn=Steely+Dan+-+Gaucho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MDP","files":7,"time":1116705391,"description":"Gaucho\n\nWith the phenomenal success of &quot;Aja,&quot; Donald and Walter are under considerably less pressure to release new material quickly. ABC releases a Greatest Hits package in November 1978 which includes one unreleased track &quot;Here At The Western World.&quot; This collection also goes platinum and reaches #30 on the charts. Tiring of the L.A. scene, Becker and Fagen move back to New York to start recording their new album.\n\nWhile recording &quot;Gaucho&quot;, Becker and Fagen had to endure various misfortunes which delay the release date: Becker is hit by a car, one of their favorite new tracks &quot;The Second Arrangement&quot; is accidentally erased by an assistant recording engineer, and there is a dispute over which record company has the rights to their forthcoming album.\n\nBecker and Fagen had already signed a new contract with Warner Brothers, but ABC (now owned by MCA) claims that they are still owed one more album. MCA wins the contract dispute and then decides to increase the album's list price to $9.98, one dollar more than all the other albums. Donald and Walter continue to hold back the album while they unsuccessfully fight the price increase. Finally, &quot;Gaucho&quot; is released in November, 1980.\n\n&quot;Gaucho&quot; follows in the footsteps of &quot;Aja&quot; stylistically and continues to use even more jazz session men. The album hits #9 on the charts and also goes platinum. &quot;Hey Nineteen&quot; hits #10 and &quot;Time Out Of Mind&quot; hits #22 on the singles charts.\n","torrent":{"xt":"urn:btih:a718dc15404d37c0c8db4fe991dd2f21c905f712","amp;dn":"Steely+Dan+-+Gaucho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a718dc15404d37c0c8db4fe991dd2f21c905f712","infoHashBuffer":{"type":"Buffer","data":[167,24,220,21,64,77,55,192,200,219,79,233,145,221,47,33,201,5,247,18]},"announce":[],"urlList":[]}}