{"title":"Guns N' Roses - Paradise City (Concept Version)","uid":4273654,"size":247580676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a76c2d4915fc019c494692ea709dbab64fc83f36&amp;dn=Guns+N%5C%27+Roses+-+Paradise+City+%28Concept+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1215070076,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Paradise City&quot; is a song written by the hard rock band Guns N&amp;#039; Roses. It is included on the 1987 album Appetite for Destruction and was released as a single in 1988. It is also the only song on the album to use a synthesizer. The song peaked at number five on the Billboard Hot 100, the third single of the band&amp;#039;s to go Top 10.\n\nHalf of the music video was filmed at Giants Stadium in New Jersey while Guns N&amp;#039; Roses were on tour with Aerosmith, midway through the video, they are seen boarding the Concorde jet so they could make an appearance in England, and return as quickly as possible back to the USA to continue touring with one of their major influences. The concert in England is the Monsters of Rock event at Donington Park. The reason for this is because of some deaths that took place while Guns N&amp;#039; Roses were performing. As a result, they thought the footage taken at the concert would be good music video footage and a proper show of respect to those who died at the concert. Duff can also be seen wearing an Aerosmith t-shirt in the video.\n\nIn the music video, about 4 minutes into the video, Axl Rose is seen sporting a World War II Nazi officer cap and a stage pass which appears to bear the SS eagle. Axl opens the pass, shows off the SS eagle, closes it again and gives a meaningful look to the camera.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a76c2d4915fc019c494692ea709dbab64fc83f36","amp;dn":"Guns+N%5C%27+Roses+-+Paradise+City+%28Concept+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76c2d4915fc019c494692ea709dbab64fc83f36","infoHashBuffer":{"type":"Buffer","data":[167,108,45,73,21,252,1,156,73,70,146,234,112,157,186,182,79,200,63,54]},"announce":[],"urlList":[]}}