{"title":"FairMount","uid":4032267,"size":600047,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a7708550039cfc75c8fc0e4edf45c0209c49c2e1&amp;dn=FairMount&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"the1silverwolf","files":1,"time":1203235495,"description":"This is FairMount v 1.0.2 (a tool to help you copy encrypted DVD&amp;#039;s) without the shareware crap.\n\nWith this you can mount Encrypted DVD&amp;#039;s as if they were not encrypted.\n\nIn other words, you can use Toast or Popcorn to shrink and burn the disk without ripping it first.\n\nThis is the full (only) version of the program.\n\n-------------------------------------------------\n\nThe comments from the website follows:\n(http://www.metakine.com/products/fairmount/)\n\nFairMount 1.0.2\n\nFairMount is a tool that allows decryption of DVD content on the fly for a convenient access. FairMount does not perform the actual decryption, it simply forwards the data to VLC Media Player which is used for decryption - thus, VLC Media Player must be installed for FairMount to work.\n\nFairMount can be downloaded with DVDRemaster.\nFairmount Screenshot\n\nUsing FairMount is easy. Just launch the application, and it will do it&amp;#039;s magic automatically, replacing the original DVD on the desktop by a decrypted disc image of this DVD. To eject the original disc, simply eject the decrypted image. Upon quitting, the orignal disc will reappear.\nFairmount in action\n\nOnce FairMount is launched, making a backup of a DVD is as simple as drag and dropping its VIDEO_TS folder somewhere on your hard disk. The resulting copy will be decrypted as it is copied and will be ready for archival.\n\nFairMount also enables application such as DVDRemaster to work directly on an encrypted DVD to make a copy that can be burnt on another DVD or that can be played on a video iPod.\nRequirements\n\nFairmount requires Mac OS X version 10.4 or higher.\nKnown Issues\n\nFairMount adds a bit of latency to data access (the bandwidth - the speed at which data is accessed - is however nearly unaffected). Some applications such as Apple DVD Player that expects low latency access might suffer from hiccups. When experiencing these hiccups, you can simply quit FairMount and use the DVD normally.\nTechnical information\n\nFairMount source code is available and released under GPL license. For the developers taking a look at the source, here is some useful information:\n\nBasic Sequence of Operations\n\n    * A disc is inserted by the user.\n    * FairMount receives a notification about the new disc.\n    * If the disk is a video dvd, the original disk is unmounted.\n    * It then starts a local web server (which is only accessible by the local host), to serve the decrypted image.\n    * The decrypted image is then mounted using Apple&amp;#039;s tool (hdiutil).\n    * When the user ejects the image, the web server is stopped, and the original disc is ejected.\n\nBy this process, FairMount allows you to use an encrypted dvd as if it was decrypted. ","torrent":{"xt":"urn:btih:a7708550039cfc75c8fc0e4edf45c0209c49c2e1","amp;dn":"FairMount","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7708550039cfc75c8fc0e4edf45c0209c49c2e1","infoHashBuffer":{"type":"Buffer","data":[167,112,133,80,3,156,252,117,200,252,14,78,223,69,192,32,156,73,194,225]},"announce":[],"urlList":[]}}