{"title":"Sun City Girls - Tourch of the Mystics [MP3 - 128]","uid":4058278,"size":66386289,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7c961afd0a140b72bc1ec446ae794cfcc08cf5b&amp;dn=Sun+City+Girls+-+Tourch+of+the+Mystics+%5BMP3+-+128%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kneskade","files":13,"time":1204478510,"description":"An eclectic mix of every musical style one can think of -- demented surf, Indian and Asian improvisation, free-form noise, fractured folk, you name it -- with doses of kabuki theater, shadow puppetry, and maverick guerilla stagecraft thrown in, the avant-everything Sun City Girls are a fiercely independent and experimental trio whose only credo seems to be to continually stretch boundaries while remaining amazingly inclusive, a process that has led to a dizzying array of vinyl, cassette, and CD releases in the past 20 years.\t Forming in Phoenix, AZ, Sun City Girls first performed under that name in 1981, and after morphing into the short-lived Paris 1942 (with former Velvet Underground drummer Maureen Tucker), the group emerged as a trio with brothers Alan Bishop and Richard Bishop and percussionist Charles Gocher in 1982. SCG released their first album, Sun City Girls, in 1984 on Placebo Records, going on to release nearly 30 official albums since then, along with countless limited-edition vinyl, cassette, and CD-R projects, making the group&amp;#039;s discography almost impossible to completely document. Throughout its history SCG has remained a challenging, unpredictable, and eclectic musical unit, operating outside the commercially driven aspirations of the mainstream recording industry, and the group has become somewhat of a beacon to independent musicians and artists everywhere. Relocating to Seattle in the early &amp;#039;90s, Sun City Girls established their own label, Abduction Records, as well as an archival imprint, Sublime Frequencies.","torrent":{"xt":"urn:btih:a7c961afd0a140b72bc1ec446ae794cfcc08cf5b","amp;dn":"Sun+City+Girls+-+Tourch+of+the+Mystics+%5BMP3+-+128%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7c961afd0a140b72bc1ec446ae794cfcc08cf5b","infoHashBuffer":{"type":"Buffer","data":[167,201,97,175,208,161,64,183,43,193,236,68,106,231,148,207,204,8,207,91]},"announce":[],"urlList":[]}}