{"title":"Rom The Spaceknight (Repost)","uid":4155211,"size":722693826,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a7ebabce30cd1841ff62420127671d077ca92ef3&amp;dn=Rom+The+Spaceknight+%28Repost%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rishab","files":80,"time":1209123235,"description":"Rom Spaceknight was a comic book series published by Marvel Comics and was set in Marvel&amp;#039;s shared universe (known as the Marvel Universe). The comic book character Rom first appeared in Rom #1 (1979) and was created by Bill Mantlo and Al Milgrom. \n\nThe Toy \n&quot;Rom The Space Knight&quot; was a toy created by Bing McCoy and sold to Parker Brothers, which was the inspiration for the comic book series. The toy was originally called COBOL (after the programming language), which was later changed to &quot;Rom&quot; (after ROM, a.k.a. Read-Only Memory) by Parker Brothers&amp;#039; executives. \n\nTo build interest in the toy, Parker Brothers licensed the character to Marvel Comics which created a comic book featuring Rom. The comic expanded on the simple premise that Rom was a cyborg and gave him an origin, personality, set of supporting characters, villains, and one other vital ingredient - interaction with the rest of the Marvel Universe. \n\nThe Comic \nUnfortunately, the toy failed and only sold 200 - 300 thousand units in the US, with creator McCoy blaming the failure on poor packaging and marketing. Parker Brothers subsequently abandoned the line and returned to manufacturing board games. \n\nThe comic book outlasted the toy which it was created to support. The comic was written by Bill Mantlo and initially illustrated by artist Sal Buscema. The series lasted for 75 issues over a seven year period, with Rom&amp;#039;s regular encounters with mainstream heroes and villains firmly establishing him as part of Marvel continuity. \n\nRom was one of the my personal favorite character of Marvel comics. It was really bad, that they close down the series due to licensing problems. There is one image of the toy in one the issues. The comic book character is far good then that crappy toy. Marvel should have bought the rights to it and continue with the series. \n\nMany kids here may not be knowing about Rom. But I tell you its really great. Entire theme is pretty cool, except for the end issues which were hurriedly done to close out the series. Rom is a character, if continued could have easily been made in to a movie with a science fiction theme. \n\nThis is a repost of the Rom torrent. The earlier torrent had some error and was downloaded only through DHT. This one I have created using Bitlord.\n\nPlease seed it as long as possible. I will seed it only till I upload it fully. After that its all up to seeders.","torrent":{"xt":"urn:btih:a7ebabce30cd1841ff62420127671d077ca92ef3","amp;dn":"Rom+The+Spaceknight+%28Repost%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ebabce30cd1841ff62420127671d077ca92ef3","infoHashBuffer":{"type":"Buffer","data":[167,235,171,206,48,205,24,65,255,98,66,1,39,103,29,7,124,169,46,243]},"announce":[],"urlList":[]}}