{"title":"Thy Will Be Done What Was and Is to Come","uid":4042488,"size":66630688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a833dbbd3c52999db0219baa9d723a6b232e59df&amp;dn=Thy+Will+Be+Done+What+Was+and+Is+to+Come&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"amnestyplease","files":16,"time":1203749408,"description":"000000-00000000000-000000000000-0000000000-0000000000000\n\nTHY WILL BE DONE just finished recording with Zeuss (Shadows Fall, Hatebreed) whom Produced, Engineered and Mixed their upcoming debut &quot;Was And Is To Come&quot; with Jamey Jasta of Hatebreed as Executive Producer. The album displays a strong and distinct mix of their influences. Tentative release date remains sometime in Fall 2007.\n\nTheir name, THY WILL BE DONE, is a perfect fit for this unique group from Providence, RI. It compliments both their explosive musical drive and the message they bring as a reaction to the &quot;second-rate&quot; commercial bands that use their stature and gimmicks to sell their senseless negativity and hopeless, nihilistic world views.\n\nTHY WILL BE DONE were recently featured in a 2-page spread in Hails&amp;Horns Magazine (March/April 07), their debut has already started to receive stellar reviews from Metal Edge Magazine, AMP Magazine, and RUIN Magazine, the band was also featured on the Stillborn Fest with Hatebreed, Sick Of It All, Suffocation, Full Blown Chaos, and Subzero among others, and the band was a Main Stage performer at the 9th Annual New England Metal &amp; Hardcore Fest this past April.\n\nOver the past few years, many have witnessed them play with the likes of Shadow&amp;#039;s Fall, Killswitch Engage, Converge and Diecast, to Skinless, Beyond The Embrace, Crowbar and many others, and have gained the interest of many fans from the different branches of extreme music.\n\nTheir songs and arrangements echo the voice of the oppressed and those whom sought much needed change in these turbulant times. THY WILL BE DONE coalesce the unorthodox balance of some of the most bludgeoning music with thought provoking lyrics that are both spiritually and emotionally uplifting. The result is a refreshing stance in opposition to the dissonance of the human condition. Not often enough is there a band who&amp;#039;s drive is to inspire millions instead of making millions.\n\nFor THY WILL BE DONE, their convictions are set but their sincerity and open-minded attitudes are conveyed like never before. The perpetual abominations of the &quot;rat-race&quot;, and those associated with it, will continue to fuel their desire...No water can put out this fire.\n000000-00000000000-000000000000-0000000000-0000000000000\n\nReally awesome band.  Really awesome lyrics.  Amazing fucking guitar.\nI&amp;#039;ll seed this for a week or so...  Tell your friends about them. Spread\nthe Word!\n","torrent":{"xt":"urn:btih:a833dbbd3c52999db0219baa9d723a6b232e59df","amp;dn":"Thy+Will+Be+Done+What+Was+and+Is+to+Come","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a833dbbd3c52999db0219baa9d723a6b232e59df","infoHashBuffer":{"type":"Buffer","data":[168,51,219,189,60,82,153,157,176,33,155,170,157,114,58,107,35,46,89,223]},"announce":[],"urlList":[]}}