{"title":"Sexy Desktops 2.1 - Sexy Wallpaper &amp; Screensaver","uid":4151398,"size":5132005,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a89cb6cd38b59116822d4dc24c83a034f7c9d3c4&amp;dn=Sexy+Desktops+2.1+-+Sexy+Wallpaper+%26+Screensaver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ironxavi","files":1,"time":1208967442,"description":"The ultimate sexy wallpaper/screensaver utility that will make your computer desktop burn!\n\nTons of thousands of full-sized (all 1024x768 or higher) downloadable sexy desktop pictures from the biggest and best quality sexy women wallpaper collection ever made available for any wallpaper manager and/or screensaver program. Sexy Desktops is a wallpaper manager/changer and a full-featured screensaver, and doesn&amp;#039;t it only allow you to download tons of fresh new amazing pics from the Sexy Desktops website (www.sexydesktops.com), but does it for you automatically every day!\n\nOnly the best quality desktop-size pictures, featuring the hottest babes, celebrities and supermodels in the world! Easy and convenient interface to navigate among your wallpaper collection and manage the images. Customizable screensaver with smooth DirectX image transitions. To get quickly started, this package comes with 30 of the images available on the website already present in your local collection, that will start showing you some of the best shots ever taken from the world&amp;#039;s most desired celebrities and supermodels!\n\nThrow away all these old low quality screensavers, with pixelated small-sized images and flat and simple image transition effects and download Sexy Desktops now to start enjoying the most exciting and sexy add-on available, that will surely convert your daily work with your computer into a real pleasure!\n","torrent":{"xt":"urn:btih:a89cb6cd38b59116822d4dc24c83a034f7c9d3c4","amp;dn":"Sexy+Desktops+2.1+-+Sexy+Wallpaper+%26+Screensaver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89cb6cd38b59116822d4dc24c83a034f7c9d3c4","infoHashBuffer":{"type":"Buffer","data":[168,156,182,205,56,181,145,22,130,45,77,194,76,131,160,52,247,201,211,196]},"announce":[],"urlList":[]}}