{"title":"Bob Dylan Lossless Studio Discography","uid":4022007,"size":8903743443,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9128089330c858f8dd0ff5cbbcd62b0e1a97510&amp;dn=Bob+Dylan+Lossless+Studio+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kintelen","files":382,"time":1202707622,"description":"Hi there!) As long as i`ve been looking through different trackers (both private and public) for the last half of the year i found out to my great surprise that there were compilations of Dylan, different kind of anthologies, collections of Dylan, certain albums of Dylan (in shitty mp3 for the most part) but there were no complete works by Dylan in lossless!!! At all! Well, being a realist as i am, sure, I didn`t expect to fall across something like &quot;full collection of everything by Dylan that ever found it`s way to record&quot; (i don`t think that anyone in the world has a couple of millions of terabytes of free hard disk space to store such immense amount of information). No, i mean i didn`t even find a decent collection of all his official studio albums on trackers. &quot;What kind of shit happens there?!&quot; i thought to myself, &quot;it`s not Britney Spears, it`s not Ricky Martin, it`s classics, it`s DYLAN, it`s &quot;MUST have&quot;!!!&quot; And i decided to improve the situation. Sadly did i look at my Dylan CD`s (for you know, ripping CD`s with EAC, searching for decent covers for each album in the web /i ain`t got scanner/, making tracklists, checking CD`s both with Tau Analyzer and Audiochecker and taking screens isn`t fast process), took a deep breath and started...\n_________________________________________\n\nThat was prehistory. And now what concerns the release itself. It includes 31 albums by Bob Dylan. /Yes, yes, i know that he`s got 32. But to my greatest pity it lacks &quot;Shot Of Love&quot;(1981) - the only album that i ain`t got on CD/\nEach album is presented in the form of CDImage - APE + CUE + LOG. Whether you like it or not but I just CANNOT stand CD`s splitted in tracks. If you need single tracks - there are enough of them in the web. If you need Dylan - get the albums. That is all.\nAnd the last: i must apologize but since i use a russified copy of EAC all logs is in russian.\n\nP.S. Forgot to add something... what was that?... Oh! Enjoy ;)))\n\nkintelen","torrent":{"xt":"urn:btih:a9128089330c858f8dd0ff5cbbcd62b0e1a97510","amp;dn":"Bob+Dylan+Lossless+Studio+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9128089330c858f8dd0ff5cbbcd62b0e1a97510","infoHashBuffer":{"type":"Buffer","data":[169,18,128,137,51,12,133,143,141,208,255,92,187,205,98,176,225,169,117,16]},"announce":[],"urlList":[]}}