{"title":"Midnighter (on-going) [BigBonedNinja][h33t]","uid":4025157,"size":174301204,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:aa2bf5f8d0126543a53bb0ef4166be13ac633567&amp;dn=Midnighter+%28on-going%29+%5BBigBonedNinja%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seedYAbastid","files":17,"time":1202880154,"description":"[IMG]http://img166.imageshack.us/img166/135/h33tpresentsss3.gif[/IMG]\n\nKilling Machine 1-6\n[IMG]http://img125.imageshack.us/img125/7025/8205400x600vn8.jpg[/IMG]\n\n[quote]Written by Garth Ennis; Art by Chris Sprouse, Peter Snejbjerg, Glenn Fabry and Karl Story; Cover by Sprouse and Story\n\nCollecting issues #1-6 of the new series starring the popular member of The Authority! Midnighter must go back in time to kill one of history&amp;#039;s greatest mass murderers ? and he can&amp;#039;t refuse due to the bomb in his chest! It&amp;#039;s a race against ? and through ? time to complete the mission! [/quote]\n\nMidnighter (Series)\n[IMG]http://img145.imageshack.us/img145/5139/midnighterur7.jpg[/IMG]\n\n[quote]On November 1 2006, an ongoing Midnighter series began, written by Garth Ennis and illustrated by Chris Sprouse.\n\nAfter returning from a mission in war-torn Afghanistan, Midnighter was attacked and kidnapped by unknown agents while passing through the Carrier&amp;#039;s teleportation portal. He awoke in a facility in Hamburg, Germany, where a man named Paulus told him that he was disrupting his ability to guess his opponents&amp;#039; moves, and that he had removed his secondary heart and replaced it with a remote-detonated bomb. Paulus gave Midnighter the choice of either working for him, or dying, showing him a photograph of the person he wanted Midnighter to kill: Adolf Hitler. Time-travelling back to the First World War trenches, Midnighter encountered Hitler as a young corporal in the German army, but was apprehended by &amp;#039;time police&amp;#039; officers from the 95th century before carrying out his mission. In his struggle to escape, he crashed the officers&amp;#039; time machine at the year 1945 -- shortly before Hitler&amp;#039;s expected suicide. Eventually he allied himself with them and worked his way back to his own time, where he threatened to erase Paulus from history by killing his kidnapped younger self; it is unclear whether or not he would have executed the child, but ultimately he did not have to. Midnighter then returned to the Carrier, but was apparently just as listless as before, immediately setting himself on another mission in Iraq.\n\nMidnighter #7, by Brian K. Vaughan and Darick Robertson, explores the way Midnighter&amp;#039;s brain processes combat by running the story backwards.\n\nMidnighter #8, by Christos Gage and John Paul Leon, deals with Midnighter&amp;#039;s attempts to connect better with humans after the graphic and public disposal of supervillain &quot;Suicide King&quot;. Trying to help a girl find her pet cat finds him stumble upon a mad scientist who has been kidnapping pets for his cybernetic experiments. After defeating him, he employs the scientist to experiment on the murderers and dictators he acquires before deciding to adopt the one pet the Doctor could not repair or rehome: a cyborg dog.\n\nIn Midnighter #10, Midnighter managed to retrieve all the information about his former life prior to his reprogramming by Henry Bendix, and discovered that his real name is Lucas Trent, that he was born on July 14, 1967 (making him 40 years old in 2007), and that he hailed from Harmony, Indiana. In issue #11, Midnighter, while looking for pieces of his missing history, happened upon the small town of his &quot;birth&quot;, Harmony, Indiana, which he discovered to be the haven of a paramilitary organization named Anthem, with designs of taking over the U.S in order to provide the country with the conscience that they felt it had lost. Midnighter battled Anthem, and their super-powered operatives, most notably Dawn (a reference to the phrase &quot;dawn&amp;#039;s early light&quot; in the &quot;Star-Spangled Banner&quot;), and Rosie (patterned after Rosie the Riveter). The issue was written by Keith Giffen and drawn by ChrisCross.[/quote]\n\n[IMG]http://img175.imageshack.us/img175/7988/midnighter16001mu3jm0.jpg[/IMG]\n\nThanks to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding. :D","torrent":{"xt":"urn:btih:aa2bf5f8d0126543a53bb0ef4166be13ac633567","amp;dn":"Midnighter+%28on-going%29+%5BBigBonedNinja%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa2bf5f8d0126543a53bb0ef4166be13ac633567","infoHashBuffer":{"type":"Buffer","data":[170,43,245,248,208,18,101,67,165,59,176,239,65,102,190,19,172,99,53,103]},"announce":[],"urlList":[]}}