{"title":"AVG AntiVirus Pro 8.0","uid":4051736,"size":52629543,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aa477b88d36e190e537c7f971bab2d3cc3eb2dd9&amp;dn=AVG+AntiVirus+Pro+8.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Geedunk","files":2,"time":1204193616,"description":"    * New Anti-Exploit Technology? AVG 8.0?s patent-pending safe surfing and safe searching technology is designed to protect users of Internet Explorer and Firefox browsers against drive-by downloads from poisoned web pages and to flag dangerous search results in Google, Yahoo and MSN search engines.\n    * New Web Shield? Complementing the safe surfing and searching technology, the new Web Shield module scans files during download or exchange over ICQ or MSN instant messaging to ensure they are safe and free of malicious content.\n    * New High Performance Scanning Engine? AVG has reengineered the scanning engine from the ground up to tackle viruses and spyware in a single pass, delivering improved performance and speed through support for multi-core computers, reduced system resource requirements, and streamlined maintenance.\n    * New User Interface? Enables more intuitive and efficient operation for novice and advanced users alike.\n    * New Anti-Rootkit? This new component removes and protects against rootkits, an especially pernicious form of malware that can give cybercriminals high-level control over infected computers.\n    * New Firewall? The all-new AVG firewall is designed to protect computers against unauthorized access from internal and external networks as well as direct hacker attacks.\n    * Improved Anti-Virus? Provides improved detection of hidden viruses, faster scanning, and more intuitive scheduling of scans.\n    * Improved Resident Shield? Provides enhanced on-access scanning with the ability to scan multiple file-open requests simultaneously.\n    * Anti-Spam? Brings faster performance to minimize email processing time and ensure prompt delivery of messages.","torrent":{"xt":"urn:btih:aa477b88d36e190e537c7f971bab2d3cc3eb2dd9","amp;dn":"AVG+AntiVirus+Pro+8.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa477b88d36e190e537c7f971bab2d3cc3eb2dd9","infoHashBuffer":{"type":"Buffer","data":[170,71,123,136,211,110,25,14,83,124,127,151,27,171,45,60,195,235,45,217]},"announce":[],"urlList":[]}}