{"title":"Historias de la Cripta Temporada 2 DVD 1/3","uid":4022584,"size":4681003008,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aa54872abcba5bb17073453b5f709fce8c88cb36&amp;dn=Historias+de+la+Cripta+Temporada+2+DVD+1%2F3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hq2007","files":27,"time":1202743438,"description":"Historias de la cripta comenzÃƒÂ³ a emitirse en televisiÃƒÂ³n en 1989 con la intenciÃƒÂ³n de revindicar el gÃƒÂ©nero de terror con el mismo romanticismo que lo hiciera La dimensiÃƒÂ³n desconocida de Rod Serling en la dÃƒÂ©cada de los 50 y 60.\n\nLas historias eran adaptaciones de la colecciÃƒÂ³n de comics de terror que la editorial EC Comics habÃƒÂ­a publicado en la dÃƒÂ©cada de los 50, en los que los personajes se veÃƒÂ­an enfrentados con destinos de lo mÃƒÂ¡s tÃƒÂ©tricos y donde cada historia era presentada por &quot;El GuardiÃƒÂ¡n de la Cripta&quot;, gran anfitriÃƒÂ³n del horror que comentaba detalles escabrosos de cada cuento y que incluso se burlaba con ironÃƒÂ­a de los lectores.\n\nEsta forma de introducir el comic se conservÃƒÂ³ en la serie de televisiÃƒÂ³n en la que cada episodio estÃƒÂ¡ precedido por un muÃƒÂ±eco cadavÃƒÂ©rico, que resulta una excelente versiÃƒÂ³n del que aparecÃƒÂ­a en las historias originales de papel. \n\nMantener estos prÃƒÂ³logos suponÃƒÂ­a conservar el espÃƒÂ­ritu original de la obra y todo un homenaje a la figura clÃƒÂ¡sica del cuenta cuentos. Rod Serling ya la habÃƒÂ­a utilizado en su DimensiÃƒÂ³n desconocida, convirtiÃƒÂ©ndose el mismo en el narrador de los episodios, y muchas series la utilizaron en el futuro: Alfred Hitchcock presenta, Las pesadillas de Freddy, El cuenta cuentos, Historias para no dormir, etc. \n\nHistorias de la cripta permaneciÃƒÂ³ siete temporadas en antena y por ella pasaron multitud de rostros conocidos (Michael J. Fox, Whoopi Goldberg, Tim Roth, Christopher Reeve, Isabella Rossellini, etc.), ademÃƒÂ¡s de contar con directores de prestigio, de la talla de Richard Donner o Robert Zemeckis, que se encargaron de llevar a la pantalla las distintas historietas.\n\nHistorias de la cripta se ha convertido en una serie de culto que mantiene ese encanto de los cuentos de terror relatados alrededor de una hoguera, ahora convertida en una caja catÃƒÂ³dica y colocada en un salÃƒÂ³n.","torrent":{"xt":"urn:btih:aa54872abcba5bb17073453b5f709fce8c88cb36","amp;dn":"Historias+de+la+Cripta+Temporada+2+DVD+1%2F3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa54872abcba5bb17073453b5f709fce8c88cb36","infoHashBuffer":{"type":"Buffer","data":[170,84,135,42,188,186,91,177,112,115,69,59,95,112,159,206,140,136,203,54]},"announce":[],"urlList":[]}}