{"title":"Doctor Who - The Commentaries - S04E02 - The Fires of Pompeii (F","uid":4135041,"size":46298593,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:ab5b0cb57606823b0adaf442fb976f15aed69996&amp;dn=Doctor+Who+-+The+Commentaries+-+S04E02+-+The+Fires+of+Pompeii+%28F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheDoctor08","files":1,"time":1208219989,"description":"Doctor Who - The Commentaries - S04E02 - The Fires of Pompeii (Full 48 Minutes)\n\nOkay, HERE we go.   This is the FULL 48 minute commentary for THE FIRES OF POMPEII.\n\nApparently the BBC is a little confused on how to release these.   The commentary for Episode 1 (Season 4 - Partners in Crime) was the full 48 minutes by download on the BBC site, but they removed it after about only 4 hours online.   The APPLE Podcast was a 30 minute version that does not match the episode.  \n\nWith this episode, they PODCAST and offered for download a 30 minute version....   \n\nWell, excuse me, but my calculator works for time as well, and there is no way to match a 30 minute commentary track with a 45 minute program...   So the 30 minute versions are worthless and should not even exist.   \n\nThanks to whomever recorded this from the red button special offers on BBC.   \n\nMy thinking is that BBC is only releasing (by PODCast and online download)m unusable 30 minute versions that obviously can not be enjoyed when watching a 45 minute program (as the missing 15 minutes!!!!   DUH!)   \n\nSo if BBC wants to be this stupid, can everyone with access to the red button offers or BBC7 Radio, please record the full proper 45 minute tracks?   Thanks.  I was lucky enough to download the one for episode 1 in the rare 4 hours it was online, and as you can see someone recorded this from BTV.   If BBC wants to make these hard to get, let&amp;#039;s get em!    :)\n\n","torrent":{"xt":"urn:btih:ab5b0cb57606823b0adaf442fb976f15aed69996","amp;dn":"Doctor+Who+-+The+Commentaries+-+S04E02+-+The+Fires+of+Pompeii+%28F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab5b0cb57606823b0adaf442fb976f15aed69996","infoHashBuffer":{"type":"Buffer","data":[171,91,12,181,118,6,130,59,10,218,244,66,251,151,111,21,174,214,153,150]},"announce":[],"urlList":[]}}