{"title":"The History of Hip Hop -=- Colection of films and docu's","uid":4025158,"size":10120683797,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:abe525d21198aa24e0f3029739fa90c606fccb9a&amp;dn=The+History+of+Hip+Hop+-%3D-+Colection+of+films+and+docu%5C%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ascentuk","files":30,"time":1202880186,"description":"This is a colection of films and docu&amp;#039;s that i have colected over the years\n\nIts a great place to start if you want to understand the roots of Hip Hop \n\nI hope you all enjoy it :)\n\n\nBeat.Street.1984\n\nUpbeat, lets-put-on-a-show, musical about the wonders of rap music tells the story of Kenny (Guy Davis), a young hip-hop artist living in the rough slums of the Bronx with his younger brother Lee (Robert Taylor) and their mother Cora. Kenny dreams of making it big as a disk jockey and playing in the most swank of Manhattan nightclubs, The Roxy. Into their lives comes Tracy (Rae Dawn Chong), a composer and assistant choreographer from New York College who inspires him to try to continue his dream while romance begins to grow between them despite coming from different neighborhoods and worlds. Meanwhile, Lee is part of a break-dancing gang set on dominating the scene of their street. The rest of their friends include Ramon (Jon Chardiet), a graffiti artist determined to spread his painting to every subway car in the city while dealing with his girlfriend Carmen (Sandra Santaigo). Chollie is a fellow rapper who becomes Kenny&amp;#039;s manager after he lands him a gig at a Bronx club as the DJ. Many rap groups, break dancers, and pop singers whom include Us Girls, The Treacherous Three, The System, Rock Steady Crew, Soul Sonic Force &amp; Shango, The Magnificent Force, New York City Breakers, Furious Five, Tina B., Afrika Bambaataa, Johnny B. Bad, etc, make cameo appearances\n\nBreakin.aka.Breakdance.the.movie.1984\n\n&amp;#039;Breakin&amp;#039;: A struggling young jazz dancer (Lucinda Dickey) meets up with two break-dancers. Together they become the sensation of the street crowds. Features ICE-T in his film debut as a club MC. \n\n\nWild.Style.1982\n\n\nLegendary New York graffiti artist Lee Quinones plays the part of Zoro, the city&amp;#039;s hottest and most elusive graffiti writer. The actual story of the movie concerns the tension between Zoro&amp;#039;s passion for his art and his personal life, particularly his strained relationship with fellow artist Rose. But this isn&amp;#039;t why one watches Wild Style--this movie is *the* classic hip-hop flick, full of great subway shots, breakdancing, freestyle MCing and rare footage of one of the godfathers of hip-hop, Grandmaster Flash, pulling off an awesome scratch-mix set on a pair of ancient turntables. A must-see for anyone interested in hip-hop music and culture.\n\n\nScratch The Movie DVD Rip 2 Disc\n\nDirector Doug Pray (HYPE) pays tribute to the innovative art of DJing in the electrifying documentary SCRATCH. Featuring legendary figures in the DJ scene, Pray?s film is at once a deeply insightful historical document and a highly entertaining glimpse into the world of underground hip-hop. Modern luminaries such as DJ Shadow, Mix Master Mike (Beastie Boys), DJ Qbert, Rob Swift, and DJ Swamp are interviewed alongside living legends like Afrika Bambaataa, Jazzy Jay, and Grand Mixer DXT, in order to paint a broad, comprehensive picture of how DJing has evolved over the years. Seamlessly cutting between interviews and actual footage filmed at several high-profile DJing contests including Skratchcon 2000 and the DMC U.S. Finals, Pray?s film is a mustsee for both seasoned fans and the uninitiated, a celebration of one of the late-20th Century?s most thrilling, original musical movements. \n\nSCRATCH, documents the ongoing history of today?s turntablists? and many of the DJs who gave birth to the hip-hop movement. This exhilarating film also features such charismatic figures as Cut Chemist &amp; Numark, DJ Crush, DJ Premier and heavy-hitter DJ Z-Trip among a host of others in full-blown exhibition of their skills. \n\nThis energetic and insightful film, that traces the birth of turntablism, continues spinning across America as a definitive piece of music history that has been entertaining audiences all over the world since its premiere at the 2001 Sundance Festival. \n\nThis 2-DVD set includes: \n\nDisc 1\nDigitally Restored 16x9 Widescreen Film Transfer\n5.1 Surround Sound\nAudio Commentary with Director Doug Pray &amp; Producer Brad Blondheim\nAdditional Scenes and Extended Interviews\nOriginal Theatrical Trailer\nArtist and Crew Bio?s \n\nDisc 2\nHow To Rock A Party: a lesson in the art of DJing with DJ Z-Trip\nSneak Attack: a selection from Wave Twisters\nA multiangle do-it-yourself lesson with DJ Qbert\nSelections from the acclaimed series Battle Sounds\nA unique sound-to-score notation demo \n\n\nA few added extra&amp;#039;s\n\nDJ Q-Bert - Australia &amp; Asia Tour\n\nDj Q-Bert  - Wave Twisters\n\nDj Q-Bert - Live Session - QFO Tour In Paris\n\nDj Shadow - In Tune and On Time\n\nDj Shadow &amp; Cut Chemist - Product Placement\n\nScratch - All The Way Live\n","torrent":{"xt":"urn:btih:abe525d21198aa24e0f3029739fa90c606fccb9a","amp;dn":"The+History+of+Hip+Hop+-%3D-+Colection+of+films+and+docu%5C%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe525d21198aa24e0f3029739fa90c606fccb9a","infoHashBuffer":{"type":"Buffer","data":[171,229,37,210,17,152,170,36,224,243,2,151,57,250,144,198,6,252,203,154]},"announce":[],"urlList":[]}}