{"title":"Ratiomaster-1.7.5 - Hack your own torrent ratio, easy and flexib","uid":4151631,"size":496038,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac321dee6b63a30d747ca72634a333d46b5cc183&amp;dn=Ratiomaster-1.7.5+-+Hack+your+own+torrent+ratio%2C+easy+and+flexib&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"micker1234","files":1,"time":1208975021,"description":"RatioMaster 1.7.5 was released on February 16th, 2007.\n\n* Intro *\n\nRatioMaster is an application designed for spoofing uploads on BitTorrent trackers. It connects to a tracker and behaves like a normal BitTorrent client, but without actually uploading to / downloading from other peers in the swarm. It reports to the tracker that it\\&amp;#039;s uploading (or downloading or both, it\\&amp;#039;s your choice) at a certain rate, thus making it useful for artificially increasing your ratio on certain sites that track a user\\&amp;#039;s overall ratio (total uploaded/total downloaded).\n\nRatioMaster has hardcoded emulations for the most commonly used BitTorrent clients, but it is also able to parse external files for emulation settings, thus making it easily extensible for your favorite client and easy to update when new versions of said clients are released. The client files (extension \\&quot;.client\\&quot;) are actually renamed XML files and the syntax should be pretty straight-forward. The emulation layer includes support for parameter order in GETs, reproduction of HTTP headers, generation of application-specific peer_ids and keys and more. RatioMaster can also parse the tracker reannounce time from the tracker\\&amp;#039;s HTTP response, and combined with the fact that you can specify down and up rates makes it pretty hard to detect by any anti-cheat scripts, if not downright impossible. Other features, like a TCP listener (so as to appear connectable on the tracker\\&amp;#039;s peerlist) and a leecher counter (so as to stop any uploads when a torrent has 0 leechers) also contribute to RatioMaster\\&amp;#039;s spoofing abilities.\n\nMemory Reader\nStarting from version 1.6 RatioMaster have integrated Memory Reader tool that useful when you want to read exact Peer ID, Key, Port and Number of peers announce parameters from your regular torrent client (like uTorrent,Azureus,Bitcomet or others). Look for the \\&amp;#039;Memory Reader\\&amp;#039; button in Advanced Tab.\n\nCommand Line support\nStarting from version 1.7 RatioMaster supports command line options.This feature is useful if you want to run several torrents from batch file or shortcuts with predefined setting:\nPossible keys :\n\n/minimize - RM will start minimized to tray.\n\n/start - RM will load latest torrent (or the one provided in command line) and automatically start it\n\n/downloadRate, /uploadRate - RM will set download and upload speed \n\n/percent - RM will set finished percent (0% = start leeching, 100% = seeding)\n\n/hide  - RM will start in hidden mode, minimized and no tray icon .Use at your own risk, as far as i know the only way to stop it, is to kill process in Task Manager.\n\n\nExamples (torrentpath.torrent is a full path to the torrent file) :\n\nratiomaster.exe torrentpath.torrent\n\n - will load the torrent\n\nratiomaster.exe torrentpath.torrent /start\n\n - will load the torrent from torrentpath and run it with default options\n\nratiomaster.exe torrentpath.torrent /start /uploadRate:250 /downloadRate:200 /percent:100\n\n - will load the torrent and start it with 250 upload,200 download,and finished 100%\n\nratiomaster.exe /uploadRate:250\n\n - will set provided value,all others will be default from settings\n\nratiomaster.exe /minimized /start\n\n - will start ratiomaster in minimized mode with last loaded torrent.\n\nSaving individual torrent settings\nStarting from version 1.7 RatioMaster saves individual settings for each torrent and uses those settings next time that you are loading same torrent.  Setting files are stored in \\&amp;#039;/Torrents Config\\&amp;#039; subfolder of the ratiomaster.exe folder.\n\n* Contact *\n\nWebsite: http://www.moofdev.org/\n\nForums: http://www.moofdev.org/forums/\n\nEmail: ratiomaster_06 AT yahoo DOT com or dev AT moofdev DOT org\n\n* Requirements *\n\nRatioMaster requires that you\\&amp;#039;ve got the .NET Framework version 2 installed. You can get it from Microsoft.\n\n* How to use *\n1. Get a .torrent file associated with the tracker you want to spoof.\n2. Load or Drag/Drop that file into RatioMaster.\n3. Change the settings in the Options group to your liking: upload speed, download speed (set to 0 to spoof upload only), finished (how much of the file do you want to appear that you have - set to 100% if you want to appear as a seeder)\n4. Choose \\&amp;#039;Client Simulation\\&amp;#039; in Advanced Tab to be the same type as your regular torrent client.\n5. Optionally, look through the Advanced and Network tabs and see if you need anything  changed there, like using a specific port or announcing through a proxy server. Most users won\\&amp;#039;t need to change anything here.\n6. Press the Start button and watch the bytes start rolling.\n7. After a while, when you decide you\\&amp;#039;ve spoofed enough, press the Stop button to announce to the tracker that you\\&amp;#039;re ending your session.\n\nGuide to writing your own client files\n\n* Things to remember *\n\nFirst of all, don\\&amp;#039;t use very high upload speeds. Some trackers check sessions for very big upload rates. Using a 6 MB/s upload rate when your IP belongs to an ISP who only has a 512 kbps plan is plain stupid. Check the moofdev forums on more info on maximum safe speeds reached by other users on different trackers.\n\nNever spoof uploads on a tracker with few peers. If there are only 2 leechers and they\\&amp;#039;re downloading at a maximum of 300 kB/s, and you\\&amp;#039;re spoofing an upload of 2 MB/s, it will look suspicious.\n\nKeep the software up-to-date. Sometimes bugs are found that may get you banned on sites. RatioMaster includes an automatic version checker and will notify you when a new version is released. Update!\n\nIf you\\&amp;#039;re going to take part in discussions on the moofdev forums, or other forums that deal with this sort of software, don\\&amp;#039;t use the same username you use on trackers. We\\&amp;#039;ve had instances of tracker admins visiting the forums to see whether any of our users were members on their trackers and... well, you can assume what happened next.\n\nRead the forums. Sometimes users will report that a certain tracker simply cannot be fooled. It\\&amp;#039;s better to stay informed than be banned on your favourite tracker.\n\nLast, but not least, only spoof when you NEED to. By cheating on a torrent, you\\&amp;#039;re disrupting the swarm and going against the spirit of p2p. Unless you really need to increase your ratio and there\\&amp;#039;s no better way (short of paying money - pay2leech trackers are a lot worse than cheating peers), don\\&amp;#039;t cheat.\n\n* Copyrights and acknowledgements *\n\nRatioMaster (the software) was written by RatioMaster_06 (the person), with contributions by JTS-UD (yes it\\&amp;#039;s an acronym!). We\\&amp;#039;d like to also thank:\n\n    * 12345B for moderating our forums, finding important bugs in beta builds, fixing my syntax errors and typos and for being a nice guy :)\n    * our anonymous betatester, who intensively tested every beta, came up with ideas and also made some nice icons for us\n    * Azurine, Samson and Thunder for beta testing and bug reports\n    * All other people we forgot, who helped with their ideas\n\n----------------------------------------------------------------------------------\n\nFeel free to scan / check website, this is NOT a fake...\n","torrent":{"xt":"urn:btih:ac321dee6b63a30d747ca72634a333d46b5cc183","amp;dn":"Ratiomaster-1.7.5+-+Hack+your+own+torrent+ratio%2C+easy+and+flexib","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac321dee6b63a30d747ca72634a333d46b5cc183","infoHashBuffer":{"type":"Buffer","data":[172,50,29,238,107,99,163,13,116,124,167,38,52,163,51,212,107,92,193,131]},"announce":[],"urlList":[]}}