{"title":"Roxio Copy &amp; Convert v3.4.0_AGAiN_hermina","uid":4045849,"size":206688496,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ac50d526629f7a7ccb9e209bdf5152af3507e81d&amp;dn=Roxio+Copy+%26+Convert+v3.4.0_AGAiN_hermina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hermina14","files":45,"time":1203903832,"description":"\nRoxio Launches Roxio Copy &amp; Convert 3\nEmpowers Consumers to Choose Exactly How They Want to Enjoy Personal Entertainment\n\nSanta Clara, California (March 15, 2007) - RoxioÂ®, a division of Sonic SolutionsÂ®Â­ (NASDAQ: SNIC), the leader in digital media software, today launched Roxio Copy &amp; Convert? 3, the ultimate solution for quickly and easily managing, transferring, and enjoying digital entertainment on PCs, set-top players, or mobile devices. In addition to making high-quality copies of personal CDs, DVDs, and Blu-ray Discs, this next generation edition of Roxio&amp;#039;s Easy DVD Copy? program now enables consumers to move their favorite movies and music to portable devices such as iPodsÂ®, PSPs?, and mobile phones. Roxio Copy &amp; Convert 3 also adds greater file support, batch conversion capabilities, automatic music cataloging, and the ability to backup iPod music to any PC. Roxio Copy &amp; Convert 3 is available today direct from Roxio at www.roxio.com and will be widely available later this month throughout North American retail stores for a suggested price of $49.99.\n\n&quot;Consumers are demanding far greater flexibility in their personal digital entertainment experiences, but until now had to contend with file and device compatibility issues and complicated applications that get in the way of enjoying digital media,&quot; Michael Demeyer, vice president product management, Roxio division of Sonic Solutions. &quot;Roxio Copy &amp; Convert 3 streamlines the digital entertainment experience by letting consumers see and hear their favorite video and music, where and when they want it. It is an essential application for anyone managing personal media today.&quot;\nProduct Highlights:\nConvert Anything\n\nRoxio Copy &amp; Convert easily translates the most popular audio and video formats today for playback on a portable device, PC or DVD player. Video format support includes DivX, WMV, H.264 (AVC), 3GP (mobile phone video), MPEG, TiVo, MPEG-2, MPEG-4, DVR-MS (Windows Media Center TV) and DVD-Video. Supported audio formats include MP3, M4A (iTunes), WAV, WMA, AAC, OGG Vorbis, FLAC, Dolby Audio (AC3), audio CD, and audio on DVD-Video.\nPortable Device Support\n\nRoxio Copy &amp; Convert makes it easy to fill your iPod, PSP, or Windows Media device with your favorite audio and video so you can take it with you, regardless of the source format. Supported audio and video files can also be converted to AAC, MP3, and 3GP for transfer to mobile phones. In addition, Copy &amp; Convert now supports the backup of non-protected iPod audio to a PC even if the device is not paired with the hard disk.\nPowerful Audio Ripping\n\nThere is no better way to build a music library than with Roxio Copy &amp; Convert 3. Users with multiple disc drives can now rip audio CDs in parallel, making it extremely efficient to convert an entire music collection. Audio CDs are identified with both Gracenote CDDB and MusicID (audio fingerprinting), so even tracks on custom discs can be recognized and tagged appropriately. Tracks that have already been copied are automatically detected to prevent duplicates. Music on non-encrypted DVD-Videos can be ripped to hard disk and converted to any supported audio format or sent to a portable device. Ripped audio tracks are automatically named and added to an organized folder structure based on user-defined criteria such as title, artist, or album.\nAdvanced Disc Copying\n\nRoxio Copy &amp; Convert 3 includes comprehensive features for copying non-encrypted CDs, DVDs, and Blu-ray discs. Advanced copy capabilities allow users to efficiently fit full-length DVD titles onto 4.7GB single-layer discs. Users can also move DVD-Video content to and from folders on their PC. In the case of audio CDs, Copy &amp; Convert enables users to add CD text to audio CD copies even if the text is not included with the original.\n\nRoxio Copy &amp; Convert also features a Disc Image Loader for mounting disc image files as if they were physical discs in a drive, an ideal solution for users who want to work with several discs simultaneously without having to switch discs. For customers on the go who are using laptops, playback from Disc Image Loader conserves battery life since it uses less power than playback of a physical disc.\nOrganize and Search\n\nRoxio Copy &amp; Convert showcases Disc Gallery, a convenient tool for cataloging and indexing all of the files and folders on your CD and DVD discs. Once cataloged, the search function in Disc Gallery enables users to quickly find a particular file or folder without having to physically insert discs.\n\nRoxio Copy &amp; Convert also offers Roxio Label Creator, enabling the easy creation of disc labels and inserts. Label Creator automatically populates labels with information from the project, such as disc name, tracks, album, or artist. Users can also create labels with custom images, text, and shapes, and use the included alignment tools to customize their designs.\nAbout Roxio\n\nRoxio, a division of Sonic Solutions, develops and markets the best-selling digital media software in the world. Roxio offers award-winning software products for CD/DVD burning, photo editing and video editing and has an installed base of over 350 million users. Roxio distributes its products globally through strategic partnerships with major hardware manufacturers, through leading retailers, through Internet partnerships and through direct sales at www.roxio.com.\n\nRoxio&amp;#039;s parent company, Sonic Solutions (NASDAQ: SNIC; http://www.sonic.com) is the leader in digital media software and provides a broad range of software tools and applications for creative professionals, business and home users and technology partners. Sonic&amp;#039;s products range from professional DVD authoring systems and interactive content delivery technologies that are used to produce the majority of Hollywood movies released on DVD, to the award-winning Roxio- and Sonic-branded CD and DVD creation, playback and backup applications that have become the premier solutions for consumers and business users worldwide. Sonic&amp;#039;s AuthorScriptÂ® is the de facto standard for CD and DVD burning and formatting and has been licensed by major software and hardware manufacturers, including Adobe, Broadcom, Microsoft, Scientific-Atlanta, Sony, and many others. Sonic Solutions is headquartered in Marin County, California.\nForward Looking Statements\n\nThis press release may contain forward-looking statements that are based upon current expectations, including the launch, distribution, and market acceptance of Roxio Copy &amp; Convert 3. Actual results could differ materially from those projected in the forward looking statements as a result of various risks and uncertainties, including those discussed in the Company&amp;#039;s annual and quarterly reports on file with the Securities and Exchange Commission. This press release should be read in conjunction with the Company&amp;#039;s most recent annual report on Form 10-K, Form 10-Q and other reports on file with the Securities and Exchange Commission, which contain a more detailed discussion of the Company&amp;#039;s business including risks and uncertainties that may affect future results. The Company does not undertake to update any forward-looking statements.\n","torrent":{"xt":"urn:btih:ac50d526629f7a7ccb9e209bdf5152af3507e81d","amp;dn":"Roxio+Copy+%26+Convert+v3.4.0_AGAiN_hermina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac50d526629f7a7ccb9e209bdf5152af3507e81d","infoHashBuffer":{"type":"Buffer","data":[172,80,213,38,98,159,122,124,203,158,32,155,223,81,82,175,53,7,232,29]},"announce":[],"urlList":[]}}