{"title":"DISQUIET (2006) DVDrip Xvid","uid":4047360,"size":543133184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac69b99ba592e939be1a427a0bb84e975df6fed2&amp;dn=DISQUIET+%282006%29+DVDrip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Phantasm5","files":1,"time":1203986408,"description":"I saw this very low-budget American indie at a festival in San Francisco last summer and I thought, given its limitations, it was quite good. But I\\'m a bit of a science fiction nerd (and Doctor Who fan!), so it struck more than a few chords with me.\n\nThis is a DVD rip from a home-made DVD+R that the festival was using for press screeners.\n \n\nFrom IMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1034025/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1034025/&lt;/a&gt;\n\nDarren Prager is an aspiring writer who finds himself completely unable to comprehend the intricacies of human behavior. Obsessed with finding the key to understanding the nature of character, he turns a co-worker\\'s family into the unwitting subjects of his new project. Darren\\'s own humanity is soon put to the test when he goes beyond observational research to the realm of gross violation.\n\nDirector:\nMatthew Doyle\n\nWriter:\nMatthew Doyle (writer)\n\nRelease Date:\n5 December 2006 (USA)\n\nDavid Tuchman\t ... \tDarren Prager\nMatthew Doyle\t... \tMason Wright\nBrandon Slagle\t... \tBrandon Dalisay\nNiki Notarile\t... \tAlicia Lafferty\nMike Keller\t... \tTim\nDavid Hilfstein\t... \tHolden\nPeter Stoehr\t... \tSales Manager\nMelanie DiPiero\t... \tMargaret\nFilip Petrovic\t... \tLifeguard\nGiselle Torres\t... \tBeautiful Woman\n\nA remarkable self-made film that is as witty and intelligent as it is unnervingly creepy, Disquiet is an all-too-uncommon example of what was once the vision at the dawn of the digital video age -- that any potential filmmaker with talent and desire could grab a camera, corral a few friends, and create a masterpiece.\n\nWriting, directing, acting, editing, supplying the props, the locations, and so on, Disquiet's creator, Matthew Doyle, demonstrates an exceptional ability to sustain the intellectual values of a larger-budgeted feature through his deft imagination and jovial will power. For once, and it rarely happens with credit card-funded movies, the viewer is challenged by the emotional constructs of the narrative, rather than by the compromises of the production environment.\n\nAs for the 67 minute feature, you might wish Doyle had had the resources to embellish the beginning, but the plot is astutely shuffled to engage the viewer throughout, as it gradually reveals the inner desires of several different characters, culminating in the film's stunning finale, a tour de force piece of acting and directing that will disturb your sense of security forever after.\n\n- Douglas Pratt\n\nDouglas Pratt is a regular columnist for Rolling Stone, author of Doug Pratt\\'s DVD-Video Guide (2000), and the recently published Doug Pratt\\'s DVD. SBCZA","torrent":{"xt":"urn:btih:ac69b99ba592e939be1a427a0bb84e975df6fed2","amp;dn":"DISQUIET+%282006%29+DVDrip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac69b99ba592e939be1a427a0bb84e975df6fed2","infoHashBuffer":{"type":"Buffer","data":[172,105,185,155,165,146,233,57,190,26,66,122,11,184,78,151,93,246,254,210]},"announce":[],"urlList":[]}}