{"title":"Batman Begins avi","uid":4025998,"size":739252224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad45f1096d675182ec3ae43573f9a2be6726114f&amp;dn=Batman+Begins+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"raw-head-rex","files":1,"time":1202927036,"description":"Batman Begins is a 2005 superhero film based on the fictional DC Comics character Batman. Christopher Nolan directed the film, which stars Christian Bale as Batman, as well as Michael Caine, Gary Oldman, Liam Neeson, Katie Holmes, Cillian Murphy, Morgan Freeman and Tom Wilkinson. The film reboots the Batman film series, telling the origin story of the character with inspirations from classic comic book storylines such as Batman: The Man Who Falls, Batman: Year One and Batman: The Long Halloween.\n\nAfter a series of unsuccessful projects to resurrect Batman on screen following the critical and commercial failure of Batman and Robin (1997), Nolan and Goyer began work on this film in 2003. Aiming for a dark and realistic tone, the filmmakers created a new interpretation of the Batmobile, here a military vehicle called the &quot;Tumbler&quot;. The film was primarily shot in England and Chicago, and relied on traditional stunts and miniatures; computer-generated imagery was used minimally. Batman Begins was critically and commercially successful, and a sequel titled The Dark Knight was commissioned for a 2008 release with both Nolan and Bale returning.","torrent":{"xt":"urn:btih:ad45f1096d675182ec3ae43573f9a2be6726114f","amp;dn":"Batman+Begins+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad45f1096d675182ec3ae43573f9a2be6726114f","infoHashBuffer":{"type":"Buffer","data":[173,69,241,9,109,103,81,130,236,58,228,53,115,249,162,190,103,38,17,79]},"announce":[],"urlList":[]}}