{"title":"Star Wars: Battlefront II","uid":4262451,"size":3927556384,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ae23dac40ab0c9e285fc8c86f459935f90833100&amp;dn=Star+Wars%3A+Battlefront+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"triperal","files":3,"time":1214532354,"description":"The other major addition to Star Wars Battlefront II is the ability to play hero characters like Jedi. When you earn a certain number of points in a match, the hero character is unlocked, and you&amp;#039;re given the option to respawn as the hero. Only one hero character per side, per match can exist at any given time, so don&amp;#039;t expect to see 12 Yodas running around against 12 Darth Vaders, unless you&amp;#039;re playing a modded game type. In general, only the top player on each side is given the option to use the hero character, who&amp;#039;s generally very powerful and hard to kill. While this feature sounds fantastic on paper, in practice, the hero characters actually aren&amp;#039;t all that interesting to use. Most of them are lightsaber-armed Jedi, so combat involves running up to people and mashing on the attack button quickly to swing your saber. Most Jedi can throw their sabers, and some have Force powers. Certain maps will also let you play special characters like Boba Fett or Han Solo, who have high-powered guns and other weapons. If members of the other team work together, concentrated fire can actually bring you down pretty quickly. But if you can take advantage of the confusion, a hero character can swing the tide of a battle. In general though, playing a hero doesn&amp;#039;t feel quite as epic as you might expect it would.\n\nThere have been some other interesting tweaks to the formula. One new class has been added to each of the four factions in the game. The Republic get clone commanders, for example, armed with powerful chainguns and an aura that imparts defensive bonuses on nearby allies. The Rebels get a Bothan spy, who can cloak with a Predator-like shimmer and then unleash a powerful short-range flamethrower. These classes, as well as the special classes from the first game, like droideka and dark troopers, are not available to you when you first begin a match or mission. Like with the hero characters, you need to earn a few points before these are unlocked, and only a few can be on the map at once. You still have access to regular classes like normal rifle troopers and snipers. You&amp;#039;ll also see familiar vehicles on the appropriate maps, like snow speeders on Hoth, AT-STs on Endor, and more. But in general, it feels as though Battlefront II is more of an infantry-focused game than its predecessor, which can be a good or bad thing depending on your perspective. A good number of the maps don&amp;#039;t have vehicles at all.\n\nThe game ships with a couple of single-player modes. One of these, Rise of the Republic, is a linear campaign of assault-style missions that follows the story of the 501st, a unit of clone troopers who eventually evolved into elite stormtroopers under Anakin Skywalker, aka Darth Vader. You&amp;#039;ll embark on a series of missions that will take you from the Clone Wars era to the Rebellion era, and you&amp;#039;ll undergo the transformation from playing for the &quot;good guys&quot; to the &quot;bad guys.&quot; The other single-player mode is called galactic conquest, which combines a turn-based mode, where you move fleets around a static planetary map, with basic conquest missions. Whenever you move your fleet over an enemy-controlled planet, you engage in a land battle. When two fleets meet, a space battle ensues. The planets you own give you production and combat bonuses, and the goal is to eventually take over all the planets in the galaxy. Four different galactic conquest galaxies are available, but they all play out pretty similarly. These modes are fun to play for a little while, but eventually they grow tiresome, partly because the missions end up being pretty redundant, and partly because the artificial intelligence isn&amp;#039;t very good when you&amp;#039;re playing a single-player mission. You&amp;#039;ll see troops get stuck in walls and hallways, and it can sometimes be frustrating to try to mount concentrated attacks because your AI teammates don&amp;#039;t always have the same idea that you do when it comes to deciding on an attack vector.\n\n\nBattlefront II sticks to a familiar formula?\n\nWhile the tweaks to the single-player mode represent an improvement from the bare-bones modes included in the original Battlefront, the multiplayer aspects of the game are still the primary attraction. The game supports 24, 32, or 64 players on the PlayStation 2, Xbox, and PC platforms, respectively. While it might seem as though having twice as many players on the PC would be a huge advantage, the maps in Battlefront II don&amp;#039;t necessarily lend themselves to having 64-player battles because of their size. In general, 24 or 32 players is enough to adequately populate the game&amp;#039;s 24 multiplayer maps. As far as performance goes, multiplayer matches were pretty smooth across all platforms during our testing, even with server populations reaching close to the maximum on the console versions and more than 40 on the PC version. It bears mentioning, though, that if you try to operate your own server on your console using the Xbox or PS2 versions of the game, you&amp;#039;re limited to hosting only four players. The rest of the match is filled out using AI bots. All of the servers that support the maximum number of players on the console version seem to be dedicated servers operated by the publisher. This shouldn&amp;#039;t make too much of a difference though, as there are plenty of people online at any given time, which makes finding a match easy, no matter what platform you play on.\n\nThose who are used to online team-based shooters on the PC, however, may not be quite as impressed with Star Wars Battlefront II. While mouse control is definitely very usable and a step up from dual-analog controllers, the overall feel of the game still seems somewhat looser and less refined than other popular shooters on the PC. In other words, Battlefront II feels like a game developed for consoles and ported over to the PC. If you&amp;#039;re a big enough Star Wars fan or not as finicky about how your shooters feel, then this shouldn&amp;#039;t be a problem...otherwise, you&amp;#039;ve been warned. It&amp;#039;s also worth mentioning that the standard perspective on the PC is first person, while the default view for the console versions is third person. You can toggle back and forth on any version with the touch of a button, though.\n\n\n?as well as familiar places.\n\nWhat the PC does have going for it are more detailed graphics, smoother frame rates, and sharper textures than the console versions do. The Xbox is noticeably more detailed than the PS2 version of the game, but even those playing on Sony&amp;#039;s console shouldn&amp;#039;t have much to grouse about. The game looks great on all platforms, as do all the character models, whether you&amp;#039;re playing as a lowly clone trooper or a mighty Jedi like Mace Windu. The console versions can get stuttery at times when there&amp;#039;s a lot of action onscreen, but it never feels as though you&amp;#039;re losing adequate control of your character. Battlefront II, as you&amp;#039;d expect from a Star Wars game, also sounds fantastic. There really can&amp;#039;t be all that much to designing sound in a Star Wars game like this--the effects of blaster rifles, lightsabers whirling through the air, or TIE fighters screaming through space are all lifted right from the movies and used in the game. Ditto for John Williams&amp;#039; timeless score, which plays not only in menus, but also during gameplay to help give you inspiration.\n\nIf Battlefront II seems like it&amp;#039;s treading over familiar ground, that&amp;#039;s because it is. If you already played the first game, you won&amp;#039;t be surprised to see the same maps in this one. You&amp;#039;ll keep fighting on the icy wastes of Hoth, the steamy swamps of Dagobah, and among the buildings in the dusty town of Mos Eisley. Some incremental feature improvements, like the new single-player campaign modes, playable Jedi, and space battles have also been tossed in for good measure. While there haven&amp;#039;t been any radical changes made since the first game, Battlefront II remains a worthwhile choice for Star Wars fans looking for a good team-based shooter. ","torrent":{"xt":"urn:btih:ae23dac40ab0c9e285fc8c86f459935f90833100","amp;dn":"Star+Wars%3A+Battlefront+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae23dac40ab0c9e285fc8c86f459935f90833100","infoHashBuffer":{"type":"Buffer","data":[174,35,218,196,10,176,201,226,133,252,140,134,244,89,147,95,144,131,49,0]},"announce":[],"urlList":[]}}