{"title":"Coolie.1983 [wacky_p]","uid":4107839,"size":1798846522,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af0ae11bdde88867236b156a7a4242d551f72843&amp;dn=Coolie.1983+%5Bwacky_p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wacky_p","files":8,"time":1206903143,"description":"Coolie.1983 [wacky_p]\n---------------------\n\nZafar Khan, a Wealthy businessman with underworld contacts, has fallen head over heels in love with Salma and wants to marry her at any cost. However, Salma and her father do not consent, as a result Zafar kills him, is arrested, and imprisoned for 10 years. When he is discharged, he finds out that Salma has married Aslam Khan. He goes to persuade Salma to divorce Aslam and marry him, but Salma refuses, Zafar than sabotages the dam near Salma&amp;#039;s village, bringing devastation and flooding to the region, grievously injuring Aslam and Salma, as well as separating them from their only child, Iqbal. Zafar rescues Salma, and takes her to a hospital. There he is told that she is unable to remember anything, but in her own interests the doctor advises that she be re-united with her child. Zafar than arranges for a child to be adopted from an orphanage from Kanpur, names him Sunny, and leaves him in Salma&amp;#039;s care. Years later, Zafar will be confronted by none other than Sunny himself who wants to expose his wrong-doing on one hand, and Iqbal on the other hand as the leader of porters (coolies) who want their money that they had invested in a financial company owned by Zafar. The wily Zafar must use all the resources available to him to ensure that both Sunny and Iqbal are killed, as well as ensure that he wins an election that will make him virtually above the law. \n\nTank Joo Kom Agayn !!!","torrent":{"xt":"urn:btih:af0ae11bdde88867236b156a7a4242d551f72843","amp;dn":"Coolie.1983+%5Bwacky_p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af0ae11bdde88867236b156a7a4242d551f72843","infoHashBuffer":{"type":"Buffer","data":[175,10,225,27,221,232,136,103,35,107,21,106,122,66,66,213,81,247,40,67]},"announce":[],"urlList":[]}}