{"title":"BBC Imagine-The Secret of Life.avi","uid":4043632,"size":432161296,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b00b10e9b31da89036c8e0e11090bd757042f24b&amp;dn=BBC+Imagine-The+Secret+of+Life.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"psygnal","files":1,"time":1203795989,"description":"BBC Imagine - The Secret of Life\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/imagine/article/the_secret_of_life.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/imagine/article/the_secret_of_life.shtml&lt;/a&gt;\n\nStarting with a look at the latest self-help phenomenon, The Secret, Alan Yentob sets out to learn from the big hitters in the self-help world: Susan Jeffers, author of the bestselling Feel The Fear And Do It Anyway; David Burns, whose book Feeling Good, The New Mood Therapy has sold over 5 million copies, and Anthony Robbins, who fills stadiums with his can-do performances. ?Most people see things worse than they are so they never have to try,? says Robbins. ?People say to me ?I?m sceptical? and I say no you?re not, you?re gutless.?\n\nRobbins has been the personal coach to a raft of celebrities including Mikhail Gorbachev and Bill Clinton. At last year?s Wimbledon, Serena Williams, another Robbins follower, was spotted with her own self-help notes: ?My good thoughts are powerful. Any negative thoughts are weak. You are number one. You are the best. You will win Wimbledon.?\n\n?But let?s face it, none of us are going to win Wimbledon,? says Yentob. ?And anyway, we keep being told it?s not all about winning, so why do we need these books?? ?I think we all have pain,? says Amy Jenkins, writer of This Life and a self-help fan. \n\nDavid Burns, a pioneer of cognitive therapy, challenges pain head on with the idea that ?your thoughts create your feelings, so your thoughts can change your feelings.? This is not just a fad; his self-help book on cognitive therapy is now prescribed by doctors around the world instead of antidepressants. \n\nYentob?s optimism is bought crushingly down to earth by the Freudian psychoanalyst Adam Philips. ?Freud said the purpose of psychoanalysis is to turn neurotic misery into everyday unhappiness, and what he meant by that is that people aren?t going to be transformed magically.? \n\nIn search of the roots of the self-help genre, Yentob discovers Self Help by Samuel Smiles, which was published in 1859, the same year as Darwin?s The Origin of Species. ?Guess which one was the bestseller?? The next blockbuster was How to Win Friends And Influence People by Dale Carnegie, published in 1936, during the Depression. \n\n?Now we live in a culture of constant change and turnover,? says the self-help critic Micki McGee. ?You not only have to be employed, but constantly employable. Not only married, but constantly marriageable. And that is the moment self-help emerges as a powerful literature.?\n\nThe episode ends with The Wizard of Oz, the ultimate self-help film. All the characters - the Tin Man, the Scarecrow, the Lion and Dorothy - think they have to look to the Wizard for the answers; what they eventually realise is they were within themselves all along. \n\nSo has Yentob been changed by his voyage of discovery? ?The truth is there is more to self-help than I thought,? he admits.\n\nThe Secret of Life, BBC ONE, Tuesday 19th February 2008, 10.35pm.","torrent":{"xt":"urn:btih:b00b10e9b31da89036c8e0e11090bd757042f24b","amp;dn":"BBC+Imagine-The+Secret+of+Life.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00b10e9b31da89036c8e0e11090bd757042f24b","infoHashBuffer":{"type":"Buffer","data":[176,11,16,233,179,29,168,144,54,200,224,225,16,144,189,117,112,66,242,75]},"announce":[],"urlList":[]}}