{"title":"Kimagura Orange Road -Complete- (Eps 1-48)","uid":3253302,"size":8180103327,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b02915ed3a18f3dbb4fed5225e3ea657eb049cf1&amp;dn=Kimagura+Orange+Road+-Complete-+%28Eps+1-48%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Midcat","files":48,"time":1099518939,"description":"Kimagura Orange Road is considered by many one of the best series out of Japan, the true die hard fans could never have enough of it and now you too can enjoy this clasic and see for yourself why KOR has developed a Cult Following all over the world!\n\n\nOccasionally Kimagure Orange Road is referred to as Whimsical Orange Road, just Orange Road, or KOR for short.\n\n\nSynopsis\n\nHigh School student Kasuga Kyosuke has problems with women. Big time! First, he thinks he's falling in love with the beautiful and somewhat mysterious Ayukawa Madoka, but he's not at all sure if Madoka feels the same way about him.\nSecond, he's being pursued by the exceedingly sweet, cute and bubbly Hiyama Hikaru, who has taken to calling him &amp;quot;Darling&amp;quot; and asking him if she'll make a good wife.\nThe two girls are total opposites - and best friends since childhood. Which means that Kyosuke's love life is somewhat complicated. But wait - Kyosuke's women troubles are far from over. He's got two bratty sisters to worry about, and his two sex-crazed buddies are stalking him! And one of the thoughest guys in the Karate Club, who is rather annoyed about him &amp;quot;stealing&amp;quot; Hikaru, is stalking him!\nNow, Kyosuke does have one thing going for him. Both he and his sisters have inherited the family gift - Paranormal Powers; Teleportation, Telekinesis, Precognition - they can do it all. Unfortunately, if anyone catches them using their powers, they'll have to leave town. And it turns out that Kyosuke's Powers are much better at getting him into trouble than they are at getting him out of it.\nAll this means that life is rarely boring (and always hilarious) on Kimagura Orange Road!\n\n\n","torrent":{"xt":"urn:btih:b02915ed3a18f3dbb4fed5225e3ea657eb049cf1","amp;dn":"Kimagura+Orange+Road+-Complete-+%28Eps+1-48%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b02915ed3a18f3dbb4fed5225e3ea657eb049cf1","infoHashBuffer":{"type":"Buffer","data":[176,41,21,237,58,24,243,219,180,254,213,34,94,62,166,87,235,4,156,241]},"announce":[],"urlList":[]}}