{"title":"Moskollo FM08 Kit Pack","uid":4140767,"size":82561201,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:b0cde77de8da161251fe4f3a3c080b6d3cfa5c8b&amp;dn=Moskollo+FM08+Kit+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"moskollo","files":1,"time":1208476868,"description":"Kit packs for FM08, which should work on previous versions of FM. I&amp;#039;ve put the kits in two folders, a graphics FMF kits and a general kit folder. It covers pretty much every nation and club one would use in the game. The graphics FMF folder is ready made to get rid of the awful kits which come built into FM08, I really dislike the t-shirt design so most of the kits in this pack are 3gt.\n\nOnce again, I don&amp;#039;t claim to have created the kits, what I have done is organised them into one folder, made sure that 95% work, some kits like Leicester City just refuse to stop being a t-shirt kit. \n\nAs I&amp;#039;ve put on my other files, I&amp;#039;m not a fan of the SI Graphics Forum(hello Frankie are you still a prick?) and I&amp;#039;m sure someone will claim this is a bogus file. Far from it reader, I believe in torrent, I&amp;#039;ve been downloading for years and I love the us against the system nature of torrent. Why would I put something bogus out there when I believe in torrent so much? So if someone wants to write some bullshit about this file go ahead, I&amp;#039;m in this for karma points, not for SI brown nose points like the Frankie&amp;#039;s of this world-I made you famous you dick.\n\nOnce downloaded open the folder with winrar. Then put the kits folder in your Sports Interactive/data folder in your C drive. You can do the same with the other kits pack for FMF, but my advice would be to download the &amp;#039;Resource Archiver&amp;#039; for FMF files, extract the graphics folder to get at those shit t-shirt kits. Go into the pictures file after extracting the &amp;#039;graphics fmf&amp;#039; file and find a folder called &amp;#039;front&amp;#039;, I&amp;#039;d just exchange that one for the one in this pack. Remember you have to then &amp;#039;create archive&amp;#039; with your ammended graphics folder. It&amp;#039;s not something you&amp;#039;ll have to do twice.\n\nSo, there you go, I&amp;#039;ve put a &amp;#039;backgrounds&amp;#039; and &amp;#039;player pics&amp;#039; pack out there as well, if you like this why not download the others...\n\n\nPeace\n\n\n\nMoskollo","torrent":{"xt":"urn:btih:b0cde77de8da161251fe4f3a3c080b6d3cfa5c8b","amp;dn":"Moskollo+FM08+Kit+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0cde77de8da161251fe4f3a3c080b6d3cfa5c8b","infoHashBuffer":{"type":"Buffer","data":[176,205,231,125,232,218,22,18,81,254,79,58,60,8,11,109,60,250,92,139]},"announce":[],"urlList":[]}}