{"title":"The Crystal Key v1.1 WIN/MAC","uid":4051853,"size":1091242160,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b11cbaeaa26542a9576a879bd76fd19014ce08d7&amp;dn=The+Crystal+Key+v1.1+WIN%2FMAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Enclen","files":5,"time":1204199335,"description":"The Crystal key Version 1.1\n\n\\&quot;Your quest for the Crystal Key will take you on an incredible adventure. Armed with only your wits, your journey will take you through fascinating lands of desert, jungle and water as you explore breathtaking worlds; each more beautiful and magical than the last. Rise to the challenge and let your wisdom, instinct and ingenuity lead the way. Carefully examine and solve each puzzle along your path. Secrets lie waiting to be unlocked and discovered by those who posses the crystal key.\\&quot;\n\n\n\nSystem Requirements:\n\nWindows 98/95\n*Pentium 133 MHz\n*32 MB RAM\n*70MB hard disk space\n*8x CD-ROM\n\nMacintosh\n*Mac OS System 7.5 or higher\n*PowerPC 120 Mhz\n*70MB hard disk space\n*8x CD-ROM\n\n\nNote:\n\nThis game does have problems running on windows xp, but all of those are related to QuickTime itself. To get this game to work you\\&amp;#039;ll need to install the version of QuickTime that is supplied on the disk, but first be sure to uninstall any other version of QuickTime you might have or you could risk corrupting the installation, making it very difficult to uninstall or reinstall QuickTime ever again.\n\nNext, you\\&amp;#039;ll need to turn off your graphics card\\&amp;#039;s hardware acceleration by right clicking the desktop and going to Properties&gt;Settings&gt;Advanced&gt;Troubleshoot and drag the slider to none. Your sound card/chipset will need to be turned off as well by going into the start menu and clicking run, input \\&quot;dxdiag\\&quot; (without quotes) and click enter. Go to the sound tab in the new application and do the same thing you did before with the graphics.\n\nFor the best experience \\&quot;The Crystal Key\\&quot; is best played at 640x480 resolution in 16-bit color mode. If you experience any display issues try installing CK_Letterbox.exe, I\\&amp;#039;ve only ever needed this patch with my old crt, I haven\\&amp;#039;t had any problems with my current LCD without it.\n\nOne other thing,\nYou may need to burn the images to disk or else you\\&amp;#039;ll get an error each time the game tries to read from the physical CD-ROM drive.","torrent":{"xt":"urn:btih:b11cbaeaa26542a9576a879bd76fd19014ce08d7","amp;dn":"The+Crystal+Key+v1.1+WIN%2FMAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11cbaeaa26542a9576a879bd76fd19014ce08d7","infoHashBuffer":{"type":"Buffer","data":[177,28,186,234,162,101,66,169,87,106,135,155,215,111,209,144,20,206,8,215]},"announce":[],"urlList":[]}}