{"title":"IRON STORM Euro version 1 with patch,crack &amp; cheats","uid":3324835,"size":1053545724,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b154d16574c157175f0efacd18d0d38bdbf447c7&amp;dn=IRON+STORM+Euro+version+1+with+patch%2Ccrack+%26+cheats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pattyk","files":4,"time":1115111917,"description":"I downloaded this from the edonkey network, also got the patch 1,041euro and it'scrack. All on CD1. Both CDs are rar using WinRar 3.40. but all should work.\n                   \nIron Storm  European v1              \nDeveloper:  4X Studio  \nPublisher:  Wanadoo Edition \n\nhttp://www.3dgamers.com/screenshots/games/ironstorm/\n\n\nBetween reality and fiction. The game takes place in an imaginary environment that has been inspired by real events. Iron Storm takes real elements from the First World War (trenches, barbed wire fences, mines, gas warfare...) and combines them with more modern elements from the Second World War (radar, penicillin, automatic weapons, tanks...) as well as elements inspired by the Vietnam War (helicopters, lasers, electronics...).\n\nThe gameplay in Iron Storm combines shoot 'em-up, action and reflection. The player undertakes an infiltration mission and must possess combat skills as well as stealth if he is to survive as he penetrates behind enemy lines. Depending on the circumstances, the player can choose between first and third person views.\n\nThe player must pass through 6 worlds in a Germany ripped apart by the front line: the Friedrich line (the Western front), the Anton Denikin line (the Russo-Mongol front), Wolfenburg (an enemy-occupied town), the Mad Baron's heavy water factory, the 'Tzar Ivan' armoured train and the Reichstag in Berlin. The player must face different types of enemy, all of whom have different fighting styles and AI: Kazakh troops, Sturmpionners (soldiers of the 'Deutsche Reichskorps', Russo-Mongol allies), Siberians, Cadets from Baron Ungern's bodyguard and, especially, Consortium agents.\n\nWiz must also watch out for all the dangers of a real war: machinegun bunkers, snipers, mines, tanks, aerial bombardments, muddy trenches, dogs carrying mines which are trained to attack the enemy, etc. The player's weapons consist of a Russian short sabre, a Heckler &amp;amp; Koch MP-6 'Wotan' assault pistol with a silencer fitted, a Remington M910 'Bull's Eye' shotgun, a M203 40mm 'Clovis' grenade launcher, fragmentation and smoke grenades, and antipersonnel and magnetic mines.\n\n","torrent":{"xt":"urn:btih:b154d16574c157175f0efacd18d0d38bdbf447c7","amp;dn":"IRON+STORM+Euro+version+1+with+patch%2Ccrack+%26+cheats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b154d16574c157175f0efacd18d0d38bdbf447c7","infoHashBuffer":{"type":"Buffer","data":[177,84,209,101,116,193,87,23,95,14,250,205,24,208,211,139,219,244,71,199]},"announce":[],"urlList":[]}}