{"title":"Further Seems Forever - Discography (EAC-FLAC)","uid":4137152,"size":773961440,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b187c669e273f83d888d6213224637129f88048e&amp;dn=Further+Seems+Forever+-+Discography+%28EAC-FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"e7","files":43,"time":1208308851,"description":"Further Seems Forever (3 albums FLAC EAC)\n=========================================\nFurther Seems Forever - 2001 The Moon Is Down\nFurther Seems Forever - 2003 How To Start A Fire\nFurther Seems Forever - 2004 Hide Nothing\n\nRip\n===\nThis is a release of all three albums of the band Further Seems Forever. \nSecure EAC, AccurateRip, and correct tags. \nLog files of ripping are inside each folder.\nEnjoy one of the amazing bands ever, don&amp;#039;t let this music die.\n\nBiography\n=========\nFurther Seems Forever was an American rock band formed in 1998 in Pompano Beach, Florida and disbanded in 2006. Over the course of their career the band experienced several lineup changes, resulting in a different lead vocalist performing on each of their three studio albums. Original singer Chris Carrabba recorded with the band for their first album The Moon is Down in 2001 before leaving to start Dashboard Confessional. He was replaced by Jason Gleason, formerly of Affinity, who performed on the 2003 album How to Start a Fire. Gleason left the band in 2004 due to interpersonal tensions and was replaced by former Sense Field vocalist Jon Bunch for the band&amp;#039;s final studio album Hide Nothing. None of the three vocalists can be said to have recorded more than one full album with the band, as posthumous compilation albums included contributions from multiple singers.\n\nThe band&amp;#039;s music is often classfied as indie rock and is frequently associated with the emo genre. They have also been classified as a Christian rock act due to the individual band members&amp;#039; religious beliefs, frequent themes of Christianity in their lyrics, their association with the predominantly Christian Tooth &amp; Nail Records label, and their performances at Christian-themed festivals such as Cornerstone. Despite these associations, the group often claimed not to be an explicitly Christian band, but rather a rock band with Christian members.\n","torrent":{"xt":"urn:btih:b187c669e273f83d888d6213224637129f88048e","amp;dn":"Further+Seems+Forever+-+Discography+%28EAC-FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b187c669e273f83d888d6213224637129f88048e","infoHashBuffer":{"type":"Buffer","data":[177,135,198,105,226,115,248,61,136,141,98,19,34,70,55,18,159,136,4,142]},"announce":[],"urlList":[]}}