{"title":"VmwAROSve08.7z","uid":4258237,"size":261775183,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:b1ea189dee6b4eb47029ea607ca71ea25fbd57ba&amp;dn=VmwAROSve08.7z&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"keenears","files":1,"time":1214340906,"description":"WmvAROS VE beta 0.8\n\nWhat AROS is?\n\nThe AROS Research Operating System is a lightweight, efficient and flexible desktop operating system, designed to help you make the most of your computer. It\\&amp;#039;s an independent, portable and free project, aiming at being compatible with AmigaOS 3.1 at the API level (like Wine, unlike UAE), while improving on it in many areas. The source code is available under an open source license, which allows anyone to freely improve upon it.\n\n[read more at http://aros.sourceforge.net/]\n\nMore words: Remember your old Amiga? ;)\n\n\nThen...\n\n\nVmwAROS VE (Virtual Environment) is a complete AROS desktop environment running on VMware virtual machines. Targeted to final users and to developers, VmwAROS allow testing and using the AROS Research Operating system without really installing it on the hard drive. It can be a reliable way to access this interesting OS for people with powerful, but yet not supported hardware.\n[read more at http://vmwaros.org/]\n\nRequirements: VMware Server, Workstation (version 5.5 or above), Player, Fusion. Recommended a x86-based computer with a 1,5 GHz CPU; 512 MB system RAM; any 32-bit capable video card; any CD-ROM drive; max 6 GB of free space on hard drive.\n\n===\nNew in version 0.8:\n[http://vmwaros.blogspot.com/2008/06/new-vmwaros-beta-08-released.html]\n    \n      \n   * Fixed the boot issue on Vmwaros Live! with some PC chipsets by adding the\nextra stable kernel option on boot (emergency mode kernel and options).\n\nEmergency Mode is not a \\&quot;Windows-safe-mode\\&quot;-like option, but a way to force AROS booting on some old machines which aren\\&amp;#039;t compatible anymore with the current AROS ata.device. Users who got booting problems with VmwAROS 0.7 and 0.7.1 should always use this option: in emergency mode, VmwAROS behaves exactly as in normal mode, no other functions than the partial SATA support are disabled.\n\n* added complete development environment with C, C++ and E (PortablE)\n* updated Murks! IDE to version 0.6.0\n* Murks! can run from CD (but it\\&amp;#039;s not completely safe)\n* added checks for proper assign and development paths (LIVE! only)\n* Murks! and development tools can be installed either in Sys: or Work: (LIVE! only)\n* added filesystem and futilities menu to AmiStart\n* moved SimpleMail directly in the /Utilities directory\n* added lots of new games\n* added lots of new utilities\n* added some sound and video commands (madahi, play, playnosound, aramp and so on) (sound working only on LIVE! version with AROS supported audio cards).\n* enhanced graphic theme\n* added PlayStation emulator FPSE\n* added some new fonts\n* VmwAROS now launches Opaque commodity at startup\n* custom muimaster.library updated to June 15th sources\n* system files updated to may 23rd nigthly build, some files are newer\n* updated Quick and dirty guide in PDF\n\n===\n\nSo what are you waiting for? Just download the new version and start using it. And if you like it please consider donating it will surely help Paolo and us to continue (and improving) this (hard!) work.\n\n7-zip archiver (7-zip.org) and 66+ MB RAM is required to unpack the archive.\n\n==\nThanks to the Paolo Besser, the creator of this distro and all the warm AROS community and developers out there! See ya soon.\t","torrent":{"xt":"urn:btih:b1ea189dee6b4eb47029ea607ca71ea25fbd57ba","amp;dn":"VmwAROSve08.7z","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1ea189dee6b4eb47029ea607ca71ea25fbd57ba","infoHashBuffer":{"type":"Buffer","data":[177,234,24,157,238,107,78,180,112,41,234,96,124,167,30,162,95,189,87,186]},"announce":[],"urlList":[]}}