{"title":"kevin.hill.121.hdtv-lol.avi","uid":3346332,"size":367351808,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b2443b6fa477235eeeee1ebceba06330914809cc&amp;dn=kevin.hill.121.hdtv-lol.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Selme17","files":1,"time":1119142408,"description":"A hot-shot attorney at a prestigious entertainment law firm, Kevin Hill (Taye Diggs) is a star on the rise. He commands attention in the courtroom and at the hottest clubs in New York City. Through all of his exploits, he is joined by his buddy, the charming and witty Dame (Jon Seda), who is always up for a good time.\n\nWithout warning, Kevin's whole life turns upside down when he's left to raise the ten-month-old daughter of his cousin, who unexpectedly passes away. Overnight, this once unflappable player turns into a nervous dad. After figuring out how to deal with bottles, diapers and his new no-nonsense, gay nanny, George (Patrick Breen), Kevin is forced to overhaul his life and quits his shark-infested, workaholic law firm for a flex-time, boutique law office, Grey &amp; Associates, owned and staffed completely by women.\n\nWith the change in pace and clientele at the new firm, Kevin must adjust his attitude when dealing with his new co-workers, who include Jessie Grey (Michael Michele), a professional single mom and boss who likes fostering Kevin's bumpy evolution; Nicolette Raye (Christina Hendricks), the office's most underestimated legal weapon thanks to her slightly-mousey demeanor, and Veronica Carter (Kate Levering), a whip-smart diva who finds it especially difficult to work cases with Kevin, considering that she previously had a one-night stand with him.\n\nDespite continuing temptation from his party buddies, Kevin is determined to walk the line between the women at his job, the women that he chases and the baby girl in the crib.\n","torrent":{"xt":"urn:btih:b2443b6fa477235eeeee1ebceba06330914809cc","amp;dn":"kevin.hill.121.hdtv-lol.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2443b6fa477235eeeee1ebceba06330914809cc","infoHashBuffer":{"type":"Buffer","data":[178,68,59,111,164,119,35,94,238,238,30,188,235,160,99,48,145,72,9,204]},"announce":[],"urlList":[]}}