{"title":"CBS - 2007 Grammy Awards","uid":4022018,"size":1592836358,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b24419a129bc23aa11b06b33c25c3a4a81c97807&amp;dn=CBS+-+2007+Grammy+Awards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jose3030","files":1,"time":1202708771,"description":"CBS - 2007 Grammy Awards\n\nShow: The Grammy Awards \nEpisode: The 50th Annual Grammy Awards \nNetwork: (CBS) CBS Television \nDate: Sunday - February 10, 2008 \nTime: 8/7c PM \nDuration: 3:30 \n\nAbout: The Grammy Awards: The 50th Annual Grammy Awards\nAirs live from Staples Center in Los Angeles (live ET/delayed PT). \nBurt Bacharach, The Band, Cab Calloway, Doris Day, Itzhak Perlman, Max Roach and Earl Scruggs will receive The Recording Academy Lifetime Achievement Award. Clarence Avant, Jac Holzman, and Willie Mitchell will be honored with The Academy&amp;#039;s Trustees Award. AMPEX Corporation and John Eargle have been named recipients of the Technical GRAMMY Award. Formal acknowledgment of these awards will be made during the telecast. \n\nScheduled performers include BeyoncÃƒÂ©, Foo Fighters, Carrie Underwood, Feist, Alicia Keys, Brad Paisley, Fergie &amp; John Legend (duet), Andrea Bocelli &amp; Josh Groban (performing together), Eldar, Kid Rock, Dave Koz, Keely Smith, Amy Winehouse (via satellite from London), Kanye West, John Mayer and BeBe Winans. \n\nSix-time Grammy winner Tina Turner will join BeyoncÃƒÂ© for a special performance. \n\nAretha Franklin, Mary J. Blige, The Clark Sisters, Israel &amp; New Breed, The Madison Bumblebees, and Trin-I-Tee 5:7 perform in a special gospel segment. \n\nRihanna performs with a reunited The Time in a special 50th anniversary segment. \n\nThe casts of &quot;The Beatles LOVE by Cirque du Soleil&quot; and &quot;Across The Universe&quot; perform in a special Beatles segment. \n\nJohn Fogerty, Jerry Lee Lewis and Little Richard perform in a special &quot;Cornerstones of Rock&quot; segment. \n\nHerbie Hancock and Lang Lang perform in a special classical/jazz segment (conducted by famed maestro John Mauceri). \n\nThe Foo Fighters will perform as part of this year&amp;#039;s &quot;My Grammy Moment&quot; 2008 segment. An unsigned musician will perform with the Foo Fighters as part of an orchestra created specifically for this event. Arranging and conducting the orchestral piece will be Led Zeppelin&amp;#039;s legendary multi-instrumentalist John Paul Jones. Together, Foo Fighters, Jones and this talented musical ensemble will provide the world with an entirely new take on Foo Fighters&amp;#039; hit single &quot;The Pretender.&quot; \n\nScheduled presenters include Natalie Cole, Juanes, Cyndi Lauper, Bette Midler, Bonnie Raitt, Chris Brown, Miley Cyrus, Solange Knowles, George Lopez, Lyle Lovett, Ludacris, Akon, Jason Bateman, Tony Bennett, Cher, Nelly Furtado, Tom Hanks, Quincy Jones, Joe Mantegna, Prince, Ringo Starr, Dave Stewart, Taylor Swift, Stevie Wonder, Dierks Bentley, Cuba Gooding Jr., Carole King, Roselyn Sanchez, Usher and will.i.am. \n\n \n\nAbout: The Grammy Awards\nEstablished in 1957, The Recording Academy is an organization of musicians, producers, engineers and recording professionals that is dedicated to improving the cultural condition and quality of life for music and its makers. Internationally known for the GRAMMY Awards -- the preeminent peer-recognized award for musical excellence and the most credible brand in music -- The Recording Academy is responsible for groundbreaking professional development, cultural enrichment, advocacy, education and human services programs. In its 50th year, The Academy continues to focus on its mission of recognizing musical excellence, advocating for the well-being of music makers and ensuring music remains an indelible part of our culture. \n\nCBS SERIES PAGE: The Grammy Awards \n","torrent":{"xt":"urn:btih:b24419a129bc23aa11b06b33c25c3a4a81c97807","amp;dn":"CBS+-+2007+Grammy+Awards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24419a129bc23aa11b06b33c25c3a4a81c97807","infoHashBuffer":{"type":"Buffer","data":[178,68,25,161,41,188,35,170,17,176,107,51,194,92,58,74,129,201,120,7]},"announce":[],"urlList":[]}}