{"title":"WASHINGTON, YOURE FIRED! -","uid":4148174,"size":307399760,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:b304c95969a1bc1dca25d88a34ee68872eb863d3&amp;dn=WASHINGTON%2C+YOURE+FIRED%21+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"real-pacman","files":6,"time":1208820474,"description":"WASHINGTON, YOURE FIRED!\n\nUploaded for:\n\nSize: 293 - .avi + cover\n\n?WASHINGTON, YOU?RE FIRED!? was born out of sheer frustration with abuses in our current political system and it gives a voice to Americans across the country.\n\nFrom the mismanagement of Hurricane Katrina rescue efforts and law enforcement abuses to the wrongful imprisonment and torturing of legal enemy combatants and misuse of the FBI and NSA -- nothing is taboo in this disturbing look at the last seven years of fundamentally flawed terror-related spy bills, how they affect you, and what you can do about it. \n\nBills such as the USA PATRIOT Act, the Military Commissions Act, and the John Warner Defense Act have crippled the U.S. Constitution and have weakened the liberties that Americans once thought they could never lose.  The loss of Habeas Corpus and Posse Comitatus, coupled with a new definition of ?torture? are just the tip of the Orwellian iceberg. If enacted, HR 1955 will for the first time put ?thought crime? laws on the books, robbing citizens of their right to freedom of conscience thought. \n\nThe American people know in their hearts that a problem exists in our current political structure and their solutions are simple, direct, and honest.  Washington, You?re Fired captures the spirit and zest of an old fashioned Boston tea party and captivatingly delivers the audience an education into legislation that will affect them and generations of Americans to come.\n\n&quot;Washington, You're Fired&quot; is a chance for every American to play a serious game of political &quot;catch-up&quot; minus the partisan punch lines.  We'll examine both sides of the political aisle exposing some of the most damning laws ever enacted in any country, while at the same time providing the audience with solutions and a game plan.","torrent":{"xt":"urn:btih:b304c95969a1bc1dca25d88a34ee68872eb863d3","amp;dn":"WASHINGTON%2C+YOURE+FIRED%21+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b304c95969a1bc1dca25d88a34ee68872eb863d3","infoHashBuffer":{"type":"Buffer","data":[179,4,201,89,105,161,188,29,202,37,216,138,52,238,104,135,46,184,99,211]},"announce":[],"urlList":[]}}