{"title":"Canal Seis De Julio - El Fraude Segun Fox (Documental).avi","uid":4144677,"size":731715584,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:b415deceff5e1c47dfdeb51694b952821d27a135&amp;dn=Canal+Seis+De+Julio+-+El+Fraude+Segun+Fox+%28Documental%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"unknown_soldier","files":1,"time":1208664943,"description":"Con el Fraude segun Fox, canalseisdejulio vuelve al tema electoral para analizar con humor y dureza el contexto y los personajes de los irregulares comicios del 2 de julio de 2006, asiÂ­ como muchas de las anomaliÂ­as que se presentaron en ellos.\n\nEste documental es tambien una recuperacion de la memoria del fraude, presente en casi todas las elecciones que se celebran en Mexico, y de los episodios de resistencia civil, en algunos casos violentos, protagonizados por el PAN y el propio Vicente Fox y hoy ocultos bajo la alfombra de la doble moral que caracteriza a la derecha mexicana.\n\nAnio de produccion: 2006\nDuracion:45 min\n\n\n***\nCanalseisdejulio es un pequenio medio de comunicacion que difunde informacion y opinion acerca de temas que la television comercial mexicana omite o distorsiona.\n\nLa practica de la pirateria ha contribuido a ampliar la difusion de diversos documentales del canalseisdejulio.\n\nNo obstante, el copiado no autorizado de estos trabajos es cada vez mayor y pone en riesgo la continuidad de un proyecto que no comercializa sus contenidos, no recibe subsidios y requiere de recursos economicos para la produccion de nuevos documentales.\n\nEs deseable que quienes aprecian la labor que desarrolla canalseisdejulio procuren adquirir las copias originales que este grupo difunde directamente; es justo que quienes practican la pirateria le devuelvan al canalseisdejulio una parte de la utilidad que obtienen del esfuerzo que esta detras de cada uno de esos documentales\n\n &lt;a href=&quot;\nhttp://www.canalseisdejulio.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canalseisdejulio.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:b415deceff5e1c47dfdeb51694b952821d27a135","amp;dn":"Canal+Seis+De+Julio+-+El+Fraude+Segun+Fox+%28Documental%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b415deceff5e1c47dfdeb51694b952821d27a135","infoHashBuffer":{"type":"Buffer","data":[180,21,222,206,255,94,28,71,223,222,181,22,148,185,82,130,29,39,161,53]},"announce":[],"urlList":[]}}