{"title":"A Midsummer Night's Dream (1935)","uid":4278044,"size":4593582080,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b4640dd3c0f237036e275aaabbbbc238e9939cf3&amp;dn=A+Midsummer+Night%5C%27s+Dream+%281935%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"choempi","files":1,"time":1215278474,"description":"What?! James Cagney, Mickey Rooney &amp; Dick Powell doing Shakespeare? Yes, indeed, and very well, too. \n\nThis is one of the most magical films of the 1930\\&amp;#039;s. Warner Brothers lavished great care upon it and it glows like the moonlight in many of its most famous scenes.\n\nThe plot is a familiar one to all lovers of Shakespeare. Four desperate lovers steal away into the enchanted forest outside ancient Athens. There they are spied upon by the King of Fairies, Oberon, who is having domestic difficulties of his own with his fair Queen, Titania. Meanwhile, seven intellectually-challenged Athenian rustics have come to the same woods to practice a play they wish to perform at the nuptial celebrations of the local nobility. Puck, the fairy mischief-maker, has a ball causing difficulty for nearly everyone.\n\nHal Mohr, the Cinematographer, did a marvelous job. He makes you think he was filming by moonlight. For this film he was awarded the only Oscar ever won due to a write-in vote. The dreamy Mendelssohn music is also used to great effect.\n\nThe entire cast is excellent and the American accents of many of them does no injury to the Shakespearean verse. This was Olivia de Havilland\\&amp;#039;s film debut and she is beautiful. Others include Ian Hunter, Joe E. Brown, Anita Louise, Victor Jory, Frank McHugh, Jean Muir, Hugh Herbert, Arthur Treacher &amp; Billy Barty. Ross Alexander, groomed for stardom by Warners, had his best role here as one of the young lovers. Fame never smiled on him and two years later, relegated to minor films, he was to die a suicide. ","torrent":{"xt":"urn:btih:b4640dd3c0f237036e275aaabbbbc238e9939cf3","amp;dn":"A+Midsummer+Night%5C%27s+Dream+%281935%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4640dd3c0f237036e275aaabbbbc238e9939cf3","infoHashBuffer":{"type":"Buffer","data":[180,100,13,211,192,242,55,3,110,39,90,170,187,187,194,56,233,147,156,243]},"announce":[],"urlList":[]}}