{"title":"Nexuiz 2.4","uid":4055967,"size":380347457,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b5370bccbf6b370551f60ece3196943ce7dac389&amp;dn=Nexuiz+2.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flushell","files":1,"time":1204330440,"description":"Nexuiz has been in development for close to 5 years by a team of amateur developers lead by Lee Vermeulen. It is a 3d deathmatch game made entirely over the internet. The purpose of the game is to bring deathmatch back to the basics, with perfect weapon balancing and fast paced action, keeping itself away from the current trend of realistic shooters. It uses HFX textures by Evil Lair, and currently has 27 maps to frag in. With an advanced UI, the user can select between 15 different player models to use, with an average of two skins for each, and can connect to our master server to play people from all over the world.\n\nThe game\\&amp;#039;s content and source are GPL. Meaning, it is entirely free and any of it can be used in other free projects, even if modified. This is a first for any large game project of its type. We hope this will support the free game community, and encourage more GPL projects.\n\nNexuiz is based on the Darkplaces engine, built on OpenGL technology. The darkplaces engine is an advanced Quake1 engine developed mainly by Forest \\&quot;LordHavoc\\&quot; Hale, who has been working with the Quake1 engine for many years. A few of Darkplaces main features are Quake3bsp support, realtime lighting and shadowing, new particle effects, advanced menu system, and Md3/Md2 model support. Because Nexuiz is based on the Quake1 engine, its source code along with its content is entirely GPL. Nexuiz will also use the Quake1 game code language, called QuakeC, which makes modding the gameplay of the game extremely easy. This gamecode will be included with the release, and will allow anyone to mod it, and because it is entirely serverside you can use it on your servers even if the clients do not have your mod.\n\nNexuiz will not require a high end system. Video cards such as a Geforce2 will be able to run Nexuiz, while highend video cards will be able to take advantage of some features such as realtime lighting and bumpmapping.\n\nThis game is released free over the internet, but we still require donations to keep development going. See the link at the bottom of the page to donate. Your donation will support further development on the project and other game projects.\nSystem Requirements\n\n400 MB of hard drive space\nWindows 2000/XP/Vista (32-bit or 64-bit)\nMac OS X 10.4 or better (PPC or x86)\nLinux Kernel 2.2 or better with glibc\nHigh Quality\n\nRealtime lights and shadows on, bloom on, high detailed maps, 1024x768 or higher res\n\n- A 1.5 Ghz Intel Pentium 4 chip or AMD Athlon 1500+ or better\n- 9600ati or 5700fx or better\n- 512 MB of ram or better\nLow Quality\n\nno realtime lights, no bloom\n\n- 1 Ghz Pentium III or AMD Athlon\n- Geforce2 Video card\n- 512 MB of ram ","torrent":{"xt":"urn:btih:b5370bccbf6b370551f60ece3196943ce7dac389","amp;dn":"Nexuiz+2.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5370bccbf6b370551f60ece3196943ce7dac389","infoHashBuffer":{"type":"Buffer","data":[181,55,11,204,191,107,55,5,81,246,14,206,49,150,148,60,231,218,195,137]},"announce":[],"urlList":[]}}