{"title":"The Temptations - All Directions + Masterpiece@320","uid":4030277,"size":189376412,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b6bfdef0226aea96d228bb432e3445e0a176d629&amp;dn=The+Temptations+-+All+Directions+%2B+Masterpiece%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alekow1","files":23,"time":1203140563,"description":"1. The Temptations - All Directions\n\nA monster album, the one that put them back in the spotlight and signaled that Norman Whitfield had saved the day. Damon Harris had replaced Eddie Kendricks, and there were many doubters convinced the band was finished. Instead, Whitfield revitalized them via the majestic single, \\&quot;Papa Was a Rollin\\&amp;#039; Stone.\\&quot; Despite its length, Whitfield\\&amp;#039;s decision to open with an extensive, multi-layered musical suite and tease listeners was a master stroke. By the time Dennis Edwards\\&amp;#039; voice came rushing in, no one would dare turn it off. The single, as well as \\&quot;Law Of The Land\\&quot; and others, ended the funeral arrangements that had been prepared for The Temptations. (AMG)\n\n\n01. Funky Music Sho Nuff Turns Me On                                                                                    \n02. Run Charlie Run                                                                                                    \n03. Papa Was A Rollin\\&amp;#039; Stone                                                                                            \n04. Love Woke Me Up This Morning                                                                                        \n05. I Ain\\&amp;#039;t Got Nothin\\&amp;#039;                                                                                                \n06. The First Time Ever I Saw Your Face                                                                                \n07. Mother Nature                                                                                                      \n08. Do Your Thing\n\nLabel: Motown\nDate: 1972\n\n\n\n2. The Temptations - Masterpiece\n\nNorman Whitfield was always the Motown producer who had the most daring creative vision for The Temptations; he was the man who helped them turn psychedelic (well, sort of) with \\&quot;Cloud Nine\\&quot; and \\&quot;Psychedelic Shack\\&quot;, and when the group\\&amp;#039;s career had hit a slump in the early 1970\\&amp;#039;s, he brought them back to the top of the charts with the brilliantly realized \\&quot;Papa Was A Rolling Stone\\&quot;. After the latter tune had become a smash, Whitfield and The Temptations set out to make their most ambitious project to date, but in many ways, Masterpiece sounded more like a Norman Whitfield solo album with the Temps adding occasional vocals; the album\\&amp;#039;s long, carefully layered tunes, complete with sweeping string charts and cleanly punctuated horn lines, have the widescreen splendor of a big-budget movie, and while it\\&amp;#039;s inarguably impressive to hear, the featured artists often seem to be lost in the shuffle. It doesn\\&amp;#039;t help that while the album is musically impressive, several of the songs are lyrically cut-rate, especially the cliche-ridden \\&quot;Ma\\&quot; and \\&quot;Plastic Man\\&quot;, a ho-hum critique of hypocrisy, and while The Temptations deliver their material with conviction and typically peerless vocal skill, it\\&amp;#039;s not enough to disguise the fact this album overshoots its target. While still better than the average Motown effort of the period, Masterpiece never quite becomes the triumph it obviously wants to be, proving once again that a \\&quot;Masterpiece\\&quot; usually occurs as a matter of serendipity rather than careful design. (AMG)\n\n\n01. Hey Girl (I Like Your Style)                                                                                        \n02. Masterpiece                                                                                                        \n03. Ma                                                                                                                  \n04. Law Of The Land                                                                                                    \n05. Plastic Man                                                                                                        \n06. Hurry Tomorrow\n\nLabel: Motown\nDate: 1973\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share","torrent":{"xt":"urn:btih:b6bfdef0226aea96d228bb432e3445e0a176d629","amp;dn":"The+Temptations+-+All+Directions+%2B+Masterpiece%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6bfdef0226aea96d228bb432e3445e0a176d629","infoHashBuffer":{"type":"Buffer","data":[182,191,222,240,34,106,234,150,210,40,187,67,46,52,69,224,161,118,214,41]},"announce":[],"urlList":[]}}