{"title":"FSX - Seahawk &amp; Jayhawk X V 2.11 Newest release","uid":4136758,"size":120421229,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b7112d279af9cfa339c618fe30633887c49d6499&amp;dn=FSX+-+Seahawk+%26+Jayhawk+X+V+2.11+Newest+release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Papazoff","files":1,"time":1208296172,"description":" &lt;a href=&quot;http://www.aerosoft.com/cgi-local/us/iboshop.cgi?showd490!0,4849418160,D10568&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.aerosoft.com/cgi-local/us/iboshop.cgi?showd490!0,4849418160,D10568&lt;/a&gt;\n\nThis is the newest version of this great Helicopter-Addon for FSX.\n\nThe usual crack is included and works perfectly.\n\n**********************************************************\nFull FSX standard\nAll the aircraft files have been reworked to be fully FSX standard this not a simple port from FS2004! Includes all the latest FSX goodies.\n\n    * Bump maps (this adds a 3d effect to a simple 2d texture, for example to show edges on hatches and rivets),\n    * Specular lighting maps (making reflections more realistic),\n    * Self-shading (aircrafts parts cast shades on other aircraft parts),\n    * All textures in DDS format (faster decompressing if your graphics card supports it),\n    * Fall back textures (all models share some textures, saving you disk space and loading time when you switch models),\n    * Prepared for DX10 graphics cards.\n\nAll models and variations\nThere are seven different models available, not only the different Seahawk models used by the US Navy, but also the export models (Japan, Greece and Spain) are included. The Coast Guard model (Jayhawk) is also included. Fifteen liveries and a paint kit are available.\n\nVery accurate flight model\nThe flight model is highly accurate and has been flown by many actual Seahawk pilots over the last 2 years. Some tweaks include the new FSX functions, but we decided to maintain the highly stable model that was used in the FS2004 version. Please note that maintaining the correct &amp;#039;feel&amp;#039; was more important than numbers and data.\n\nComplete animations\n\n    * Complex fold of rotors and tail (using the actual procedure)\n    * Horizontal tail moves depending on speed\n    * Four crewmembers that animated\n\nStability Augmentation System\nThe advanced Stability Augmentation System (SAS) is very accurate. Not only will it stabilize your flight, it also includes a highly realistic Hover and Hover Depart mode. Unlike other FS helicopters that &amp;#039;force&amp;#039; the location using FSUIPC or SimConnect, this system uses sensors to find the location of the helicopter and will use the standard controls to maintain a hover or move the helicopter in any direction.\n\nAutomated Flight Control System\nThe AFCS is able to read standard flight plans and have the Seahawk fly them fully automated. Your route is shown on the Navigation Display. Distance and time to fly for each waypoint is also available.\n\nExtended manual\nThe 68 page extended manual explains all systems and is well illustrated. Even novice helicopter pilots (or novice flight simmers) should be able to use this advanced helicopter after they completed the training flights.\n\nThree complete documented training flights\n\n    * Systems and Automated Flight Control Systems; learn to setup all systems and start the helicopter. After take-off you will head to a training area to experiment with the navigation system. You will also learn how to fly the helicopter fully automated in terrain following mode.\n    * Advanced navigation; learn how to have the helicopter fly a route automatically and do a low visibility ILS landing.\n    * Zero visibility manual hover; learn to hover the helicopter in a fixed location without ANY visibility (no other helicopter in FS can do this)\n\nSix ships included\nThere are 6 ships included that can be placed in any location using the Shipyard 2 tool.\n\n    * Coast Guard Marine Security Cutter, Large. Very modern off-shore interdiction cutter\n    * CG-50 (Valley Forge). Old style destroyer used to protect carrier groups.\n    * LCS-1 (USS Freedom). Low visibility stealth ship of the latest design.\n    * X-Craft (Sea Fighter). Experimental Special Operation and Patrol Operation ship.\n    * LHD-4 (Boxer). Large amphibious carrier designed to land and support 2000 marines.\n    * F-222 (Augsburg). Modern German air defense ship.\n\nShipyard2\nThis tool allows you to select a location for the ships in Google Earth and convert the resulting files into real FSX scenery.\n**********************************************************\n\n\n\nEnjoy and keep seeding","torrent":{"xt":"urn:btih:b7112d279af9cfa339c618fe30633887c49d6499","amp;dn":"FSX+-+Seahawk+%26+Jayhawk+X+V+2.11+Newest+release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7112d279af9cfa339c618fe30633887c49d6499","infoHashBuffer":{"type":"Buffer","data":[183,17,45,39,154,249,207,163,57,198,24,254,48,99,56,135,196,157,100,153]},"announce":[],"urlList":[]}}