{"title":"Smallville (TV Series Tie-in) [BBN][h33t]","uid":4043747,"size":218481520,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b72e9e9582a3fd252bc9071133e1dc98e0c87f80&amp;dn=Smallville+%28TV+Series+Tie-in%29+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seedYAbastid","files":13,"time":1203800583,"description":"\n[IMG]http://img259.imageshack.us/img259/4408/smallvilletl3.png[/IMG]\n\nSmallville 1-11 + one-shot\n\n[quote]Typical of this series is issue #3, Dubbed a ?Special Lex Luthor Issue,? it does, indeed, focus on The Bald Billionaire by providing readers with two solid comic-book stories (one of which has a cliffhanger ending), a fairly substantive interview with Michael Rosenbaum (who plays Lex in the television series), and a two-page novel excerpt from Dean Wesley Smith?s Lex-centric Whodunnit. Also included is a partial episode guide (without review commentary, unfortunately) of Season One of the TV show.\nAs most fans of Smallville will attest, the best part of the series is the character of Lex Luthor, who, like Anakin ?Darth Vader? Skywalker, will one day shed his inherent goodness and become a much-ballyhooed bad guy. However, unlike Skywalker, who comes off as sort of a whiny cartoon character (as seen in Attack of the Clones), Luthor is a complex creation oozing with nuance, subtlety, and a palpable sense of foreboding.\n\nThis issue does a nice job of capturing these traits, and the first story, which is a gripping murder mystery drawn by Guedes, even manages to capture the likenesses of the various denizens of Smallville. (Clark looks especially realistic.) The second story is a bit less successful in the art department (Lex looks a little silly in a couple of panels), but it does say something interesting about marital commitment ? a topic seldom broached in comic books.[/quote]\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:b72e9e9582a3fd252bc9071133e1dc98e0c87f80","amp;dn":"Smallville+%28TV+Series+Tie-in%29+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b72e9e9582a3fd252bc9071133e1dc98e0c87f80","infoHashBuffer":{"type":"Buffer","data":[183,46,158,149,130,163,253,37,43,201,7,17,51,225,220,152,224,200,127,128]},"announce":[],"urlList":[]}}