{"title":"Deep Purple - Who Do We Think We Are (2005) (Audio Fidelity AFZ","uid":4263324,"size":260850873,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b77d565117bfeb0bbde1e987f094a4b9c92b21a2&amp;dn=Deep+Purple+-+Who+Do+We+Think+We+Are+%282005%29+%28Audio+Fidelity+AFZ+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":16,"time":1214574573,"description":"Extractor: EAC 0.95 beta 4\nRead mode   : Secure with NO C2, accurate stream, disable cache\nCodec: Flac 1.2.1;  Level 8  \n\nSource: Found\nArtwork: Front, Back, Inlay and CD.  \n\n\nGeneral Info:\nArtist: Deep Purple\nAlbum:  Who Do We Think We Are (Audio Fidelity 24k Gold CD)\n\n\n\n                Tracklist:\n   1. &quot;Woman from Tokyo&quot; ? 5:48\n   2. &quot;Mary Long&quot; ? 4:23\n   3. &quot;Super Trouper&quot; ? 2:54\n   4. &quot;Smooth Dancer&quot; ? 4:08\n   5. &quot;Rat Bat Blue&quot; ? 5:23\n   6. &quot;Place in Line&quot; ? 6:29\n   7. &quot;Our Lady&quot; ? 5:12\n\n\n\n\n              LINE UP:\n    * Ritchie Blackmore - guitar\n    * Ian Gillan - vocals, harmonica\n    * Roger Glover - bass\n    * Jon Lord - piano, organ, keyboards\n    * Ian Paice - drums\n\n# Produced by Deep Purple\n# Engineer ? Martin Birch\n# Rolling Stones Mobile Unit: Jeremy Gee &amp; Nick Watterton\n# Equipment ? Ian Hansford, Rob Cooksey, Colin Hart, Ron Quinton\n# Cover Design ? Roger Glover &amp; John Coletta\n# Original album mixed by Ian Paice and Roger Glover\n#Mastered by Steve Hoffman\n\n\n\n\nReview taken from progressiveworld.net:\nDeep Purple is doing its fans proud by re-issuing their entire back catalogue augmented with a royal amount of bonus tracks. To be honest the actual playing time of the band?s 1973 album Who Do We Think We Are is a bit short for the CD format, but then again it remains one hell of an album. Fully remastered, the seven original songs are very clean and it?s as if you?re sitting in during the actual sessions. Especially Ian Paice?s drums sound very close, as if you?re in the control booth. Opening with ?Woman From Tokyo? can?t go wrong as this was a classic from the moment you heard it. With headphones on ?Super Trooper? is one hell of an experience what with the phasing on the drums taking you to another planet. I have always loved the use of that cowbell during the opening for ?Rat Bat Blue? but it?s only now that I hear the handclaps very clearly. And what a great combination Jon?s Hammond organ and Ritchie?s guitar form during the bluesy ?Place In Line.&quot;\n\nWho Do We Think We Are was the last album that the Mark II lineup of Deep Purple recorded. Arguably, this is the finest lineup the rock legends ever had. It seems only fitting that Audio Fidelity decided that it was worthy of its 24KT Gold treatment. This series of gold disc releases are destined to be coveted collectors items as soon as they hit the racks and it makes that much more enticing to own such fine recordings for your own collection.\nI always loved ?Woman From Tokyo? but after hearing ?Rat Bat Blue? in this format, it is by far the best track on the album. Ritchie Blackmore was at an apex playing his patented blues-rock licks and all seven tracks prove that unequivocally. There are many great Deep Purple albums and the previous release Machine Head certainly rivals this album in many ways. It is a tough call picking which one is the best.\nIt takes a crisp clear 24KT Gold format to make you sit up and take notice of how important these albums are to the history of rock music. I noticed some things right away while listening to this great album. The bass and drums are up front like never before and the sound is explosive, keeping up with Blackmore?s blistering guitar lines.\nI could not ask for more on this release, I heard one of the best Deep Purple albums ever recorded, and with a new lease on life, featuring a sound that would make the pictures on your wall jar loose if you turned it up loud enough. This is the way rock ?n? roll was meant to sound all along.","torrent":{"xt":"urn:btih:b77d565117bfeb0bbde1e987f094a4b9c92b21a2","amp;dn":"Deep+Purple+-+Who+Do+We+Think+We+Are+%282005%29+%28Audio+Fidelity+AFZ+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b77d565117bfeb0bbde1e987f094a4b9c92b21a2","infoHashBuffer":{"type":"Buffer","data":[183,125,86,81,23,191,235,11,189,225,233,135,240,148,164,185,201,43,33,162]},"announce":[],"urlList":[]}}