{"title":"Reset (early Simple Plan) - No Limits LP (2000)","uid":4049203,"size":49106086,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b82c3b6ed6f79ee5244a1836d97e26129ecd5a7b&amp;dn=Reset+%28early+Simple+Plan%29+-+No+Limits+LP+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VinYl_RiPPa","files":15,"time":1204070059,"description":"Artist...: Reset\nGenre....: Punk Rock\nTitle....: No Limits\nYear.....: 2000\nTracks...: 13\n\nSource...: CD Audio\nMon/Ste..: Stereo\n\nEncoder..: Lame MP3 CBR\nQuality..: 192 kbps\n\nCovers...: No\n\n\n\n\nThis is the second album that Reset made, the first one No Worries had a different lineup: they had a bassist and Chuck (currently in SP) was the drummer and it sounded a bit garage, but its one of the best bebut album I have heard, the style is like a mix of NoFX-Punk in Drublic, Pennywise-Unknown Road and Bad Religion-Recipe for Hate. \n\nOn the second album, Pierre took up Bass duties and Andrian replaced Chuck on the drums. This album sounds really great, the guitar sounds a lot like the guitars in Pennywise back in the About Time period (Phil is a huge Heavy Metal fan and it shows in his style). The drumming is really good (Adrian is a much better drummer than Chuck was) and it is really fast paced. With melodic vocals and harmonies. This album is fast, aggressive and still remains as catchy as the first one. If you like Strung Out, Pennywise and Bad Religion, this CD is for you. Keep in mind that this band comes from Quebec and that it really mesures up to the best Californian Punk bands.\n\nFrom Pierre own opinion, Simple Plan is a slower paced, more commercial style than Reset used to be (read: they got fed up of not making money out of fast paced energic punk-rock and decided to make money at the cost of toning down). So, if you are into MxPx, Mest, Good Charlotte and Blink 182, you will probably prefer Simple Plan, but in my opinion, its a shame that Reset died to give birth to SP, Simple Plan is good but its not has original and unique has Reset used to be.\n\nAfter hearing this album, I sometimes question whether Im glad that Reset split up for Simple Plan. I love Simple Plan! Theyre great, but its a shame that Reset was abandoned. In my opinion, they were the greatest punk band! This band can easily appeal to pop-punk and punk fans. Unlike a lot of other punk bands, this album has a mix of excellent guitaring, great drumming, very good vocals by Pierre and the songs are very hard and fast paced. What makes this album better than most punk albums is the fact that these are hardcore punk songs that have very catchy melodies. \n\nOther bands are either too poppy (Simple Plan, Blink-182) or too punkish that its hard to enjoy the melody/harmony. (ex: Rancid, Bad Religion). This album is an absolutely perfect mix !\n\nDouble Cross (the last song) is in my opinion one of the best songs ever made! Other greats are: Let Me Go, which keeps switching from a slow to fast back to slow tempo. My Dream and I and Friend are also very good songs.","torrent":{"xt":"urn:btih:b82c3b6ed6f79ee5244a1836d97e26129ecd5a7b","amp;dn":"Reset+%28early+Simple+Plan%29+-+No+Limits+LP+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b82c3b6ed6f79ee5244a1836d97e26129ecd5a7b","infoHashBuffer":{"type":"Buffer","data":[184,44,59,110,214,247,158,229,36,74,24,54,217,126,38,18,158,205,90,123]},"announce":[],"urlList":[]}}