{"title":"Entourage Season One","uid":4248301,"size":2490560563,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b86ff9a2e69002b7d077f23ebf47f5f2b4a71160&amp;dn=Entourage+Season+One&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MrDap","files":9,"time":1213894730,"description":"DVD Rip XVid\nYear: 2004\nLength: 200 Mins (Eight 25 min Eps)\nAudio: Great\nVideo: Great\nFormat: TV Series\n\nEntourage is everything viewers have come to expect from an HBO series: smart, hilarious, and highly addictive, especially when taken in full-season, DVD form. As implied in the title, the show follows Vincent Chase (Adrian Grenier), a rising Hollywood star with bedroom eyes and an over-active libido, along with his three childhood companions-turned-hangers-on. Kevin Dillon plays Johnny Drama, Vincent&amp;#039;s less-attractive, B-list actor of a brother (he is Matt Dillon&amp;#039;s less-attractive, B-list actor of a brother in real life). Jerry Ferrara plays Turtle, the weasel, and Kevin Connolly appears as Eric, the Everyman hero who hopes to parlay his friendship with Vincent (plus two years of community college) into a career in talent management. Along the way Eric contends with the predictable self-doubt, romantic indecision, etc. The cast is rounded out by Jeremy Piven (Doug Hughley from Singles) as a foul-mouthed agent reminiscent of Jay Mohr&amp;#039;s short-lived Peter Dragon character. Finally, it&amp;#039;s produced by Marky Mark himself--and you&amp;#039;ve got to believe that guy knows something about the star-entourage relationship. If possible, watch with a friend so you&amp;#039;ll have someone to quote lines back to later.","torrent":{"xt":"urn:btih:b86ff9a2e69002b7d077f23ebf47f5f2b4a71160","amp;dn":"Entourage+Season+One","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b86ff9a2e69002b7d077f23ebf47f5f2b4a71160","infoHashBuffer":{"type":"Buffer","data":[184,111,249,162,230,144,2,183,208,119,242,62,191,71,245,242,180,167,17,96]},"announce":[],"urlList":[]}}