{"title":"Coney hatch - Friction (1985)","uid":4023710,"size":58688000,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b924afb7a7f5e760461ad7744ae9a20bdcf3dc1b&amp;dn=Coney+hatch+-+Friction+%281985%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"butcherboys","files":12,"time":1202798230,"description":"Track List:\n1. This Ain&amp;#039;t Love (4:06)\n2. She&amp;#039;s Gone (3:58)\n3. Wrong Side Of Town (3:20)\n4. Girl From Last Nights Dream (4:03)\n5. Coming To Get You (3:47)\n6. Fantasy (4:16)\n7. He&amp;#039;s A Champion (4:39)\n8. State Line (4:02)\n9. Burning Love (3:59)\n10. Fuel For The Fire (Unreleased) (4:06)\n\n\n\nHistory:\nNamed after an infamous London lunatic asylum, Coney Hatch played a slick brand of melodic hard rock. They were able to find success in their home country of Canada, but failed to break-out elsewhere.\nAndy Curran (vocals/bass) and Dave Ketchum (drums) formed Coney Hatch in Toronto, Ontario. In 1981 the band would be solidified with the additions of ex-Firefly Carl Dixon (vocals/guitar) and Steve Shelski (guitar). They managed to catch the eye of Pye Dubois who would introduce the band to his Max Webster partner Kim Mitchell. Signing to Mitchell&amp;#039;s Anthem records and recruiting famed producer Jack Richardson, the future looked bright for Coney Hatch.\nThe self titled debut became a hot seller and FM staple in Canada thanks to singles like &quot;Devil&amp;#039;s Deck&quot;, &quot;Monkey Bars&quot; and &quot;Hey Operator&quot; (which was a last minute addition to the album). The group toured behind Judas Priest and Triumph while the album reached gold status in Canada and was establishing themselves an audience in other countries as well. Hooking up with producer Max Norman for the follow-up, Outa Hand delivered more of the commercial hard rock they had become known for. The single &quot;First Time For Everything&quot; (which became the group&amp;#039;s first video) was quickly added to American radio play lists, but failed to expand the band&amp;#039;s audience as much as suspected.\nWith a new drummer in tow by the name of Barry Conners, the band began working on their third release. Friction was another satisfying album, but with dwindling sales Anthem promptly dropped Coney Hatch. The group soldiered on until 1986, when they decided to break apart. Curran began a solo career and formed Soho 69; Dixon also went solo and would tour with a revamped Guess Who and April Wine while Shelski would survive a near-fatal automobile accident to resurface in Gowan. The boys reformed in 1992 for a few gigs to promote their greatest hits album, and still perform the occasional gig together. An exceptional yet underrated band, Coney Hatch&amp;#039;s music can still be heard on Canadian rock radio.\n\n\nButcherboys","torrent":{"xt":"urn:btih:b924afb7a7f5e760461ad7744ae9a20bdcf3dc1b","amp;dn":"Coney+hatch+-+Friction+%281985%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b924afb7a7f5e760461ad7744ae9a20bdcf3dc1b","infoHashBuffer":{"type":"Buffer","data":[185,36,175,183,167,245,231,96,70,26,215,116,74,233,162,11,220,243,220,27]},"announce":[],"urlList":[]}}