{"title":"Electronic Arts Sub Command ISO, 1.08e patch, nocd.exe, keygen","uid":4099739,"size":817004391,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b9b74a48156fcc5cb36a2cd7a3a7d7402a106f8b&amp;dn=Electronic+Arts+Sub+Command+ISO%2C+1.08e+patch%2C+nocd.exe%2C+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"::0","files":47,"time":1206513528,"description":"In Sub Command take charge of the most deadly modern-day submarines in the world as you command three distinct submarines across two unique and challenging campaigns. Utilize cutting-edge technology to navigate the world\\&amp;#039;s oceans to locate, track and destroy enemy convoys. Or, park your sub off hostile shores to deliver Tomahawk missiles to inland targets. Whether diving, scouring or surfacing, you control the smartest, stealthiest, and most feared subs in the water today.\n\nGame Features: \n\n\nThe Legacy Continues - from the makers of the award winning, 688(I): Hunter/Killer, Sub Command will be the best and most realistic submarine simulation ever! \n  \nThree Submarines to Command - take control of the most technologically advanced submarines in the world, the Seawolf, the 688(I), and the Akula; each sub contains authentic Naval systems like Sonar, Radar and Target Motion Analysis. \n  \nTwo Campaigns to Navigate - test your skills in missions straight from headlines as you fire Tomahawk missiles at enemy structures, rescue crippled subs, rise through the polar caps to communicate vital information, and much more.\n  \nMultiplayer Extends the Action - play cooperatively or head-to-head over the Internet on EA.COM\\&amp;#039;s matchmaking system for endless hours of submarine warfare.\n  \nEasy-to-Use Game Interface - controlling a submarine has never been easier for the advanced or casual gamer. \n  \nEnhanced Sound and 3D Graphics Engine - 250+ 3D objects, from Russian trawlers to France\\&amp;#039;s Mirage fighters, and exacting sound modes pull you into a realistic battle experience like no other. You won\\&amp;#039;t just hear depth charges-you will feel them.\n","torrent":{"xt":"urn:btih:b9b74a48156fcc5cb36a2cd7a3a7d7402a106f8b","amp;dn":"Electronic+Arts+Sub+Command+ISO%2C+1.08e+patch%2C+nocd.exe%2C+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9b74a48156fcc5cb36a2cd7a3a7d7402a106f8b","infoHashBuffer":{"type":"Buffer","data":[185,183,74,72,21,111,204,92,179,106,44,215,163,167,215,64,42,16,111,139]},"announce":[],"urlList":[]}}