{"title":"o&amp;o defrag 10.0 pro edition - POWER HD Defragger","uid":4256930,"size":12795976,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b9fed83d0714be8ecb03230ad0e8e41ae2837ba8&amp;dn=o%26o+defrag+10.0+pro+edition+-+POWER+HD+Defragger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tompunker","files":3,"time":1214286085,"description":"O&amp;O Defrag puts is a replacement for the standard Windows defragmenter, that offers a much advanced set of features. It puts fragmented files together and maximizes your system speed and offers five different defragmentation strategies, as well as OneButtonDefrag technology for automatic adjustment of the settings best fitting for your system. The program can defragment drives manually, or fully automatic in the background, keeping your system at peak performance by avoiding build-up of file fragmentation. Defragmentation jobs can also be scheduled, using various criteria. Additional features include status reports, cluster inspector, command line interface, optional MMC integration, boot time defragmentation, special support for mobile systems and more.\n\n\n\nO&amp;O Defrag solves the performance and stability problems of Windows workstations and servers caused by fragmented hard disks. Fragmentation is the main cause of significant losses in performance in Windows. Due to the fact that the hard disk is the slowest component of a computer, its optimization is an especially important issue. By using O&amp;O Defrag, files can be read and written much more quickly. What at first seems to be lost performance can easily be rediscovered and realized again with O&amp;O Defrag, giving you the peace of mind that your hardware is in good health and operating optimally.\n\nO&amp;O Defrag 10 is the newest generation of the very successful O&amp;O Defrag. Simply, quickly, and securely, you can get the maximum performance out of your expensive hardware investments - and all this with only a tiny investment of time and energy! The new O&amp;O Defrag 10 Professional Edition for Windows-based workstations unlocks the hidden Performance of your computer. This software will optimize your hard disk in Windows Vista, XP Home, Windows XP Professional and Windows 2000 Professional, securely repacking fragmented files together for more efficiency. In addition, O&amp;O Defrag 10 Professional Edition boasts outstanding usability and a myriad of important functions not found in any other defragmentation software platforms on the market today.\n\nHighlights:\n? Automatic and self-adjusting defragmentation in the background (O&amp;O OneButtonDefrag)\n? Select from different profiles for the automatic defragmenation of PCs and servers\n? Expanded job scheduling for custom strategies for automatic defragmentation\n? Status monitor and control direct from the Task Tray\n? Completely overhauled interface for increased usability\n? Expanded O&amp;O Defrag Wizard for quick configuration\n? O&amp;O ActivityGuard Pro for even less system loads\n? Expanded Power Management for Notebooks\n? ScreenSaver Mode\n? Integrated O&amp;O Defrag ScreenSaver with 3-D animation\n? Five unique defragmentation methods for different optimization strategies\n? Support for all current Windows operating systems in 32- and 64-bit\n? Support of all Windows drives in configuration and sizes\n\nO&amp;O Defrag Professional Edition runs with the following operating systems:\n+ Windows 2000 Professional\n+ Windows XP Home Edition\n+ Windows XP Professional Edition x32/x64\n+ Windows Vista (all editions, x32/x64)\n\nNew with Defrag 10:\n- overhauled the user interface for our new O&amp;O Defrag 10 as well as adapting it to Windows Vista. The new Ribbon Bar makes it easy for you to find functions or settings. Numerous revisions have been made to the already renowned methods and options. For example, the popular ?OneButtonDefrag? offers individual setting options for your computer and its intended usage. This makes Defragmentation even easier and more effective than ever before.","torrent":{"xt":"urn:btih:b9fed83d0714be8ecb03230ad0e8e41ae2837ba8","amp;dn":"o%26o+defrag+10.0+pro+edition+-+POWER+HD+Defragger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9fed83d0714be8ecb03230ad0e8e41ae2837ba8","infoHashBuffer":{"type":"Buffer","data":[185,254,216,61,7,20,190,142,203,3,35,10,208,232,228,26,226,131,123,168]},"announce":[],"urlList":[]}}