{"title":"[PS2] [NTSC-US] beatmania","uid":4108280,"size":2859110635,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ba15af7d3e8a9e15cd8f08190ccc59d8e0300387&amp;dn=%5BPS2%5D+%5BNTSC-US%5D+beatmania&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"D4RK-PIRAT3","files":2,"time":1206916007,"description":"From wikipedia: &amp;#039;beatmania, also known colloquially as beatmania (US) or BMUS to distinguish it from the original arcade game beatmania, is the first version of the music video game beatmania IIDX to be released in the United States. It was officially released by Konami on March 28, 2006 for the Sony PlayStation 2 video game console.\n\nThe game is named for the original beatmania, but is actually based on beatmania IIDX and the original beatmania. Players play with five, seven, ten, and fourteen keyboard keys (the latter two options only available when players have two controllers available), regulation switches and a turntable.\n\nAdditionally, each mode in beatmania (US) (original beatmania and beatmania IIDX) has its own separate songlist in beatmania. Each mode has certain songs that only appeared in each specific version of beatmania. Although there are songs that appear in both versions, most songs that appeared in (for example) beatmania IIDX (7/14 keys) are not accessible in original beatmania (5/10 keys) mode.\n\nThe game uses the beatmania IIDX 9th Style interface. However, unlike the E3 demo version of beatmania, the final version does not use the original Japanese version, but uses a purple-colored, reskinned version instead. The judgement also has changed from the Japanese version, with the flashing &quot;Great!&quot; judgement being shown in the North American version as &quot;Perfect&quot;, much like in Dance Dance Revolution. The grading system in this game is also significantly easier than the Japanese games, requiring much lower scores to attain the highest grades.&amp;#039;","torrent":{"xt":"urn:btih:ba15af7d3e8a9e15cd8f08190ccc59d8e0300387","amp;dn":"%5BPS2%5D+%5BNTSC-US%5D+beatmania","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba15af7d3e8a9e15cd8f08190ccc59d8e0300387","infoHashBuffer":{"type":"Buffer","data":[186,21,175,125,62,138,158,21,205,143,8,25,12,204,89,216,224,48,3,135]},"announce":[],"urlList":[]}}