{"title":"KM Jamison's Serial (Teaser) (Slasher)","uid":4108842,"size":17053533,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:bcfb3daee90fe433b4fb8e2d953c540ce871c659&amp;dn=KM+Jamison%5C%27s+Serial+%28Teaser%29+%28Slasher%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Squirrel420","files":3,"time":1206945039,"description":"Plot Outline:\nAs a series of missing students from the University Of Memphis and residents from the neighboring town of Buxton begin to pile up so does the outstanding pressure on the already mentally worn Memphis Head Of Homicide and Missing Persons Detective Kendall Morse alongside his mentor Memphis Chief Of Police Hyatt Lerado. With the clock ticking aganist them one or two missing students begins to turn into four or five and before they know it Morse and Lerado are forced into a new form of hell known as Highway 49- an isolated stretch of highway running from Tennessee to Florida being used as a victim dumping ground for a sadistic psychopath known only as &quot;The Bedlam Butcher Of Highway 49.&quot; Up and down the stretch of highway starting in Tennessee the remains of both male and female victims are found gutted and slaughtered inside a collection of shacks and remote shelters being used by the killer for a place to enforce his homicidal behavior without disturbance. Forced by their superiors to put everything aside until a suspect is charged, Morse and Lerado are pushed into a heinous manhunt that leads to more repulsion and macabre than either one of them could have ever imagined or possibly ever will again.\n\nBecome a part of the heinous journey into the depraved mind of a serial killer as he tries to earn his infamous place next to the worst of the worst in historical homicide -- become the eyes watching over -- to experience something that could not only happen in reality....but has repeated itself time and time again. Inspired by true events, SERIAL masterfully creates a mixture of multiple genres of classic horror, true crime and psychological thriller to make an untained product of fear that will not soon be forgotten.\n\nUploader Comments:\n\nThis is a short by a good friend of mine. (Yes he has given me distribution rights, feel free to pass this out anywhere you see fit as long as you include the website link and leave the torrent otherwise untouched)(conversions to other video formats are fine though)\n\nThe plot outline pretty much covers it. This is just the start of his movie project, so expect to see more uploads from this movie from me as time goes on.\n\nPlease, leave a comment, any and all feedback is appreciated, he&amp;#039;s trying to make a good slasher flick here. Please leave better comments than &quot;its rocks/sucks&quot;, any input from fans/haters is appreciated.","torrent":{"xt":"urn:btih:bcfb3daee90fe433b4fb8e2d953c540ce871c659","amp;dn":"KM+Jamison%5C%27s+Serial+%28Teaser%29+%28Slasher%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcfb3daee90fe433b4fb8e2d953c540ce871c659","infoHashBuffer":{"type":"Buffer","data":[188,251,61,174,233,15,228,51,180,251,142,45,149,60,84,12,232,113,198,89]},"announce":[],"urlList":[]}}