{"title":"Hank Mobley - Soul Station (BlueNote-1960)","uid":3235932,"size":53863410,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd8b2bea4cf089ad71885e88d1d139d55e8d9f05&amp;dn=Hank+Mobley+-+Soul+Station+%28BlueNote-1960%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"magOwl","files":7,"time":1094112550,"description":"Hank Mobley - Soul Station (BlueNote-1960)\n\n6 Songs - 51.4mb @ high VBR.\n\nOften overlooked, perhaps because he wasn't a great innovator in jazz but merely a stellar performer, tenor saxophonist Hank Mobley was at the peak of his powers on Soul Station. Recorded with a superstar quartet including Art Blakey on drums, Paul Chambers on bass, and Wynton Kelly on piano, it was the first album since Mobley's 1955 debut to feature him as a leader without any other accompanying horns. The clean, uncomplicated sound that resulted from that grouping helps make it the best among his albums and a peak moment during a particularly strong period in his career. Mobley has no problem running the show here, and he does it without being flashy or burying the strong work of his sidemen. The solidness of his technique means that he can handle material that is occasionally rhythmically intricate, while still maintaining the kind of easy roundness and warmth displayed by the best players of the swing era. Two carefully chosen standards, &amp;quot;Remember&amp;quot; and &amp;quot;If I Should Lose You,&amp;quot; help to reinforce that impression by casting an eye back to the classic jazz era. They bookend four Mobley originals that, in contrast, reflect the best of small-group composition with their lightness and tight dynamics. Overall, this is a stellar set from one of the more underrated musicians of the bop era. - from AMG.\n\nenjoy and SEED!! :]\n\n/owl","torrent":{"xt":"urn:btih:bd8b2bea4cf089ad71885e88d1d139d55e8d9f05","amp;dn":"Hank+Mobley+-+Soul+Station+%28BlueNote-1960%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd8b2bea4cf089ad71885e88d1d139d55e8d9f05","infoHashBuffer":{"type":"Buffer","data":[189,139,43,234,76,240,137,173,113,136,94,136,209,209,57,213,94,141,159,5]},"announce":[],"urlList":[]}}