{"title":"Coast to Coast Radio Program! Commercial Free! Apr 17th thru Apr","uid":4160428,"size":556017706,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bd8c0207e227f741dfb3ffc5b68ef169cd560cff&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+17th+thru+Apr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":50,"time":1209346151,"description":"Expanding the Consciousness of the entire planet! Coast to Coast with George Noory. Thanks in advance to all the seeders and leechers. It&amp;#039;s awesome to share the last ten broadcasts with numerous others around the globe. Do me a favor and upload these to as many sites as you all can and continue to seed as long as you can. Thank You All! Until next week my friends! Stokeman Out.....\n\nThursday April 17th, 2008\nThe Nye Incidents\nAuthors Whitley Strieber and Craig Spector discussed their new graphic novel The Nye Incidents which concerns mysterious cases of human mutilation, which may be connected to alien abductions. The incidents in the book were inspired by a number of real... \nHost: George Noory\nGuest(s): Whitley Strieber, Craig Spector, Henry T. Greely, John Gray, Dr. Roger Leir\n\nFriday April 18th, 2008\nThe Legend of J.C. Brown\nIn the first hour, writer Stephen Sindoni discussed the legend of J.C. Brown, a man who supposedly worked as a geologist for the Lord Cowdray Mining Co. in the early 20th century and claimed to have discovered an ancient Lemurian civilization in the hollows... \nHost: George Noory\nGuest(s): Open Lines, Stephen Sindoni\n\nSaturday April 19th, 2008\nSurvivalism &amp; Roget&amp;#039;s Thesaurus\nIan Punnett and Steve Quayle held a lively and spirited discussion on the topic of &quot;survivalism.&quot; Callers phoned in to speak with Quayle during the last half of the show. In the first hour, author Joshua Kendall (Book Link) spoke about Roget&amp;#039;s Thesaurus... \nHost: Ian Punnett\nGuest(s): Steve Quayle, Joshua Kendall\n\nSunday April 20th, 2008\nA Polygamist&amp;#039;s Wife\nIrene Spencer, a fifth generation polygamist, shared her account of being the second of ten wives and the mother of 14 of her husband&amp;#039;s 58 children. She eventually escaped from her polygamist community, which practiced a fundamentalist offshoot of Mormonism.... \nHost: Ian Punnett\nGuest(s): Irene Spencer\n\nMonday April 21st, 2008\nBiblical Prophecy in 2008\nRev. Irvin Baxter discussed how 2008 could be the year of greatest fulfillment in biblical prophecy in the last 2,000 years. He outlined four prophesied events that may come to pass this year. The Mark of the Beast, in which everyone will need to have...\nHost: George Noory\nGuest(s): Irvin Baxter, Dr. Allan J. Hamilton\n\nTuesday April 22nd, 2008\nHudson Valley UFOs &amp; the Paranormal\nUFO investigator for over thirty years, Philip Imbrogno discussed the Hudson Valley sightings of the 1980s, as well as hidden connections between UFOs and other unexplained phenomena. Working with the renowned J. Allen Hynek, he investigated the Hudson... \nHost: George Noory\nGuest(s): Philip Imbrogno, Stanton Friedman\n\nWednesday April 23rd, 2008\nScientific Creativity\nAuthor Clifford Pickover discussed his latest work on scientific laws and the great minds behind them, and also touched on such topics as time travel, parallel universes and alien life. Some of the best scientific laws have the widest applications, he... \nHost: George Noory\nGuest(s): Clifford Pickover, Lynne D. Kitei\n\nThursday April 24th, 2008\nHoney Bees, Ethanol, Morgellons &amp; Strange Lights\nInvestigative reporter Linda Moulton Howe updated several on-going stories including Honey Bee collapse, grain shortages, Morgellons disease, and strange aerial lights. According to one beekeeper, Honey Bee collapse is worse this year than it was last... \nHost: George Noory\nGuest(s): Linda Moulton Howe, Phil Plait, Michael Cremo\n\nFriday April 25th, 2008\nSmiley Face Killers\nDuring the first half of the program, Kristi Piehl, award-winning journalist for KSTP Channel 5 Eyewitness News in Minneapolis, shared details from her investigation into the murder of a University of Minnesota student and how it could be linked to the... \nHost: Ian Punnett\nGuest(s): Kristi Piehl, Open Lines\n\nSaturday April 26th, 2008\nSuspicious Drug Studies\nDr. John Abramson discussed the breaking scandal of ghostwritten drug trials which puts the actual efficacy of many new drugs into question. He also talked about other ethical issues surrounding the pharmaceutical industry, such as the medication of...\nHost: Ian Punnett\nGuest(s): Dr. John Abramson","torrent":{"xt":"urn:btih:bd8c0207e227f741dfb3ffc5b68ef169cd560cff","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+17th+thru+Apr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd8c0207e227f741dfb3ffc5b68ef169cd560cff","infoHashBuffer":{"type":"Buffer","data":[189,140,2,7,226,39,247,65,223,179,255,197,182,142,241,105,205,86,12,255]},"announce":[],"urlList":[]}}