{"title":"Alien (Virtual Workprint) (FANEDIT) (FIXED) [RePoPo]","uid":4163451,"size":1470592027,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be6644b73f37cc7b235dfbdd6611de4b3c6ab4e0&amp;dn=Alien+%28Virtual+Workprint%29+%28FANEDIT%29+%28FIXED%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"repopo","files":4,"time":1209492593,"description":"THIS RELEASE FIXES A PREVIOUS ONE, WHERE AUDIO WAS OUT OF SYNC\n\n\n*******************************************************************************\n                Alien (Virtual Workprint) (Ridley Scott, 1979)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: movie\nFile Validation......: SFV\nContainer File.......: AVI\nVideo Format.........: XVID\nVideo Bitrate........: 1266\nAudio Format.........: MP3\nAudio Languages......: English 2.0\nSubtitles Enclosed...: None\nResolution...........: 704x304\nColor................: 24 bit\nFPS..................: 29.970\nSource...............: Various\nDuration.............: 02:19:28\nOriginal Format......: NTSC\nGenre................: Science Fiction \nMovie Information....: http://fanedits.org\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nAll credits on this version must go to Meedermow, who originally released this \n&quot;beast&quot;.\n\nA fan-edit of the film ALIEN which interpolates all exisiting deleted scenes and \na variety of unseen footage and unused score cues to create a version that runs \nconsiderably longer than both the 1979 theatrical release and the 2003 \ndirector&amp;#039;s cut.\n\nDuration (according to IMDB, NTSC Versions)\n- Theatrical Version: 117&amp;#039;\n- Director&amp;#039;s Cut: 116&amp;#039;\n- Virtual Workprint: 139&amp;#039;\n\n\n\nPLOT:\n\nWhile returning from a deep-space mission, the crew of the commercial spaceship \nNostromo is awakened by a supposed SOS call from a system they are passing \nthrough. Descending to the planet&amp;#039;s surface, they discover a strange derelict \nspaceship - the apparent source of the transmission - and one of the crew \ndescends into the hold. What he finds are thousands of strange alien eggs. While \nexamining one of the eggs, it hatches and the parasite inside attacks him. After \nreturning to the Nostromo the crew takes off again to head for Earth. The alien \nparasite subsequently dies and all seems well again. But what no one knows is \nthat another alien is quietly forming within its host - and when it emerges, the \ncrew finds itself in serious trouble...  Written by Derek O&amp;#039;Cain.\nTRIVIA: \n    *  Originally to be directed by Walter Hill, but he pulled out and gave the \njob to Ridley Scott.\n    * Veronica Cartwright was originally to play Ripley, but producers opted for \nSigourney Weaver.\n    * An early draft of the script had a male Ripley.\n    * All of the names of the main characters were changed by Walter Hill and \nDavid Giler during the revision of the original script by &amp;#039;Dan O&amp;#039;Bannon&amp;#039; and \nRonald Shusett. The script by O&amp;#039;Bannon and Shusett also had a clause indicating \nthat all of the characters are &quot;unisex&quot;, meaning they could be cast with male or \nfemale actors. However, Shusett and O&amp;#039;Bannon never thought of casting Ripley as \na female character.\n    * Conceptual artist H.R. Giger&amp;#039;s designs were changed several times because \nof their blatant sexuality.\n    * Much of the dialogue was developed through improvisation.\n    * The front (face) part of the alien costume&amp;#039;s head is made from a cast of a \nreal human skull.\n    * Ridley Scott is reportedly quoted as saying that originally he wanted a \nmuch darker ending. He planned on having the alien bite off Ripley&amp;#039;s head in the \nescape shuttle, sit in her chair, and then start speaking with her voice in a \nmessage to Earth. Apparently, 20th Century Fox wasn&amp;#039;t too pleased with such a \ndark ending.\n    * During production an attempt was made to make the alien character \ntransparent or at least translucent.\n    * Three aliens were made: a model and two suits. One of the suits was for \nthe seven foot tall Masai tribesman Bolaji Badejo, and the other was for a \ntrained stunt man.\n    * The models had to be repainted every evening of the shoot because the \nslime used on-set removed the acrylic paint from their surfaces.\n    * The rumor that the cast, except for John Hurt, did not know what would \nhappen during the &quot;chestburster&quot; scene is partly true. The scene had been \nexplained for them, but they did not know specifics. For example, Veronica \nCartwright did not expect to be sprayed with blood.\n    * &quot;Nostromo&quot; is the title of a Joseph Conrad book. The shuttle that Ripley \nescapes on is called the &quot;Narcissus&quot;, a reference to another Joseph Conrad book. \nSee also Aliens (1986).\n    * The vector graphics that appear on Ripley&amp;#039;s screen showing the undocking \nsequence for the Nostromo were also used for the aircar launch sequence in Blade \nRunner (1982).\n    * Extra scenes filmed but not included, due to pacing problems:\n          o Ripley finds Dallas and Brett cocooned. Dallas is covered in maggots \nand begs Ripley to kill him. She does so with a flame thrower.\n          o Ripley and Lambert discuss whether Ash has sex or not.\n          o Alternative death scene for Brett: Ripley and Parker come across an \nalive Brett being lifted from the ground.\n\n    * Many of the non-English versions of the film&amp;#039;s title translate as \nsomething similar to &quot;Alien: The 8th Passenger&quot;.\n    * The alien&amp;#039;s habit of laying eggs in the stomach (which then burst out) was \ninspired by spider wasps, which are said to lay their eggs &quot;in the abdomen of \nspiders.&quot; This image gave &amp;#039;Dan O&amp;#039;Bannon&amp;#039; nightmares, which he used to create the \nstory. But spider wasps (pompilidae) lay eggs on their prey, not inside them, \nafter which the wasp maggots simply snack on the sting-paralyzed spiders. \nO&amp;#039;Bannon may instead have been thinking of either ichneumon wasps or braconid \nwasps. The ichneumon drills a single egg into a wood-boring beetle larva, \nwhereas braconids inject eggs inside certain caterpillars. Both result in fatal \nhatch-outs more alike to O&amp;#039;Bannon&amp;#039;s alien.\n    * 130 alien eggs were made for the egg chamber inside the downed spacecraft.\n    * Conceptual artist H.R. Giger would successfully sue 20th Century Fox 18 \nyears later over his lack of screen credit on Alien: Resurrection (1997).\n    * Ridley Scott&amp;#039;s 2003 director&amp;#039;s cut largely came about when over 100 boxes \nof footage of his 1979 original were discovered in a London vault.\n    * Many of the interior features of the Nostromo came from airplane \ngraveyards.\n    * For the awakening from hypersleep segment, Veronica Cartwright and \nSigourney Weaver had to wear white surgical tape over their nipples so as not to \noffend certain countries.\n    * Jon Finch was originally cast as Kane but on the first day of shooting, he \nlooked extremely ill. Medics were called and Jon Finch was immediately taken to \nhospital where it was discovered that he had an extreme case of diabetes. Ridley \nScott knew that John Hurt was in town, so he approached him that night about \nplaying Kane. John Hurt was on set the following day.\n    * To simulate the thrust of engines on the Nostromo, Ridley Scott had crew \nmembers shake and wobble the seats the actors were sitting in.\n    * H.R. Giger&amp;#039;s initial designs for the face-hugger were held by US Customs \nwho were alarmed at what they saw. Writer &amp;#039;Dan O&amp;#039;Bannon&amp;#039; had to go to LAX to \nexplain to them that they were designs for a horror movie.\n    * The chestbursting scene was filmed in one take with four cameras.\n    * To get Jones the cat react fearfully to the descending Alien, a German \nShepherd was placed in front of him with a screen between the two, so the cat \nwouldn&amp;#039;t see it at first, and came over. The screen was then suddenly removed to \nmake Jones stop, and start hissing.\n    * Dallas&amp;#039; pursuit of the alien down the ventilator shafts, and the intercut \nscenes of the rest of the crew urging him on, was shot in one day.\n    * It was conceptual artist Ron Cobb who came up with the idea that the Alien \nshould bleed acid. This came about when &amp;#039;Dan O&amp;#039;Bannon&amp;#039; couldn&amp;#039;t find a reason \nwhy the Nostromo crew just wouldn&amp;#039;t shoot the Alien with a gun.\n    * Ridley Scott did all the hand-held camera-work himself.\n    * According to Ridley Scott, the mechanism that was used to make the alien \negg open was so strong, that it could tear off a hand.\n    * Jerry Goldsmith was most aggrieved by the changes that Ridley Scott and \nhis editor Terry Rawlings wrought upon his score. Scott felt that Goldsmith&amp;#039;s \nfirst attempt at the score was far too lush and needed to be a bit more \nminimalist. Even then, Goldsmith was horrified to discover that his amended \nscore had been dropped in places by Rawlings who inserted segments from \nGoldsmith&amp;#039;s score to Freud (1962) instead. (Rawlings had initially used these as \na guide track only, and ended up preferring them to Goldsmith&amp;#039;s revised work.) \nGoldsmith harbored a grudge against the two right up to his death in 2004.\n    * The character of Ash did not appear in &amp;#039;Dan O&amp;#039;Bannon&amp;#039; &amp;#039;s original script.\n    * Ash&amp;#039;s blood is colored water. Milk was not used as it would have gotten \nvery smelly very quickly under the hot studio lights. Milk was used though for \nthe close-up of his innards, along with pasta and glass marbles.\n    * &amp;#039;Dan O&amp;#039;Bannon&amp;#039; first encountered H.R. Giger&amp;#039;s unique style when the two \nwere briefly working on Alejandro Jodorowsky&amp;#039;s ill-fated attempt at making \n&quot;Dune&quot;.\n    * The screen test that bagged Sigourney Weaver the role of Ripley was her \nclosing off speech aboard the Nostromo&amp;#039;s shuttle at the end of the film.\n    * The genesis of the film arose out of &amp;#039;Dan O&amp;#039;Bannon&amp;#039; &amp;#039;s dissatisfaction \nwith his first feature, Dark Star (1974) which John Carpenter directed in 1974. \nBecause of that film&amp;#039;s severe low budget, the alien was quite patently a beach \nball. For his second attempt, O&amp;#039;Bannon wanted to craft an altogether more \nconvincing specimen. The goofiness of Dark Star (1974) also led him in the \ndirection of an intense horror movie.\n    * The writing partnership between &amp;#039;Dan O&amp;#039;Bannon&amp;#039; and Ronald Shusett came \nabout when Shusett approached O&amp;#039;Bannon about helping him adapt a Philip K. Dick \nstory that he had acquired the rights to. That was &quot;We Can Remember It for You \nWholesale&quot; which later became Total Recall (1990). O&amp;#039;Bannon then said that he \nhad an idea that he was stuck on about an alien aboard a spaceship and that he \nneeded some assistance. Shusett agreed to help out and they tackled the alien \nmovie first as they felt it would have been the cheaper of the two to make.\n    * The original title was &quot;Star Beast&quot;.\n    * Walter Hill and David Giler&amp;#039;s contribution to the script was to make Ash a \nrobot.\n    * There is no dialog for the first 6 minutes.\n    * The word &quot;fuck&quot; is used five times in the film, four of them by Ripley.\n    * 20th Century Fox doubled the budget from $4.2 million to $8.4 million on \nthe strength of seeing Ridley Scott&amp;#039;s storyboards.\n    * Ridley Scott was keen to take on the project as the one that he had been \npreviously working on at Paramount, Tristan + Isolde (2006), was stuck in \ndevelopment hell.\n    * Three Nostromos were built for the production: a 12&quot; version for long \nshots, a 48&quot; version for the landing sequence and a seven ton rig for showing \nthe ship at rest on the planet&amp;#039;s surface.\n    * The producers of the 1950s potboiler It! The Terror from Beyond Space \n(1958) considered suing for plagiarism but didn&amp;#039;t.\n    * The original name for the spaceship was Snark. This was later changed to \nLeviathan before they finally settled for Nostromo.\n    * The Nostromo&amp;#039;s computer is called Mother. In the third sequel, Alien: \nResurrection (1997), the spaceship&amp;#039;s computer is called Father.\n    * Mother&amp;#039;s two 30 second countdowns take 36 and 37 seconds respectively.\n    * According to John Hurt in the DVD Documentary, he was considered at the \nbeginning of casting to play Kane but had already committed to another film that \nwas set to take place in South Africa, so John Finch got the role instead. \nHowever, two separate incidents occurred which got Hurt the role. First was the \nfact that he was banned from South Africa because the country mistook him for \nactor John Herd who strongly opposed the Apartied (Hurt points out that he was \nopposed to it too, but was lucky enough not to get blacklisted) so he was unable \nto do the other film. Second, actor John Finch became seriously ill from \ndiabetes and had to pull out. Ridley Scott immediately contacted Hurt, pitched \nhim the script over a weekend and John Hurt arrived on the set Monday morning \nwith little to no sleep to begin filming.\n    * The blue laser lights that were used in the alien ship&amp;#039;s egg chamber were \nborrowed from The Who. The band was testing out the lasers for their stage show \nin the soundstage next door.\n    * The stylized artwork that Ridley Scott used to create the storyboards that \ngot Fox to double the budget were inspired by the artwork of famed comic book \nartist Mobius.\n    * The screech of the alien as it bursts from the stomach of John Hurt was \nactually voiced by animal impersonator Percy Edwards. He was personally \nrequested by director Ridley Scott to do the sound effect and it was recorded in \none take.\n    * Veronica Cartwright only found out that she wasn&amp;#039;t playing the part of \nRipley when she was first called in to do some costume tests for the character \nof Lambert.\n    * The Nostromo is supposed to be 800 feet long, while the craft she is \ntowing is a mile and a half long.\n    * The spacesuits worn by Tom Skerritt, John Hurt and Veronica Cartwright \nwere huge, bulky items lined with nylon and with no outlets for breath or \ncondensation. As the actors were working under hot studio lights in conditions \nin excess of 100 degrees, they spent most of their time passing out. A nurse had \nto be on hand at all times to keep supplying them with oxygen. It was only after \nRidley Scott&amp;#039;s and cinematographer Derek Vanlint&amp;#039;s children were used in the \nsuits for long-shots and they passed out too, that some modifications were made \nto the costumes.\n    * At the start of production, Ridley Scott had to contend with 9 producers \nbeing onset at all times, querying the length of time he was taking over each \nshot.\n    * The first day that she shot a scene involving Jones the cat, Sigourney \nWeaver&amp;#039;s skin started reacting badly. Horrified, the young actress immediately \nthought that she might be allergic to cats, and that it would be easier for the \nproduction to recast her instead of trying to find 4 more identical cats. As it \ntranspired, Weaver was reacting to glycerin sprayed on her skin to make her look \nhot and sweaty.\n    * After the first week of shooting, &amp;#039;Dan O&amp;#039;Bannon&amp;#039; asked if he could attend \nthe viewing of the dailies, and was somewhat staggered when Gordon Carroll \nrefused him. To get past that ban, &amp;#039;Dan O&amp;#039;Bannon&amp;#039; viewed the dailies by standing \nbeside the projectionist whilst he screened them for everyone else.\n    * For the chestburster sequence, John Hurt stuck his head, shoulders and \narms through a hole in the mess table, linking up with a mechanical torso that \nwas packed with compressed air (to create the forceful exit of the alien) and \nlots of animal guts. The rest of the cast were not told that real guts were \nbeing used so as to provoke genuine reactions of shock and disgust.\n    * The &quot;Company&quot; referred to in the film is Weylan-Yutani. It would become \nWeyland-Yutani in James Cameron&amp;#039;s sequel 7 years later.\n    * Among some of the ingredients of the alien costume are Plasticine and \nRolls Royce motor parts.\n    * While he was working on the visual effects for this film, Brian Johnson \nwas simultaneously working in the same capacity on Star Wars: Episode V - The \nEmpire Strikes Back (1980).\n    * The space jockey prop was 26 feet tall.\n    * In the wide shots of the Space Jockey prop, Ridley Scott used his two sons \nto make the prop seem bigger.\n    * For Parker&amp;#039;s death, a fiberglass cast of Yaphet Kotto&amp;#039;s head was made, and \nthen filled with pigs&amp;#039; brains. The forehead was made of wax so that the alien&amp;#039;s \nteeth could penetrate it easily. Indeed barbed hooks were fastened to the end of \nthe teeth to make sure it broke the wax surface effectively.\n    * For the alien&amp;#039;s appearance in the shuttle, the set was built around Bolaji \nBadejo, giving him an effective hiding place. However, extricating himself from \nthe hiding place proved more difficult than anticipated. The alien suit tore \nseveral times, and, in one instance, the whole tail came off.\n    * A sex scene between Dallas and Ripley was in the script, but was not \nfilmed.\n    * A scene originally cut, but re-inserted for the Director&amp;#039;s Cut shows \nLambert slapping Ripley in retaliation for Ripley&amp;#039;s refusal to let her, Dallas, \nand Kane back on the ship. According to both Ridley Scott and Veronica \nCartwright, every time she went to slap Sigourney Weaver, Sigourney would shy \naway. After about three or four takes of this, Scott finally told Cartwright \n&quot;Not to hold back. Really hit her.&quot; Thus the very real shocked reactions of \nWeaver, Yaphet Kotto, and Harry Dean Stanton.\n    * The face hugger carcass that Ash autopsies was made using fresh shellfish, \nfour oysters and a sheep kidney to recreate the internal organs.\n    * The Nostromo was built to then-current NASA specifications for spacecraft. \nSome of the displays from the Nostromo are reused in Blade Runner (1982).\n    * The decal on the door of the Nostromo is a &quot;checkerboard square&quot;, the \nsymbol on Purina&amp;#039;s pet food label; it designated Alien Chow.\n    * According to a quote from Veronica Cartwright in a film magazine, in the \nscene where the alien&amp;#039;s tail wraps around her legs, they are actually Harry Dean \nStanton&amp;#039;s legs, in a shot originally filmed for another scene entirely.\n    * The embryonic movements of the &quot;face hugger&quot; (prior to bursting out of its \negg) were created by Ridley Scott using both his rubber-gloved hands.\n    * In the space jockey scene, the three crew members Lambert, Dallas, and \nKane are portrayed by Ridley Scott&amp;#039;s two children and another child; this was \ndone to make the model appear larger.\n    * In &quot;The Blue Planet&quot; (2001), David Attenborough said the &amp;#039;Alien&amp;#039; monster \nwas modeled after the Phronima, a creature spotted by submersibles at great \ndepths. However there is little evidence to support this claim - the original \nAlien design was based on a previous painting by Giger, Necronom IV, which bears \nlittle resemblance to the Phronima. Giger&amp;#039;s agent, Bijan Aalam, claims &quot;He never \ninspired himself by any animals, terrestrial or marine&quot;.\n    * The computer screen displaying Nostromo&amp;#039;s orbit around the planet contains \na hidden credit to Dr. Brian Wyvill, one of the programmers for the animation. \nWithin the top frame entitled Deorbital Descent, it is possible to isolate the \nletters &quot;BLOB&quot;, Dr. Brian Wyvill&amp;#039;s common nickname.\n    * The words &quot;Weyland-Yutani&quot; (the name of The Company) appear at the bottom \nof one of the computer screens during the landing sequence (in green).\n    * The background sound that is heard in the laboratory where Kane has the \nface hugger &quot;on&quot;, is heard also in Deckard&amp;#039;s room in Blade Runner (1982).\n    * The grid-like flooring on the Nostromo was achieved using upturned milk \ncrates, painted over.\n    * In an interview for M?tal Hurlant, Ridley Scott revealed that to make the \naction more realistic, the flight deck was wired so that flipping a switch in at \none console would trigger lights somewhere else. The cast then developed &quot;work \nroutines&quot; for themselves where one would trip a switch, leading another to \nrespond to the changes at his work station and so on.\n    * The original design for the Alien by H.R. Giger had eyes, which were \neliminated to make the creature look even more menacing.\n    * Originally, no film companies wanted to make this film, 20th Century-Fox \nhad even passed on it. They stated various reasons, most being that it was too \nbloody. The only producer who wanted to make the film was Roger Corman, and it \nwas not until Walter Hill came on board that it all changed. 20th Century-Fox \nagreed to make the film as long as the violence was toned down; even after that \nthey still rejected the first cut for being &quot;too bloody&quot;.\n    * The original cut of the film ran 3 hours and 12 minutes.\n    * Despite releasing a new version of the film titled &quot;Alien: The Director&amp;#039;s \nCut&quot;, Ridley Scott wrote in a statement in the film&amp;#039;s packaging that he still \nfeels the original Alien was his perfect vision of the film. The newer version \nis titled &quot;The Director&amp;#039;s Cut&quot; for marketing purposes, featuring deleted scenes \nmany fans wanted to see incorporated into the film (such as the scene where \nLambert and Ripley discuss whether or not they&amp;#039;ve slept with Ash, suggesting \nthere&amp;#039;s something not quite right about Ash).\n    * Director Ridley Scott and composer Jerry Goldsmith were at odds with each \nother on the usage of the original music score. As a result, many crucial cues \nwere either rescored, ill-placed, or deleted altogether, and the intended end \ntitle replaced with Howard Hanson&amp;#039;s &quot;Symphony No. 2 (Romantic)&quot;. The original \nintended score was featured as an isolated track on the now out-of-print 20th \nAnniversary DVD.\n    * The vapor released from the top of the spacesuit helmets (presumably \nexhausted air from the breathing apparatus) was actually aerosol sprayed from \ninside the helmets. In one case, the mechanism broke and started spraying inside \nthe helmet.\n    * A closer look at the alien eggs in the scene right before the facehugger \nreveals that slime on the eggs is dripping from bottom to top. Ridley Scott did \nthis intentionally by shooting with the camera upside down.\n    * The engine plasma that blasts the alien away from the shuttle at the end \nof the movie is actually just tons of water pouring over the camera.\n    * 20th Century Fox Studios almost did not allow the &quot;space jockey&quot;, or the \ngiant alien pilot, to be in the film. This was because, at the time, props for \nmovies weren&amp;#039;t so large.\n    * According to &amp;#039;Ian Holm&amp;#039; , Ash&amp;#039;s head contained spaghetti, cheap caviar and \nonion rings.\n    * Yaphet Kotto (Parker) actually picked fights with Bolaji Badejo who played \nthe Alien, in order to help his onscreen hatred of the creature.\n    * Bolaji Badejo beat Peter Mayhew to the part of the alien.\n    * Copywriter Barbara Gips came up with the famed tagline: &quot;In space, no one \ncan hear you scream.&quot;\n    * The engines of the Narcissus coming to life was created by having water \npour out of showers with strong arc lights around it. This gave the illusion \nthat it was plasma.\n    * Bolaji Badejo who plays the Alien in the movie was a graphic artist who \nwas discovered at a pub by one of the casting directors. Being a Masai he was \nabout 7 feet tall with thin arms - just what they needed to fit into the Alien \ncostume. He was sent for Tai Chi and Mime classes to learn how to slow down his \nmovements. A special swing had to be constructed for him to sit down during \nfilming as he could not sit down on a regular chair once he was suited up \nbecause of the Alien&amp;#039;s tail.\n    * The slime used on the Alien was K-Y jelly.\n    * Director Trademark: [Ridley Scott] [mothers] The Nostromo&amp;#039;s computer is \nnamed &quot;Mother&quot;. The incubation of the alien has also been interpreted as a \nmetaphor for pregnancy.\n    * During the opening sequence, as the camera wanders around the corridors of \nthe Nostromo, we can clearly see a Krups coffee grinder mounted to a wall; this \nis the same model that became the &quot;Mr. Fusion&quot; in Back to the Future (1985).\n    * Many producers have professional &quot;readers&quot; that read and summarize scripts \nfor them. The reader in this case summarized it as &quot;It&amp;#039;s like Jaws (1975), but \nin space.&quot;\n    * Roger Dicken, who designed and operated the &quot;face hugger&quot; and the &quot;chest \nburster,&quot; had originally wanted the latter to pull itself out of Kane&amp;#039;s torso \nwith its own little hands, a sequence he felt would have produced a much more \nhorrifying effect than the gratuitous blood and guts in the release print.\n    * The thin layer of mist that &quot;notified the eggs&quot; was made possible using a \npulsating laser and smoke, borrowed from the band The Who.\n    * A lawsuit by A.E. van Vogt, claiming plagiarism of his 1939 story &quot;Discord \nin Scarlet&quot; (which he had also incorporated in the 1950 novel &quot;Voyage of the \nSpace Beagle&quot;), was settled out of court.\n    * Potential directors, who either were considered by the studio or wanted to \ndirect, included Robert Aldrich, Peter Yates, Jack Clayton, &amp;#039;Dan O&amp;#039;Bannon&amp;#039; and \nWalter Hill.\n    * The inside of the &quot;eggs&quot; as seen by Kane was composed of real organic \nmaterial. Director Ridley Scott used cattle hearts and stomachs. The tail of the \n&quot;face hugger&quot; was sheep intestine.\n    * Bill Paterson turned down a part.\n    * When casting the role of Ripley, Ridley Scott invited several women from \nthe production office to watch screen tests, and thus gain a female perspective. \nThe women were unanimously impressed with then-unknown actress Sigourney Weaver, \nwhose screen presence they compared to Jane Fonda&amp;#039;s.\n    * Ridley Scott cites three films as the shaping influences on his movie: \nStar Wars (1977) and 2001: A Space Odyssey (1968) for their depiction of outer \nspace, and Tobe Hooper&amp;#039;s The Texas Chain Saw Massacre (1974) (1974) for its \ntreatment of horror.\n    * Shredded condoms were used to create tendons of the beast&amp;#039;s ferocious jaws\n    * Entertainment Weekly voted this as the third scariest film of all time.\n    * While the crew is eating, if you freeze the frame, you can clearly see the \n&quot;Weyland-Yutani&quot; brand on the can Kane is drinking from.\n    * The chest bursting scene was considered the second scariest movie moment \nof all time on Bravo&amp;#039;s _&quot;100 Scariest Movie Moments, The&quot; (2004)_ .\n    * A green monitor visible behind Ripley while the crew discusses Kane&amp;#039;s \ncondition outside the kitchen shows nonsense characters as well as the word \n&quot;Giler&quot;--obviously a nod to producer David Giler.\n    * Ridley Scott stated that in casting the role of Ripley, it ultimately came \ndown to Sigourney Weaver and Meryl Streep. The two actresses had been \nschoolmates at Yale.\n-------------------------------------------------------------------------------\n                                 Personal Info\n-------------------------------------------------------------------------------\nMy releases so far... personal rips from original DVDs, looking for quality.\nWhenever there&amp;#039;s an AC3 file, there&amp;#039;s 99% possibilities this is the directly\nripped audio track from the DVD, untouched.\nThey&amp;#039;re usually uploaded in TPB, Mininova and TorrentBox, but feel free to share \nthem on edonkey networks or in any way you want.  Spread the word.\nIf there&amp;#039;s demand (and if it&amp;#039;s possible) I can upload seperate audio tracks for\ndubbings in movies whose DVDs contains them.\n- Timerider: The Adventure of Lyle Swann (DVDRip Dual Spanish-English) (1,4Gb)\n  AVI/MP3, Dual English-Spanish, no subs\n- The Yakuza (Sidney Pollack, 1974) (DVDRip Dual Eng-Esp) (1,3Gb)\n  AVI/AC3, Dual English-Spanish, subpack including multiple subtitles\n- Dracula&amp;#039;s Daughter (Lambert Hillyer, 1936, DUal-Multisubs) (700Mb)\n  H264/AAC in Matroska container, Dual Eng-ESP, subs ENG-ESP-ITA-POR\n- Dracula (George Melford, 1931, Spanish Audio) (1,4Gb)\n  H264/AC3 in Matroska container, ESP audio, subs ENG-ESP-ITA-POR-CRO\n- Queen Christina (Rouben Mamoulian, 1933, Dual-Multisubs) (1,45Gb)\n  H.264/AC3/AAC in Matroska container, ENG-ESP Audio and subs,\n  also enclosed a subpack with multiple subs\n- Poltergeist (25th anniversary-WideScreen) (Tobe Hooper, 1982) (Dual Multisubs)\n  H.264/AC3 in Matroska container, ENG-ESP Audio and subs,\n  also enclosed a subpack with multiple subs\n- The Spy Who Came In From The Cold (Martin Ritt, 1965) (Dual Multisubs)\n  H.264/AAC in Matroska container, Eng-Esp audio and subs,\n  also enclosed a subpack with multiple subs\n- Someone Behind The Door (Nicolas Gessner, 1971) (Dual MultiSubs)\n  H.264/AC3 in Matroska container, Eng-Esp audio and Subs,\n  also enclosed a subpack with multiple subs\n- The Mark Of Zorro (Rouben Mamoulian, 1933) (Dual Eng-Esp\n  H.264/AC3 in Matroska container, Eng-Esp audio and Subs.  Spanish dub is       \n  LATIN SPANISH\n- Knife In The Water (NÃ‘z w wodzie) (Roman Polanski, 1962) (Polish-Spanish)\n  H.264/AC3.  Original Polish audio and spanish dub.  Subbed in english and   \n  spanish.\n- Alien (Virtual Workprint) (Ridley Scott, 1979)\n  XVID/MP3.  Audio in English 2.0.  No subs\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:be6644b73f37cc7b235dfbdd6611de4b3c6ab4e0","amp;dn":"Alien+%28Virtual+Workprint%29+%28FANEDIT%29+%28FIXED%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6644b73f37cc7b235dfbdd6611de4b3c6ab4e0","infoHashBuffer":{"type":"Buffer","data":[190,102,68,183,63,55,204,123,35,93,251,221,102,17,222,75,60,106,180,224]},"announce":[],"urlList":[]}}