{"title":"The.X.Files.S02E25.Anasazi.DVDRip.XVID-neocon80.avi","uid":4250415,"size":367120384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be787ad6ee1fde06cc1717d0e7b801ed3ba7719d&amp;dn=The.X.Files.S02E25.Anasazi.DVDRip.XVID-neocon80.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"neocon80","files":1,"time":1213981744,"description":"&quot;Anasazi&quot; is the second season finale of the television series The X-Files.\n\nIn New Mexico, an earthquake occurs near the Navajo Nation. A young man on a motorcycle ride finds something buried in the dirt in a canyon as well as a corpse that looks alien. The boy&amp;#039;s grandfather advises him that the body should be returned, for &quot;they will be coming.&quot;\n\nElsewhere, a computer hacker is stunned to learn he has gained access to the Defense Department&amp;#039;s secure website, and he begins downloading files to a digital tape. This sets in motion a series of international phone calls concerning the &quot;MJ documents,&quot; culminating with a call to the Cigarette Smoking Man, which he calls &quot;the phone call I never wanted to get.&quot;\n\nMulder has been sick and not sleeping and is not in the mood when the Lone Gunmen arrive at his apartment. They claim that they are being followed by a black ops unit looking for the computer hacker, named Kenneth Soona, a.k.a. &quot;The Thinker.&quot; The Thinker requests a late-night meeting with Mulder, where he gives him the copy of the original DOD UFO intelligence files.\n\nMulder tries the tape on his computer, but becomes upset when it appears to be gibberish. Scully recognizes it as Navajo, and believes it is encoded. Mulder is questioned by Skinner as to whether or not he is in receipt of the files, but Mulder hauls off and slugs him.\n\nScully is called to a disciplinary meeting to address Mulder&amp;#039;s increasingly bizarre and violent behavior. There, she lies about the files and learns that both she and Mulder are threatened with termination from the FBI. She goes to see Mulder, who is still delirious and sick. He says he can&amp;#039;t remember why he hit Skinner, and tries to summon X.\n\nAt his home on Martha&amp;#039;s Vineyard, William Mulder receives a visitor - the Cigarette Smoking Man. CSM tells him that Mulder has the files, and that they will have to be recovered. Mulder expresses concerns because his name appears in the MJ files. When William Mulder asks him his son will be killed, the Smoking Man replies, &quot;I&amp;#039;ve protected him this long, haven&amp;#039;t I?&quot;\n\nScully meets with a representative of the Navajo nation who suggests that a code-talker would be needed to decrypt the documents. She does, however, recognize two modern words - &quot;vaccination&quot; and &quot;merchandise.&quot;\n\nMulder awaits contact from X, but is drawn away by a phone call from his father who asks him to come home immediately.\n\nScully goes to Mulder&amp;#039;s apartment, where she notices an unmarked truck servicing the water main to the building. Inside the apartment, she is shot at through the window. The bullet grazes her forehead.\n\nMulder arrives at his father&amp;#039;s house and finds his father extremely upset. William Mulder praises his son for being his own man, and tells him that he is going to learn things that will bring greater truths to light. When Mulder asks what things his father is referring to, William Mulder says, &quot;the merchandise.&quot; He excuses himself to use the bathroom.\n\nAs Mulder&amp;#039;s father goes into the bathroom, he is shot by Alex Krycek, who has been lying in wait. Mulder hears the gunshot and rushes to his father&amp;#039;s side. With his last breath, William Mulder asks Fox to &quot;forgive me.&quot;\n\nMulder calls Scully and tells her that his father is dead. She tells him to come to her apartment and she puts him to bed when he arrives. Mulder awakens the next morning to discover that Scully has taken his gun. He calls her and angrily accuses her of spying on him. She says she took his gun to ballistics to prove he did not kill his father. Mulder tells her, &quot;You have my files, and you have my gun. Don&amp;#039;t ask me for my trust.&quot;\n\nMulder goes back to his apartment at night and spots Krycek outside. The two men struggle, and Mulder gets Krycek&amp;#039;s gun. He is about to kill him, but Scully arrives and tells Mulder to stop. She is forced to shoot him to prevent him from killing Krycek.\n\nMulder wakes up three days later in New Mexico. Scully is there, along with the old man from the teaser, whose name is revealed to be Albert Hosteen, a WWII code-talker. Scully says the water in Mulder&amp;#039;s building had been doped with LSD to bring on his behavior, and that killing Krycek with his gun would have linked Mulder to his father&amp;#039;s murder. Albert tells Mulder he had an omen of Mulder&amp;#039;s arrival, and he has something Mulder needs to see.\n\nAlbert tells Mulder about the Anasazi indians, a tribe who vanished without a trace hundreds of years ago. Albert says the truth is &quot;nothing disappears without a trace,&quot; and that the tribe was abducted &quot;by visitors who come here still.&quot; Albert&amp;#039;s grandson takes Mulder out to the canyon and reveals what he found - a train refrigeration car buried in the earth. Mulder gets a call from the CSM, who warns him that if he exposes the MJ files he will also expose his father&amp;#039;s involvement in the project. The call is traced, and CSM and a group of soldiers take off in helicopters.\n\nMulder goes into the car and finds mounds of bodies like the one from the teaser. Scully calls him to say that both her name and Duane Barry&amp;#039;s appear in the files involving a test. Mulder thinks the bodies in the car are alien...until he sees one has a smallpox vaccination scar. &quot;Oh my God, Scully...what have they done?&quot; he asks before the door to the car closes from above.\n\nThe Cigarette Smoking Man has arrived and asks Albert&amp;#039;s grandson where Mulder is. The soldiers search the boxcar and say that Mulder is gone, vanished without a trace. CSM angrily insists that &quot;nothing vanishes without a trace!&quot; and orders the soldiers to burn the boxcar. They drop an incendiary bomb into the car and depart in helicopters as it explodes, flames leaping out of the car, burning the bodies and possibly Mulder inside...\n\nTO BE CONTINUED\n\nSeason 2\nEpisode 25\nOriginal airdate............May 19, 1995\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0751074/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0751074/&lt;/a&gt;\n\nStarring\nDavid Duchovny..............Fox Mulder\nGillian Anderson............Dana Scully\nPeter Donat.................William Mulder\nFloyd &amp;#039;Red Crow&amp;#039; Westerman..Albert Hosteen\nNicholas Lea................Alex Krycek\nWilliam B. Davis............Cigarette Smoking Man\nMitch Pileggi...............Walter Skinner\nDakota House................Eric Hosteen\n\nAUDiO.........[ MP3 48000Hz 137 kb/s ABR (2 chnls)\nLANGUAGE......[ English/Navajo\nSUBS..........[ English \nViDEO.........[ 930 kbps XviD 23.9 FPS\nRESOLUTiON....[ 528 x 400\nDAR...........[ 1.320\nQUALiTY FRAME.[ 0.184\nSiZE..........[ 350 MB\nSOURCE........[ NTSC DVD\nDURATiON......[ 45mins 15secs\n\nBROUGHT TO YOU BY NEOCON80 OF THE KINYAA&amp;#039;AANII CLAN\t\n","torrent":{"xt":"urn:btih:be787ad6ee1fde06cc1717d0e7b801ed3ba7719d","amp;dn":"The.X.Files.S02E25.Anasazi.DVDRip.XVID-neocon80.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be787ad6ee1fde06cc1717d0e7b801ed3ba7719d","infoHashBuffer":{"type":"Buffer","data":[190,120,122,214,238,31,222,6,204,23,23,208,231,184,1,237,59,167,113,157]},"announce":[],"urlList":[]}}