{"title":"Orin Meditations -  Transforming with Divine Will Part I","uid":4033629,"size":108946737,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:becccdba9dc3a0b34fc3aba2387ff67a43070510&amp;dn=Orin+Meditations+-++Transforming+with+Divine+Will+Part+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SuperManny","files":15,"time":1203288808,"description":"Meditations by Orin and Sanaya Roman\n\nThe Millennium Journeys by Orin\n Transforming with Divine Will Part I\n &lt;a href=&quot;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm050d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/db/dbstore/description.php?prodno=mm050d&lt;/a&gt;\n\nProgram 1  Preparing for Divine Will ~ Receive transmissions from a very high being to prepare you for direct contact with the seven Great Ones who transmit Divine Will.\n\nProgram 2 Contacting Divine Will ~ Contact each of the Great Ones who transmit Divine Will to harmonize with their patterns of light, color, sound, tones, and subtle energies.\n\nSide 3 The Will to Initiate ~ Awakening New Consciousness  Blend with this Great One who initiates expansions of consciousness, so you can receive insights and revelations, and initiate activities that are in alignment with the divine plan of your life.\n\nProgram 4 The Will to Unify ~ Developing Vision Merge with this Great One who brings you the gift of clear vision through knowing what is to be loved. Bring unity to your personality, soul, and spirit. Increase your ability to see your soul, the souls of others, and the beings of light who guide humanity.\n\nProgram 5 The Will to Evolve ~ Becoming Wise Blend with this Great One and strengthen your ability to evolve both your consciousness and all the forms and circumstances in your life. Increase your ability to express the creative intelligence of your soul to create your highest future.\n\nProgram 6 The Will to Harmonize ~ Deepening Intuition This Great One transmits the illumined will that releases limitations. Working with this Being can help you bring harmony to areas of conflict and expand your ability to create art, music, and beauty in all forms. It is the basis of the intuition.\n\t\t\nProgram 7 The Will to Act ~ Achieving Liberation Join with this Great One and with the Solar Angel of the mind to align your higher mind with your everyday, concrete mind. Your mind can then fulfill its purpose of being a channel for the inflow of higher mind energy and your personality can become a pure channel for Divine Will, leading to liberation.\n\nProgram 8 The Will to Cause ~ Embodying High Ideals The transmissions from this Great One cause the mind of God to be known, which appear in your mind as ideals that you live by. Live by the ideals of your soul, which bring you love, freedom, and enlightenment. This Will brings the ability to release personality desire, endurance, and detachment.\n\nProgram 9 The Will to Express ~ Creating Divinity in Form This Being makes the work of the other Great Ones appear on the physical plane in a rhythmic, orderly way. It works with the devas and forces that manifest forms. Draw in its qualities of strength, perseverance, courage, self-reliance, steadfastness, care in details, and precision in creating form.\n\nProgram 10 Manifesting with Divine Will ~ Work with all seven qualities of Divine Will to manifest something important in your life.\n\nProgram 11 Creating Ideal Relationships ~ Draw in the seven qualities of Divine Will to transform a special relationship, or all your relationships at once as you align them with Divine Will.\n\nProgram 12 Transmitting Divine Will ~ Absorb and then transmit the qualities of Divine Will to your life, to your loved ones, to the animal, plant, and mineral kingdoms, and to whatever you choose. ","torrent":{"xt":"urn:btih:becccdba9dc3a0b34fc3aba2387ff67a43070510","amp;dn":"Orin+Meditations+-++Transforming+with+Divine+Will+Part+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becccdba9dc3a0b34fc3aba2387ff67a43070510","infoHashBuffer":{"type":"Buffer","data":[190,204,205,186,157,195,160,179,79,195,171,162,56,127,246,122,67,7,5,16]},"announce":[],"urlList":[]}}