{"title":"The Boomtown Rats","uid":4041920,"size":731286563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf6f18ae96840ad841c8b95688585c25d1d0f71e&amp;dn=The+Boomtown+Rats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ekv2000","files":80,"time":1203718101,"description":"Boomtown Rats is one of those bands that comes from time to time and somehow not only make a big impact but also changes the world completely and the minds of people. Boomtown Rats did it thru their members, especially singer Bob Geldof and his work uniting the music world into two big shows called Live Aid. For months prior and after the shows people and media spoke about starvation in Africa, especially in Ethiopia at that time.\n\nSecond thing this band will be remembered for is the by some controversial song &quot;I don&amp;#039;t like Mondays&quot;. The song is about a San Diego girl Brenda Ann Spencer who one day took her the gun her father gave her for Christmas and thru the window in her home shot straight at the local school killing two people and wounded several kids during a period of 6 hours. Her only explanation for this was: &quot;I don&amp;#039;t like Mondays. This livens up the day.&quot;\n\nBoomtown Rats where not only this two things. Thats something most people missed. With Bob Geldof paranoid fear of big brother, Fingers unique piano and synth playing Crows senseless beating on the drums, Gery Cotts baroque influenced guitar playing, Garry Roberts never ending to be a punk guitars and Pete Briquettes humor and bass guitar gave this band a very unique sound. From the first punk style record &quot;The Boomtown Rats&quot; towards the last synth inspired &quot;In The Long Grass&quot; they gave us another UK number one &quot;Rat Trap&quot; several more UK top 10 like &quot;Someones looking at you&quot;, &quot;Like A Clockwork&quot; and &quot;Banana Republic&quot; together wits several more lesser but  just as good songs like &quot;Dave&quot;, &quot;Drag Me Down&quot; and &quot;Hold On Me&quot;\n\nHere are all 6 records made by them. ","torrent":{"xt":"urn:btih:bf6f18ae96840ad841c8b95688585c25d1d0f71e","amp;dn":"The+Boomtown+Rats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf6f18ae96840ad841c8b95688585c25d1d0f71e","infoHashBuffer":{"type":"Buffer","data":[191,111,24,174,150,132,10,216,65,200,185,86,136,88,92,37,209,208,247,30]},"announce":[],"urlList":[]}}