{"title":"Tim and Jeff Buckley JJJ Radio Special 1996","uid":4045884,"size":411269349,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf7fd947cbcd8a03b7a2433ca8e226b12f30075e&amp;dn=Tim+and+Jeff+Buckley+JJJ+Radio+Special+1996&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"somfatmtylm","files":26,"time":1203905949,"description":"This is a recording of a special JJJ Radio in Australia ran on the evening of 29th March 1996. I originally recorded it onto to cassette then onto CD at that time. The 3 CD set has been at my brother&amp;#039;s home while I roamed SE Asia and got into all sorts of trouble. It was the evening before Jeff&amp;#039;s last ever concert with the band with Mick, Mike and Matt. I attended the unlisted concert at Selinas on the 1st March 1996 and it was excellent running for over 3 hours as I remember. I thank Andrew for his DAT to CD of that concert but it has been lost. The scanned photos are from the T-shirt I still own as a gift from Christine in Canberra. You are both fondly remembered. As this was a once-off event, I have recorded it at 320Kbits and the original taping is in good stead considering the 2 transcriptions.\n\nHopefully, this will be fully available as a bittorrent on the 12th anniversary of that now famous concert at Selinas. I had the pleasure to see Jeff at his first concert in Australia at The Metro, The Phoenician Club a week later in 1995. In 1996 I saw Jeff at the Enmore Theatre and Selinas. At The Phoenician and Selinas, I was about 2 metres from Jeff. On some recordings, my voice can be heard interjecting.\n\nLorn of Cambodia","torrent":{"xt":"urn:btih:bf7fd947cbcd8a03b7a2433ca8e226b12f30075e","amp;dn":"Tim+and+Jeff+Buckley+JJJ+Radio+Special+1996","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7fd947cbcd8a03b7a2433ca8e226b12f30075e","infoHashBuffer":{"type":"Buffer","data":[191,127,217,71,203,205,138,3,183,162,67,60,168,226,38,177,47,48,7,94]},"announce":[],"urlList":[]}}