{"title":"The Martix Of Evil (Alex Jones)","uid":3240861,"size":1348903052,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfbff74bbe56cfa9b3429f3e322bfabb6b3fec2c&amp;dn=The+Martix+Of+Evil+%28Alex+Jones%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"flux","files":2,"time":1095852399,"description":"MATRIX OF EVIL\n\nSome of the best minds in the country, coming from different sectors of the political spectrum combine in this film to expose an intricate web of deceitful wickness controlling America today.\n\nMatrix of Evil contains footage from speeches and conversations with Alex Jones, Congressman Ron Paul, Colonel Craig Roberts, Congresswoman Cynthia McKinney and Frank Morales which cover and include:\n\n-How the private banks control the military-industrial complex \n\n-Expert analyses of the USA Patriot Act and the latest police state developments\n\n-Globalist financial policies pushing America and the world into depression\n\n-How the neoconservative movement controlling the Bush administration is nothing more than a trojan horse for a big government agenda of ivory tower social engineers\n\n-The latest revelations concerning cashless society control grid, satellite tracking, cellphone tracking, DARPA surveillance, the end of Posse Comitatus, the federalization of local police and governments and much more..\n\n-Government-sponsored terrorism, gun control, political assasinations, Sept. 11th coverup \n\nMost importantly, Matrix of Evil is chock-full of solutions. All of the dynamic people interviewed for this film agreed that there is a massive awakening taking place in America to the criminal activities of the global elite.\n\nThis film is full of documents and archival news clips. Runtime over 2 hours.\n\n","torrent":{"xt":"urn:btih:bfbff74bbe56cfa9b3429f3e322bfabb6b3fec2c","amp;dn":"The+Martix+Of+Evil+%28Alex+Jones%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfbff74bbe56cfa9b3429f3e322bfabb6b3fec2c","infoHashBuffer":{"type":"Buffer","data":[191,191,247,75,190,86,207,169,179,66,159,62,50,43,250,187,107,63,236,44]},"announce":[],"urlList":[]}}