{"title":"Fergie featuring Will.I.Am - Fergalicious","uid":4242154,"size":139091972,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bfbff0921da65c8d89b853ad0e9cf5175868e71d&amp;dn=Fergie+featuring+Will.I.Am+-+Fergalicious&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"2nafish","files":1,"time":1213608542,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 kbps\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe video premiered on MTV on October 24, 2006 and premiered on Yahoo! Music on October 31, 2006. The music video was filmed in Hollywood, and directed by Fatima Robinson, who also directed the &quot;My Humps&quot; music video. will.i.am from the Black Eyed Peas also appears in the video, which features Fergie as Willy Wonka in a candy factory called &quot;Fergieland&quot; (the factory was nameless in the original book and both film versions). The video starts with the Oompa Loompas packaging pink and purple boxes of &quot;Fergalicious&quot; candy. In the beginning of the video, Fergie sings in a field of candy canes with the Oompa Loompas. Throughout the video, she wears a tan and khaki girl scout outfit (it could be noted that Fergie herself was a girl scout[citation needed]), sports a black one-piece swimsuit while lying in a pile of candy, (often in a kaleidoscope view) works out in a colorful gym flexing her biceps, sings in a room filled with lollipops and other candies while dressed like Shirley Temple, and pops out of a cake while wearing a tiny blue swimsuit with gems encrusted on the exterior. She then starts watching two women wrestle in ice cream before joining them at the end of the video.\n\nTowards the end of the video, Fergie opens and then plays a few notes on a Samsung K5 MP3 Player, giving it center focus in the screen; there then follow, interspersed in the remaining frames of the videos, shots of other characters in the video either listening to the player, presenting it to the camera with a big smile, or carefully handing the player to another extra.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bfbff0921da65c8d89b853ad0e9cf5175868e71d","amp;dn":"Fergie+featuring+Will.I.Am+-+Fergalicious","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfbff0921da65c8d89b853ad0e9cf5175868e71d","infoHashBuffer":{"type":"Buffer","data":[191,191,240,146,29,166,92,141,137,184,83,173,14,156,245,23,88,104,231,29]},"announce":[],"urlList":[]}}