{"title":"Run from the Cure - The Rick Simpson Story (opt. Finnish subtitl","uid":4267242,"size":2848755768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c0f1a9f359f503ec55adbdd9b88d0be034db751a&amp;dn=Run+from+the+Cure+-+The+Rick+Simpson+Story+%28opt.+Finnish+subtitl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kulmikastunne","files":2,"time":1214756015,"description":"Description from http://www.cannabisculture.com/articles/5169.html\n\nMy name is Rick Simpson. I have been providing people with Hemp Oil medicines, at no cost, for about three years. The results have been nothing short of amazing. Throughout man&amp;#039;s history hemp has always been known as the most medicinal plant in the world. Even with this knowledge, hemp has always been used as a political and religious football. I want this knowledge out there for everyone to learn! Watch the documentary Run From The Cure to understand more about using cannabis as a cure for cancer and other medical problems!\n\nThe current restrictions against hemp were put in place and maintained, not because hemp is evil or harmful, but for big money to make more big money, while we suffer and die needlessly. Look at a proposal such as this; if we were allowed to grow hemp in our back yards and cure our own illnesses, what do you think the reaction of the pharmaceutical industry would be to such a plan?\n\nMany large pharmaceutical companies that still exist today sold hemp based medicines in the 1800&amp;#039;s and early 1900&amp;#039;s. They knew then what I have recently found out. Hemp oil if produced properly is a cure-all that the pharmaceutical industry can&amp;#039;t patent.","torrent":{"xt":"urn:btih:c0f1a9f359f503ec55adbdd9b88d0be034db751a","amp;dn":"Run+from+the+Cure+-+The+Rick+Simpson+Story+%28opt.+Finnish+subtitl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f1a9f359f503ec55adbdd9b88d0be034db751a","infoHashBuffer":{"type":"Buffer","data":[192,241,169,243,89,245,3,236,85,173,189,217,184,141,11,224,52,219,117,26]},"announce":[],"urlList":[]}}