{"title":"Fred Waring &amp;  The Pennsylvanians : Sentimental Journey","uid":4137684,"size":103945556,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c258114bfd9645319fecc20ee3bc666f5ff85064&amp;dn=Fred+Waring+%26++The+Pennsylvanians+%3A+Sentimental+Journey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mingy2","files":27,"time":1208343859,"description":"Sentimental Journey\n\n\n\nFor six decades, Fred Waring and his group, the Pennsylvanians, spread their smooth sound through-out the world. He sold millions of records and won the Congressional Gold Medal, the highest honor the U.S. government can bestow on a civilian. Often dubbed &quot;The Man Who Taught America To Sing,&quot; Waring was most famous for his love of choral music.\n\nHe started innocently enough with a troupe known as Waring&amp;#039;s Banjazztra in early &amp;#039;20s. The collision of theater with radio and phonographic records opened possibilities for entertainers. It was not long before Fred Waring became involved with show business using these forms of media. As the &amp;#039;20s progressed, the troupe became known as Waring&amp;#039;s Pennsylvanians.\n\nHis adaptation of chorus with the smart rhythms of the day, gave the vocal refrain a fresh face. Odd sounds, the rasp of Poley McClintock, the sweet hummingbird-like sounds the three Waring girls, and great musicians made up this unique show unit. He made numerous records until the inevitable clash of radio and recorded music caused copyright problems in the smaller market radio stations. Since Waring&amp;#039;s livelihood depended heavily on both media, he lobbied hard for broadcasting reforms so the authors of recorded music would received fair compensation for their work.\n\nJust as the situation was being resolved, Waring went on a European tour. It was a well managed show. They had lighting effects, dazzling theatrics, and of course, great music. His fame increased.\n\nIn the &amp;#039;40s, the Waring Glee Club superceded the Pennsylvanians, and became an act unto its own. It&amp;#039;s interesting to note Waring&amp;#039;s own Alma Mater Penn State turned away his bid for the president of its own Glee Club. Today, Waring is one of Penn State&amp;#039;s distinguished alumni.\n\nHe continued to be the showman extraordinare, and a successful entrepreneur. He was the host of several radio shows and &quot;The Fred Waring Show,&quot; which ran from 1949 to 1954. In addition to performances by his orchestra and large chorus, the show included dancing, sketches, and interpretations of fairy tales. He also showcased a line of appliances, most notably the Waring Blender. \n\n\n\n\nAin&amp;#039;t Misbehavin&amp;#039;\nApril Showers\nBallynure Ballad\nCountry Style\nHere I&amp;#039;ll Stay\nHit The Road To Dreamland\nI Can&amp;#039;t Give You Anything But Love\nI Feel A Song Comin&amp;#039; On\nI Hear Music\nI Only Have Eyes For You\nIt&amp;#039;s Only A Paper Moon\nJapanese Sandman\nMoonlight And Roses\nRiders In The Sky\nRoumanian Rhapsody\nRunnin&amp;#039; Wild\nSentimental Journey\nSleep\nSomebody Loves Me\nSomeone To Watch Over Me\nTemptation\nThe Continental\nWhat Makes The Sunset","torrent":{"xt":"urn:btih:c258114bfd9645319fecc20ee3bc666f5ff85064","amp;dn":"Fred+Waring+%26++The+Pennsylvanians+%3A+Sentimental+Journey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c258114bfd9645319fecc20ee3bc666f5ff85064","infoHashBuffer":{"type":"Buffer","data":[194,88,17,75,253,150,69,49,159,236,194,14,227,188,102,111,95,248,80,100]},"announce":[],"urlList":[]}}