{"title":"The Jesus Papers [Mook&amp;Bee]","uid":4058422,"size":354075714,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c273610626e2e029cbc5d3887c34ece325bdcbdc&amp;dn=The+Jesus+Papers+%5BMook%26Bee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rh128592","files":1,"time":1204483115,"description":"TITLE: The Jesus Papers- The Hidden History of Jesus \n\nBOOK: http://www.amazon.com/Jesus-Papers-Exposing-Greatest-Cover-Up/dp/0060827130\n\nFORMAT: MP3 (DRM stripped from WMA file hence the fair audio quality).\n\nSUMMARY:\n What if everything you think you know about Jesus is wrong? In The Jesus Papers, Michael Baigent reveals the truth about Jesus&amp;#039;s life and crucifixion. Despite -- or rather because of -- all the celebration and veneration that have surrounded the figure of Jesus for centuries, Baigent asserts that Jesus and the circumstances leading to his death have been heavily mythologized.\n\nAs a religious historian and a leading expert in the field of arcane knowledge, Baigent has unequaled access to hidden archives, secret societies, Masonic records, and the private collections of antiquities traders and their moneyed clients. Using that access to full advantage, Baigent explores the religious and political climate in which Jesus was born and raised, examining not only the conflicts between the Romans and the Jews, but the strife within the different factions of the Jewish Zealot movement. He chronicles the migrations of Jesus&amp;#039;s family, his subsequent exposure to other cultures, and the events, teachings, and influences that were most likely to have shaped his early years. Baigent also uncovers the inconsistencies and biases in the accounts of the major historians of Jesus&amp;#039;s time, including Josephus, Pliny, and Tacitus. The enduring influence of these accounts in forming our most common conceptions of Jesus reveals that spin is not a new phenomenon.\n\nTaking us back to sites that over the last twenty years he has meticulously explored, studied, and in some instances excavated for the first time, Baigent provides a detailed account of his groundbreaking discoveries, including many never-before-seen photos. The evidence he has uncovered has lead him to make shocking new assertions that threaten the conventional account of Jesus&amp;#039;s life and death and shake the very foundation of Western thought, based as it is upon the assumption of Jesus&amp;#039;s divinity. Ultimately, his investigation raises the hope that we may gain a new understanding of Jesus.\n\nCheers,\nMook &amp; Bee\n\nPS: If you enjoy this book, pick up Holy Blood, Holy Grail.  It&amp;#039;s a tedious read but far more comprehensive.","torrent":{"xt":"urn:btih:c273610626e2e029cbc5d3887c34ece325bdcbdc","amp;dn":"The+Jesus+Papers+%5BMook%26Bee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c273610626e2e029cbc5d3887c34ece325bdcbdc","infoHashBuffer":{"type":"Buffer","data":[194,115,97,6,38,226,224,41,203,197,211,136,124,52,236,227,37,189,203,220]},"announce":[],"urlList":[]}}