{"title":"Kontrabanda - Gyv(a)i - 2CD (2007, Live)","uid":4133279,"size":557944546,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c293ed5125f2a9d1c39fb71acf69867a1657083a&amp;dn=Kontrabanda+-+Gyv%28a%29i+-+2CD+%282007%2C+Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zabadas","files":28,"time":1208135387,"description":"Kontrabanda (Contraband) is one of the most mysterious and unpredictable groups in Lithuanian scene. It was created in about 1990. Since 1993 it recorded six albums, but only one of them (Bludas ? The Rampage; 1995, M.E.G.A. Records) was released ?legally?. All other albums were released in minimal number of copies by unofficial underground record businesses ? it came out later that none these businesses actually existed (Old Bones Records and others). \n\nThe geography of group?s concerts is also unusual ? from Gothenburg poetry festival to Somerfest of Conrad Adenauer fund in Berlin, form a bit illegal concerts in tiny villages of Lithuania, where the fans of Kontrabanda gathered from all over the country, to a concert of Jimi Hendrix jubilee in Moscow. In if you add that from 2002 the band for some reasons was called Rokfeleriai (precisely like that, in Lithuanian ? Rokfeleriai  but by no way The Rockefellers) and came back to its old name in 2006, that the first album of this group ends with monologue from Peter Handke?s play Publikumsbeschimpfung (Offending the Audience) and that a famous Lithuanian poet ? Gintaras Grajauskas ? sings, plays bass guitar and writes the song texts for this group, you will understand that it has kind of shade of Fluxus? \n\nIt would be hard to describe the music of this group in one or two words. If we speak about all the albums, while having in mind that most of them radically differs from each other, the term to describe the music of Kontrabanda can be ?fusion? ? or ?postmodern? if you like. The first three albums of the group might be called rhythm-and-blues ? or maybe simply blues-rock ? which was replayed in Eastern Europe and modified in Lithuanian style, spiced with frippic (Robert Fripp, King Crimson) guitar ? the latter played by one of the most professional Lithuanian guitarists Vilius Anceris. The albums, released in the name of Rokfeleriai, are more oriented towards bossa-nova, latino and funky music. All of them are joined together by original texts of Gintaras Grajauskas, sang only in Lithuanian. For foreign listeners, who want to understand what Kontrabanda is singing about, the group has special ?jazz-poetry? (or to be more precise - fusion-poetry) program, during which the translations of the texts are synchronically demonstrated on the screen. This program gained big success in Gothenburg poetry festival (2005).\n\n","torrent":{"xt":"urn:btih:c293ed5125f2a9d1c39fb71acf69867a1657083a","amp;dn":"Kontrabanda+-+Gyv%28a%29i+-+2CD+%282007%2C+Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c293ed5125f2a9d1c39fb71acf69867a1657083a","infoHashBuffer":{"type":"Buffer","data":[194,147,237,81,37,242,169,209,195,159,183,26,207,105,134,122,22,87,8,58]},"announce":[],"urlList":[]}}