{"title":"Bulgaria Total War","uid":4024539,"size":409525948,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:c3e0f166e5a0f12083869aba03f5a5fccf8fcf2a&amp;dn=Bulgaria+Total+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"groznii","files":3,"time":1202845965,"description":"Bulgaria: Total War is a mod for the computer game Medieval II: Total War of the Creative Assembly company, released on the 11th of November 2006 - being in development for whole 7 years and a result of the experience gained from games such as Shogun: Total War (13th of June 2000), Medieval: Total War (19th of August 2002) and Rome: Total War (22nd of September 2004). But keep in mind that the latter games were not unsuccessful experiments before the great ending! Every one of those games is unique with the age, where the game takes place, and many people also believe that the company loses by not further developing Rome: Total War, considered by many fans to be even more intriguing than Medieval II. \nWhat does the mod actually consist of - since Bulgaria has been almost always forgotten by the game developers, as it is also in this case, we decided to add it to Medieval II, i.e. to create a completely new faction - the tsardom (empire) of Bulgaria, starting in the year 1072 AD with the capital of Ohrid and under the leadership of Konstantin Bodin (a.k.a. tsar Petar III) and with the natural enemy of Byzantium. This is the time of the insurrection of Georgi Voiteh and Konstantin Bodin against the Byzantine dominion! In terms of history, their rebellion was suppressed, but now, thanks to the creators of this mod, we have the chance to transfer ourselves virtually into the past and lead the uprising to glory or defeat ourselves. \nBut this is not all - adding Bulgaria is not the only change in the mod. In Bulgaria: Total War are included also many other mods, correcting both the graphics and the gameplay, new names, provinces etc. have been added (including outside the Balkan region), so that, in the end, we could play not simply a new nation, but a new mod.\n\n &lt;a href=&quot;\nhttp://bgtw.hit.bg/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bgtw.hit.bg/&lt;/a&gt;","torrent":{"xt":"urn:btih:c3e0f166e5a0f12083869aba03f5a5fccf8fcf2a","amp;dn":"Bulgaria+Total+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3e0f166e5a0f12083869aba03f5a5fccf8fcf2a","infoHashBuffer":{"type":"Buffer","data":[195,224,241,102,229,160,241,32,131,134,154,186,3,245,165,252,207,143,207,42]},"announce":[],"urlList":[]}}