{"title":"Half-Life 2 DVD Retail-VENGEANCE","uid":3261067,"size":2676945274,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c3eaacc08ae7ca82080cb8ad6315e5757c3b102d&amp;dn=Half-Life+2+DVD+Retail-VENGEANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sotis","files":56,"time":1101863531,"description":"V e n g e a n c E  P r e s e n t S\n\nHalf-Life 2 DVD *Retail* (c) Valve/Sierra\n\nRelease Date  :  11-30-2004\nProtection  :  SecuROM/Steam\nFile Count    :  DVD=54x50mb\nGame Genre  :  Shooters\n\n*NOTES*\n\nVengeance presents yet another excellent release of the action-packed\nthriller Half-Life 2.\n\nThis time around, we have made a fully compatible installer for those\nwho did not wish to have their internet connection active while\ninstalling this game, or for those who had firewalled STEAM/VALVE servers.\n\nIn addition, we have also upgraded the emulator's capabilities and as a\nresult the game runs even FASTER than our previous release. As a result,\nyou can expect even better gameplay, and shorter loading times.\nThe emulator has been carefully profiled against Half-Life 2, and file\ndata throughput has been optimized even further. This brings the emulator\nto version 1.10. Most of the important emulator settings are configurable\nfor advanced users by using the steamemu.ini configuration file.\n\nAnd in addition to improved game performance, we have enabled our\nemulator to create cracked servers for Counter-Strike Source.  Thus,\nwhoever is running the game using the Vengeance emulator from this release\ncan create their own cracked servers for CS: Source, and also play on\nother cracked servers.\n\nPlease note that the previous release DOES work, if you have your internet\nconnection active and your firewalls off.\n\nInstall Notes (Please follow these instructions IN ORDER)\n\n1. Unpack the release with WinRAR or equivalent\n\n2. Burn with Nero Burning ROM, CDRWin or equivalent.\n\n3. *OPTIONAL STEP*\n\nDisconnect your computer from the internet if you do not\nwish any contact with the VALVE servers during the installation.\n\nThis WILL NOT alter or disable gameplay or any features, so do not worry\nif you have chosen to disconnect your internet.\n\n4. Run the autoplay, choose &quot;Install Half-Life 2&quot;, then follow the\ninstructions on-screen to install STEAM, and then Half-Life 2.\n\n*NOTE* You MUST install Counter-Strike Source as well or you will get an\nerror for the file hl2.ico1 in hl24.cab on CD4.\nThis is by fault of VALVE itself and this error is found on the\noriginal retail copies of both the cd version and dvd.\n\n5. After installation, depending on if your internet connection is active,\nSTEAM will ask you to create an account or login as an existing user.\n\nSimply close this window once you see it as you DO NOT need a STEAM\naccount to play this release, nor do you need to launch or logon to\nSteam.\n\nIt will also attempt to update the STEAM platform client, so just turn\non your firewall if you do not want to update the STEAM client.\n\nIf your internet was inactive during installation, once you reconnect it\nmay pop-up for you as well, so just close the window and turn on your\nfirewall only if you wish to avoid contact with STEAM at this point of\nthe installation.\n\nREMEMBER THIS UPDATE IS FOR THE STEAM CLIENT ONLY! IT IS NOT NECESSARY\nTO UPDATE. YOU DO NOT NEED INTERNET TO PLAY OUR HALF-LIFE 2.\n\nCONTINUE READING ENTIRE NFO FOR MORE INFORMATION.\n\n6. From the /VENGEANCE/HL2Installer/ directory on the DVD, double click the\nfile hl2install.exe.\n\nThis installer will automatically rename needed GCF files in the\nSteamApps directory on your HDD (which is normally done by STEAM when\ninstalling with an active internet connection).\n\nThe installer has now been modified to work offline, without any\ninteraction with the VALVE servers. So no worries about the installation\never being blocked or calling home.\n\nNext, the h2install.exe will automatically extract the necessary files\nto run Half-Life 2 to &quot;&lt;install directory&gt;SteamAppsUserHalf-Life 2&quot;.\n\nFinally, the hl2install.exe will render the game into full offline mode,\nmeaning, upon the first launch of the game, there will be no contact\nwith VALVE's master server or friends servers.\n\n*** SAVED GAMES TIP ******************************************\n\nYou can copy your save games to the following folder to\ncontinue playing them:\n\n&quot;&lt;install directory&gt;SteamAppsUserHalf-Life 2hl2SAVE&quot;\n\nAnd note that the &quot;User&quot; folder literally means User, it\nDOES NOT refer to any STEAM account name you previously used.\n\n**************************************************************\n\n*** REMINDER *************************************************\n\nRemember, you DO NOT need a STEAM account to play our release,\nnor do you need to have STEAM running when you do want to play.\n\n**************************************************************\n\n7. *OPTIONAL STEP*\n\nThis step is only for those who wish to play CS: Source online, to host\nor play on cracked servers generated by our emulator.\n\n*** IMPORTANT STEP *******************************************\n\nFrom the /VENGEANCE/ directory on the DVD, double click the\nfile &quot;Steam Online.reg&quot; to return the game to online mode.\n\nIf this step is not done, the game will remain in offline mode\nand Counter-Strike Source will only work for LAN games.\n\n**************************************************************\n\nFrom the /VENGEANCE/CSSInstaller/ directory on the DVD, double click\nthe file cssinstaller.exe.\n\nThis installer will similarly to hl2install.exe, rename the needed\nGCF files and extract necessary files to play Counter-Strike Source.\n\nCounter-Strike Source will be installed to\n&quot;&lt;install directory&gt;SteamAppsUserCounter-Strike Source&quot;.\n\nHowever, cssinstaller.exe will enable the emulator to play\nCounter-Strike Source!\n\nYou can create and join cracked servers by choosing the appropriate\naction while playing the game.\n\n8. --- Half-Life 2 ---\n\nTo play Half-Life 2 double click the &quot;Half-Life 2&quot; shortcut found on\nyour desktop.\n\n(Half-Life 2 will work in either OFFLINE or ONLINE mode - read below)\n\n--- Counter-Strike Source ---\n\nTo play Counter-Strike Source double click the &quot;Counter-Strike Source&quot;\nshortcut found on your desktop.\n\n(CS: Source is ONLY functional if you are in ONLINE mode and\nhave completed step 7 - read above and below)\n\n*** SHORTCUT NOTICE *******************************************\n\nOur installers will make shortcuts ONLY to the REAL location\nwhere windows believes the desktop is.  If you have played\naround with the desktop using TweakUI or other programs, you\nmay not see the shortcuts on your &quot;desktop&quot; which is NOT where\nwindows thinks the desktop actually is.  So, follow these\ninstructions to make your own shortcut:\n\nFor Half-Life 2:\n\n&quot;&lt;install dir&gt;SteamAppsUserHalf-Life 2hl2.exe&quot; -steamlocal\n\nFor Counter-Strike Source:\n\n&quot;&lt;install dir&gt;SteamAppsUserCounter-Strike Sourcehl2.exe&quot; -steamlocal -game cstrike\n\n&lt;install dir&gt; being wherever you installed the game obviously.\n\n*** OFFLINE / ONLINE MODE *************************************\n\n--- ONLINE ---\n\nFrom the /VENGEANCE/ directory on the DVD, double click the\nfile &quot;Steam Online.reg&quot; to put the game in ONLINE mode.\n\nMake sure your internet connection is active and the needed\nports to play CS: Source are open (or turn firewalls off).\n\n--- OFFLINE ---\n\nFrom the /VENGEANCE/ directory on the DVD, double click the\nfile &quot;Steam Offline.reg&quot; to put the game in OFFLINE mode.\n\n---------------------------------------------------------------\n\nThe game MUST be in ONLINE mode to play Counter-Strike Source\non cracked servers, or to host a cracked server, and you\nobviously must be connected to the internet.\n\nOFFLINE mode is for those who do not have a constant internet\nconnection or for those who do not want any contact with VALVE\nservers and want to play Half-Life 2.\n\nRemember that OFFLINE mode will disable Counter-Strike Source\nonline capabilities. So if you want to play online, follow\nthe instructions above to enable ONLINE mode.\n\nRemember, STEAM does NOT need to be running to play either\nHalf-Life 2, or Counter-Strike Source and you DO NOT need a\nSTEAM username/account.","torrent":{"xt":"urn:btih:c3eaacc08ae7ca82080cb8ad6315e5757c3b102d","amp;dn":"Half-Life+2+DVD+Retail-VENGEANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3eaacc08ae7ca82080cb8ad6315e5757c3b102d","infoHashBuffer":{"type":"Buffer","data":[195,234,172,192,138,231,202,130,8,12,184,173,99,21,229,117,124,59,16,45]},"announce":[],"urlList":[]}}