{"title":"Inextinguishable Fire (1969) - Harun Farocki","uid":4034055,"size":242912421,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:c45e6ea70cbb341b5540a6b6ffa25a684479b8d2&amp;dn=Inextinguishable+Fire+%281969%29+-+Harun+Farocki&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DR_Movies","files":4,"time":1203316578,"description":"MOVIE:\n\nGenre: Documentary / Politics\nDirector: Harun Farocki\nDuration: 22 mins\nYear: 1969\nCountry: West Germany\nLanguage: German\nIMDB: http://www.imdb.com/title/tt0063345/\nPlot:\n\nIT CONTAINS SPOILERS!!!!!!!!!!!!!!!!!!!!!!!\n\n&quot;When we show you pictures of napalm victims, you&amp;#039;ll shut your eyes. You&amp;#039;ll close your eyes to the pictures. Then you&amp;#039;ll close them to the memory. And then you&amp;#039;ll close your eyes to the facts.&quot; These words are spoken at the beginning of this agitprop film that can be viewed as a unique and remarkable development. Farocki refrains from making any sort of emotional appeal. His point of departure is the following: &quot;When napalm is burning, it is too late to extinguish it. You have to fight napalm where it is produced: in the factories.&quot; Resolutely, Farocki names names: the manufacturer is Dow Chemical, based in Midland, Michigan in the United States. Against backdrops suggesting the laboratories and offices of this corporation, the film proceeds to educate us with an austerity reminiscent of Jean Marie Straub. Farocki&amp;#039;s development unfolds: &quot;(1) A major corporation is like a construction set. It can be used to put together the whole world. (2) Because of the growing division of labor, many people no longer recognize the role they play in producing mass destruction. (3) That which is manufactured in the end is the product of the workers, students, and engineers.&quot; This last thesis is illustrated with an alarmingly clear image. The same actor, each time at a washroom sink, introduces himself as a worker, a student, an engineer. As an engineer, carrying a vacuum cleaner in one hand and a machine gun in the other, he says, &quot;I am an engineer and I work for an electrical corporation. The workers think we produce vacuum cleaners. The students think we make machine guns. This vacuum cleaner can be a valuable weapon. This machine gun can be a useful household appliance. What we produce is the product of the workers, students, and engineers.&quot; \n\n\nRELEASE:\n\nVideo Quality: VHSRiP\nVideo Codec: XViD 1.1.0 Final\nVideo Bitrate: 1387 Kbps\nAudio Codec: MP3\nAudio Bitrate: 90 Kbps\nResolution: 512x384\nAspect Ratio: Full Screen (4:3)\nFrame Rate: 29.970 FPS\nSize: 231 MB\nSubs: English Hardcoded\nExternal Subs: Brazillian Portuguese, Spanish, and Galego.\n\nThanks CiNEMAGROTESQUE for the ripping! Great job!","torrent":{"xt":"urn:btih:c45e6ea70cbb341b5540a6b6ffa25a684479b8d2","amp;dn":"Inextinguishable+Fire+%281969%29+-+Harun+Farocki","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45e6ea70cbb341b5540a6b6ffa25a684479b8d2","infoHashBuffer":{"type":"Buffer","data":[196,94,110,167,12,187,52,27,85,64,166,182,255,162,90,104,68,121,184,210]},"announce":[],"urlList":[]}}