{"title":"Run From The Cure - The Rick Simpson Story DVDR","uid":4055374,"size":2845243392,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4c3c387665f4d72d27cbaebd0e53ae27a3f4d3e&amp;dn=Run+From+The+Cure+-+The+Rick+Simpson+Story+DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bluecarvw","files":8,"time":1204342636,"description":"People all over the world are talking about RUN FROM THE CURE: The Rick Simpson Story\n\n\nHEMP OIL IS NOT THE SAME AS &quot;HEMP SEED OIL&quot;. Although hemp seed oil is extremely nutritious, it does not contain the high concentrations of THC needed to cure cancers.\n\nThe true story of hemp, as told by Rick Simpson, the man who cured cancer with hemp oil. Please visit www.phoenixtears.ca for a vast collection of hemp research and hidden truth about &quot;the miracle medicine&quot;!\n\nA FILM BY CHRISTIAN LAURETTE of AMHERST, NOVA SCOTIA, CANADA! \nThe overnight success of the video can only be deemed as ASTOUNDING\nand we are proud to have brought this information to the people of the world... \n...free of charge!!!\n\nAny other offer to sell copies is fraudulent, and will be punished by the fullest extent of the law. \n\nThis video was made to have for free, and we are only charging for the cost of copying and mailing these discs. All content on the DVD should be considered free to distribute without charge.\n \nThe material contained on the discs is not for resale by penalty of prosecution by the owner. Any sale of the DVD other than from the Official Website constitutes fraud.\n\nPlease feel free to promote this video for the good of all mankind - it seems the best things in life might really be free after all. - Christian Laurette\n\n","torrent":{"xt":"urn:btih:c4c3c387665f4d72d27cbaebd0e53ae27a3f4d3e","amp;dn":"Run+From+The+Cure+-+The+Rick+Simpson+Story+DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c3c387665f4d72d27cbaebd0e53ae27a3f4d3e","infoHashBuffer":{"type":"Buffer","data":[196,195,195,135,102,95,77,114,210,124,186,235,208,229,58,226,122,63,77,62]},"announce":[],"urlList":[]}}