{"title":"Thai Movie - Hotel Angel (Theptida Rong Rem, 1974) .iso","uid":4268372,"size":4308922368,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c580c1903a5d6360e86b5565f4a72afd2b4cca76&amp;dn=Thai+Movie+-+Hotel+Angel+%28Theptida+Rong+Rem%2C+1974%29+.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rawbear","files":1,"time":1214814957,"description":"Hotel Angel (Theptida Rong Ram)\nThai Movie (1974)\n\nLanguage: Thai\nSubtitles: English\n\nDVD\nRunning time 103 minutes\n\nDrama about a young woman who becomes involved in the sex trade in Bangkok\n\nDirected by Prince Chatrichalerm Yukol\nStarring Viyada Umarin, Sorapong Chatree, Sompop Benjatikul\n\nStory:\nAngel is one of Chatrichalerm Yukol&amp;#039;s earliest films, and it comes from a time when his works wore their social commentary on their sleeves. Angel or Hotel Angel is the story of a girl named Malee, played by Viyada Umarin.\n\nThe film opens during the Thai New Year, Songkran, in Chiang Mai. There is some excellent footage from this event, in which people splash water on one another. In northern city of Chiang Mai, people are shown wading out into the middle of the Ping River to get water and frolic.\n\nMalee meets her new boyfriend, who sweet talks her and convinces her to run away with him to Bangkok. They check into one of those motels that have curtains around the carport. The car pulls in, the curtain is drawn and the people get out to head upstairs, undercover, to their little love nest. Malee wakes up the next morning. The boyfriend is gone. She has no money. She&amp;#039;s been duped. If she can&amp;#039;t pay for the room, she must work it off. She protests, but a couple of slaps by the hotel&amp;#039;s pimp, Tone (a cool, smooth Sorapong Chatree), sets her straight. Violent as he is at times, Tone is actually a sweet guy - a pimp with a heart of gold. He&amp;#039;s kind of like Superman and Clark Kent. He fights to protect his girls, only he doesn&amp;#039;t take off his glasses to do so.\n\nMaking some money, Malee&amp;#039;s able to send some home to her Pa. Soon, Pa is building a new house. She&amp;#039;s pulling tricks in the love motel and the house goes up. She opens her bra. Quick cutaway. Pa opens the shutters on a new window. Some great editing during this sequence.\n\nShe&amp;#039;s told her dad that she&amp;#039;s making money as a seamstress, while in fact she&amp;#039;s only learning to be a seamstress, when she&amp;#039;s not working as a prostitute.\n\nMalee is the one the pimp calls when a girl is being difficult. One is a girl from her hometown. She&amp;#039;s stubborn and is beaten severly. She doesn&amp;#039;t listen to Malee.\n\nBack up in Chiang Mai, Pa invites the neighbors over. Their daughter is in Bangkok working as a &quot;seamstress&quot;, too. So why did she come home sick with syphllis and die? Pa is in denial.\n\nAfter a spectacular fight with a customer (some great action by Sorapong) and a smart-mouthed prostitute, there&amp;#039;s a police raid at the hotel. Malee is forced onto the streets. This is a major turning point for the film, and unfortunately it never really regains the momentum it had during the first half.\n\nBut it&amp;#039;s still really heavy on the message. Malee gradually comes to see that the life she has fallen into is not good. She&amp;#039;s in a difficult trap to get out of, but by making the right choices, it just might be possible to make it in this old world without selling your body. More choices are presented by a handsome stranger (Sompop Benjatikul). At first this character seems like a nice guy, but as more is revealed about him - he doesn&amp;#039;t work, he keeps borrowing money, he disappears for days at a time, etc. - he seems to be a first-class jerk, just like all the other men in the movie.\n\nIn addition to the fine performances, excellent direction and editing, this 1974 Thai film is chock full of retro goodness. For example, during that kick-ass fight scene in the hotel, shades of the Shaft theme can be heard. It&amp;#039;s the real thing in an age when new movies are trying so hard to be retro they simply fail\n\n\nMore info: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Hotel_Angel&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Hotel_Angel&lt;/a&gt;","torrent":{"xt":"urn:btih:c580c1903a5d6360e86b5565f4a72afd2b4cca76","amp;dn":"Thai+Movie+-+Hotel+Angel+%28Theptida+Rong+Rem%2C+1974%29+.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c580c1903a5d6360e86b5565f4a72afd2b4cca76","infoHashBuffer":{"type":"Buffer","data":[197,128,193,144,58,93,99,96,232,107,85,101,244,167,42,253,43,76,202,118]},"announce":[],"urlList":[]}}