{"title":"Joan Didion - 2005 - The year of magical thinking - DAISY-2006-g","uid":4043942,"size":169310557,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c584af7542411bc2ed640d7d6a6c981a68b498e7&amp;dn=Joan+Didion+-+2005+-+The+year+of+magical+thinking+-+DAISY-2006-g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"goodguy","files":31,"time":1203808879,"description":"Author:...........Joan Didion (born 1934)\nOriginal title:...The year of magical thinking (2005)\nNarrator:.........Kathleen Oldham, 2006\nAudio:............48 kBit/s, 22 kHz\nDuration:.........5 h 56 m\nType:.............DAISY, mp3\n\n\nAbout the author:\nDidion was born in Sacramento, California and graduated from the University of California, Berkeley in 1956 with a BA in English. Much of Didion&amp;#039;s writing draws from her life in California, particularly during the 1960s as the world in which she grew up &quot;began to seem remote.&quot; Her portrayals of conspiracy theorists, paranoiacs, and sociopaths are now considered part of the canon of American literature.[citation needed]\n\nShe adopted a culturally conservative stance; her early career being spent as a Goldwater conservative and writing incisive articles in William Buckley&amp;#039;s National Review. Perhaps as a reaction to Reagan whom she termed a faux conservative, or as a result of being closely aligned with progressive writers in the New York literary world in which she moved in the seventies, she abandoned her earlier leanings and moved toward the liberal tenets of the Democrats. Didion retains a conservative bent, though, sharply chronicling America after World War II with its endless search for privacy and fulfillment of individual dreams.\n\n\nAbout the book:\nThe Year of Magical Thinking (2005), by Joan Didion (b. 1934), is an account of the year following the death of the author&amp;#039;s husband John Gregory Dunne (1932-2003). Published by Knopf in October 2005, the book was immediately acclaimed as a classic in the genre of mourning literature. It won the National Book Award in November 2005 and was a finalist for the National Book Critics Circle Award[1] as well as the Pulitzer Prize for Biography/Autobiography.[2]\n\nThe narrative structure of the book parallels the mental re-living of a tragic event that is common to many experiences of grief. The outline of the story remains constant: Didion and her husband were returning home after a visit to their daughter Quintana Roo Dunne, then in a New York hospital battling a life-threatening illness. At dinner John collapses, is taken to the hospital, and pronounced dead. But with each replay of the event, the focus on certain emotional and physical aspects of the experience shifts. Didion also incorporates medical and psychological research on grief and illness into the book.\n\nDidion applies the iconic reportorial detachment for which she is known to her own experience of grieving; there are few expressions of raw emotion. Through observation and analysis of changes in her own behavior and abilities, she indirectly expresses the toll her grief is taking. She is haunted by questions concerning the medical details of her husband&amp;#039;s death, the possibility that he sensed it in advance, and how she might have made his remaining time more meaningful. Fleeting memories of events and persistent snippets of past conversations with John take on a new significance. Her daughter&amp;#039;s continuing health problems and hospitalizations further compound and interrupt the natural course of grief.\n\n\nAdditional sources: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Year_of_Magical_Thinking&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Year_of_Magical_Thinking&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Joan_Didion&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Joan_Didion&lt;/a&gt;","torrent":{"xt":"urn:btih:c584af7542411bc2ed640d7d6a6c981a68b498e7","amp;dn":"Joan+Didion+-+2005+-+The+year+of+magical+thinking+-+DAISY-2006-g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c584af7542411bc2ed640d7d6a6c981a68b498e7","infoHashBuffer":{"type":"Buffer","data":[197,132,175,117,66,65,27,194,237,100,13,125,106,108,152,26,104,180,152,231]},"announce":[],"urlList":[]}}