{"title":"Miami Vice: The Game","uid":4247137,"size":538003727,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c5f82031339be61bb49f26712bef942a9ab583d0&amp;dn=Miami+Vice%3A+The+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lobarotor","files":4,"time":1213834768,"description":"With its surplus of scenic locales, beautiful women, and cigarette boats, as well as that trademark silver Ferrari, being an undercover narcotics officer never seemed as fun and glamorous as in the seminally 1980s action drama Miami Vice. Director Michael Mann, who executive produced the original series, has taken the concept and updated it for a new feature film, which in turn prompted the development of Miami Vice: The Game for the PlayStation Portable. Though we can&amp;#039;t speak to how well it represents the movie (since the game&amp;#039;s release has preceded it), on its own, this is a slickly produced shooter with some dark edges and whose biggest offense is that it&amp;#039;s over too soon.\n\n\nWe get down, if the play calls for it, bud.\n\nMiami Vice: The Game puts you in the shoes of either Sonny Crockett or Ricardo Tubbs, two undercover narcotics officers working for the Miami-Dade Police Department. Since this is based on the 2006 movie and not the 1980s TV series, the characters are modeled after Colin Farrell and Jamie Foxx, though the voice actors who stand in for the stars, while total pros, don&amp;#039;t sound a whole lot like them. After you save an informant from a vengeful associate in the opening level, you begin climbing up the drug food chain, gaining a reputation on the street and taking down cartels dealing in weed, meth, and of course, coke. There&amp;#039;s a little double-crossing and a few portentous phone calls that go on during cutscenes, but Miami Vice is heavier on premise than it is on actual story, which is fine since it does such a great job with the atmosphere. The game takes itself quite seriously, just like the source material did, which is vital in keeping the game from coming off as a parody.\n\nThe locales you&amp;#039;ll visit range from slick and glamorous to seedy and hazy, and they include a neon-soaked South Beach nightclub, a trailer park turned meth factory, a sun-bleached waterfront, and more. It&amp;#039;s the attention to detail, though, that really sells Miami Vice--for example, the way your between-mission map looks like a nighttime helicopter flyby shot of downtown Miami or how the camera will shake when you sprint, as though it&amp;#039;s trying to keep up. The soundtrack reinforces the detached sense of cool with underplayed keyboards and a lonely, bluesy electric guitar. There are some snags, such as the repetitive and unrelenting shouting of enemies and how the lighting in some levels can make it hard to see enemies or your weapon&amp;#039;s laser sight, but this is a mostly great-looking game with an assertive sense of style.\n\nMost missions have you infiltrating a location, killing all of the enemies, recovering all of the drugs, and accomplishing one or two additional objectives. The missions are all completely linear and straightforward, with virtually no backtracking or exploration, and are essentially long strings of close-quarters firefights. The controls and the camera perspective are unashamedly copped from Resident Evil 4, which gives immediacy to the action. Since the game forces you to stop in your tracks to fire your weapon, it&amp;#039;s a good idea to make near-constant use of cover, which gives the action a rather methodical pace. There&amp;#039;s a decent amount of tension since it benefits you to get the drop on your enemies, but it&amp;#039;s all kind of easy, too. Even without body armor, you can take a whole lot more damage than any of your enemies, who aren&amp;#039;t particularly bright or aggressive in the first place. Health pickups are plentiful, as are checkpoints. Even still, the core action feels pretty tight and satisfying.\n\nIf that were all Miami Vice: The Game had to offer, though, it would get a little monotonous. Thankfully, the game breaks things up with several different minigames, the occasional boat chase, and a reputation system that rewards you for acting like a real tough guy. At the end of each mission, you&amp;#039;re given a reputation rating based on several different factors, such as which weapons you used, which outfit you wore, and how many first-aid kits you used. Your reputation determines which street dealers and drug barons will talk to you, and through these avenues you can sell off all of the drugs that you confiscated during your missions. There are nearly a dozen different street dealers throughout the game, and each deals in a different variety of products, including MDMA, weed, LSD, meth, PCP, and coke. There&amp;#039;s a little artificial economy built up around the street dealers, and prices for different drugs will fluctuate from day to day, so if you&amp;#039;re smart, it&amp;#039;s not hard to buy low and sell high. You&amp;#039;re limited to 16 in-game &quot;days&quot; between missions, and each visit to a street dealer uses up a day, so time management is important, too, lest you end up sitting on a pile of narcotics that you can&amp;#039;t unload until the end of the next mission.\n\nThe drug barons run things a little differently, with each one only dealing in one drug, though they also pay a much higher premium than the street dealers. Paying a visit to a drug baron is a two-step process that involves you convincing both his security staff and him that you&amp;#039;re on the level, which is played out through a minigame where you use either the D pad or the analog stick to keep a white line in the blue center of a multicolored bar, while a progress bar beneath it fills up. You can also affect your reputation at certain points by acting aggressive or diplomatic, which will either raise both your reputation and the minigame difficulty or lower them. The actual mechanic is really contrived, but there&amp;#039;s still good tension during these sequences as you get frisked by thugs and questioned by the drug baron, and the cinematic style in which they&amp;#039;re presented is very immersive.\n\n\nBeing deep cover can prove both fun and lucrative.\n\nDuring most missions, you can recover a FlashRAM containing encrypted data, which usually provides access to a new weapon upgrade or the location of a new drug baron, and you can attempt to hack into it at police headquarters between missions. The hacking minigame is really abstract and basically has you controlling a triangle that can emit shockwaves to destroy antagonistic cubes and collect rings of valuable data. The hacking minigame is highly stylized, and it can get pretty tough as you progress, with the cubes shooting data-stealing crosses at you after just a few levels, but more variety still would have been welcome. You also have an informant that you can pay off with confiscated drugs, and for the right price, he&amp;#039;ll tell you a lot of extremely valuable information about your next mission, such as how to disable security cameras and the locations of enemies, drugs, first-aid kits, and FlashRAMs. If you&amp;#039;re smart about your drug trade, the amount of product that you have to pay off your informant with is nominal, which makes this feature a little too useful, thus undercutting the difficulty in a game that&amp;#039;s already relatively easy.\n\nDespite its relative ease and short running time--you&amp;#039;ll probably be done with the game in less than six hours--Miami Vice: The Game feels really well put together. The presentation is authentic and consistently atmospheric, and the variety of the action goes a long way toward making you feel like a deep-cover vice cop. If such a concept sounds at all intriguing to you, and you can forgive the brevity, this is an easy game to like.","torrent":{"xt":"urn:btih:c5f82031339be61bb49f26712bef942a9ab583d0","amp;dn":"Miami+Vice%3A+The+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f82031339be61bb49f26712bef942a9ab583d0","infoHashBuffer":{"type":"Buffer","data":[197,248,32,49,51,155,230,27,180,159,38,113,43,239,148,42,154,181,131,208]},"announce":[],"urlList":[]}}