{"title":"SMF 2.0 Beta 3 Public","uid":4109099,"size":1959313,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c644a76f2c247b8d5362231fb3cfbf337e16dff5&amp;dn=SMF+2.0+Beta+3+Public&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"binkles","files":1,"time":1206964375,"description":"Simple Machines is extremely proud to announce the long awaited release of the first public beta of SMF 2.0.\n &lt;a href=&quot;\nhttp://download.simplemachines.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://download.simplemachines.org/&lt;/a&gt;\n\nSMF 2.0 has now been in development for over 18 months, and in beta with our Charter Members since August last year. Feature complete, and having undergone considerable testing and bug fixing, we are now ready to put it into the hands of the public for wider testing.\n\nImportantly, this is a beta - and the first public beta at that. We strongly recommend that you do not use this package on a production site as it will contain bugs and issues. In addition whilst we&amp;#039;ll do our best to support people running the beta our support team&amp;#039;s primary focus will remain 1.1 during this period - so please be patient if you do experience a problem. Also, we request you note the following caveats:    \n\n    * All existing mods and themes are almost certain not to work until their authors have an opportunity to rewrite them.\n    * The upgrader will do its best to upgrade previously installed themes. However, this is not fool proof and you are likely to need to tweak old themes and update them to take full advantage of SMF 2.0 functionality.\n    * Language packs for 1.1 will be out of date and need updating - this might take some time.\n    * Users who currently integrate SMF into their site using any of the non-standard SSI functions (Such as using the db_query function) will need to change their integrations to use the new query system in 2.0. More information on this can be found here.\n\nThe changes in this release from 1.1 are immense - and we can&amp;#039;t list them all here. We recommend you take a look at the changelog on the download page - some of the highlights include:    \n\n    * Database abstraction including support for PostgreSQL and SQLite\n    * Post and attachment moderation - setup through board permissions.\n    * Additional group management features such as group moderators and joinable and requestable groups\n    * Comprehensive user warning system.\n    * Paid subscriptions to allow people to make a payment with PayPal to get additional group access\n    * Personal message labeling system and new viewing options\n    * OpenID support - to enable users to login and register with their OpenID account\n    * Custom profile fields to enable admins to setup new profile fields in addition to the default\n    * WYSWIYG editor, to improve the user posting experience\n    * Ignore boards and ignore user functions - so users only see what they want to see\n    * Scheduled events and mail queuing systems to add additional functionality to the forum\n    * Admin and user logs to track who makes what changes to a user&amp;#039;s profile\n    * A moderation center to bring together all moderation functionality into one place for all people with moderation abilities\n\nThe download packages are the same as for 1.1 - simply choose the install or upgrade package depending on your requirements. If upgrading please, please remember to backup first. Please do not use this topic for support questions - use the dedicated 2.0 Support Board. Guides for installing and upgrading can be found on the Online Manual. Note that downgrading is not possible.\n\nOn a quick note to mod and theme authors, we are currently working through the templates to move towards more semantic HTML layout. Unfortunately we didn&amp;#039;t complete this in time for this beta, but this will make the next release, so please bear this future change in mind when looking at updating your mods and themes.\n\nFinally, we thank you for your patience and hope you enjoy using this software as much as we have enjoyed making it.\n &lt;a href=&quot;\nhttp://download.simplemachines.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://download.simplemachines.org/&lt;/a&gt;\n\nThank you,\n\nSimple Machines","torrent":{"xt":"urn:btih:c644a76f2c247b8d5362231fb3cfbf337e16dff5","amp;dn":"SMF+2.0+Beta+3+Public","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c644a76f2c247b8d5362231fb3cfbf337e16dff5","infoHashBuffer":{"type":"Buffer","data":[198,68,167,111,44,36,123,141,83,98,35,31,179,207,191,51,126,22,223,245]},"announce":[],"urlList":[]}}