{"title":"Johnny Liberty - Reclaiming Your Sovereign Citizenship 1995","uid":4051955,"size":1055445710,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c6c1ef863cbf0d2a588b2487c76b9ee1d9752bc6&amp;dn=Johnny+Liberty+-+Reclaiming+Your+Sovereign+Citizenship+1995&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bluecarvw","files":16,"time":1204206034,"description":"I know this is a little dated but the info is still very good.  Other info included also.\n\nJohnny Liberty - Reclaiming Your Sovereign Citizenship (The Granada Forum - May 25, 1995)\n\n\\\\\\\\\\\\\\&quot;Sovereignty is the KEY concept around which all political, economic and legal systems revolve\\\\\\\\\\\\\\&quot;. Until the Declaration of independence, the only Sovereigns were the King and the Pope. The first recourse the people had to the Sovereign authority was the Magna Carta in 1215. Sovereigns operate their commercial and business affairs through Trust structures. The Monarch (King and Queen) of England set up a Sovereign Trust out of which the British Empire came. All the Assetts and the Banks and the Parliaments were all subject to that Trust. When OUR country was set up, the Citizen was Sovereign. We the people, are the Parent, the overnment is the Child. If we are to remain Sovereign as a Nation, we must have Sovereign States, and without Sovereign Citizens, there is no Sovereign State.\n\nThe people behind the scenes, controlling the power structures throughout the world, are themselves Sovereign. If they weren\\\\\\\\\\\\\\&amp;#039;t Sovereign they would be subject to all the same rules and regulations as the rest of the people. There are different classes of Citizenship. What is the difference between a State Citizen, an American National or a Sui Juris Freeperson? The U.S. citizen did not exist until the 14th Amendment in 1868. Before that everyone was a citizen of one of the several States. The State Citizens held their land in Allodium (Free &amp; clear), and no one could take it away from them. \n\nThese people were \\\\\\\\\\\\\\&quot;KINGS\\\\\\\\\\\\\\&quot; in their own \\\\\\\\\\\\\\&quot;Castles\\\\\\\\\\\\\\&quot;. U.S. citizens did not have a right to a trial by jury until 1967. When you get a birth certificate you become property of the federal united states. You\\\\\\\\\\\\\\&amp;#039;re birth certifivate is transfered to the bureau of census, and the Dept. of Commerce and you are enrolled as a beneficiary of the federal reserve system and you become obligated to the national debt. The Social Security Number, Driver\\\\\\\\\\\\\\&amp;#039;s licenses, vehicle registration, marriage licences, incorporation papers, and business licenses are all adhesion contracts and each one gives up a little bit more of your rights. The Birth Certificates, John claims were transferred by Jimmy Carter over to the Federal Reserve system as collateral for the national debt.\n\nJohnny Liberty\\\\\\\\\\\\\\&amp;#039;s real name is John David Van Hove.\n\nA presentation at the Granada Forum on May 25, 1995.\n\nThe difference between the U.S.A. and the U.S.: http://www.gemworld.com/USAvsUS.htm\n\n\n\nNumber of files: 9\nSize: 3.67 GB\nRun time: 1 hour, 51 minutes\nFormat: DVD, NTSC, 4:3, 720x480, 30 fps\nSource: VHS\n","torrent":{"xt":"urn:btih:c6c1ef863cbf0d2a588b2487c76b9ee1d9752bc6","amp;dn":"Johnny+Liberty+-+Reclaiming+Your+Sovereign+Citizenship+1995","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6c1ef863cbf0d2a588b2487c76b9ee1d9752bc6","infoHashBuffer":{"type":"Buffer","data":[198,193,239,134,60,191,13,42,88,139,36,135,199,107,158,225,217,117,43,198]},"announce":[],"urlList":[]}}