{"title":"Jackie McLean - Jacknife[FLAC - LOSSLESS]","uid":4254726,"size":279352657,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6e293773135567840250b9a01def9d4d4622389&amp;dn=Jackie+McLean+-+Jacknife%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":14,"time":1214177735,"description":"FLAC files + COVERS\nRelease Date: Apr 12, 1966\n\n\nTrack Listing\n1. On The Nile\n2. Climax\n3. Soft Blue\n4. Jacknife\n5. Blue Fable\n\n\nIn a string of Blue Note albums during the 1960s, alto saxophonist Jackie McLean documented his efforts to incorporate elements of the Avant-garde with his own brand of mainstream jazz. Starting with Let Freedom Ring, McLean embraced modality and wasn?t sheepish to use honks and squeaks in his solos. This 1965 session, newly reissued as part of Blue Note?s Connoisseur series, showcases McLean?s exciting vision of jazz in all its glory.\nWith a rhythm section of Larry Willis, Larry Ridley and Jack DeJohnette, as well as two trumpeters, Charles Tolliver and Lee Morgan, McLean crafts an album full of urgency and intensity. McLean himself thrives on the modal structures of Tolliver?s ?On The Nile? and DeJohnette?s ?Climax,? producing fiery solos that illustrate his vivid imagination as a soloist. He also contributes the well-thought out original ?Blue Fable? to the proceedings. Morgan makes his strongest impression on ?Blue Fable? and also plays on ?Climax? as well as his own tune, ?Soft Blue,? which comes off as a tad too conventional for this album. Tolliver trumps Morgan, though, with his writing as well as his unique improvisations, especially his dramatic thoughts on ?On The Nile? and his ability to match McLean?s fury on the title track.\nWillis?s solos are models of restraint and provide an excellent contrast to the three horn players. DeJohnette?s playing on his own composition particularly is an instructive example of a jazz drummer constantly building up and releasing tension, not unlike what Tony Williams did on McLean?s One Step Beyond.\nDuring the heyday of Blue Note, many fine sessions such as Jacknife did not see the light of day until many years later. So, while it?s admittedly not surprising that jazz of this calibre was not immediately released, it?s still a tad confounding that producer Alfred Lion could let this fine music linger in the vault.\n\n(Review from AllAboutJazz.com)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:c6e293773135567840250b9a01def9d4d4622389","amp;dn":"Jackie+McLean+-+Jacknife%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6e293773135567840250b9a01def9d4d4622389","infoHashBuffer":{"type":"Buffer","data":[198,226,147,119,49,53,86,120,64,37,11,154,1,222,249,212,212,98,35,137]},"announce":[],"urlList":[]}}