{"title":"Gringo.avi","uid":4031183,"size":733534208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c6fcf10bccd3b2aa56fc7427695f4380886106f1&amp;dn=Gringo.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcosau","files":1,"time":1203179475,"description":"Gringo Velho\nTÃƒÂ­tulo Original:Old Gringo\nGÃƒÂªnero:\tDrama, Aventura, HistÃƒÂ³ria\nDiretor: Luis Puenzo\nElenco: Jane Fonda , Gregory Peck\nDuraÃƒÂ§ÃƒÂ£o:119 min\nAno  \t1989\nOrigem  EUA\n\nSinopse  \t\n1913. Harriet Winslow (Jane Fonda, vencedora do Oscar por Amargo Regresso e Klute - O Passado Condena) ÃƒÂ© uma solteirona cansada do mundo de mentira no qual vive sua mÃƒÂ£e. Em busca de seu destino, deixa o paÃƒÂ­s para ser professora das crianÃƒÂ§as de uma rica famÃƒÂ­lia mexicana. \n\nNo MÃƒÂ©xico, conhece Bitter (Gregory Peck, Oscar por O Sol Ãƒ? para Todos e que estrelou sucessos como Moby Dick e A Princesa e o Plebeu), um famoso jornalista americano que abandonou tudo e agora quer lutar na revoluÃƒÂ§ÃƒÂ£o. Um grupo de revolucionÃƒÂ¡rios, liderados por Arroyo (Jimmy Smits, de Adoradores do Diabo e tambÃƒÂ©m astro da sÃƒÂ©rie de TV Nova York contra o Crime), se oferece para levÃƒÂ¡-la atÃƒÂ© a propriedade dos Miranda. Bitter junta-se a eles. TÃƒÂ£o logo chegam, Arroyo e seus homens dominam o lugar. Vivendo com eles, Harriet descobre novos valores, outra cultura e o amor que nunca encontrou. Baseado na novela Gringo Viejo, do premiado escritor mexicano Carlos Fuentes, o filme tem a direÃƒÂ§ÃƒÂ£o de Luis Puenzo (de A HistÃƒÂ³ria Oficial, ganhador do Oscar de Melhor Filme Estrangeiro), que tambÃƒÂ©m assina o roteiro ao lado de Aida Bortnik.\n\nUm ÃƒÂ©pico que mistura ficÃƒÂ§ÃƒÂ£o e realidade\n\nRodado no MÃƒÂ©xico, entre janeiro a abril de 1988, &quot;Old Gringo&quot; deveria ter sido lanÃƒÂ§ado pela Columbia nos EUA em dezembro do ano passado, a tempo de concorrer ao Oscar. Entretanto, devido a dificuldades de montagem e finalizaÃƒÂ§ÃƒÂ£o, o diretor Luiz Puenzo preferiu retardÃƒÂ¡-lo - ficando assim reservado para temporada 89 (estrÃƒÂ©ia dia 6 de outubro em 300 cinemas nos EUA, num sistema de lanÃƒÂ§amento que serÃƒÂ¡ ampliado a proporÃƒÂ§ÃƒÂ£o que obtenha maior repercussÃƒÂ£o). Em suas entrevistas, tanto Jane como o diretor Luiz Puenzo (argentino, diretor de &quot;A HistÃƒÂ³ria Oficial&quot;, que obteve 32 premiaÃƒÂ§ÃƒÂµes internacionais, inclusive o Oscar de melhor filme estrangeiro), insistiram em desmentir os maldosos comentÃƒÂ¡rios de que teriam vindo ao Brasil e Argentina para promover o filme - antes de sua estrÃƒÂ©ia nos EUA - por temer que o mesmo fracasse naquele territÃƒÂ³rio cinematogrÃƒÂ¡fico. Referindo-se aos elogios recebidos no ÃƒÂºltimo Festival de Cannes, o qual foi o filme da sessÃƒÂ£o de encerramento (na mesma ocasiÃƒÂ£o em que Gregory Peck, 71 anos, era homenageado especial), Puenzo e Jane afirmam que &quot;Old Gringo&quot; mesmo tendo uma forte porÃƒÂ§ÃƒÂ£o polÃƒÂ­tica - (foi adaptado do romance do mexicano Carlos Fuentes jÃƒÂ¡ editado no Brasil), tem condiÃƒÂ§ÃƒÂµes de emplacar boa bilheteria.\n\nCom seqÃƒÂ¼ÃƒÂªncias em que participaram centenas de extras, muita aÃƒÂ§ÃƒÂ£o durante pelo menos 40% de sua duraÃƒÂ§ÃƒÂ£o, revela no papel do General Tomas Arroyo um excelente ator, Jimmy Smiths, que embora jÃƒÂ¡ tenha atuado em alguns filmes exibidos no Brasil (&quot;Corrida Silenciosa&quot;, ao lado de Billy Crystal e Gregory Hines e &quot;Adoradores do Diabo&quot;, John Schelessinger) ÃƒÂ© ainda pouco conhecido do pÃƒÂºblico. Sua interpretaÃƒÂ§ÃƒÂ£o vigorosa, marcante, ÃƒÂ© um dos pontos altos do filme, que tem uma belÃƒÂ­ssima fotografia do argentino Felix Monti (o mesmo de &quot;A HistÃƒÂ³ria Oficial&quot; e tambÃƒÂ©m de &quot;O ExÃƒÂ­lio de Gardel&quot; e &quot;Sur&quot;, de Fernando Solanas) e uma trilha sonora de Lee \nHoldridge, com toques dignos de Miklos Rosza (misturando a Ennio Morricone) para encantar os que curtem as sound tracks.\n\n\nImagem: 544x304pixels\nAudio: \n\tTaxa de Bits: 128 kbps\n\tFormato: Lame MP3\nVÃƒÂ­deo:\n\tTaxa de Quadros: 25\n\tTaxa de Dados: 103 kbps\n\tCompactaÃƒÂ§ÃƒÂ£o: XvID\nTamanho:699 mb\n\n\n","torrent":{"xt":"urn:btih:c6fcf10bccd3b2aa56fc7427695f4380886106f1","amp;dn":"Gringo.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6fcf10bccd3b2aa56fc7427695f4380886106f1","infoHashBuffer":{"type":"Buffer","data":[198,252,241,11,204,211,178,170,86,252,116,39,105,95,67,128,136,97,6,241]},"announce":[],"urlList":[]}}