{"title":"Revenge Of The Nerds IV: Nerds in Love (1994) DVDRip","uid":4061989,"size":633028608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7f15e62ac0f02ba146df760197e1096d4279699&amp;dn=Revenge+Of+The+Nerds+IV%3A+Nerds+in+Love+%281994%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alcharkov","files":1,"time":1204649775,"description":"Revenge of the Nerds IV: Nerds in Love is a 1994 sequel to the 1984 film Revenge of the Nerds and the follow up films in 1987 and 1992. In this movie Dudley &quot;Booger&quot; Dawson (Curtis Armstrong) is getting married to his Omega Mu girlfriend Jeannie (Corinne Bohrer), but the father of the bride tries to stop them, as he is not keen on welcoming the likes of Booger into his family, despite the fact Dudley would be a good husband to Jeannie as they share many common interests. Jeannie&amp;#039;s father works with his loathsome son-in-law Chip (the husband of Jeannie&amp;#039;s older sister) to find a way to discredit Booger and cause Jeannie to call off the wedding. Lewis Skolnick and the other nerds discover the conspiracy and work to save Booger&amp;#039;s wedding ceremony from being torpedoed. In a subplot, Lewis&amp;#039; wife Betty is pregnant with their first child, and is in her 3rd trimester as the wedding date approaches.\n\nA part of the plot where Booger is trying to find the origin of the accusation that he fathered an illegitimate child reveals that Dudley Dawson was born in Akron, Ohio. The child is from Sandusky, Ohio, where Booger spent much of his life. In the end, Jeannie&amp;#039;s mom tells her father that she will leave him if he doesn&amp;#039;t support his daughter&amp;#039;s wedding to Booger, and Chip&amp;#039;s accusations fall apart when the little girl reveals she was &quot;drafted&quot; from an orphanage to play the illegitimate child role. Chip&amp;#039;s wife decides to divorce him and Jeannie&amp;#039;s father throws him out of their lives forever, leaving to Chip to swear his own revenge against the nerds. In the end, Booger and Jeannie are married, Betty gives birth to a healthy baby boy, and the newly married couple tell the little orphan girl they&amp;#039;d like to adopt her.","torrent":{"xt":"urn:btih:c7f15e62ac0f02ba146df760197e1096d4279699","amp;dn":"Revenge+Of+The+Nerds+IV%3A+Nerds+in+Love+%281994%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f15e62ac0f02ba146df760197e1096d4279699","infoHashBuffer":{"type":"Buffer","data":[199,241,94,98,172,15,2,186,20,109,247,96,25,126,16,150,212,39,150,153]},"announce":[],"urlList":[]}}