{"title":"Prince.Of.Persia.2.Warrior.Within.DVD-RELOADED","uid":4262312,"size":4277071777,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8058fa8fa2720514a4696387d3a7138dd311f9d&amp;dn=Prince.Of.Persia.2.Warrior.Within.DVD-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anas_Pitbull","files":5,"time":1214526420,"description":"Seven years after the Prince used the Sands of Time to turn back time and rewrite history, he finds himself hunted by the Dahaka, the Guardian of the Timeline. Because the Prince escaped his fate, the Dahaka is sent to ensure that the Prince dies and thus restore order to the Timeline.\n\nSeeking counsel from a old wise man, the Prince learns of the existence of the Island of Time - birthplace of the Sands of Time, governed by the Empress of Time. Thinking only of himself and his survival, the Prince sets sail for the Island to prevent the Sands of Time from ever being created. His belief is that if the Sands are not created then the Dahaka will have no reason to hunt him.\n\nMany obstacles attempt to prevent the Prince from reaching the Island and his goal. First, his ship is attacked by an army led by a mysterious woman in black named Shahdee. The Prince faces her and during the ensuing combat she manages to throw him overboard; his ship sinks and his entire crew perishes; however, the Prince manages to survive and drifts ashore on the Island.\n\nWandering further into the island, he re-encounters Shahdee, whom he pursues deep into the fortress of the Island. By doing so, he accidentally steps into one of the many Portals of the fortress, which connects the present with the past. Continuing his pursuit into the Past, he finds her trying to murder an unknown woman in red named Kaileena. The Prince engages Shahdee once more in battle, kills her, and saves Kaileena.\n\nDenied an audience with the Empress of Time to state his case, the Prince is then faced with the task of activating two towers, which in time will open the doors to the Empress&amp;#039; Throne Room. Kaileena aids the Prince by presenting to him the Serpent Sword, which will activate the bridges to reach both towers, and eventually the Lion Sword, an even more powerful weapon than the Serpent Sword. As the Prince explores the island, he occasionally encounters a mysterious, dark-looking creature. Shortly before reaching the throne room, the Prince is attacked by the Dahaka (which, until this point, had only been encountered in the present) and almost killed, but the dark creature rushes in and is killed in his place. The Dahaka then leaves without attacking the Prince. The Prince eventually succeeds in reaching the Throne Room only to discover that Kaileena is the Empress of Time. She had sent Shahdee to kill the Prince, sent him on the perilous journey to the towers, and even cursed the Lion Sword - yet the Prince did not die.\n\nKaileena is also trying to defy her fate. She has seen hers in the Timeline, which is to die at the hands of the Prince. Therefore, her only concern is to get rid of him at any cost. Shahdee, feeling that her mission to help save Kaileena was foolish, illogical, and futile, had turned against her only to be killed by the Prince.\n\nThe Prince reluctantly fights and kills Kaileena. He returns to the present, hoping that he has escaped his fate, but soon discovers that when he killed Kaileena, the Sands of Time were spawned from her body. Realizing that he has caused the event he intended to prevent, the Prince begins to lose hope, but soon discovers the Mask of the Wraith, which is said to have the power to make its wearer coexist in the same timeline. When he puts on the mask, he transforms into the Sand Wraith, the dark creature he saw earlier. The time portals have a greater effect on him in this state, causing him to relive the events of the past as the Wraith (and see his encounters with the Wraith from the opposite perspective). When he reaches the point at which the Wraith saved the Prince from the Dahaka, he instead lets the Dahaka kill the &quot;other&quot; Prince, causing the mask to fall off and him to return to the position he was in just before he entered the Throne Room.\n\nThe Prince decides that he may not be able to avoid killing Kaileena, but if he kills her in the present rather than the past, the Sands will not be created until after he had used them, thereby escaping his fate. The Prince confronts Kaileena again and forces her through a time portal into the present. At this point the ending forks, depending on whether or not the Prince has found all of the health upgrades and acquired his ultimate weapon, the Water Sword.\n\nWithout the Water Sword (alternate ending): The Prince and Kaileena fight again and the Prince kills her again. After the fight, the Dahaka appears, but ignores the Prince and takes Kaileena&amp;#039;s body (since she is now the one who is out of place in the timeline). The Dahaka then heads for the Prince, but only to take his Time Medallion. Having destroyed the final trace of the Sands(it consumed Kaileena&amp;#039;s body before it became the sands, thus preventing their creation) the Dahaka ceases to exist altogether. Having escaped his fate, the Prince sets sail for Babylon.\n\nWith the Water Sword (true ending): The Dahaka appears and heads for Kaileena (since she is now the one who is out of place in the timeline). However, the Prince discovers that the Dahaka has a weakness to his Water Sword. The Prince fights the Dahaka and manages to defeat it. Having both escaped their fates, the Prince and Kaileena set sail for Babylon together.","torrent":{"xt":"urn:btih:c8058fa8fa2720514a4696387d3a7138dd311f9d","amp;dn":"Prince.Of.Persia.2.Warrior.Within.DVD-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8058fa8fa2720514a4696387d3a7138dd311f9d","infoHashBuffer":{"type":"Buffer","data":[200,5,143,168,250,39,32,81,74,70,150,56,125,58,113,56,221,49,31,157]},"announce":[],"urlList":[]}}