{"title":"Easterhouse - Waiting for the Redbird (MP3@320)","uid":4262305,"size":107419518,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c80cfeda868abd33aec0551946d8e040a70a5ad3&amp;dn=Easterhouse+-+Waiting+for+the+Redbird+%28MP3%40320%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sjbnj","files":10,"time":1214526146,"description":"Easterhouse - Waiting for the Redbird (1989)\nmp3@320 kps\n\nBy request.  I make no apologies for this one.\n\nFrom allmusic.com:\nA stridently political band that came up in the mid-\\&amp;#039;80s and failed to follow through on high expectations, Easterhouse\\&amp;#039;s early sound wasn\\&amp;#039;t unlike a cross between the Chameleons and the Smiths. Early on, they won the vocal adoration of the latter group\\&amp;#039;s Morrissey, who no doubt found the left-wing leanings and roaring sound -- featuring blaring, reverb-drenched guitars -- a powerful combination. However, the members weren\\&amp;#039;t so closely knit, and by the time the group released its second and much different album, only one original member remained.Brothers Andy (vocals) and Ivor Perry (guitar) formed Easterhouse in Stretford, Manchester, during the mid-\\&amp;#039;80s, with Mike Murray (rhythm guitar), Gary Rostock (drums), and Peter Vanden (bass) filling out the lineup. Songwriter Andy Perry, a politically minded individual fascinated by communism, was originally brought into the group to improve its lyrical content; he apprehensively took on the vocal duties. Easterhouse signed on with Rough Trade and issued the \\&quot;Whistling in the Dark\\&quot; (1985) and \\&quot;Inspiration\\&quot; (1986) singles -- both of which reached the Top Ten of the U.K.\\&amp;#039;s independent chart -- prior to the group\\&amp;#039;s full-length debut, 1986\\&amp;#039;s Contenders. The album was met with modest success in the band\\&amp;#039;s own country, but it unsurprisingly failed to leave much of an impression in the States.Ivor Perry, whose occasionally contrasting ideals and ideas had been at odds with his brother\\&amp;#039;s, left the group after Contenders to join fellow guitarist Craig Gannon (Aztec Camera, the Smiths) in the Cradle. Murray, Rostock, and Vanden would eventually leave as well, leaving Andy Perry to continue with a new lineup that included drummer Dave Verner and guitarists Steve Lovell, Lance Sabin, and Neil Taylor. All the shakeups delayed the making of Waiting for the Redbird, which wasn\\&amp;#039;t released until 1989. Reliant upon a more contemporary and programmed sound, the album came off as stilted. As a result, it aged poorly. Ironically, \\&quot;Come Out Fighting\\&quot; charted higher in the States than any Smiths single, cracking the Billboard Hot 100 at number 82 and reaching the Top Ten of the modern rock chart. Shortly after the album\\&amp;#039;s release, the group broke up for good.\n\nTrack listing\n01 Waiting For The Redbird\n02 You\\&amp;#039;re Gonna Miss It (When It\\&amp;#039;s Gone)\n03 Stay With Me ( Death On The Dole)\n04 Come Out Fighting\n05 America\n06 Hope And Glory\n07 Say Yes\n08 This Country\n09 Sweatshop\n\n","torrent":{"xt":"urn:btih:c80cfeda868abd33aec0551946d8e040a70a5ad3","amp;dn":"Easterhouse+-+Waiting+for+the+Redbird+%28MP3%40320%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c80cfeda868abd33aec0551946d8e040a70a5ad3","infoHashBuffer":{"type":"Buffer","data":[200,12,254,218,134,138,189,51,174,192,85,25,70,216,224,64,167,10,90,211]},"announce":[],"urlList":[]}}