{"title":"BB Flashback V1.3 &amp; Keygen (Clean)","uid":4136207,"size":12288,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c81956011062f32af2841934cf65d7fb8393a7d8&amp;dn=BB+Flashback+V1.3+%26+Keygen+%28Clean%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"EZCool","files":1,"time":1208279504,"description":"BB FlashBack 1.3\n\nBB FlashBack is a screen recording application for creating tutorials, demonstration or training material. Add text, sound and commentary, and use the extensive\nediting functions to create a high quality presentation. Movies can be exported to Flash, AVI or standalone exe for use on a CD-ROM, over a network or on the web. Easy to use, typical users can be creating movies with BB FlashBack in minutes. A custom compression engine produces compact movie files, making them easier to deliver by E-mail or internet download. Flash movies can also include a control bar, allowing your viewers VCR-like functions when viewing your movie. BB FlashBack movies have a wide range of applications including: training staff to use pieces of software, showing others how to perform PC tasks and demonstrating your software products to potential customers. \n\nFile also includes Keygen which works brillaintly!\n\nJust install BB Flashback then when it asks for the serial, Run keygen, Put in your name and you will get a serial number flash up on the screen.\n\nPop your name &amp; Serial into BB Flashback and hey presto you have full working version. \n\nHave Fun. :D","torrent":{"xt":"urn:btih:c81956011062f32af2841934cf65d7fb8393a7d8","amp;dn":"BB+Flashback+V1.3+%26+Keygen+%28Clean%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81956011062f32af2841934cf65d7fb8393a7d8","infoHashBuffer":{"type":"Buffer","data":[200,25,86,1,16,98,243,42,242,132,25,52,207,101,215,251,131,147,167,216]},"announce":[],"urlList":[]}}