{"title":"Halo CE Chronicles SciFi","uid":4135931,"size":420889687,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c89a5872b8d23fbe8383606eb52b2bdae7f26700&amp;dn=Halo+CE+Chronicles+SciFi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"khast","files":1,"time":1208267087,"description":"Halo CE Chronicles is a movie created by using a computer game as actors and sets. It&amp;#039;s called Machinima, look it up on the net. You could think of it as an animated story, but that is not quite right.\n\nI did not make this work! See the web site http://hcec.halomaps.org/ for the maker and more in the series. The only part I have taken is to download lots of episodes and edit them together. I also created a new title sequence which I hope Dennis Powers will forgive me for. I have tried to clean up the sound as well, I think it suffered a lot during compression.\n\nIf you would like to see the individual episodes or the episodes in higher quality see the website http://hcec.halomaps.org/. Sorry this movie is not in the highest available resolution but it took me long enough to render it at this level and it would take a long time to download.\n\nI would recommend that you give the movie a chance for at least 20 minute.\n\nI will quote directly from the maker?s website to explain the story.\n\n&quot;The Halo CE Chronicles is the story of the events that occurred on the First Ringworld found by man.&quot;\n\n&quot;The Halo CE Chronicles is NOT a comedy and it is NOT about blowing things up. It&amp;#039;s a story about a flawed individual and an equally imperfect lesser AI. It is about people and emotion and not about battles. It is about personal exploration and growth and not about heroics. It is a drama about hope and humanity.&quot;\n\nSeasons 3 &amp; 4 are available episode by episode from http://hcec.halomaps.org/ \n\nRe-seed","torrent":{"xt":"urn:btih:c89a5872b8d23fbe8383606eb52b2bdae7f26700","amp;dn":"Halo+CE+Chronicles+SciFi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c89a5872b8d23fbe8383606eb52b2bdae7f26700","infoHashBuffer":{"type":"Buffer","data":[200,154,88,114,184,210,63,190,131,131,96,110,181,43,43,218,231,242,103,0]},"announce":[],"urlList":[]}}