{"title":"The Red Elvis (Der Rote Elvis) - Dean Reed documentary","uid":4105841,"size":1103198796,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8a07e440679525bff4be30ecd187acc7d7df0ff&amp;dn=The+Red+Elvis+%28Der+Rote+Elvis%29+-+Dean+Reed+documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"optimuse","files":1,"time":1206805164,"description":"A documentary on the late American entertainer Dean Reed, who became a huge star in East Germany after settling there in 1973.\n\n\nDean Cyril Reed (September 22, 1938 - June 13, 1986) was an American actor, singer and songwriter who lived a great part of his adult life in South America, then in the communist German Democratic Republic.\n\nWhile Reed never achieved any musical success in the US, Our Summer Romance proved to be so popular in South America that he stayed on in Argentina following a South American tour. His fame, and record sales there (as well as in PerÃƒÆ’Ã‚Âº, where he also appeared on the major TV network, and sang on at least one occasion, at the special request of a member of the Peruvian oligarchy for a 16th birthday celebration), were certainly noteworthy, even exceeding those of his idol, Elvis Presley.\n\nThis particular &quot;achievement&quot;, translated by his biographers as Reed being the &quot;Red Elvis&quot;, or as being more popular and a hotter record seller both in South America and behind the Iron Curtain than Elvis Presley, but without the specific mention of the latter being his idol-which helps to better put into perspective what that actually meant in terms of achievement, for Reed or for his fans-is somewhat misleading as there were, in addition to Reed, many other singers, local and foreign who were more popular than Presley was, even at his peak, in these two markets.\n\n\n","torrent":{"xt":"urn:btih:c8a07e440679525bff4be30ecd187acc7d7df0ff","amp;dn":"The+Red+Elvis+%28Der+Rote+Elvis%29+-+Dean+Reed+documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8a07e440679525bff4be30ecd187acc7d7df0ff","infoHashBuffer":{"type":"Buffer","data":[200,160,126,68,6,121,82,91,255,75,227,14,205,24,122,204,125,125,240,255]},"announce":[],"urlList":[]}}