{"title":"Updated ROH Videowire Pack! 10 Hours! 10 Matches! Support ROH V2","uid":4144495,"size":1308123271,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9125575903b6a276a9b84b81e35fd4b53ae054b&amp;dn=Updated+ROH+Videowire+Pack%21+10+Hours%21+10+Matches%21+Support+ROH+V2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zendavis","files":72,"time":1208653363,"description":"Ring of Honor is the third largest Pro Wrestling Company in North America. Although still too small to land a television deal, ROH is working hard to gain exposure, expand its fan base, and provide the best professional wrestling in the world.\n\nPlease support this great company with your cash because the quite frankly deserve it. They put on the best product in the market for the least amount of money. Their wrestlers damn near always give their absolute best for even the smallest of the crowds. A lot of people say that they would support a great product if they were worth supporting. Well I&amp;#039;m telling you that Ring of Honor is a company DAMN WELL worth supporting.\n\nHowever far too many people have limited exposure to the Ring of Honor product and aren&amp;#039;t sure of whether or not to take the financial plunge on it. Well for those people I have put together a compilation of Ring of Honor Video Wires that the company posts every few weeks or so. \n\nA video wire, simply put, is a recollection of the live events of the week past for the fans at home who weren&amp;#039;t able to attend the event themselves. It also helps keeps fans updated with any story updates, as well as furthering characters and story lines through web video updates.\n\nApart from supporting the company by buying DVDs - from www.rohwrestling.com - you can also view the Ring of Honor &quot;Rising Above&quot; Pay Per View right now. &quot;Rising Above&quot; is available for $9.95 on The DISH Network and $14.95 on iN DEMAND. You can also catch the PPV on The DISH Network&amp;#039;s All Day Ticket this Saturday. You can look over the in DEMAND show times below. \n  &lt;a href=&quot;\nhttp://indemand.com/viewProductShowtimes.jsp?page_sectionId=2&amp;prodId=79151&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://indemand.com/viewProductShowtimes.jsp?page_sectionId=2&amp;prodId=79151&lt;/a&gt;\n\nHere are some reviews from the &quot;Rising Above&quot; PPV.\n\n&quot;Main event (Nigel McGuinness vs. Austin Aries) and Danielson-Morishima are both great matches, with the main event worth going out of your way to see.&quot; - Dave Meltzer at WrestlingObserver.com\n\n&quot;For the $10 pricetag, this will be a better show for your dollar than any other PPV this year in terms of wrestling content....The Manhattan crowd really adds a great, unique atmosphere to the show....Danielson vs. Morishima might very well be the Abdullah the Butcher vs. Bruiser Brody of their generation if they keep having brawls like that. For guys who are considered two of the best workers right now, that was one intense brawl....Nigel vs. Aries was just awesome....&quot; - Mike Johnson at PWInsider.com\n\n&quot;....an incredible strong PPV effort and there are plenty of great matches (and great reasons) to purchase this PPV....The main event title match of McGuinness vs. Aries completes &quot;Rising Above&quot; and seals the deal on another excellent Pay Per View. That match, the tag scramble and the Morishima / Danielson encounter are all must see moments of the show, while the undercard matches are a good base that helps to round out the card. I was very impressed with the improved production and special effects elements used to help smooth out the rough edges. This feels more like a &quot;complete&quot; Pay Per View than any previous show, or maybe its that it finally feels like an ROH DVD has been successfully translated into to PPV format.&quot; - Ari Berenstein at 411mania.com\n\n&quot;....there is some great action and I wholeheartedly recommend this pay-per-view The final match alone is worth of the $14.95 that my cable company charged....yet another strong ROH pay-per-view with great matches and innovative storytelling.&quot; - Jason Powell at ProWrestling.Net\n\n&quot;....the atmosphere for this match (Nigel McGuinness vs. Austin Aries) were downright incredible and this is an early contender for match of the year....Recommendation: (10.0) From start to finish, this was a great show....This show gets a big thumbs up from me. You won&amp;#039;t get better value for you dollar from any other promotion given ROH&amp;#039;s price point. ROH really pulled everything together from a production standpoint as well and the show really has great underground feel without looking cheaply produced. This PPV is the complete package.... If you&amp;#039;re on the fence about ordering one of the ROH PPVs, don&amp;#039;t hesitate to purchase this. &quot; - Sean Radican at Pro Wrestling Torch\n\n&quot;There is nothing that I can say that will do this match justice; all I can say is that you have to see it. I don&amp;#039;t care if you&amp;#039;re a casual fan, a hardcore fan, or hardly a fan at all, you will be absolutely amazed at the work of Austin Aries and Nigel McGuinness....Ring of Honor sets the bar so high for professional wrestling in the United States it&amp;#039;s going to make WrestleMania seem dull....Thank you Ring of Honor for giving real wrestling fans something to enjoy. I dont care if it&amp;#039;s boxing, mixed martial arts, or professional sports, you won&amp;#039;t get more action than what you will get in this two hour masterpiece.&quot; - Richard Gray at wrestlingnewsworld.com \n\nIn addition, if DVDs and PPVs aren&amp;#039;t enough to convince you, you can catch Ring of Honor live at a venue near you. Upcoming tour dates are listed below and will be updated on a daily basis. Click on the link underneath each venue to see the card for that specific show.\n\nUpcoming Ring of Honor Events:\n\n Manassas, VA- May 9th\nRing of Honor&amp;#039;s debut event in Virginia.\n\nNew York, NY- May 10th\nRing of Honor at the Manhattan Center (Hammerstein Ballroom) in New York City.\n\nHartford, CT- June 6th\nRing Of Honor at the Expo Center in Hartford, CT.\n\nPhiladelphia, PA- June 7th\nRing of Honor returns to Philly.\n\nDayton, OH- June 27th\nRing of Honor at the Montgomery County Fairgrounds in Dayton.\n\nCleveland, OH- August 15th\nRing of Honor returns to Cleveland.\n\nBoston, MA- September 19th\nRing of Honor in Massachusetts at Boston University.\n\nCoral Springs, FL- October 10th\nRing of Honor debuts in Coral Springs, FL.\n\nOrlando, FL- October 11th\nRing of Honor returns to Orlando, FL.\n\nEdison, NJ- October 25th\nRing of Honor at the Inman Sports Club.\n\nThe contents of this torrent include:\n\n01. Adam Pearce vs. Pelle Primeau\n02. Brent Albright vs. Trik Davis\n03. Chris Hero vs. Hallowicked\n04. Claudio Castagnoli vs. YAMATO\n05. Delirious vs. Jason Blade\n06. Jack Evams vs. Eddie Edwards\n07. Lacey vs. Serena Deeb\n08. Nigel McGuinnes vs. TJ Perkins\n09. Kevin Steen and El Generico vs. Jason Blade and Eddie Edwards\n10. CM Punk vs. Homicide\n\nRing of Honor Rising Above Teaser #1\nRing of Honor Rising Above Teaser #2\nRing of Honor Rising Above Teaser #3\nRing of Honor Rising Above 10 Minute Trailer Starring Daizee Haze\n\nDelirious Ring of Honor Wrestling School Advertisement\n\nWomen of Honor In Action \n\nRing of Honor 2007 Welcome Video\n\n54 Ring of Honor Video Wires From 02/25/06 - 04/16/08\t\t\t","torrent":{"xt":"urn:btih:c9125575903b6a276a9b84b81e35fd4b53ae054b","amp;dn":"Updated+ROH+Videowire+Pack%21+10+Hours%21+10+Matches%21+Support+ROH+V2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9125575903b6a276a9b84b81e35fd4b53ae054b","infoHashBuffer":{"type":"Buffer","data":[201,18,85,117,144,59,106,39,106,155,132,184,30,53,253,75,83,174,5,75]},"announce":[],"urlList":[]}}