{"title":"Death Note Eps 1 -Ribith-  English subs","uid":4041337,"size":78060618,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c927b87da71d043dc7f3366efc8a9f519703fa78&amp;dn=Death+Note+Eps+1+-Ribith-++English+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mr.BlackJack","files":1,"time":1203695827,"description":"The fist episode of Death Note (it&amp;#039;s in part. you will need VLC or somting like that to play it) \n\nDownload VLC here for free: http://www.videolan.org/vlc/\n\nDeath Note Plot:\nLight Yagami is an extremely intelligent young man who resents the crime and corruption in the world. His life undergoes a drastic change in the year 2003, when he discovers a mysterious notebook, known as the &quot;Death Note&quot;, lying on the ground. The Death Note&amp;#039;s instructions claim that if a human&amp;#039;s name is written within it, that person shall die. Light is initially skeptical of the notebook&amp;#039;s authenticity, but after experimenting with it, Light realizes that the Death Note is real. After meeting with the previous owner of the Death Note, a shinigami named Ryuk, Light seeks to become &quot;the God of the new world&quot; by passing his judgment on those he deems to be evil or who get in his way.\n\nSoon, the number of inexplicable deaths of reported criminals catches the attention of the International Police Organization and a mysterious detective known only as &quot;L&quot;. L quickly learns that the serial killer, dubbed by the public as &quot;Kira&quot; (derived from the Japanese pronunciation of the word &quot;Killer&quot;), is located in Japan. L also concludes that Kira can kill people without laying a finger on them. Light realizes that L will be his greatest nemesis, and a game of psychological cat and mouse between the two begins.\n","torrent":{"xt":"urn:btih:c927b87da71d043dc7f3366efc8a9f519703fa78","amp;dn":"Death+Note+Eps+1+-Ribith-++English+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c927b87da71d043dc7f3366efc8a9f519703fa78","infoHashBuffer":{"type":"Buffer","data":[201,39,184,125,167,29,4,61,199,243,54,110,252,138,159,81,151,3,250,120]},"announce":[],"urlList":[]}}