{"title":"FS2004 - FSX - Flight1 FSAvidne","uid":4145576,"size":52728342,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9dba23a880448cd2a9f034b9e38156482ece544&amp;dn=FS2004+-+FSX+-+Flight1+FSAvidne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Guillaume.A","files":1,"time":1208714015,"description":"FSAvidyne Features\n\nThe EXP5000 PFD displays standard flight instrumentation including attitude direction indicator (EADI), horizontal situation indicator (EHSI), altitude, airspeed, vertical speed, moving map, terrain, and traffic, on large high resolution displays that are easy-to-read.\n\nThe MFD displays a beautiful color moving map display with checklists, traffic warnings, engine data, flight plan info and navigation features such as: Fixes, VOR&amp;#039;s, NDB&amp;#039;s, Class B,C, &amp; D Airspace, Traffic, Traffic Warnings, Runway Depiction information pages and more.\n\nThe software package also includes a highly accurate S-TEC Fifty Five X Autopilot that works seamlessly with the Avidyne Displays. The 55X also includes anticipated roll steering! a feature not found in the default system or any competing products.\n\nThe easy-to-use console interface allows you to add the FSAvidyne gauges to any existing aircraft in your flight simulator arsenal with 2 quick steps.\n\nA comprehensive manual and additional system manuals are included.\nThe Settings Manager let&amp;#039;s you choose your own custom options like v-speeds, map display ranges and much more. The package also includes a demo version of FS Panel Studio, the standard in panel customization.\n\nNow you can fly with the highly advanced Avidyne Entegra display systems with any of your aircraft in FS2004 or FSX!","torrent":{"xt":"urn:btih:c9dba23a880448cd2a9f034b9e38156482ece544","amp;dn":"FS2004+-+FSX+-+Flight1+FSAvidne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9dba23a880448cd2a9f034b9e38156482ece544","infoHashBuffer":{"type":"Buffer","data":[201,219,162,58,136,4,72,205,42,159,3,75,158,56,21,100,130,236,229,68]},"announce":[],"urlList":[]}}