{"title":"Beltesassar's Short Animation Festival Part 13","uid":4143506,"size":2283617431,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9f89beba32ec96cb49f2ecbd21fcefe74cfda94&amp;dn=Beltesassar%5C%27s+Short+Animation+Festival+Part+13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Beltesassar","files":19,"time":1208614863,"description":"Puleng is a very short animation, made for Channel 4. Ali Taylor tells a simple story, with a strong atmosphere. The attention for the skin, and the combination of various styles work nicely. Nowy Janko Muzykant is a polish animation. The animation itself is quite static, made of paper cut-outs, but Lenica was one of the people to give Plish animation a boost. The tale of how is a a beautiful and rich animation about a as of yet unknown part of the history of the dodo. The story is told through an opera style voice over, with a richness that fits perfectly with the visuals. I think this work is a great example of modern animation, created in parttime. See the making of here: http://theblackheartgang.com/2007/12/18/the-making-of-the-tale-of-how-2007/. Intolerence III is without a doubt the great ending this trilogy deserves. It is touching, sharp, and funny, and often all at the same time. Since someone requested it, it&amp;#039;s a pleasure to put it in this part. Munro is a funny short about getting drafted, from the perspective of a four year old. I especially like the difference between the dry voice of the narrator and the voice of Munro. It won an Oscar in 1961. Len Rye (not only a filmmaker, but also a poet, sculptor and innovative painter) created Free Radicals by scrathing on black film, and combined it with a sound-tape of African traditional music. It is seen as his masterpiece and influenced many animators since. Moo(n) by Leigh Hodgkinson is a story about a cow and a moon: the whole short is just as wittingly put together as the title, and it&amp;#039;s an enjoyable experience altogether. Doonesbury is a animated short of the Doonesbury cartoon which was and is extremly popular ever since it started in 1970, made by Faith and John Hubley. Paul Driessen is featured here with one of his finest and funniest movies, Waterpeople, about people living half under the water (maybe inspired by his Dutch background). The music and soundeffects contribute a lot to the total atmosphere. Hasta Los Huesos comes from one of the major Mexican animators, RenÃƒÂ© Castillo. Although Mexico might not be known for it&amp;#039;s animation, this stop-motion with some beautiful camera work, telling the haunting story of a recently deceased man. Influenced by the typical Mexican tradition of Day of the Dead, this man refuses to accept his own death. Once in a while I like to add an exceptionally creative student film among these animations, this time it&amp;#039;s Stephan-Flint MÃƒÂ¼ller&amp;#039;s fliegenpflicht fÃƒÂ¼r quadrat kÃƒÂ¶pfe for using himself and everything in his surrounding to create an ongoing animation filled with very funny ideas topped with a good dosis of enthusiasm. I got a request to add something from Larry Jordan, and I think his moonlight sonata is a good example of his work, combining cut-outs with his own visual language of moving people, orbs (suns, ballons or any circels) over classical music, on a background of 17th century paintings. Jeffrey Scher&amp;#039;s trigger happy is a short shot on a lightbox with hig-contrast film, and is made up of objects found on the streets in New York. Talking about the benefits of recycling ;). The happy soundtrack is by Shay Lynch. Madame Tutli-Putli did well during the last Oscars, and is beautifully made. Liam Kemp&amp;#039;s the Wonderful Life tries to bring you the most lifelike 3D graphics of people, and they do a really nice job. The storyline is a bit sad, perhaps, and could do better, but I included it because visually it&amp;#039;s stunning, even though it&amp;#039;s already some years old. Even older is Fischinger&amp;#039;s Allegretto, a colorful feast that would almost have been know to us only in black and white when paramount wanted to change it to fit in with a feature film. Fischinger refused and eventually bought back the rights. I&amp;#039;d like to thank CinemaGrotesque for providing a lot of great independent cinema, some of which is futured in these torrents. In addition, thanks to all of those who continue to share these torrents. Finally, I want to dedicate this torrent to all animations students: may you be inspired to create beautiful animations yourself!","torrent":{"xt":"urn:btih:c9f89beba32ec96cb49f2ecbd21fcefe74cfda94","amp;dn":"Beltesassar%5C%27s+Short+Animation+Festival+Part+13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f89beba32ec96cb49f2ecbd21fcefe74cfda94","infoHashBuffer":{"type":"Buffer","data":[201,248,155,235,163,46,201,108,180,159,46,203,210,31,206,254,116,207,218,148]},"announce":[],"urlList":[]}}