{"title":"WhereTheBoysAren't-18","uid":4050355,"size":662063411,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ca771fde2e9b75779e6a769e847aa260b4a3641d&amp;dn=WhereTheBoysAren%5C%27t-18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AlexCience","files":3,"time":1204132977,"description":"Casting:Monique Alexander, Briana Banks, Lanny Barbie, Lacey Love, Lyndsey Love, Lexi Marie, Mercedez, Stefani Morgan, Tera Patrick, Tawny Roberts, Savanna Samson\n\nThis is the first entry in this series in nearly four years (though it was filmed two years ago, according to the Date of Production statement) and it is sort of a disappointment. Earlier installments have usually had some plot, albeit usually a pretty threadbare plot, linking the various sexual couplings of the Vivid girls. But this one jettisons all that, turning the video into a series of couplings leading to a large orgy in which the entire cast participates.\n\nActually, it would be more accurate to say that it leads into a large orgy in which almost all the cast participates, with another scene with the rest of the cast happening off to the side. Interestingly, that additional scene features twin sisters Lyndsey and Lacey Love. The behind the scenes information doesn&amp;#039;t go into too much detail about what&amp;#039;s going on here (focusing more on how a number of underwater scenes were shot and on Chi Chi LaRue&amp;#039;s overuse of the word &quot;gorgeous&quot;) but from the expressions on the Love sisters&amp;#039; faces during their scenes, I almost suspect that they really aren&amp;#039;t into lesbianism. In sharp contrast is the attitude shown by most of the other women, particularly Lanny Barbie. (Who contrasts with the reluctant Love sisters in another way, he slyly insinuated.) While the nominal star of the feature is Tera Patrick, she doesn&amp;#039;t really shine more brightly than the rest of the cast.\n\nAnother strike against the video is that it&amp;#039;s ostensibly set on the French Riviera, but since the action never leaves the site of the villa (or wherever) where all this stuff is happening, it might as well have been set in California. Still, many of the scenes are quite appealing, if not really very imaginative. For completists only.","torrent":{"xt":"urn:btih:ca771fde2e9b75779e6a769e847aa260b4a3641d","amp;dn":"WhereTheBoysAren%5C%27t-18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca771fde2e9b75779e6a769e847aa260b4a3641d","infoHashBuffer":{"type":"Buffer","data":[202,119,31,222,46,155,117,119,158,106,118,158,132,122,162,96,180,163,100,29]},"announce":[],"urlList":[]}}