{"title":"Barsaat Ki Ek Raat.1981 [wacky_p]","uid":4161975,"size":1536263789,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cba49a8203d25d19af56b8cde4b96c823431b75b&amp;dn=Barsaat+Ki+Ek+Raat.1981+%5Bwacky_p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wacky_p","files":7,"time":1209418509,"description":"Barsaat Ki Ek Raat.1981 [wacky_p]\n-----------------------------------------------------\n\nA young blind woman named Rajni lives in India with her dad, Suresh, who is employed as a Manager with a business marketing tea leaves. The region where they live has a lax police force run by Inspector Sammar, who is controlled by a wealthy contractor, Hariya Sahu, and his son, Kaliram. Hariya and Kaliram control and terrorize the people to such an extent that one day they get together and complain to their employer, who in turn speaks with the D.S.P., who assures them that he will take a personal interest in this matter. Shortly thereafter, Inspector Abhijeet Rai makes his appearance, in virtually no time at all he arrests Kaliram, tries him in Court, and gets him sentenced to five years in prison. He then indefinitely suspends Sammar, falls in love and gets married to Rajni and they re-locate to another place, where they live a harmonious life with Rajni soon getting pregnant. The two then start planning for the appearance of the third member of their family when their lives are turned upside down as Kaliram, who has completed his sentence, has found them, and is all set to avenge himself at any and all costs.\n\nTank Joo Kom Agayn !!!","torrent":{"xt":"urn:btih:cba49a8203d25d19af56b8cde4b96c823431b75b","amp;dn":"Barsaat+Ki+Ek+Raat.1981+%5Bwacky_p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cba49a8203d25d19af56b8cde4b96c823431b75b","infoHashBuffer":{"type":"Buffer","data":[203,164,154,130,3,210,93,25,175,86,184,205,228,185,108,130,52,49,183,91]},"announce":[],"urlList":[]}}