{"title":"The Bank Job_2008","uid":4059959,"size":746166611,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cbbdea840bfcd7fd6dd2a8471795cf2aee4ab57e&amp;dn=The+Bank+Job_2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mcmick","files":2,"time":1204568043,"description":"The true story of a heist gone wrong... in all the right ways.\nInspired by the infamous 1971 robbery that took place at the Lloyds Bank in Marylebone London, LIONSGATE&amp;#039;s Ã‚Â® THE BANK JOB stars Jason Statham (TRANSPORTER, SNATCH, CRANK, THE ITALIAN JOB) and Saffron Burrows (KLIMT, ENIGMA). The highly-charged heist thriller tautly interweaves high-level corruption, murder and sexual scandal in 1970s England.\n\nA car dealer with a dodgy past and new family, Terry (Statham) has always avoided major-league scams. But when Martine (Burrows), a beautiful model from his old neighborhood, offers him a lead on a foolproof bank hit on London&amp;#039;s Baker Street, Terry recognizes the opportunity of a lifetime. Martine targets a roomful of safe deposit boxes worth millions in cash and jewelry. But Terry and his crew don&amp;#039;t realize the boxes also contain a treasure trove of dirty secrets - secrets that will thrust them into a deadly web of corruption and illicit scandal that spans London&amp;#039;s criminal underworld, the highest echelons of the British government, and the Royal Family itself...the true story of a heist gone wrong...in all the right ways.\n\nDirected by Roger Donaldson (NO WAY OUT, THIRTEEN DAYS, THE RECRUIT) and written by Dick Clement &amp; Ian La Frenais (ACROSS THE UNIVERSE, FLUSHED AWAY), produced by Steven Chasman (TRANSPORTER 2) and Charles Roven (GET SMART, THE DARK KNIGHT); executive producers are George McIndoe, Ryan Kavanaugh, Alan Glazer and Christopher Mapp. THE BANK JOB also stars Richard Lintern (SYRIANA), Stephen Campbell Moore (THE HISTORY BOYS), Daniel Mays (ATONEMENT), Peter Bowles (FREEBIRD), Keeley Hawes (A COCK AND BULL STORY), Colin Salmon (DIE ANOTHER DAY, PUNISHER: WAR ZONE), Peter de Jersey (TV&amp;#039;s &quot;Holby City&quot;), James Faulkner (COLOUR ME KUBRICK), Sharon Maughan (ANOTHER STAKEOUT), Alki David (THE FREEDIVER), Michael Jibson (FLYBOYS), Georgia Taylor (TV&amp;#039;s &quot;Coronation Street&quot;) and three-time BaftaÃ‚Â® nominee David Suchet (TV&amp;#039;s &quot;Poirot&quot;).\n\nLionsgate will release THE BANK JOB nationwide on Friday, March 7. A Mosaic Media Group production in association with Relativity Media &amp; Omnilab Media. Rated &quot;R&quot; by MPAA for sexual content, nudity, violence and language.  \n\n\n\nCast:\nJason Statham, Saffron Burrows, Stephen Campbell Moore, Daniel Mays, James Faulkner, Alki David, Michael Jibson, Richard Lintern, Don Gallagher, David Suchet","torrent":{"xt":"urn:btih:cbbdea840bfcd7fd6dd2a8471795cf2aee4ab57e","amp;dn":"The+Bank+Job_2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbbdea840bfcd7fd6dd2a8471795cf2aee4ab57e","infoHashBuffer":{"type":"Buffer","data":[203,189,234,132,11,252,215,253,109,210,168,71,23,149,207,42,238,74,181,126]},"announce":[],"urlList":[]}}