{"title":"Lee Morgan - The Last Session - 1971 (Flac)","uid":4041839,"size":475333636,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cbdd52924242c069eb252e6599e95c1c3a6077b6&amp;dn=Lee+Morgan+-+The+Last+Session+-+1971+%28Flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sskain","files":19,"time":1203714045,"description":"Lee Morgan - The Last Session - 1971\n\nFlac(tracks) + Log + CUE + Artwork\n\n1. 01 - Capra Black (15:32) (Harper)\n2. 02 - In What Direction Are You Headed? (16:20) (Mabern)\n3. 03 - Angela (6:24) (Merritt)\n4. 04 - Croquet Ballet (10:57) (Harper)\n5. 05 - Inner Passions Out (17:34) (Waits)\n\n\nLee Morgan - Trumpet, Flugelhorn\nGrachan Moncur III - Trombone\nBobbi Humphrey - Flute\nBilly Harper - Tenor Sax, Alto Flute\nHarold Mabern - Piano, El Piano\nJymie Merritt - El Bass\nReggie Workman - Bass, Percussion\nFreddie Waits - Drums, Recorder\n\n\nProduced by George Butler\nRecorded September 17 &amp; 18 1971 at Van Gelders Studio\nMasterred by Ron McMaster using 20-bit SBM\n\n\nThis is called The Last Session and this is definitely that as leader, Lee have not written any trackby\nhimself, but as a session man he gonna make his last session two days before he got killed on February 16-17 \non the fantastic Charles Earland session that make Intensity.\n\nOn this album called The Last Session you don&amp;#039;t got no The Sidewinder or The Rumproller, no on this album\nyou found a more avant-gard side of him, and he got a marvelous line-up with him and this should be\nBobbi Humphrey debut session, yeah she gonna make some wonderfull jazz-funk albums with the Mizell brothers,\nand I bet that Lee hade made that too if he lived, when he play on the Charles Earland sessions, so now you\ngot a chance to be familiar with Lee last session as a leader as they say.\n\n\nReview by Scott Yanow\n\nThe final recording by Lee Morgan, this double LP has its moments but is somewhat erratic with some modal-oriented selections that ramble on too long and a forgettable debut (on &quot;Croquet Ballet&quot;) for the trumpeter&amp;#039;s discovery, flutist Bobbi Humphrey. Morgan (who was still just 33) is in generally good form and his band (with Billy Harper on tenor, keyboardist Harold Mabern, Jymie Merritt or Reggie Workman on bass and drummer Freddie Waits) is quite stimulating but the music has an uncomfortable and incomplete feel to it. It does leave one wondering what Lee Morgan would have done next had he lived. \n\n\nBiography by Steve Huey \n\nBorn July 10, 1938 in Philadelphia\nDied February 19, 1972 in New York\n\nA cornerstone of the Blue Note label roster prior to his tragic demise, Lee Morgan was one of hard bop&amp;#039;s greatest trumpeters, and indeed one of the finest of the &amp;#039;60s. An all-around master of his instrument modeled after Clifford Brown, Morgan boasted an effortless, virtuosic technique and a full, supple, muscular tone that was just as powerful in the high register. His playing was always emotionally charged, regardless of the specific mood: cocky and exuberant on up-tempo groovers, blistering on bop-oriented technical showcases, sweet and sensitive on ballads. In his early days as a teen prodigy, Morgan was a busy soloist with a taste for long, graceful lines, and honed his personal style while serving an apprenticeship in Art Blakey&amp;#039;s Jazz Messengers. As his original compositions began to take in elements of blues and R&amp;B, he made greater use of space and developed an infectiously funky rhythmic sense. He also found ways to mimic human vocal inflections by stuttering, slurring his articulations, and employing half-valved sound effects. Toward the end of his career, Morgan was increasingly moving into modal music and free bop, hinting at the avant-garde but remaining grounded in tradition. He had already overcome a severe drug addiction, but sadly, he would not live to continue his musical growth; he was shot to death by his common-law wife in 1972.Edward Lee Morgan was born in Philadelphia on July 10, 1938. He grew up a jazz lover, and his sister apparently gave him his first trumpet at age 14. He took private lessons, developing rapidly, and continued his studies at Mastbaum High School. By the time he was 15, he was already performing professionally on the weekends, co-leading a group with bassist Spanky DeBrest. Morgan also participated in weekly workshops that gave him the chance to meet the likes of Miles Davis, Dizzy Gillespie, and his idol Clifford Brown. After graduating from high school in 1956, Morgan -- along with DeBrest -- got the chance to perform with Art Blakey&amp;#039;s Jazz Messengers when they swung through Philadelphia. Not long after, Dizzy Gillespie hired Morgan to replace Joe Gordon in his big band, and afforded the talented youngster plenty of opportunities to solo, often spotlighting him on the Gillespie signature piece &quot;A Night in Tunisia.&quot; Clifford Brown&amp;#039;s death in a car crash in June 1956 sparked a search for his heir apparent, and the precocious Morgan seemed a likely candidate to many; accordingly, he soon found himself in great demand as a recording artist. His first session as a leader was cut for Blue Note in November 1956, and over the next few months he recorded for Savoy and Specialty as well, often working closely with Hank Mobley or Benny Golson. Later in 1957, he performed as a sideman on John Coltrane&amp;#039;s classic Blue Train, as well as with Jimmy Smith.Morgan&amp;#039;s early sessions showed him to be a gifted technician who had his influences down pat, but subsequent dates found him coming into his own as a distinctive, original stylist. That was most apparent on the Blue Note classic Candy, a warm standards album completed in 1958 and released to great acclaim. Still only 19, Morgan&amp;#039;s playing was still imbued with youthful enthusiasm, but he was also synthesizing his influences into an original sound of his own. Also in 1958, Gillespie&amp;#039;s big band broke up, and Morgan soon joined the third version of Art Blakey&amp;#039;s Jazz Messengers, which debuted on the classic Moanin&amp;#039; album later that year. As a leader, Morgan recorded a pair of albums for Vee Jay in 1960, Here&amp;#039;s Lee Morgan and Expoobident, and cut another for Blue Note that year, Leeway, with backing by many of the Jazz Messengers. None managed to measure up to Candy, and Morgan, grappling with heroin addiction, wound up leaving the Jazz Messengers in 1961. He returned to his hometown of Philadelphia to kick the habit, and spent most of the next two years away from music, working occasionally with saxophonist Jimmy Heath on a local basis. His replacement in the Jazz Messengers was Freddie Hubbard, who would also become one of the top hard bop trumpeters of the &amp;#039;60s.Morgan returned to New York in late 1963, and recorded with Blue Note avant-gardist Grachan Moncur on the trombonist&amp;#039;s debut Evolution. He then recorded a comeback LP for Blue Note called The Sidewinder, prominently featuring the up-and-coming Joe Henderson. The Morgan-composed title track was a funky, danceable groover that drew from soul-jazz, Latin boogaloo, blues, and R&amp;B in addition to Morgan&amp;#039;s trademark hard bop. It was rather unlike anything else he&amp;#039;d cut, and it became a left-field hit in 1964; edited down to a 45 rpm single, it inched onto the lower reaches of the pop charts, and was licensed for use in a high-profile automobile ad campaign. Its success helped push The Sidewinder into the Top 25 of the pop LP charts, and the Top Ten on the R&amp;B listing. Sales were brisk enough to revive the financially struggling Blue Note label, and likely kept it from bankruptcy; it also led to numerous &quot;Sidewinder&quot;-style grooves popping up on other Blue Note artists&amp;#039; albums. By the time &quot;The Sidewinder&quot; became a phenomenon, Morgan had rejoined the Jazz Messengers, where he would remain until 1965; there he solidified a long-standing partnership with saxophonist Wayne Shorter.Morgan followed the most crucial recording of his career with the excellent, more abstract Search for the New Land, which was cut in early 1964, before &quot;The Sidewinder&quot; hit. An advanced modal bop session called Tom Cat was also recorded shortly thereafter, but both were shelved in hopes of scoring another &quot;Sidewinder.&quot; Accordingly, Morgan re-entered the studio in early 1965 to cut The Rumproller, whose Andrew Hill-penned title cut worked territory that was highly similar to Morgan&amp;#039;s breakout hit. Commercial lightning didn&amp;#039;t strike twice, but Morgan continued to record prolifically through 1965, cutting excellent sessions like The Gigolo, Cornbread, and the unissued Infinity. The Gigolo introduced one of Morgan&amp;#039;s best-known originals, the bluesy &quot;Speedball,&quot; while the classic Cornbread featured his ballad masterpiece &quot;Ceora.&quot; Search for the New Land was finally issued in 1966, and it achieved highly respectable sales, reaching the Top 20 of the R&amp;B album charts; both Cornbread and The Gigolo would sell well among jazz audiences when they were released in 1967 and 1968, respectively.By the time Morgan completed those albums, he had left the Jazz Messengers to begin leading his own groups outside the studio. He was also appearing frequently as a sideman on other Blue Note releases, working most often with tenorman Hank Mobley. Morgan was extraordinarily prolific over 1966-1968, cutting around eight albums&amp;#039; worth of material (though not all of it was released at the time). Highlights included Delightfulee, The Procrastinator, and the decent-selling Caramba!, which nearly made the Top 40 of the R&amp;B album chart. His compositions were increasingly modal and free-form, stretching the boundaries of hard bop; however, his funkier instincts were still evident as well, shifting gradually from boogaloo to early electrified fusion. Morgan&amp;#039;s recording pace tailed off at the end of the &amp;#039;60s, but he continued to tour with a regular working group that prominently featured saxophonist Bennie Maupin. This band&amp;#039;s lengthy modal explorations were documented on the double LP Live at the Lighthouse, recorded in Los Angeles in July 1970; it was later reissued as a three-CD set with a generous amount of extra material. Morgan led what turned out to be the last session of his life in September 1971. On February 19, 1972, Morgan was performing at the New York club Slug&amp;#039;s when he was shot and killed by his common-law wife, Helen More. Accounts of exactly what happened vary; whether they argued over drugs or Morgan&amp;#039;s fidelity, whether she shot him outside the club or up on the bandstand in front of the audience, jazz lost a major talent. Despite his extensive recorded legacy, Morgan was only 33 years old. Many of his unreleased Blue Note sessions began to appear in the early &amp;#039;80s, and his critical standing has hardly diminished a whit.","torrent":{"xt":"urn:btih:cbdd52924242c069eb252e6599e95c1c3a6077b6","amp;dn":"Lee+Morgan+-+The+Last+Session+-+1971+%28Flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbdd52924242c069eb252e6599e95c1c3a6077b6","infoHashBuffer":{"type":"Buffer","data":[203,221,82,146,66,66,192,105,235,37,46,101,153,233,92,28,58,96,119,182]},"announce":[],"urlList":[]}}