{"title":"Playboy The Mansion","uid":4256237,"size":1622985140,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:cbe44c58a37cf63b5b29d957ba3830e432893f62&amp;dn=Playboy+The+Mansion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"libieca","files":3,"time":1214256788,"description":"Playboy: The Mansion blends state-of-the-art social simulation with traditional role-playing and empire-building gameplay. As Hugh Hefner, you build the Playboy Mansion and magazine into a dynamic cultural icon and powerful brand. Rub shoulders with stunning women and stimulating celebrities as you pursue the ultimate Playboy lifestyle. \n\n\nConstruct the Mansion - The Playboy lifestyle begins at home. Will your home be a stately manor built for entertaining or a gadget lover&amp;#039;s paradise? As your fame and wealth increase, you&amp;#039;ll be able to add tennis courts, game houses, aviaries, even the world-famous Grotto to your estate. Just make sure to build enough bedrooms for your girlfriends. \nLive the Playboy Lifestyle - What use is a stylish pad if you can&amp;#039;t share it with hundreds of celebrity friends? Spend the afternoon poolside with a bevy of beautiful women, and then change into your finest pajamas for an evening of decadent dancing with chart toppers, industry moguls, and all-star athletes. Will you watch a movie in the Theater Room or the Playmates on the trampoline? Life can be so cruel. \nBuild Your Empire - Fame and fortune don&amp;#039;t come easy. Manage a crack editorial staff, hustle celebrity interviews, and mold the magazine in response to a fickle market. Are readers suddenly interested in sports? Maybe it&amp;#039;s time to host a tennis tournament! And remember, people don&amp;#039;t just read Playboy for the articles. Each month you&amp;#039;ll invite women to stay at the Mansion, manage their Playmate training, and oversee their sexy photo-shoots. \nHundreds of &quot;Celebrities&quot; - Including actors, athletes, authors, comedians, fashion designers, models, and musicians. \nEmpire Mode - Select your own goals (fame, circulation, guests, etc.) and then work over a series of months or years to achieve them. \nCampaign Mode - A dozen campaigns that chronicle Hugh Hefner and the Playboy Mansion&amp;#039;s rise to international fame. \nThe Playboy Philosophy - You&amp;#039;re rewarded for living the good life, having a positive sexual attitude, and promoting tolerance and individual freedom.","torrent":{"xt":"urn:btih:cbe44c58a37cf63b5b29d957ba3830e432893f62","amp;dn":"Playboy+The+Mansion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe44c58a37cf63b5b29d957ba3830e432893f62","infoHashBuffer":{"type":"Buffer","data":[203,228,76,88,163,124,246,59,91,41,217,87,186,56,48,228,50,137,63,98]},"announce":[],"urlList":[]}}