{"title":"Hachi-ko Monogatari SWEsub","uid":4134959,"size":737124574,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc99b0ee6c85a4e1e9236aed473cf12937377e07&amp;dn=Hachi-ko+Monogatari+SWEsub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Astreia","files":4,"time":1208215654,"description":"This torrent consists of the avi-file made by MissRipZ and custom subtitles in Swedish made by me. I love this movie very much (you\\&amp;#039;ve done a very good job, MissRipZ!) but I found the original subtitles to be less than satisfactory. They were originally in English but I\\&amp;#039;ve translated them into Swedish. I thought at first that I\\&amp;#039;d only use the subtitles privately for me and my family, but I guessed there are some people who want the Swedish subtitles.\nI do not claim to have made the avi in this torrent release, it is made by MissRipz and all credit should go to her alone. I thank her deeply for this lovely film that really moved my heart. Also, it\\&amp;#039;s very good quality considering that this film is 21 years old, so she\\&amp;#039;s made a great job indeed.\nI\\&amp;#039;ve never made a torrent before and I hope that I did everything correctly. If anything at all is unclear, please leave a comment and I will try my best to answer your question. I will not write anything about the film myself, but here comes a user comment from imdb.com:\n\n\\&quot; Dog movies are a dime a dozen, and you can probably name a few out of the USA or Japan. There are many fictional ones that some might believe did exist (not the breed of course), but here\\&amp;#039;s a story of one which really did, and in its lifetime earned the admiration of people around, enough to build a statue of it too! The Hachiko Exit of Tokyo\\&amp;#039;s subway Shibuya Station stands a Hachiko the dog statue, in remembrance of its unwavering loyalty to its master.\n\nHachiko is an Akita dog born in Odate, Akita Prefecture, and this is ample opportunity for the filmmakers to insert as many cutesy shots of puppies as possible, with their natural playfulness and inquisitive nature earning plenty of \\&quot;awwws\\&quot; from the audience. The birth of Hachiko and its siblings is probably one of the best I\\&amp;#039;ve seen - or make that the only one I\\&amp;#039;ve seen to date, with an actual birth sequence being captured on film - I didn\\&amp;#039;t know they come out that small!\n\nBut Hachiko\\&amp;#039;s life seemed destined for hardship from the start. And this somewhat serves as a warning to those in the audience with an inkling of getting themselves a puppy after watching the show. As with any pet, it comes with commitment - you commit to taking care of it, and it will more than often do the same for you too, especially when it\\&amp;#039;s a dog (they aren\\&amp;#039;t called Man\\&amp;#039;s Best Friend) for nothing. In the beginning, a young girl promises to care for the Hachiko, but as we all learn soon enough, this is but an empty promise as she \\&quot;abandons\\&quot; it even before it set foot into the home, and given that nobody in the household is keen on keeping it, the responsibility laid with the head of the household.\n\nAnd thus a strong relationship between owner and dog was forged, one that involved amongst others, the dog accompanying the master to the train station, and dutifully waiting for his arrival at the station after work. This probably sealed its legend as it was unwavering with the dog being there come rain, shine, or snow. But the other half of the movie centered on more melodrama, one which I thought was having almost everything except the kitchen sink thrown at the dog\\&amp;#039;s direction. Abandonment is cruel, and that is chiefly what it focused on. There was a particularly powerful scene that the professor\\&amp;#039;s wife (who once was jealous of the attention Hachiko got from her spouse) denied having direct ownership with Hachiko, and that really hurt. Not to mention during one of the finale shots where you see again, hypocrisy at play.\n\nBut too much of something makes it nauseatingly sick. The finale tended to drag too long, and the story was determined to drum Hachiko\\&amp;#039;s sad life into you once its honeymoon years were over. And the supporting characters during this stage, were more like caricatures, popping up now and then to regurgitate the same old lines and expressions of pity. And no self respecting dog movie will be without a de-facto scene of the dog running towards the owner from afar in slow motion. There is such a scene here too, which made me roll my eyeballs.\n\nDespite its two-part act, Hachiko is still a rather enjoyable movie about a dog who can\\&amp;#039;t let go, pining for the love of its master. Loyalty, friendship, and trust are the hallmarks of such movies. Now only if the pop song played during the end credits didn\\&amp;#039;t ruin it all. \\&quot;\n\nAt any rate, I recommend this movie. It is really sad and lovely and there are puppies in it. Yes, fluffy puppies. Who can resist them?\n\nLots of love\nfrom Astreia","torrent":{"xt":"urn:btih:cc99b0ee6c85a4e1e9236aed473cf12937377e07","amp;dn":"Hachi-ko+Monogatari+SWEsub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc99b0ee6c85a4e1e9236aed473cf12937377e07","infoHashBuffer":{"type":"Buffer","data":[204,153,176,238,108,133,164,225,233,35,106,237,71,60,241,41,55,55,126,7]},"announce":[],"urlList":[]}}