{"title":"9/11 Chronicles Part One: Truth Rising 837Mb","uid":4274890,"size":878439682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd0c99735508fe95d505bb39242cd07c1d02140b&amp;dn=9%2F11+Chronicles+Part+One%3A+Truth+Rising+837Mb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheLasersShadow","files":1,"time":1215132958,"description":"Alex Jones? 9/11 Chronicles Part One: Truth Rising is more than a rollercoaster adventure through the various expressions of the 9/11 truth movement, it pays homage to a form of direct activism that has corrupt politicians scuttling for cover across the country as their crimes are exposed in public.\n\nSeven years after the attacks of September the Eleventh, a global awakening has taken place, the likes of which the world has never seen. As the corporate-controlled media dwindles into extinction, a new breed of journalists and activists has emerged.\n\nShot unlike anything you have ever experienced from Alex Jones, cinema verite&amp;#039; style, this masterpiece not only exposes the mistreatment of our 9/11 heroes, but also shows how a growing number of people around the world are questioning the official version of events that day.\n\nFeaturing interviews with Willie Nelson, Rosie O&amp;#039;Donnell, Jesse Ventura, George Carlin, Martin Sheen, as well as confrontations with many political figures including Bill Clinton, David Rockefeller and Arnold Schwarzenegger.\n\nPrisonplanet.com\nTheLasersShadow.com\nWeAreChange.org\n\nWhen your done watching this PLEASE make copies and spread it to all your friends. Alex would love for you to buy this on DVD but its more important for the information to get out at this point in time.\n\n&quot;I want this thing to go viral&quot; Alex Jones\n\nFor you and your family&amp;#039;s sake please get out of your chair and be the REAL change you want to see made in the world !!","torrent":{"xt":"urn:btih:cd0c99735508fe95d505bb39242cd07c1d02140b","amp;dn":"9%2F11+Chronicles+Part+One%3A+Truth+Rising+837Mb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd0c99735508fe95d505bb39242cd07c1d02140b","infoHashBuffer":{"type":"Buffer","data":[205,12,153,115,85,8,254,149,213,5,187,57,36,44,208,124,29,2,20,11]},"announce":[],"urlList":[]}}