{"title":"BitDefender Total Security 2008","uid":4254812,"size":50316800,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ce0311db1dc9c54aa92f8c2efe1ecc246f9cb8c4&amp;dn=BitDefender+Total+Security+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ronraul","files":1,"time":1214181430,"description":"BitDefender Total Security 2008 NEW With Crack and 3650 Days Valid License Key\n\n\n\n\n===============================================================\n\nINFO:\n\n\n\n\nANTIVIRUS &amp; ANTISPYWARE:\n\nProtects your PC in real time from known viruses, spyware and other malware with hourly updates\n\nBlocks unknown viruses using advanced proactive detection techniques\n\nMonitors and prevents spyware threats in real-time\n\nDetects and removes the newest breed of hidden threats known as rootkits\n\nProvides a smooth gaming experience by reducing the system load to a minimum\n\n\n\n\nANTI-PHISHING:\n\nProtects against phishing attacks by filtering all accessed web pages for fraud attempts\n\nReduces the risk of identity theft by preventing personal information leaks via e-mail or web.\n\n\n\n\nFIREWALL:\n\nControls applications? access to the Internet while ?hiding? your computer from hackers\n\nHelps prevent unauthorized access to your Wi-Fi network by notifying you when computers log in to the network.\n\n\n\n\nANTISPAM:\n\nPrevents different types of spam and scam e-mails from reaching your Inbox\n\nNow responds faster to new spamming techniques with new adaptive engines\n\n\n\n\nPARENTAL CONTROL:\n\nBlocks access to inappropriate websites and e-mail\n\nAllows or blocks web access during specified time periods\n\n\n\n\nBACKUP:\n\nSafeguards your data by creating backup copies to local and removable drives, CD-R/RW or DVD-R/RW\n\nAutomatically backs up only new files, based on a pre-set schedule.\n\n\n\n\nTUNE-UP:\n\nImproves your PC performance by removing unnecessary files and registry entries\n\nCompletely erases files and &quot;traces&quot; of files from disk to prevent recovery\n\nHassle ? Free Hourly Updates\n\nHourly updates ensure that you are protected against the latest threats without pushing a button. Lost program files are not a problem either. In the rare event of file damage due to PC problems, BitDefender automatically repairs and updates itself.\n\n\n\nNEWGamer Mode:\n\nThe new Gamer Mode temporarily modifies protection settings so as to minimize their impact on gaming performance, maintaining a safe, fun gaming experience\n\n\n\n\n\nCheck the latest updates, features, news and information at : http://www.bitdefender.com/","torrent":{"xt":"urn:btih:ce0311db1dc9c54aa92f8c2efe1ecc246f9cb8c4","amp;dn":"BitDefender+Total+Security+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0311db1dc9c54aa92f8c2efe1ecc246f9cb8c4","infoHashBuffer":{"type":"Buffer","data":[206,3,17,219,29,201,197,74,169,47,140,46,254,30,204,36,111,156,184,196]},"announce":[],"urlList":[]}}