{"title":"CorelDRAW Graphics Suite X4 14.0 FULL VERSION","uid":4259080,"size":328258093,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ce1316bf7f09614b15ff9545c19a6ac8ec65697e&amp;dn=CorelDRAW+Graphics+Suite+X4+14.0+FULL+VERSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"britnerken","files":5,"time":1214380027,"description":"CorelDraw Graphics Suite X4\n\nThe 14th version of this established graphics suite has significant and practical new features.\n\nCorelDRAW Graphics Suite X4 delivers all the essential tools for today&amp;#039;s busy designer. Create powerful designs using intuitive vector illustration and page layout tools. Retouch and enhance photos with professional photo-editing software. And easily convert bitmap images to editable and scalable vector files. Whatever your project, CorelDRAW Graphics Suite X4 will streamline your workflow and inspire you with new creative possibilities.\n\nCreate illustrations, logos, brochures, newsletters, flyers, signs, Web images and more.\n\nTransform ideas into professional and impressive results using CorelDRAW Graphics Suite X3!\n\nWith this comprehensive graphics suite, you can confidently tackle a wide variety of projects - from logo creation and Web graphics, to multi-page marketing brochures, or eye-catching signs.\n\nFrom new bitmap-to-vector tracing in Corel PowerTRACE, new photo-editing features in PHOTO-PAINT, new suite-wide learning tools, and enhancements in illustration and page layout, this suite combines design capabilities, ease-of-use, and affordability that cannot be matched by any other graphics software.\n\nHere are some key features of &quot;CorelDRAW Graphics Suite&quot;:\n\nStreamline your workflow\nÂ· Modernized user interface:\nThe new, more intuitive user interface features redesigned icons, menus and control\n\nÂ· CorelDRAW ConceptShare:\nShare your designs and ideas with colleagues and collaborate with clients in real time\n\nÂ· Corel PowerTRACE X4:\nSave time and enjoy more control with this enhanced and powerful bitmap-to-vector conversion solution\n\nÂ· Windows Color System:\nClosely match colors between Corel and Microsoft applications\n\nÂ· Adobe Color Management Module:\nMatch colors between Corel and Adobe applications\n\nFind\nyour design assets\nÂ· Enhanced Windows Vista integration:\nOrganize projects and search for files\n\nÂ· New, editable content:\n10,000 clipart images (40% new), 1,000 high-quality photos and more specialized fonts: includes 75 Windows Glyph List 4 (WGL4) with support for Greek, Cyrillic and other international character sets, as well as single-line engraving fonts and OpenType cross-platform fonts\n\nÂ· Redesigned New From Template dialog box:\nEasily find the right template for any job, and browse by keyword or industry\n\nÂ· 80 professionally designed templates:\nWith keywords, notes about design choices, output tips and ways to maintain good design when customizing templates\n\nAccelerate layout and text editing\nÂ· Interactive tables:\nCreate and import structured layouts for text and graphics\n\nÂ· Independent page layers:\nVary page layout within a multipage document\n\nÂ· Live text formatting:\nPreview formatting changes before applying them\n\nÂ· Integration with WhatTheFont:\nQuickly identify fonts\n\nÂ· Mirror paragraph text:\nMirror text horizontally or vertically, or both\n\nGet inspired and gain knowledge\nÂ· Welcome screen:\nAccess recently used documents, templates, learning tools, and inspiring designs from one location\n\nÂ· CorelDRAW Handbook - Insights from the Experts:\nView impressive projects and learn from seasoned design professionals\n\nÂ· Training videos:\nDelve into hours of new training videos\n\nÂ· CorelTUTOR:\nAccess online, project-based instruction with new tutorials\n\nÂ· CorelDRAW.com:\nShare designs, ideas and inspiration with this online community\n\nDiscover advanced image-editing features\nÂ· Support for RAW camera files:\nInteractive controls let you preview adjustments in real time\n\nÂ· Straighten images:\nNew, interactive controls make it fast and easy\n\nÂ· Histogram feedback:\nAvailable with more features than ever before\n\nÂ· Enhanced Tone Curve dialog box:\nLets you adjust images with more precision\n\nÂ· Streamlined page sizes:\nReflect the geographic location of the user better\n\n\nRequirements:\n\nÂ· 512 MB of RAM, 430 MB of hard disk space\nÂ· Pentium III, 800MHz processor or AMD Athlon XP\nÂ· 1,024 Ã— 768 or better monitor resolution\nÂ· DVD drive\nÂ· Mouse or tablet","torrent":{"xt":"urn:btih:ce1316bf7f09614b15ff9545c19a6ac8ec65697e","amp;dn":"CorelDRAW+Graphics+Suite+X4+14.0+FULL+VERSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce1316bf7f09614b15ff9545c19a6ac8ec65697e","infoHashBuffer":{"type":"Buffer","data":[206,19,22,191,127,9,97,75,21,255,149,69,193,154,106,200,236,101,105,126]},"announce":[],"urlList":[]}}