{"title":"ELECTRIBE 101 - Electribal Memories (The Best Of)","uid":4059780,"size":105024235,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cea42ea016b76d29a1b39d7ddb04661ea82408d2&amp;dn=ELECTRIBE+101+-+Electribal+Memories+%28The+Best+Of%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"badbigdog","files":-1,"time":1204550864,"description":"ELECTRIBE 101 - ELECTRIBAL DREAMS - The Best of Electribe 101 Featuring Billie Ray Martin\n\n\n01. Talking With Myself - 6.25\n02. Lipstick On My Lover - 6.21\n03. You're Walking (Peeping Tom Mix) - 6.05\n04. Inside Out - 6.00\n05. Diamond Dove - 7.51\n06. Heading For The Night - 4.08\n07. Tell Me When The Fever Ended - 4.45\n08. Talking 2 - 6.05\n09. Electribal Memories - 10.36\n10. Talking With Myself (Frankie Knuckles Mix) - 7.31\n11. Talking With Myself '98 (Canny 12&quot; Vocal) - 9.16\n12. Talking With Myself '98 (Beloved Radio Edit) - 4.05 ------------------------------Electribe 101 was a British based electronic music group in the late 1980s and early 1990s, managed by Tom Watkins of Bros, Pet Shop Boys, and 2wo Third3 fame. Named after a Soviet refrigerator and/or the popular Roland SH-101 synthesiser, the band was comprised of four electronic composers/producers from Birmingham. These were (Brian Nordhoff, Joe Stevens, Les Fleming, and Roberto Cimarosti) and a female vocalist from Hamburg, Germany (Billie Ray Martin).\n\nBefore signing to Mercury Records in 1988, they released their first single &quot;Talking With Myself&quot; without much success. However before the next single release, Billie Ray Martin guested with Eric Robinson of Eric and the Good Good Feeling on the S'Express record, &quot;Hey Music Lover&quot;.\n\nThe Top Ten success of &quot;Hey Music Lover&quot; sparked interest from the music press in Billie Ray Martin's band, though Eric and the Good Good Feeling's album flopped on Exquinox. Electribe 101 were signed to Mercury Records / Phonogram, and a press blitz (justified in this case) concerning their groundbreaking singles commenced as &quot;Tell Me When The Fever Ended&quot; (their first release on Mercury) was hitting the racks.\n\nIn 1990 Electribe 101 released their debut album called Electribal Memories to critical acclaim. The group's tracks were compared heavily to the music of Larry Heard, also known as Fingers Inc. and later as Mr. Fingers. Both Heard, and fellow house pioneer Frankie Knuckles, contributed remixes. &quot;Electribal Memories&quot; was a slinky house based album in a style similar to other early 1990s acts, such as The Beloved and Sunsonic. Electribe 101 stood out for their mixture of hip-hop beats (used as samples to garnish their grooves), techno house, avante-garde poetry and classic American soul.\n\nWith the release of their album, they also re-released their single &quot;Talking With Myself&quot; which faired quite well, peaking at #23 on the UK singles chart. However, this was the last Electribe 101 song to do so.\n\nIn late 1990, the band released their reading of the classic Jesse Rae song Inside Out (a hit, amongst others, for the group Odyssey in the early 1980s. Perhaps due to fallings-out with their management and a lack of a unified vision for the group's future, promotion was inadequate. The song failed to reach the Top 75. It has become an underground classic, as have all of their single releases.\n\nThough accounts vary as to why, the group split during sessions for the never-completed second album. Not wanting to carry on under the Electribe 101 name without Billie, the band renamed themselves The Groove Corporation and signed to the Network sub-label Six6 - already home to Kevin Saunderson and his project Inner City. After guesting on tracks for others, Billie made a solo debut when her first single for WEA, &quot;Your Loving Arms&quot; stormed the club charts in every European country before repeating its success on U.S. dancefloors. A second single &quot;Running Around Town&quot; failed to perform as well, but the third &quot;Imitation of Life&quot; enjoyed a respectable release, and has become a classic in its own right. Electribe 101's importance can be discerned by their presence in Ben Watt's 2005 &quot;Essential Mix&quot; for Radio One: the relatively short set of mostly 2004/2005 house tracks featured their 1990 single &quot;Inside Out&quot; in its closing grooves. &quot;Talking With Myself&quot; and &quot;Tell Me When the Fever Ended&quot; continue to pop up in hipster-oriented &quot;Chillout&quot; compilations. [ WIKIPEDIA http://en.wikipedia.org/wiki/Electribe_101 ]","torrent":{"xt":"urn:btih:cea42ea016b76d29a1b39d7ddb04661ea82408d2","amp;dn":"ELECTRIBE+101+-+Electribal+Memories+%28The+Best+Of%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea42ea016b76d29a1b39d7ddb04661ea82408d2","infoHashBuffer":{"type":"Buffer","data":[206,164,46,160,22,183,109,41,161,179,157,125,219,4,102,30,168,36,8,210]},"announce":[],"urlList":[]}}