{"title":"Larken Rose -- 2008-06-19 For the Unpopular Side","uid":4248388,"size":4600,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:cf0bc47be40166d9b55c24813a5fbe64b89ab029&amp;dn=Larken+Rose+--+2008-06-19+For+the+Unpopular+Side&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"asc11","files":1,"time":1213897363,"description":"Subject: For the Unpopular Side\nFrom:    &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;21554c45520c4d4852550c4e564f4453614c40484d0c4d4852550f424e4c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nDate:    Thu, 19 Jun 2008 02:38:36 -0400\n\n\n                For the Unpopular Side\n\nOnce again, I welcome the opportunity to be on the unpopular side\nof a controversy. After all, what positive change ever came from\narguing something popular?\n\nThe Supreme Court recently made a ruling acknowledging that enemy\ncombatants, or whatever you want to call them, have certain rights.\nMany proud Americans are outraged at the idea that foreign\nterrorists are to be afforded the right to counsel, the right to\ntrial, etc.\n\nI&amp;#039;m not.\n\nWhen the Declaration of Independence acknowledged that ALL men (not\njust all Americans) are created equal, and when the Bill of Rights\nspelled out some of the things that &quot;governments&quot; should NEVER be\nallowed to do, it wasn&amp;#039;t for the purpose of protecting murderers\nand thieves. It was for the purpose of protecting people ACCUSED of\nbeing murderers and thieves. The point is, if you let &quot;government&quot;\ntreat people like dirt, simply because it has DECLARED them to be\nbad guys, all limitations upon &quot;government&quot; power and any notion of\nindividual rights are toast.\n\nIf someone really IS a terrorist, who kills innocent people to\nfurther a political agenda (which, incidentally, describes a lot of\npeople who work for the United States government), then I don&amp;#039;t\ncare much what is done to them. Trouble is, I don&amp;#039;t KNOW who is a\nterrorist and who isn&amp;#039;t, and neither do you. Furthermore, I would\nNEVER trust those in &quot;government&quot; to tell the truth about it--\nassuming they even know either. Having myself been the target of\ndefamation, demonization, harassment and terrorization by the feds,\nI wouldn&amp;#039;t for one second take their word for it when the American\ntyrants declare someone to be an &quot;enemy combatant.&quot; (For any who\nwould, I recommend not only the movie &quot;Rendition,&quot; but the\ndocumentary found on the DVD of that film.)\n\n(On a technical/legal note, how exactly can there be enemy\ncombatants and war criminals when there isn&amp;#039;t a war? Under the\nConstitution, only Congress can declare war, and they have not done\nso. So what is happening in the middle east is an undeclared\nmilitary occupation of a foreign country, and it doesn&amp;#039;t surprise\nme that lots of people in that country--including good people--\naren&amp;#039;t thrilled about that.)\n\nSo do people ACCUSED of being terrorists, or &quot;enemy combatants,&quot; or\nwhatever, deserve to be treated as innocent until proven guilty?\nPut the shoe on the other foot. (That&amp;#039;s often a good way to test\nthat thing called &quot;principles.&quot;) If Chinese troops came over here,\nand did random searches of homes without warrants or probable\ncause, and arrested hundreds of people based on nothing more than\nguesses or suspicions, would you think it was okay? In other words,\ndo you ACTUALLY believe in freedom, or do you just believe that YOU\nshould be free? Personally, I even believe that people who don&amp;#039;t\nlook like me and don&amp;#039;t think what I think still deserve freedom.\n(I&amp;#039;m funny that way.)\n\nWhen politicians whine that they need more power, NEVER assume that\nthey want that power to use against bad guys--though that will\nALWAYS be what they claim. Instead, assume that they want to use\nthat power against YOU--because that will always be the truth.\n(&quot;Governments&quot; will always be more afraid of the good people than\nthey are of the bad guys, because good people are a far greater\nthreat to tyranny.) Imagine that they intend to use their power\nagainst you. Then decide whether there should be limits on what\nthey can do.\n\nSincerely,\n\n\nLarken Rose &lt;a href=&quot;\nhttp://www.tyrantbook.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tyrantbook.com&lt;/a&gt;\n","torrent":{"xt":"urn:btih:cf0bc47be40166d9b55c24813a5fbe64b89ab029","amp;dn":"Larken+Rose+--+2008-06-19+For+the+Unpopular+Side","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf0bc47be40166d9b55c24813a5fbe64b89ab029","infoHashBuffer":{"type":"Buffer","data":[207,11,196,123,228,1,102,217,181,92,36,129,58,95,190,100,184,154,176,41]},"announce":[],"urlList":[]}}