{"title":"Jack Blood - Deadline Live - 080617","uid":4248265,"size":38333226,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cf6402c0f866514ebae118fbc8381d975959ad8f&amp;dn=Jack+Blood+-+Deadline+Live+-+080617&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HueMann","files":1,"time":1213893168,"description":"\n\nTHE CEREMONY IS ABOUT TO BEGIN. WAKE UP!\n\nAs a Radio Talk show host for the last several years, Jack Blood has interviewed some of the Top experts, researchers, investigative reporters, historians, Whistle-Blowers, and political &quot;policy makers&quot; the world over.\n\n\nThe list includes:\n\nFour Star General Tony McPeak (Joint Chiefs USAF - Gulf War 1)\nGeneral Janis Karpinski (Abu Graib)\nFormer Governors Jerry Brown and Grey Davis\nCol.s Oliver North\nDoug Rokke (DU)\n\n\nCelebrities:\n\nChuck Barris (The Gong Show)\nTom Coughlin (Billy Jack)\nand Jeanne Garafolo\n\nCongressman Ron Paul\nCongressman Tom Tancredo\n\nFormer Deputy Secretary of the Treasury: Paul Craig Roberts\n\nFormer Chief Economist Dept of Labor: Morgan Reynolds\n\nFormer CIA Analyst: Ray McGovern\n\nMI5 Whistle Blowers: David Shayler and Annie Machon\n\nNBC&amp;#039;s - Meet the Press Host: Tim Russert\n\nFormer Deputy Secretary of Education: Charlotte Iserbyt\n\nFormer UN Weapons Inspector: Scott Ritter\n\n\nAuthors:\n\nDavid Ray Griffin (New Pearl Harbor), Mark Crispin Miller, Howard Zinn, Jim Marrs, David Brock, Dave McGowen, Will Thomas, Webster Tarpley, Stephan Kinzer, Greg Palast, Alex Jones, and Anthony Hilder\n\nFormer Presidential Speech Writer (&quot;Axis of Evil&quot; Speech) David Frum, &quot;Buzz&quot; Patterson (Carried the nuclear &quot;Football&quot; for Bill Clinton)\n\nPentagon Whistle Blower Daniel Ellsburg (&quot;The Pentagon Papers&quot;)\n\nFormer Israeli Ambassador to the UN Dr. Dore Gold\n\nFormer Gitmo Chaplin: James Yee\n\nUn-embedded Iraq reporter: Dahr Jamail\n\nDEA Whistle Blower: Cele Castillo\n\n911 hero and Whistle Blower: William Rodriguez\n\n... and a load of Neo Con, CFR, Bilderberg, Think-Tank types, Local and regional Politicians, NWO official spokespersons, Thought Criminals, and Enemies of the State.\n\n\n\n\nDEADLINE LIVE with Jack Blood is now in it&amp;#039;s 5th year of broadcasting, and it&amp;#039;s 2nd year of syndication. With several years of research and comprehensive information gathering, Jack has a serious understanding of how the Global Super Elite do their business.\n\nHe understands and decodes the doublespeak, and groupthink of the mainstream media, and outlines the agenda of those who would seek to kill off or enslave the planet. Jack can also discuss Mind Control, Corporate Corruption, The Police State, Globalism, The United Nations Agenda (Inalienable Rights vs UN Privileges), Secret Societies, Government Sponsored Terrorism, and Collectivism vs Individual Sovereignty as well as Breaking News Du Jour.\n\nJack Blood has been interviewed on Numerous radio stations, and syndicated radio networks, and is currently available for interviews EVERYWHERE!\n\nCall your local radio station, TV station, or Print Vehicle NOW... Jack will represent you, and freedom lovers EVERYWHERE!\n\nJack Blood is NOT affiliated with any organizations, or political parties, and does not have any other mission than that of freedom of human consciousness.\n\nJack Blood is currently publishing a monthly newsletter &quot;Matrix Monthly&quot; while publishing his website www.jackblood.com - Jack is also writing a new series of documentary films Titled &quot;The Matrix Chronicles&quot; the first of which will focus on the social and economically engineered &quot;Clash of Civilizations&quot; using the standard &quot;Divide and Rule&quot; tactics and covert colonization of the powers that be.\n\nJack Blood is a experienced Investigative reporter with several syndicated articles to his credit. Jack Blood Frequently guest hosts for Alex Jones, and does a lot of public speaking everywhere.\n\n\n\nwww.jackblood.net or www.uncoverthenews.com for news and discussion go to www.jackbloodforum.com\n\n\n\nID3 Tagged by HueMann\n\n\n","torrent":{"xt":"urn:btih:cf6402c0f866514ebae118fbc8381d975959ad8f","amp;dn":"Jack+Blood+-+Deadline+Live+-+080617","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf6402c0f866514ebae118fbc8381d975959ad8f","infoHashBuffer":{"type":"Buffer","data":[207,100,2,192,248,102,81,78,186,225,24,251,200,56,29,151,89,89,173,143]},"announce":[],"urlList":[]}}