{"title":"Unreported World -Kenya's Human Time Bomb ( Ch. 4) 2008 04 18","uid":4143375,"size":182642688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cf89285a236723477622390c76babf4a744930a6&amp;dn=Unreported+World+-Kenya%5C%27s+Human+Time+Bomb+%28+Ch.+4%29+2008+04+18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shunster07","files":1,"time":1208564102,"description":"Unreported World -Kenya&amp;#039;s Human Time Bomb ( Ch. 4) 2008 04 18 xvid\n\n\n24 mins\n174 megs\n &lt;a href=&quot;\nhttp://www.channel4.com/news/ontv/unreported_world/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/news/ontv/unreported_world/&lt;/a&gt;\n\nKenyan born reporter Aidan Hartley reports from Kenya on the exploding population problem, one of the root causes of the recent violence, and a crisis which may yet lead to the complete implosion of what has been Africa&amp;#039;s most stable democracy.\n\nKenyan born reporter Aidan Hartley and director George Waldrum report from Kenya on the exploding population problem, one of the root causes of the recent violence, and a crisis which may yet lead to the complete implosion of what has been Africa&amp;#039;s most stable democracy. The link between terrible violence and the fact that the land just cannot sustain Kenya&amp;#039;s growing numbers has gone almost unnoticed by the international media and NGOs.\n\nHartley and Waldrum begin their journey in the Rift Valley, western Kenya, where long after the political agreement the killings go on. Much of the violence is driven by a land-hungry mass of frustrated young men who resort to crime rather than accept poverty and hunger. ?\n\nThe team visits the hospital where the survivors were taken. Harltey finds 10 year old Miriam, whose mother was decapitated, and 12 year old Emma, both with severe burns. The doctors are working overtime to save lives but cannot cope with the increasing number of people. Now with the ongoing conflict the facilities are stretched even further, as a result the two badly burned girls have to share a bed.\n\nThe team moves on to a nearby slum where they find a school buckling under the weight of the population explosion. One class has 120 children and there&amp;#039;s only one toilet for 1400 boys. A estimated 80 new classrooms a day are needed to keep up with the increased number of pupils.\n\nUnreported World also investigates the failure of family planning. In the rural area of the Rift Valley they find one family that is the size of a small village. They discover that tradition and a previous lack of health care are the reasons why poor Kenyans are having large families - leading to an ecological collapse?.\n\nHarltey negotiates access to one tribal militia group called the Saboat Land Defence Force or SLDF. No international journalists have filmed them before. This violent criminal gang based in the forests of Mount Elgon is reportedly responsible for more than 500 killings.\n\nAs the team finishes their journey, Hartley concludes this is a scene he thought he&amp;#039;d witness in Kenya, a country described as a stable democracy. As the population rises and too many people draw on too few resources, Kenya&amp;#039;s future looks uncertain. edits\n\n\nshunster","torrent":{"xt":"urn:btih:cf89285a236723477622390c76babf4a744930a6","amp;dn":"Unreported+World+-Kenya%5C%27s+Human+Time+Bomb+%28+Ch.+4%29+2008+04+18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf89285a236723477622390c76babf4a744930a6","infoHashBuffer":{"type":"Buffer","data":[207,137,40,90,35,103,35,71,118,34,57,12,118,186,191,74,116,73,48,166]},"announce":[],"urlList":[]}}