{"title":"Desert Punk (Sunabouzu) Disc (DVD5 ISO) 5 of 6","uid":4252754,"size":4690459254,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d106d6f5a0671f853a779080f7f59b9e3262fadb&amp;dn=Desert+Punk+%28Sunabouzu%29+Disc+%28DVD5+ISO%29+5+of+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"newdrathor","files":4,"time":1214090195,"description":"This is a dvd-rip of the anime series Desert Punk. The disk was ripped with Anydvd and Dvdshrink. It has been compressed to a DVD-5 ISO. Just mount or burn and enjoy.\n\nSeries Summary:\n In the future, Japan is a wasteland. In the Great Kantou Desert, scattered humans eke out a living in the hot sand. Among them, a short-statured man they call \\&quot;Sunabouzu\\&quot; makes a living as a bounty hunter. Like a demon of the sand, he seems unbeatable. Yet, like all men, he has a particular weakness for the opposite sex...\n\nDisc Summary:\nThe Great Kanto desert is a place of extremes, where foe becomes friend and friend becomes fodder.\n\nJunko\\&amp;#039;s coquettish ways have finally caught up with her and now she\\&amp;#039;s on the run from a lustful sniper. Appealing to Desert Punk and Kosuna for their help, the three hightail it across the sand only to find themselves facing an even nastier adversary. Will the rag-tag trio have to join forces with their trigger happy pursuer to survive this new challenge?\n\nOn a job that takes them underground (literally!), the Punk and his apprentice confront a lot of faces from their past. Apparently everyone and their mutt has been part of an anti-government movement...\n\nDisc Title: Under the Desert\n\nFeel free to PM me with a suggestion for another series release.\n\n\nHave any Questions look me up at irc://irc.rizon.net/Drathor","torrent":{"xt":"urn:btih:d106d6f5a0671f853a779080f7f59b9e3262fadb","amp;dn":"Desert+Punk+%28Sunabouzu%29+Disc+%28DVD5+ISO%29+5+of+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d106d6f5a0671f853a779080f7f59b9e3262fadb","infoHashBuffer":{"type":"Buffer","data":[209,6,214,245,160,103,31,133,58,119,144,128,247,245,155,158,50,98,250,219]},"announce":[],"urlList":[]}}