{"title":"Traveling Wilburys vol 1","uid":4155279,"size":34886330,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d14a5587a1bce5a4766a9a33762727d0f8a96a6d&amp;dn=Traveling+Wilburys+vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hufc114","files":11,"time":1209083796,"description":"In early April 1988, George Harrison was in Los Angeles, California and needed to record a B-side for a European 12-inch single. Jeff Lynne was also in Los Angeles producing some tracks for Roy Orbison as well as Tom Petty?s solo album. While having dinner with Lynne and Orbison, Harrison related how he needed to record a new track and wanted to do it the next day. Both offered to help. Needing a studio on short notice, Harrison suggested they call Bob Dylan, who had a home studio. After dinner, George stopped by Tom Petty?s house to pick up his guitar for the next day?s session and invited him along too. Gathering at Dylan?s Malibu home the following day, they wrote and recorded the song ?Handle with Care?, with all five sharing the vocals.[1]\nThe track was considered too good to be used as a B-side, so Harrison hatched the idea to form a band and record another nine songs for an album. The group got together again for nine days in May, recording the basic tracks and vocals at Dave Stewart?s home studio in Los Angeles. Overdubs and mixing were done back in England at Harrison?s home studio F.P.S.H.O.T. (Friar Park Studio, Henley-on-Thames).\nMasquerading as the Wilbury brothers, the participants would be known as Nelson (Harrison), Otis (Lynne), Lucky (Dylan), Lefty (Orbison) and Charlie T. Jr. (Petty). Harrison was no stranger to the use of alternate identities with Sgt Pepper&amp;#039;s Lonely Hearts Club Band, but this concept was taken a step further: their real names never appear anywhere on the album, liner notes, or even the songwriting credits.\nWith Harrison having the greatest claim to the band, he signed them up to Warner Bros. Records (which Petty eventually signed to himself), his current label, and incorporated their own Wilbury Records label, in addition to producing the sessions with Lynne that spring.\n\n&quot;Handle with Care&quot; ? 3:20 \n&quot;Dirty World&quot; ? 3:30 \n&quot;Rattled&quot; ? 3:00 \n&quot;Last Night&quot; ? 3:48 \n&quot;Not Alone Any More&quot; ? 3:24 \n&quot;Congratulations&quot; ? 3:30 \n&quot;Heading for the Light&quot; ? 3:37 \n&quot;Margarita&quot; ? 3:15 \n&quot;Tweeter and the Monkey Man&quot; ? 5:30 \n&quot;End of the Line&quot; ? 3:30\n","torrent":{"xt":"urn:btih:d14a5587a1bce5a4766a9a33762727d0f8a96a6d","amp;dn":"Traveling+Wilburys+vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d14a5587a1bce5a4766a9a33762727d0f8a96a6d","infoHashBuffer":{"type":"Buffer","data":[209,74,85,135,161,188,229,164,118,106,154,51,118,39,39,208,248,169,106,109]},"announce":[],"urlList":[]}}