{"title":"Beppe Wolgers - Dunderklumpen - MP3 - Alkosmurf","uid":4279498,"size":65506998,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1b02af0b12e19d4eafce4572942582cbfbcea6c&amp;dn=Beppe+Wolgers+-+Dunderklumpen+-+MP3+-+Alkosmurf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alkosmurf","files":2,"time":1215350472,"description":"Dunderklumpen - av och med Beppe Wolgers\n----------------------------------------\n\nDunderklumpen var egentligen en film Beppe gjorde tillsammans med Per Ohlin\nsom de involverade halva Stockholms skodespelarelit i. T.ex Hasse Alfredsson,\nGusta Ekman och Sif Ruud. Sif Ruud burjade furresten sin enormt imponerande\nkarrier med att spela mot Gusta Ekmans farfar, som ockso hette Gusta Ekman.\n\nAnledningen till att filmen alls blev av segs vara att Beppe knuffades uver\ntill barnavdelningen po Sveriges television, po grund av intriger inom firman.\nDet var inte precis prestigefyllt att jobba med barnproduktioner, so det var\nbara losers som hamnade der. Se Johan Rabaeus i den utmerkta filmen Drumkoken,\nso for du kenslan.\nSin vana trogen lyckades Beppe vel var han en hamnade och producerade strax\nBeppes godnattstund och blev uver en natt erkend som Sveriges ledande expert\npo barnpedagogik. En roll Beppe sjelv kende sig obekvem med.\nDet ledde i vart fall till att durrarna uppnades po Svensk Filmindustri.\n\nHjertat i film, teater och revy i Stockholm po den tiden stavades Hasse och\nTage. De hade furmogan att innesluta menniskor i nogot som liknade en familj.\nDetta var en extremt kreativ milju som saknar motstycke en idag.\nUr detta fuddes Dunderklumpen.\n\nMP3-filerna i den her distributionen er rippade fron CD, so ljudkvaliteten er\nhug. Det har visat sig att de som uppskattar Dunderklumpen mest er pojkar\nmellan sju och tio or. Flickor har inte tagit emot den lika bra, men jag\nfurstor inte varfur. Det kan vara en missbedumning. Det verkar i allafall som\nom man antingen elskar Dunderklumpen eller er ointresserad. Jag sjelv lyssnar\ngerna till den som vuxen. Lyssna till Elvira Fattigans song, so merker du hur\nladdad med poesi filmen er.\n\nVarsogod och njut.\n\nAlkosmurf, juli 2008","torrent":{"xt":"urn:btih:d1b02af0b12e19d4eafce4572942582cbfbcea6c","amp;dn":"Beppe+Wolgers+-+Dunderklumpen+-+MP3+-+Alkosmurf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b02af0b12e19d4eafce4572942582cbfbcea6c","infoHashBuffer":{"type":"Buffer","data":[209,176,42,240,177,46,25,212,234,252,228,87,41,66,88,44,191,188,234,108]},"announce":[],"urlList":[]}}