{"title":"Das Stahltier - The Steel Animal (german avantgarde from 1934) e","uid":3324074,"size":366293467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1b8b4ea25f23937a4f72370aaa4a6380c29419e&amp;dn=Das+Stahltier+-+The+Steel+Animal+%28german+avantgarde+from+1934%29+e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Fudoh","files":2,"time":1114965905,"description":"Das Stahltier by Willy Zielke 1934 \n\ndvd (vhs source) to xvid, 560x416, 41 minutes, 349 mb, german with english subs. \n\nunfortunately this is not the 70 minutes complete version;-( but it's still a must see. \n\nimdb: http://www.imdb.com/title/tt0121767/ \n\nfilmportal (german but plenty of pics): http://www.filmportal.de/df/65/Uebersicht,,,,,,,,4853DFA246074C888F50B9CF0C797DBD,,,,,,,,,,,,,,,,,,,,,,,,,,,.html \n\nimdb says: \n\nWilly Zielke has made DAS STAHLTIER (the steel animal) for the 100th anniversary of the German railroad. Almost half of the film is missing now, but what has survived the editing is still sensational. \n\nFirst the camera documents the construction of an engine, then the main character (Aribert Mog) tells some track-layers the story of steam and its taming. \n\nWonderful episodes with working replicas of the original machines are to see. My favorite is the one with Hedley's Puffing Billy: some mine workers load coal wagons (one sings very loud) and couple them together, Hedley climbs onto the machine and finally the train leaves, but soon the brakeman has difficulties to stop it, because a cow is on the track ... \n\nThe last episode depicts the cause of this film. It's the year 1835. At the station in Nuernberg are a lot of people to celebrate the opening of the first German railway. After the train (pulled by an engine called Adler) has left the film jumps back to the present (1935) and Aribert Mog interprets the new-built locomotive, a famous Bavarian S3/6, as a steel animal: it has scales (rivets), a heart (supply pump), eyes (lights) and so on. \n\nThen it departs and very fast cuts give the impression of speed. There are very close shots of the driving mechanism and other parts of the engine, the tracks and the signals. Finally the brakes are to hear and the locomotive comes to a standstill. \n\nThe technical side of the film (the beautiful replicas) is admirable, the many character faces are wonderful (how Zielke's camera has captured the human emotions is unrivaled), the costumes are magnificent, there is humor and sadness, and, last but not least, the music by famous composer Peter Kreuder creates always a perfect mood. \n\nDAS STAHLTIER is a great work of art. I give it the highest rating - not only because I'm a steam locomotive fan. \n\nimdb trivia: \n\nThe expensive film, made for the 100th anniversary of the German railroad, was not shown in 1935! Reichspropagandaminister Goebbels didn't like it at all, because much of the time is devoted to English railway pioneers like William Hedley and George Stephenson. Finally the release came 20 years later.","torrent":{"xt":"urn:btih:d1b8b4ea25f23937a4f72370aaa4a6380c29419e","amp;dn":"Das+Stahltier+-+The+Steel+Animal+%28german+avantgarde+from+1934%29+e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b8b4ea25f23937a4f72370aaa4a6380c29419e","infoHashBuffer":{"type":"Buffer","data":[209,184,180,234,37,242,57,55,164,247,35,112,170,164,166,56,12,41,65,158]},"announce":[],"urlList":[]}}