{"title":"Jersey Girl -By Yarouze-[Espanish-English-Deutsch][DVD-9]","uid":4111208,"size":8326387712,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d1b803629366401653c72deaa813f914b3ddfe2b&amp;dn=Jersey+Girl+-By+Yarouze-%5BEspanish-English-Deutsch%5D%5BDVD-9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"yarouze","files":28,"time":1207068860,"description":"Jersey Girl is an enjoyable film to watch, even if it is a little derivative. Ben Affleck plays Ollie Trinke, a Manhattan music publicist whose life is turned upside down when his pregnant wife (Jennifer Lopez) dies in childbirth, leaving him a single father. Moving to his father\\&amp;#039;s house in a Jersey suburb, Ollie and his daughter Gertie try to get accustomed to the new lifestyle as Ollie meets a local woman (Liv Tyler) who helps change his look on life. The plot is nothing new but the film is still pretty good. I thought this film was going to be really bad but I was surprised. Its not an Oscar quality film, its just a nice to film to watch if you have nothing better to do. Ben Affleck\\&amp;#039;s performance was actually not bad and its watch able. Liv Tyler performance was very good and she really showed she has some talent. Raquel Castro plays Gertie and she does an alright job but she is no Dakota Fanning. Jason Biggs has a very small role and he does a decent job. Jennifer Lopez isn\\&amp;#039;t in the film for very long, which is good as her performance isn\\&amp;#039;t very good. Matt Damon and Jason Lee both have cameos. Kevin Smith tries a new type of film and he does a good job. The only problem I had with Jersey Girl was that it wasn\\&amp;#039;t very original. Most of the dialog had been used in previous films like Kramer vs. Kramer. The story is good even if it is a little unrealistic and unoriginal. The running time is only 102 minutes long so unless you really hate Affleck, its not too much of a pain to watch. The film is also very predictable so its disappointing that Kevin Smith didn\\&amp;#039;t try something new. There are a lot of funny moments as well as sad moments that may get to you. In the end, this is a predictable, safe film to watch and one that can easily be enjoyed. Rating 7/10, worth checking out.\n\nfulldvd-9 \n\nlang:spanish,english,deustch\nsubs:spanish,english,deustch","torrent":{"xt":"urn:btih:d1b803629366401653c72deaa813f914b3ddfe2b","amp;dn":"Jersey+Girl+-By+Yarouze-%5BEspanish-English-Deutsch%5D%5BDVD-9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b803629366401653c72deaa813f914b3ddfe2b","infoHashBuffer":{"type":"Buffer","data":[209,184,3,98,147,102,64,22,83,199,45,234,168,19,249,20,179,221,254,43]},"announce":[],"urlList":[]}}