{"title":"Buddy Holly and the Crickets - The Very Best Of Buddy Holly And ","uid":4030904,"size":112162655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d20b2267aea307786d82535d01dda816ca5cafbe&amp;dn=Buddy+Holly+and+the+Crickets+-+The+Very+Best+Of+Buddy+Holly+And+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pubfood22","files":38,"time":1203172331,"description":"Buddy Holly and the Crickets - The Very Best Of Buddy Holly And The Crickets\n\nRipped by Nielsie, Feb 2008.\nAll files encoded in 192Kbps. Please keep seeding after downloading, thank you.\n\n\nPlaylist files:\n\n1. Buddy Holly and the Crickets - Heartbeat (2:11)\n2. Buddy Holly and the Crickets - That&amp;#039;ll Be The Day (2:18)\n3. Buddy Holly and the Crickets - Peggy Sue (2:31)\n4. Buddy Holly and the Crickets - Oh Boy! (2:09)\n5. Buddy Holly and the Crickets - Rave On (1:50)\n6. Buddy Holly and the Crickets - Think It Over (1:45)\n7. Buddy Holly and the Crickets - Brown Eyed Handsome Man (2:05)\n8. Buddy Holly and the Crickets - Love&amp;#039;s Made A Fool Of You (1:58)\n9. Buddy Holly and the Crickets - True Love Ways (2:51)\n10. Buddy Holly and the Crickets - Raining In My Heart (2:49)\n11. Buddy Holly and the Crickets - Everyday (2:10)\n12. Buddy Holly and the Crickets - Wishing (2:04)\n13. Buddy Holly and the Crickets - It&amp;#039;s So Easy (2:12)\n14. Buddy Holly and the Crickets - Listen To Me (2:23)\n15. Buddy Holly and the Crickets - It Doesn&amp;#039;t Matter Anymore (2:04)\n16. Buddy Holly and the Crickets - Words Of Love (1:53)\n17. Buddy Holly and the Crickets - I&amp;#039;m Gonna Love You Too (2:14)\n18. Buddy Holly and the Crickets - Well... All Right (2:15)\n19. Buddy Holly and the Crickets - Bo Diddley (2:21)\n20. Buddy Holly and the Crickets - Blue Suede Shoes (1:55)\n21. Buddy Holly and the Crickets - Shake Rattle And Roll (1:24)\n22. Buddy Holly and the Crickets - What To Do (1:53)\n23. Buddy Holly and the Crickets - Midnight Shift (2:12)\n24. Buddy Holly and the Crickets - Love Is Strange (3:05)\n25. Buddy Holly and the Crickets - Crying, Waiting, Hoping (2:06)\n26. Buddy Holly and the Crickets - Peggy Sue Got Married (2:05)\n27. Buddy Holly and the Crickets - Maybe Baby (2:02)\n28. Buddy Holly and the Crickets - Early In The Morning (2:09)\n29. Buddy Holly and the Crickets - Baby I Don&amp;#039;t Care (1:37)\n30. Buddy Holly and the Crickets - Reminiscing (1:59)\n31. Buddy Holly and the Crickets - Valley Of Tears (2:09)\n32. Buddy Holly and the Crickets - Learning The Game (2:03)\n33. Buddy Holly and the Crickets - Look At Me (2:05)\n34. Buddy Holly and the Crickets - Fools Paradise (2:31)\n35. Buddy Holly and the Crickets - Take Your Time (1:59)\n36. Buddy Holly and the Crickets - Not Fade Away (2:15)\n\n\nBiography\n\nBuddy Holly was born Charles Hardin Holley in Lubbock, Texas[1] to Lawrence Odell Holley and Ella Pauline Drake in 1936. The Holleys were a musical family and as a young boy Holley learned to play the violin (his brothers oiled the strings so much that no one could hear him play), piano, guitar and fiddle. In the fall of 1949, he met Bob Montgomery in Hutchinson Junior High School. They shared a common interest in music and soon teamed up as the duo &quot;Buddy and Bob.&quot; Initially influenced by bluegrass music, they sang harmony duets at local clubs and high school talent shows. His musical interests grew throughout high school while singing in the Lubbock High School Choir.[4]\n\nHolly turned to rock music after seeing Elvis Presley sing live in Lubbock in early 1955. A few months later, he appeared on the same bill with Presley, also in Lubbock. Holly&amp;#039;s transition to rock was finalized when he opened for Bill Haley &amp; His Comets at a local rock show organized by Eddie Crandall, who was also the manager for Marty Robbins. As a result of this performance, Holly was offered a contract with Decca Records to work alone, which he accepted. According to the Amburn book (p. 45), his public name changed from &quot;Holley&quot; to &quot;Holly&quot; on February 8, 1956, when he signed the Decca contract. Among the tracks recorded for Decca was an early version of &quot;That&amp;#039;ll Be The Day&quot;, which took its title from a phrase that John Wayne&amp;#039;s character said repeatedly in the 1956 film, The Searchers.[5]\n\n \n&quot;The Crickets&quot;: Buddy Holly, Joe B. Mauldin, Jerry Allison, and Niki SullivanBack in Lubbock, Holly formed his own band, The Crickets and began making records at Norman Petty&amp;#039;s studios in Clovis, New Mexico. Norman had music industry contacts and believing that &quot;That&amp;#039;ll Be the Day&quot; would be a hit single, he contacted publishers and labels. Coral Records, a subsidiary of Decca, signed Buddy Holly and The Crickets. This put Holly in the unusual position of having two record contracts at the same time. Before &quot;That&amp;#039;ll Be The Day&quot; had its nationwide release, Holly played lead guitar on the hit-single &quot;Starlight&quot;, recorded in April, 1957, featuring Jack Huddle. The initial, unsuccessful version of &quot;That&amp;#039;ll Be The Day&quot; played more slowly and about half an octave higher than the hit version\n\nHolly managed to bridge some of the racial divide that marked rock n&amp;#039; roll music. While Elvis made black music more acceptable to whites, Holly won over an all-black audience when the Crickets were accidentally booked at New York&amp;#039;s Apollo Theater (though, unlike the immediate response depicted in the 1978 movie The Buddy Holly Story, it actually took several performances for his talents to be appreciated).\n\nAfter the release of several highly successful songs, Holly and the Crickets toured the United Kingdom in 1958.[6]\n\nThat same year, he met Maria Elena Santiago (born 1935 in San Juan, Puerto Rico) while she was working as a receptionist for a New York music publisher. He proposed to her on their very first date. She initially thought he was kidding, but they were married in Lubbock, Texas on August 15, 1958, less than two months after they met. Maria traveled on some of the tours, doing everything from the laundry to equipment set-up to ensuring the group got paid.\n\nThe ambitious Holly became increasingly interested in the New York music/recording/publishing scene, while his easygoing bandmates wanted to go back home to Lubbock. As a result, in 1959, the group split.\n\nHolly began a solo tour with other notable performers, including Ritchie Valens and J.P. Richardson, &quot;The Big Bopper.&quot; One night after a performance in Green Bay, Wisconsin, at the Riverside Ballroom, the three headliners gave their final show, at the Surf Ballroom in Clear Lake, Iowa on February 2, 1959. Afterwards, Buddy Holly chartered a Beechcraft Bonanza to take him and his new back-up band (Tommy Allsup, Carl Bunch, and Waylon Jennings) to Fargo, North Dakota. Carl Bunch missed the flight as he had been hospitalized for frostbite three days earlier. The Big Bopper asked Jennings for his spot on the four-seat plane, as he was recovering from the flu. Ritchie Valens was still signing autographs at the concert site when Allsup walked in and told him it was time to go. Allsup pulled a 50 cent coin out of his pocket and the two men flipped for the seat. Allsup lost.\n\nThe plane took off in light snow and gusty winds at around 12:55 A.M., but crashed after only a few minutes. The wreckage was discovered several hours later by the plane&amp;#039;s owner, Jerry Dwyer, some 8 miles (13 km) from the airport on the property of Albert Juhl. The crash killed Holly, Valens, Richardson, and the 21-year-old pilot, Roger Peterson. Holly&amp;#039;s body, along with those of Valens and Richardson, were thrown from the wreckage, Holly&amp;#039;s body being nearly decapitated by his impact with a tree. Holly and Valens lay 17 feet (5.2 m) south of the wreckage and Richardson was thrown around 40 feet (12 m) to the north of the wreckage. The pilot&amp;#039;s body remained in the wreckage. All had suffered severe and multiple injuries. Without any doubt, all had died on impact, with the plane hitting the ground at 170 mph (270 km/h). While theories abound as to the exact cause of the crash, an official determination of pilot error was rendered by the Civil Aeronautics Board. Although the crash received a good deal of local coverage, it was displaced in the national news by an accident that occurred the same day in New York City, when American Airlines Flight 320 crashed during an instrument landing approach at LaGuardia Airport, killing 65. Don McLean referred to it as &quot;the Day the Music Died.&quot;\n\nHolly&amp;#039;s pregnant wife became a widow after barely six months of marriage and miscarried soon after.\n\n \nCity of Lubbock Cemetery, Holly&amp;#039;s Headstone \nBuddy Holly&amp;#039;s gravestoneHolly&amp;#039;s funeral services were held at the Tabernacle Baptist Church in Lubbock, and his body was interred in the City of Lubbock Cemetery in the eastern part of the city. Holly&amp;#039;s headstone carries the correct spelling of his surname (Holley) and a carving of his Fender Stratocaster guitar.","torrent":{"xt":"urn:btih:d20b2267aea307786d82535d01dda816ca5cafbe","amp;dn":"Buddy+Holly+and+the+Crickets+-+The+Very+Best+Of+Buddy+Holly+And+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d20b2267aea307786d82535d01dda816ca5cafbe","infoHashBuffer":{"type":"Buffer","data":[210,11,34,103,174,163,7,120,109,130,83,93,1,221,168,22,202,92,175,190]},"announce":[],"urlList":[]}}