{"title":"Strangley familier","uid":4102456,"size":1037145511,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d27861d7bef2e5d8d8ca53aedb285650c78bdb83&amp;dn=Strangley+familier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oddbod","files":169,"time":1206643733,"description":"Strangely Familiar mash-up tracks 1-9.\n\nA few great mash-ups for those that like them.\n\nTracks include :\n\nEnya vs James Blunt vs The Prodigy - Orinocco Goodbye Bitch.mp3\nGnarls Barkley Vs The Shirelles - Crazy Baby It&amp;#039;s You.mp3\nHuman League vs Ce Ce Peniston - Finally, Dreams Are Made Of....mp3\nJon Legend Vs Montell Jordan Vs Snoop - How Hot Is Yours.mp3\nJustin Timberlake Vs Chris Brown - Run It Like I Love You.mp3\nKriss Kross Vs Biggie Vs Fugees Vs T Pain Vs Busta -.mp3\nMark Morrison Vs R Kelly &amp; The Game Vs Notorious BIG - Return Of The Playas.mp3\nMadonna Vs Usher - Yeah Lucky Star.mp3\nMartin Solveig Vs D12 Vs Black Eyed Peas - Hump The Bands Jealousy.mp3\nMichael Jackson Vs Pink - Get This Party Black &amp; White.mp3\nMichael Jackson Vs Ne Yo - Starting Sick Love Songs.mp3\nMichael Gray Vs Pied Piper - Do You Really Like The Weekend.mp3\nRight Said Fred Vs TV Rock - Too Sexy To Flaunt It.mp3\nMichael Jackson Vs Blackstreet - No Diggity Billie.mp3\nStanton Warriors Vs Reel 2 Real - Move Your Body (2006).mp3\nThe Veronicas Vs. Pink - U And Ur Hand 4ever.mp3\nU2 vs Air featuring Sonia Dada - You don&amp;#039;t treat Kelly good on Sundays.mp3\nLuthor Vandross Vs Craig David &amp; Mos Def - Seven Days Too Much.mp3\nSoundgarden Vs Joni Mitchell - Like Woodstock.mp3\nGnarls Barkley v Liberty X - Just A Little Bit Crazy.mp3\nThe Beatles Vs Queens Of The Stone Age - Eleanor&amp;#039;s In My Head.mp3\nFranz Ferdinand Vs Liberty X - Do You Want To A Little.mp3\nGary Glitter Vs Peaches - I Didn&amp;#039;t know the boys wanna be her.mp3\nGenesis Vs Gorillaz - Dirty Harry Can&amp;#039;t Dance.mp3\nBeyonce Vs Evanescence - Crazy Life.mp3\nDepeche Mode Vs Nirvana - Dream On About A Girl.mp3\nShakira Vs Jovanotti Vs Ricky Martin - Hips Don&amp;#039;t Lie (L&amp;#039;ombelico de la vida).mp3\nKelly Clarkson Vs Rob Dougan - Walkaway Towards Death.mp3\nSteppenwolf Vs Madonna Vs Apollo 440 Vs Ike &amp; Tina Turner - Wild Rock Music!.mp3\nThe Pixies Vs Britney &amp; Madonna - Me Against The Monkey.mp3\nRay Charles Vs ZZTop Vs Norman Greenbaum Vs Gary Glitter - The Spirit Of Ray.mp3\nHolly Valance v Aguilera - Dirty Kiss .mp3\nHeadrush Vs Quincy Jones - Self Preservation Society 2006.mp3\nWhitney Houston Vs Radiohead - can&amp;#039;t explain, OK.mp3\nDestiny&amp;#039;s Child Vs Stevie Wonder - Bootystition.mp3\nKelly Clarkson Vs Combichrist - Walkaway Master Control.mp3\nJohn Lennon Vs The Temptations Vs The Doors - Imagine A Ball Of Confusion.mp3\nCult Vs The Doors - Sanctuary&amp;#039;s Over (Remix).mp3\nBlack Rebel Motorcycle Club Vs Mousse T - We&amp;#039;re All Horny.mp3\nRihanna Vs Soft Cell Vs Weather Girls Vs Skunk Anansie - S.O.S. It s Weeping Tainted Men.mp3\nMarvin Gaye Vs Britney - Sexual Healing 2 Make U Happy.mp3\nDr Dre Vs Coldplay - The Next Scientist Episode.mp3\nDavid Bowie Vs Grandmaster Flash - Message Of Sound &amp; Vision.mp3\nLudacris VS EMF - Stand Unbelievable.mp3\nGnarls Barkley Vs Avalanches - Crazy Therapist.mp3\nU2 Vs Gorillaz - Feel Good on New Years Day.mp3\nAslan Vs Depeche Mode - Crazy World Of The Revelator.mp3\nPink Vs Leviticus - Get The Drum N Bass Started.mp3\nMadonna Vs Usher - Yeah Lucky.mp3\nPussycat Dolls Vs Juliette &amp; The Licks - Nobody&amp;#039;s Pussycat.mp3\nLL Cool J ft. Jennifer Lopez Vs Tone Loc - Control My Cold Medina.mp3\nElvis Vs U2 - Elvistigo.mp3\nThe Jam Vs The Beatles - Start Taxing Me.mp3\nUB40 Vs 808 State Vs Yazoo - 40 Into 808 Won&amp;#039;t Go.mp3\nYazoo Vs Tears For Fears - Don&amp;#039;t Go In A Mad World.mp3\nKelly Clarkson Vs Annie Lennox - Why U Been Gone.mp3\nLenny Kravitz Vs Mark Morrison - Return of the Krav.mp3\n2 Unlimited Vs Was Not Was - Tribal Dinosaur.mp3\nUB40 vs 808 State - One In 808.wma\nJustice Vs Luisa Fernandez - Lay Love On You.mp3\nPink Vs Fear Factory - Get This Scum Grief Started.mp3\nTony Touch &amp; Doo Wop Vs The Meters - G&amp;#039;z Up Funk.mp3\nSuzanne Vega Vs Dire Straits - Toms Investigations.mp3\nMr. On vs Jungle Brothers - Breathe Don?t Stop.wma\nBeatles Vs Masters At Work - Get Back (White Label Mix).wma\nRun Dmc Vs Tom Petty - Free Adidas.mp3\nKinks Vs Prince Vs The Temptations Vs Crystals - Going To An All Day Confusion In 1999.mp3\nDiana Ross Vs Iggy Pop - Lust Child.mp3\nPolice Vs Rick James - Roxannes A Super Freak.mp3\nStone Roses Vs Air Vs Marvin Gaye - Sexual Fools Darling.mp3\nFatboy Slim Vs Shaggy - Praise, It Wasn&amp;#039;t Me.mp3\nBeatles Vs Temptations - Walrus Confusion.mp3\nThe Beatles Vs Radiohead - Karma In The Life.mp3\nGuns N Roses Vs JayZ - Paradise Dirt.mp3\nPolice Vs Ben E King - Every Breath Stands.mp3\n50 Cent Vs Cranberries - Many Men Are Zombies.mp3\nDepeche Mode Vs Bob Marley - I Feel One Loved.mp3\nHard Fi Vs JayZ Vs ABBA Vs Red Hot Chilli Peppers Vs Flying Lizards - The Money Song.mp3\nGnarls Barkley Vs Frank Sinatra - Fly Me 2 The Krazy Moon.mp3\nGuns N Roses Vs Madness - Sweet Child of Madness.mp3\nU2 Vs Dr Dre - Next Bloody Sunday.mp3\nQueen Vs Fine Young Cannibals - Crazy Little Good Thing.mp3\nChris Isaak Vs Radiohead Vs The Beatles - Wicked Music (For a Norwegian Film).mp3\nBooker T &amp; The Mg&amp;#039;s Vs Duran Duran - Green Lines.mp3\nThe Beatles vs Red Hot Chili Peppers Vs U2 - Let It Be Under The Bridge.mp3\nNirvana Vs Bobby McFerrin Vs Indeep Vs Jet Vs Beastie Boys Vs The Doors Vs America - Nirvanananeenoonoo.mp3\nCure Vs Lou Reed Vs Snow - Walk On The Love Informer.mp3\nSeal Vs The Beatles - Get Crazy Eleanor.mp3\nColonel Abrams Vs Sheila B - Trapped in a Love Bizarre.mp3\nAdamski Vs Vanilla Ice Vs Yazoo Vs C&amp;C Music Factory - Killa Vanilla.mp3\nGenesis Vs Falco - Thats All Falco.mp3\nOasis Vs Leviticus - Songbird Burial.mp3\nFatboy Slim VS. Gorillaz - Gangster Dirty Harry (DJ homma&amp;#039;s Remash-up).mp3\nU2 Vs Happy Mondays - Haven&amp;#039;t Found The Step.mp3\nGorillaz Vs No Doubt Vs Deep Purple - Hella Dare You to Smoke.mp3\nGnarls Barkley Vs Grandmaster Flash - A Krazy Message.mp3\nBeatles Vs Fatboys - A Hard Days Wipeout.mp3\nSepultura vs Eminem - Roots Yourself.mp3\nBilly Preston Vs The Beatles - Get Back.mp3\nAmon Tobin vs Rihanna - The SOS Light.mp3\nGoldfrapp vs. Canned Heat - Ohh The Road Again.mp3\nSnap vs K.T Tunstall - Suddenly I See The Power.mp3\nThe Prodigy Vs. Michael Grey - Funky Weekend Shit.mp3\nThe Streets vs Girls Aloud - You&amp;#039;re Fit But You Know It&amp;#039;s Biology.mp3\nPeaches vs Gang Starr - Titsick.mp3\nStealers Wheel Vs. Sheryl Crow - Stuck In The Middle With Sheryl.mp3\nEnya vs James Blunt - Orinocco Goodbye (Sail away my lover).mp3\nStardust Vs PJ Harvey - PJ Sounds Better With Stardust.mp3\nREM vs Elvis Costello - How To Stand Dumb.mp3\nHole vs Sonia Dada - You Don&amp;#039;t Treat Me Good To Malibu.mp3\nAce Of Base vs. Mariah Carey - All That She Wants Is To Belong Together.mp3\n10CC Vs Marvin Gaye - I&amp;#039;m Not In Love So Let&amp;#039;s Get It On.mp3\nABBA Vs Echo &amp; The Bunnymen - Voulez Moon.mp3\nAce Of Bass Vs Maroon 5 - All She Wants Is This Love.mp3\nFatboy Slim Vs Primal Scream - Primal Jeans.mp3\nMadonna Vs Amerie - Hung Up On One Thing.mp3\nHaddaway Vs New Order - What Is A Jetstream.mp3\nJoy Division Vs Rihanna - S.O.S. Will Tear You Apart.mp3\nModjo Vs Pussycat Doll&amp;#039;s - Lady Don&amp;#039;t Cha.mp3\nMadonna Vs Snoop Dogg &amp; Justin - Holiday Signs.mp3\nMr. On vs Jungle Brothers - Breathe Don?t Stop.mp3\nMylo Vs Beyonce Vs Adina Howard - Drop The Crazy Freak.mp3\nShapeshifters Vs Mario - Let Me Love You Lola.mp3\nPussycat Doll&amp;#039;s Vs Seether - Dontcha Wish Your Seether Was a Freak Like Me.mp3\nThe Verve Vs Missy Elliott - Bittersweet Freak.mp3\nTina Moore Vs KP &amp; Envy - Shorty Swing My Way.mp3\nTLC Vs Pharrel &amp; Gwen - Scrubs Have It Like That.mp3\nUB40 vs 808 State - One In 808.mp3\nArctic Monkeys Vs Pha\nBabamania Vs The Prodigy - Wanna Rock My Bitch Up.mp3\nBeats International Vs Scissor Sisters - Be Good To Your Mama.mp3\nBon Garcon Vs Sean Paul &amp; Blu Cantrell Vs Kevin Lyttle - Turn Breathe Freek.mp3\nBodyrockers Vs ZZ Top - Runaround Sharp Dressed Girl.mp3\nBobby Valentino Vs Michael Jackson - Slow Down &amp; Remember.mp3\nChic Vs Candi Staton - You Got The Good Times.mp3\nBlink 182 Vs Missy Elliott - Work It Out! I Miss You.mp3\nBritney Spears Vs Muse - Britney&amp;#039;s Massive Hole.mp3\nDaft Punk Vs Outkast - Faster Roses.mp3\nBlur Vs Gwen Stefani - 2 Songs Crashed.mp3\nBobby Thurston Vs Lex Rhythm Digitales - Check Out The Jacques.mp3\nDavid Bowie Vs Black Eyed Peas - The Hump Dance.mp3\nThe Doors Vs Muse - Riders on the Supermassive Black Hole.mp3\nThe Stranglers Vs Gorillaz - Clint Peachwood.mp3\nFrankie Goes To Hollywood Vs Frankie Goes To Hollywood - Relax It&amp;#039;s Two Tribes.mp3\nEagles Vs Brownstone - Brownstone California.mp3\nFolder.jpg\nGnarls Barkley Vs Mirwais - Crazy Disco.mp3\nDr Dre Vs Jet - Are You Gonna Be My Next Episode.mp3\nGnarls Barkley Vs Prince - Crazy Times.mp3\nHuman League Vs Ce Ce Peniston - Finally, Dreams Are Made Of This.mp3\nJ-Lo Vs Dutch - Double Play.mp3\nMandy Vs Booka Shade Vs The Doors - Body And Soul Language.mp3\nMaire Brennan Vs The Chemical Brothers - Block Tonic.mp3\nMissy Elliott Vs J.S. Bach &amp; G.F. Handel - Bach The Dutch Or Turn The Handel.mp3\nJoss Stone Vs The Temptations - Just Digging.mp3\nMobb Deep Vs The Maisonettes - Double The Heartache.mp3\nMissy Elliot Vs Salt n Pepa - Push Party.mp3\nMylo Vs Ne Yo - So Sick Of Mylo.mp3\nLayo &amp; Bushwacka Vs Cliff Richard - South Living.mp3\nMichael Jackson Vs Clash - Should I Stay Or Should I Boogie.mp3\nNew Order Vs Madonna - Hung Up On Blue Monday.mp3\nMax Graham Vs Yes Vs The Black Eyed Peas - Owner Of A Lonely Hump.mp3\nQueen Vs Beenie Man - Radio Ragga.mp3\nRaconteurs Vs Les Rhythm Digitales - Steady As Jacques Goes.mp3\nRod Stewart Vs Bryan Adams - Maggies Summer.mp3\nShania Twain Vs Destinys Child - Impressive Name.mp3\nRihanna Vs Busta Rhymes - Pon Da Busta.mp3\nRem Vs Robbie Williams - Losing My Advertising Space.mp3\n\nEnjoy and Seed.","torrent":{"xt":"urn:btih:d27861d7bef2e5d8d8ca53aedb285650c78bdb83","amp;dn":"Strangley+familier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d27861d7bef2e5d8d8ca53aedb285650c78bdb83","infoHashBuffer":{"type":"Buffer","data":[210,120,97,215,190,242,229,216,216,202,83,174,219,40,86,80,199,139,219,131]},"announce":[],"urlList":[]}}