{"title":"Project64KVE Project64k for Windows Vista","uid":4152942,"size":1810138,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:d2d1a7c68574206f68449a99166683371ae5d882&amp;dn=Project64KVE+Project64k+for+Windows+Vista+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Hyperneogeo64","files":1,"time":1209032044,"description":"Project64KVE is a modified version of the Nintendo 64 emulator with Kaillera support, Project64K (Version 0.13 Core 1.4). Project64KVE is compatible with all Microsoft Windows operating systems, and Vista. The main purpose of Project64KVE is its &quot;netplay&quot; (online multiplayer gaming) capabilities in Windows Vista, due mainly to the integration of the Kaillera networking client which enables online multiplayer gaming. Players are able to join game servers where multiple games may be hosted. This ability is not possible with Project64 at this point in time, due to the lack of online gaming capabilities. However, Project64KVE, shares many underlying similarities with Project64k, such as with system requirements and emulator core compatibility with games, as well as cheating facilities, via GameShark code emulation.\n\nProject64KVE can emulate games (ROMs) in high resolution up to 1600x1200 with anti-aliasing and anisotropic filtering, depending on video plugin capabilities. The emulator currently accepts 3rd party graphics and sound plug-ins like Glide64, Rice Video, and Azimer&amp;#039;s HLE sound plugin. Included with the emulator is Jabo&amp;#039;s Direct3D 8.0 video plug-in and the considered default audio plugin is Jabo&amp;#039;s DirectSound 1.4, which uses low-level emulation (in conjunction with a suitable RSP plugin). The default input plugin, created by Jabo, accepts any Windows-supported controller through the use of DirectInput (a subset of DirectX).","torrent":{"xt":"urn:btih:d2d1a7c68574206f68449a99166683371ae5d882","amp;dn":"Project64KVE+Project64k+for+Windows+Vista+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d1a7c68574206f68449a99166683371ae5d882","infoHashBuffer":{"type":"Buffer","data":[210,209,167,198,133,116,32,111,104,68,154,153,22,102,131,55,26,229,216,130]},"announce":[],"urlList":[]}}