{"title":"Johan Cruijff En Un Momento Dado (2004).avi","uid":4113545,"size":789752864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d34f1ef41061d64edf337efa281c9cfce85717e5&amp;dn=Johan+Cruijff+En+Un+Momento+Dado+%282004%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"rolfpoland","files":1,"time":1207182627,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0397483/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0397483/&lt;/a&gt;\n\nJOHAN CRUIJFF : En un momento dado\n\nJohan Cruijff and the moments he gave to the Barcelonese peopleJohan Cruijff&amp;#039;s \ninternational fame as a football player is still vividly tangible among the inhabitants of Barcelona, the city where &amp;#039;number 14&amp;#039; lives himself nowadays and where he has played many matches. Stemming from an example Cruijff&amp;#039;s inimitable idiom el momento dado (a litteral translation of a Dutch saying that didn&amp;#039;t exist in the Spanish language before) thirteen people from Barcelona tell director RamÃƒÂ³n Gieling (BuÃƒÂ±uel&amp;#039;s Prisoners) about the moment Cruijff has given them. Those special moments, in which he surprised them, made them angry or made them mad of enthusiasm. A film about the search for Catalan identity and independence through the past decades and the important role both Cruijff plays, being almost a saint for the Catalans by working his miracles. Finally, Johan Cruijff himself will take the floor...\nWritten and directed by: RamÃƒÂ³n Gieling\nPhotography: Martijn van Beenen\nSound: Jaume Martin, Wib Nelissen\nEditor: Govert JanseOriginal music by: Diego CarrascoLine \nproducer: Sylvia BaanP\nroducer: Pieter van Huystee in co-production with Raimond Masllorens (La Productora, Barcelona)\nCommissioning editor: Bert Janssens\nBroadcasting company: Humanist Broadcasting Foundation\nDuration: 90 min.\n\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/16171&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/16171&lt;/a&gt;\n\nNederland / Spanje\nDocumentaire\n90 minuten\n\ngeregisseerd door RamÃƒÂ³n Gieling\nmet Johan Cruijff\n\nIn 1974 kwam Cruijff, op een gegeven moment, in Barcelona aan. `Moest deze schriele kettingroker onze club na jarenlange kommer en kwel weer kampioen maken?&amp;#039; aldus een van de geÃƒÂ¯nterviewden. `Het lukte, maar Cruijff deed meer. Hij gaf de Catalanen hun trots terug na de onderdrukking tijdens de dictatuur van Franco.&amp;#039; RamÃƒÂ³n Gieling laat vele Catalanen aan het woord. Van de taxichauffeur, de kok, de flamencogitarist die Cruijffs sierlijke acties van muziek voorziet, tot de hartchirurg die Cruijff opereerde na een hartinfarct. Gieling schetst de unieke voetballer die Cruijff was en toont de gekkige eigenheid van de leider door de woorden van zijn bewonderaars. Zij hebben Cruijff geanalyseerd, imiteren zijn bewegingen en beargumenteren hun bewondering, zoals de alleenstaande secretaresse die nooit een man heeft kunnen vinden die in de buurt kwam van de eigenzinnigheid, sierlijkheid en &amp;#039;leukheid&amp;#039; van Johan Cruijff. Johan Cruijff, En un Momento Dado is veel meer dan een portret van de voetballer Cruijff. Het is een documentaire over de rol van Cruijff en de voetbalclub Barcelona voor het eigenzinnige CataloniÃƒÂ«.\n\n","torrent":{"xt":"urn:btih:d34f1ef41061d64edf337efa281c9cfce85717e5","amp;dn":"Johan+Cruijff+En+Un+Momento+Dado+%282004%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d34f1ef41061d64edf337efa281c9cfce85717e5","infoHashBuffer":{"type":"Buffer","data":[211,79,30,244,16,97,214,78,223,51,126,250,40,28,156,252,232,87,23,229]},"announce":[],"urlList":[]}}