{"title":"Nero 6.6.1.6","uid":4253011,"size":35721202,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d4e6b5afd8b107d2a718e422b768e7e52060c791&amp;dn=Nero+6.6.1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"goalforholland","files":6,"time":1214101586,"description":"\n\n\nCD/DVD BurningNero 6 - The Ultimate solution for Data, Video, Photo, Audio and BackUp! Nero 6 is your All-in-One solution! With all the powerful and fun applications now included in Nero 6, all of your CD and DVD burning tasks can be managed in a breeze. Burning DVD-Video, Photo, Data, Audio or BackUp just sit back and see Nero 6 handle it all with ease.\n\n\n\nNero is a flexible, reliable, and easy-to-use application designed to write both data and CD audio to CD-R and CD-RW discs. It supports ISO 9660 images as well as ISO mode 1 and XA mode 2, and allows for on-the-fly disc recording in addition to overburning (if supported by hardware). It also supports multisession and mixed-mode recording, HFS, ISO/HFS hybrid, UDF, PSX, OFAS (optimal file access speed), track-at-once (TAO) and disc-at-once (DAO) writing, digital audio extraction, and more. In addition, Nero can dynamically disable automatic-insert notification, offers support for multiple languages, and works with all major models of CD-R and CD-RW drives. This also contains a standalone Cover Editor for designing and printing CD covers.\n\n*~* SEEDMORE.ORG *~*\nTired of public trackers with spyware/adware and malware? Tired of slow speeds and torrents with no seeders? If so come to seedmore.org, we have all the latest movies, apps and games and lots more. Signing up is quick and easy and you&amp;#039;ll find we are a friendly community with a slightly different look [something different from other trackers] so come and see us. Registrations are only open certain days so come on, what are you waiting for?\n&quot;JOIN THE FAMILY&quot;\nAre you an experienced uploader? applications accepted.. See forums\nwww.seedmore.org\nSee you all there!!!!","torrent":{"xt":"urn:btih:d4e6b5afd8b107d2a718e422b768e7e52060c791","amp;dn":"Nero+6.6.1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4e6b5afd8b107d2a718e422b768e7e52060c791","infoHashBuffer":{"type":"Buffer","data":[212,230,181,175,216,177,7,210,167,24,228,34,183,104,231,229,32,96,199,145]},"announce":[],"urlList":[]}}