{"title":"Complete Invader Zim Series and The Bad Art Collection","uid":4271719,"size":9281973902,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d6c201161eb3afdf641c2bedc3faa9096ba7a4e5&amp;dn=Complete+Invader+Zim+Series+and+The+Bad+Art+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gr8bishie","files":51,"time":1214964461,"description":"Ooookay, a few things: First off, this is not just a collection of TV shows (and the TV shows don&amp;#039;t have text or subs, sorry.) This a collection of two types of work by Jhonen Vasquez: \n\nThe entire collection of Invader Zim TV episodes, well known to many. All three seasons are present, from &quot;The Nightmare Begins&quot; to &quot;The Most Horrible X-mas Ever.&quot;\n\nThe Bad Art Collection, an obscure title unknown to many, including hardcore Vasquez fans, is in fact a bad art collection. It&amp;#039;s like Satan&amp;#039;s coloring book. Most memorable line: &quot;My God, it&amp;#039;s GOD!&quot; Then the kid got crushed by a meteor. I&amp;#039;m not even kidding.\n\nRandom detritus, an interview with Vasquez (in PDF), The Greatest Human Thinker, from Too Much Coffee Man Magazine, and The Ghost With Black Fingers, a two-page depression-fest.\n\nI didn&amp;#039;t include Squee or Johnny the Homicidal Maniac because A) They are easily found on TPB, and B) My scanner&amp;#039;s busted. Mea culpa, I spilled tea on it.\n\nThe detritus is for the most part RARed. If I get any comments asking how to unRAR, I&amp;#039;ll be pissed, so don&amp;#039;t ask. The episodes of Zim are AVIs. DivX plays these well.\n\nThis is my apology for my previous torrent, which was pretty much a stillbirth, ZERO SEEDS. The episodes of Zim are great for kids, the rest... not so much.\n\n\nNow for mind control: YOU LOVE THIS TORRENT AND WILL SEED FOREVER! IF YOU DON&amp;#039;T SEED, YOU WILL DIE!","torrent":{"xt":"urn:btih:d6c201161eb3afdf641c2bedc3faa9096ba7a4e5","amp;dn":"Complete+Invader+Zim+Series+and+The+Bad+Art+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6c201161eb3afdf641c2bedc3faa9096ba7a4e5","infoHashBuffer":{"type":"Buffer","data":[214,194,1,22,30,179,175,223,100,28,43,237,195,250,169,9,107,167,164,229]},"announce":[],"urlList":[]}}