{"title":"(Indie Rock) Brandtson, Camber, Seven Storey Mountain (Deep Elm)","uid":4114933,"size":20744955,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d7d9d4a10d1bc651bf331ca9853d1102ddcc1c9b&amp;dn=%28Indie+Rock%29+Brandtson%2C+Camber%2C+Seven+Storey+Mountain+%28Deep+Elm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Falleen_Fan_No_1","files":6,"time":1207255711,"description":"Three veteran Deep Elm bands have joined together with all new, unreleased songs for the third release in our Split Series. The past two splits between The Appleseed Cast / Planes Mistaken For Stars / Race Car Riot and Red Animal War / Slowride  have been extremely well received by fans, press and radio, so you should expect no less this time around. You get BRANDTSON&amp;#039;s masterpiece of catchy, melodic perfection called &quot;Dead Animals,&quot; three of the best songs CAMBER has ever recorded plus two amazing new tracks by SEVEN STOREY. From the songwriting to the lyrics to the outright quality, these six songs are a prime indicator of why these bands continue to receive accolades and praise from critics and fans around the globe. \n\n\n01. Brandtson - &quot;Dead Animals&quot;  \n02. Camber - &quot;Dealt&quot;  \n03. Camber - &quot;I Could Not Care Less&quot; \n04. Camber - &quot;Goodbye Mr. Spalding&quot;  \n05. Seven Storey Mountain - &quot;New Day&quot;  \n06. Seven Storey Mountain - &quot;Covers&quot; \n\nThis record opens with a brand new Brandtson track.  I personally love Brandtson.  They&amp;#039;re catchy, yet you know, good.  This track is no exception.\n\nThe first two Camber tracks reminisce to the old emo days, which is always good in my book.  Think Cap&amp;#039;n Jazz, but slightly more refined.  The third track is a nice acoustic-ish track.\n\nSeven Storey Mountain delivers some great indie rock.  Nothing else is needed.  It&amp;#039;s good.\n\n&quot;Brandtson leads off the third release in Deep Elm&amp;#039;s Split Series and rest assured you will not be disappointed with its precisely placed vocal harmonies, interesting half times and broken down break up lyrics. Next is Camber with an assault of squealing guitars and pounding backbeats which definitely makes them the stand out act here. Finally, rounding it all off is Seven Storey with two tracks. In particular, New Day has an interesting premise with its half-choppy, half-flowing rhythmic pattern.&quot; - 30music \n\nIf you like this, check out my other torrents.  I only upload quality stuff!","torrent":{"xt":"urn:btih:d7d9d4a10d1bc651bf331ca9853d1102ddcc1c9b","amp;dn":"%28Indie+Rock%29+Brandtson%2C+Camber%2C+Seven+Storey+Mountain+%28Deep+Elm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d9d4a10d1bc651bf331ca9853d1102ddcc1c9b","infoHashBuffer":{"type":"Buffer","data":[215,217,212,161,13,27,198,81,191,51,28,169,133,61,17,2,221,204,28,155]},"announce":[],"urlList":[]}}