{"title":"Cowboy Junkies 2004-08-28 @ Park Place Pavilion - Keystone, CO","uid":4057842,"size":671270500,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db05d17567723882c4a75f1b13ae0a0b98e5dbac&amp;dn=Cowboy+Junkies+2004-08-28+%40+Park+Place+Pavilion+-+Keystone%2C+CO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":28,"time":1204463996,"description":" This show was in a funky venue in the ski village at the base of Keystone Mountain in Summit County. After driving up and parking, my husband and I wandered around until we found a brewpub to hit for some dinner. As always in the mountains, it was a little colder, and as the sun went down, the temperature plummeted. Sunshine and UV DOES add a lot of warmth.\n\n \n\nThe venue itself was actually a huge inflated bubble, sort of like what you sometimes see over skating rinks and tennis courts. Inside the bubble were lots of folding chairs. Despite the rather strange setting, it was intimate in its way, possibly because there weren&amp;#039;t that many rows of chairs. I was able to set up the recording gear right by the soundboard and awaited the music.\n\n \n\nThe band was doing two sets on this tour, an acoustic one and an electric one, and it lent a special dimension to most of the shows. It sort of became &quot;An Evening With.&quot;\n\n \n\nThe acoustic set opened with a lovely &quot;Anniversary Song&quot; and &quot;White Sail,&quot; but what stood out was a haunting &quot;Lonely Sinking Feeling.&quot; The acoustic version seemed to really mesh well with the lyrics.\n\n \n\nThe electric set was quite a surprise, featuring &quot;To Live is to Fly&quot; and one of the few versions of &quot;Ring on the Sill&quot; played in 2004. Margo dedicated &quot;Ring&quot; to a friend of the band, and it was sort of amusing because it&amp;#039;s probably my favorite song by the band, and as soon as they started playing I closed my eyes and whispered all the lyrics, swaying gently. After the song ended, a woman behind me leaned forward and asked if it had been dedicated to me, since she saw me recording and had seen me singing along quietly to most of the tunes. It hadn&amp;#039;t been me, but it was a special moment.\n\n \n\nThe double encore was especially nice. The band surprised us all by coming out to do a second encore, but they said they&amp;#039;d been having fun and wanted to keep playing, so &quot;Powderfinger&quot; was a lovely treat.\n\n \n\nThis is one of my favorite shows that I&amp;#039;ve been in attendance for, and I hope everyone likes it as much as me.","torrent":{"xt":"urn:btih:db05d17567723882c4a75f1b13ae0a0b98e5dbac","amp;dn":"Cowboy+Junkies+2004-08-28+%40+Park+Place+Pavilion+-+Keystone%2C+CO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db05d17567723882c4a75f1b13ae0a0b98e5dbac","infoHashBuffer":{"type":"Buffer","data":[219,5,209,117,103,114,56,130,196,167,95,27,19,174,10,11,152,229,219,172]},"announce":[],"urlList":[]}}