{"title":"10 Little Boxes.m4p","uid":4251326,"size":1565943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db4a8b168861e8f68933f0ebb0b976ebcda3519e&amp;dn=10+Little+Boxes.m4p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pvtmadore","files":1,"time":1214021885,"description":"This is the new song by Rise Against. I encourage you to purchase it to support the artist, but since they are supposed to be hardcore and have made millions, I don&amp;#039;t mind sharing. Anyways, this is the theme song for the television show &quot;Weeds.&quot; It has been performed by like 20 bands. Here is the official blurb...\n\n&quot;In 1962, Malvina Reynolds wrote a song called &quot;Little Boxes&quot;, a song that, even today, rings true in it&amp;#039;s stark critique of both homogenized suburbia and society&amp;#039;s pressure to succeed. The song was made famous by Pete Seeger.\n\n\nBrilliant in it&amp;#039;s simplicity, the song became the theme song for the TV show &quot;Weeds&quot;, and Rise Against recently the joined the growing list of artists who have recorded their own versions. The list includes a wide variety of artists including Elvis Costello, The Shins, Billy Bob Thornton, Linkin Park, Regina Spektor, Joan Baez, and Death Cab For Cutie.\n\n\nIn addition to being played on an episode of &quot;Weeds&quot; this season, Rise Against&amp;#039;s version of &quot;Little Boxes&quot; will be released on iTunes on June 17th, as part of Dimebag Series &amp;035;1 . It is the first collection in the series to feature 10 versions of the show&amp;#039;s now-retired legendary theme song &quot;Little Boxes&quot; including the unreleased version by Rise Against.&quot;","torrent":{"xt":"urn:btih:db4a8b168861e8f68933f0ebb0b976ebcda3519e","amp;dn":"10+Little+Boxes.m4p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4a8b168861e8f68933f0ebb0b976ebcda3519e","infoHashBuffer":{"type":"Buffer","data":[219,74,139,22,136,97,232,246,137,51,240,235,176,185,118,235,205,163,81,158]},"announce":[],"urlList":[]}}