{"title":"Privacy Eraser Pro 5.9.7","uid":4040919,"size":2373389,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:db8331d014e65dbccfaa7cf4966b39363be2e476&amp;dn=Privacy+Eraser+Pro+5.9.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"poisondas9821","files":2,"time":1203674625,"description":"Privacy Eraser is an Internet Eraser that protects your Internet privacy by cleaning up all the tracks of Internet and computer activities. Our Internet Eraser supports popular web browsers such as Internet Explorer, Mozilla, Firefox, AOL, Netscape, Opera and MSN Explorer. In addition, Privacy Eraser Pro supports free plug-ins to extend cleaning features, you can easily erase the tracks left by any applications and make your own plug-ins. We currently offer more than 230 FREE plug-ins which supports the most popular programs such as ACDSee, Acrobat, Microsoft Office, KaZaA, Real Player, Media Player software and many others. With Privacy Eraser Pro you can schedule cleaning tasks to run at a time that is most convenient for you. Privacy Eraser (Pro) supports Microsoft Windows FAT/FAT32/NTFS file systems, completely implements and exceeds the US Department of Defense DOD 5220.22-M and NSA clearing and sanitizing standard, to gives you confidence that once deleted with our Internet Eraser your file data is gone forever and can not be recovered.","torrent":{"xt":"urn:btih:db8331d014e65dbccfaa7cf4966b39363be2e476","amp;dn":"Privacy+Eraser+Pro+5.9.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db8331d014e65dbccfaa7cf4966b39363be2e476","infoHashBuffer":{"type":"Buffer","data":[219,131,49,208,20,230,93,188,207,170,124,244,150,107,57,54,59,226,228,118]},"announce":[],"urlList":[]}}