{"title":"The.Water.Horse-Legend.Of.The.Deep[2007]DvDrip-KRG-KVCD_gadge007","uid":4111612,"size":819486211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc1985a2a17dd4b887d2c903f51fb67e2e31e432&amp;dn=The.Water.Horse-Legend.Of.The.Deep%5B2007%5DDvDrip-KRG-KVCD_gadge007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gadge007","files":5,"time":1207086588,"description":"\n\nFormat:Bin/Cue\nSample:N/A\nSource:The Water Horse\nChapters: Every 5 Minutes\nRuntime: 01:44 min\nVideo: ntsc MPEG-1\nAudio: 44.1kHz/128kbps/ Stereo\nRes: 352x240 / 29.97= fps\nSize: 800Mb(Bin file)\nTracker:Pirate  Bay\n\nSynopsis:\nBased on the novel by BABE author Dick King-Smith, THE WATER HORSE: LEGEND OF THE DEEP is set in Scotland during World War II, and focuses on Angus (Alex Etel), a young boy who discovers an unusual egg at Loch Ness. When the egg hatches to reveal a dinosaur-like creature, Angus finds that he has a... [More]\nBased on the novel by BABE author Dick King-Smith, THE WATER HORSE: LEGEND OF THE DEEP is set in Scotland during World War II, and focuses on Angus (Alex Etel), a young boy who discovers an unusual egg at Loch Ness. When the egg hatches to reveal a dinosaur-like creature, Angus finds that he has a unique pet--a mythical &quot;water horse,&quot; which he names Crusoe. Complicating matters are Crusoe&amp;#039;s fast growth rate and soldiers stationed near the lake, factors that make it very tricky to keep the friendly beastie a secret. A thoroughly likable family film directed by Jay Russell (TUCK EVERLASTING), THE WATER HORSE provides an intriguing spin on the classic boy-and-his-dog tale. While Etel, who won over audiences in MILLIONS, ably carries the movie, he is supported by a topnotch ensemble that includes Emily Watson as his mother, newcomer Priyanka Xi as his sister, and Ben Chaplin as a good-natured handyman. Primarily sharing the screen with Etel, however, is the Loch Ness Monster-in-the-making, which is wonderfully rendered by Weta, the company behind the digital effects for THE LORD OF THE RINGS films. Both cute and--in his larger state--intimidating, Crusoe strikes up a surprisingly believable relationship with Angus, providing the heart of this beautifully photographed story.","torrent":{"xt":"urn:btih:dc1985a2a17dd4b887d2c903f51fb67e2e31e432","amp;dn":"The.Water.Horse-Legend.Of.The.Deep%5B2007%5DDvDrip-KRG-KVCD_gadge007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1985a2a17dd4b887d2c903f51fb67e2e31e432","infoHashBuffer":{"type":"Buffer","data":[220,25,133,162,161,125,212,184,135,210,201,3,245,31,182,126,46,49,228,50]},"announce":[],"urlList":[]}}