{"title":"VISCONTI_DIE_ERDE_BEBT_DVD5","uid":4062478,"size":4605145088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:dc9e091edbcb11078b4ecd17ae8b263c0167e712&amp;dn=VISCONTI_DIE_ERDE_BEBT_DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sonne210","files":9,"time":1204665408,"description":"Drama, Italien 1947, Regie: Luchino Visconti, Buch: Luchino Visconti, Kamera: Gianni di Venanzo, G.R. Aldo, Musik: Luchino Visconti und Willy Ferrero, Produzent: Salvo d'Angelo, Salvo D'Angelo. Mit: Laiendarsteller.\n\nDer junge sizilianische Fischer Ntoni Valastro erkennt, dass er und seine Freunde von den GroÃƒÆ’?hÃƒÆ’Ã‚Â¤ndlern ausgebeutet werden. Als sie bei Verhandlungen mit den HÃƒÆ’Ã‚Â¤ndlern zu fÃƒÆ’Ã‚Â¼hren, dass sie von vorne bis hinten betrogen worden sind, werfen sie die HÃƒÆ’Ã‚Â¤ndler samt ihrer Waagen ins Wasser. Als die HÃƒÆ’Ã‚Â¤ndler auf eine gerichtliche Verfolgung verzichten, weil sie auf die Arbeit der Fischer angewiesen sind, wird sich Ntoni der eigenen Macht bewusst. Er nimmt eine Hypothek auf das Haus seiner Eltern auf, kauft ein Boot und beginnt, auf eigene Rechnung zu fischen. ZunÃƒÆ’Ã‚Â¤chst scheint er Erfolg zu haben und sich behaupten zu kÃƒÆ’Ã‚Â¶nnen. Doch dann zerstÃƒÆ’Ã‚Â¶rt ein Sturm sein Boot, und Ntoni muss sich dem Diktat der HÃƒÆ’Ã‚Â¤ndler beugen...\n\nDas Drama &quot;Die Erde bebt&quot;, das Luchino Visconti ausschlieÃƒÆ’?lich mit Laiendarstellern des sizilianischen Fischerdorfes Acitrezza drehte, ist eines der bedeutendsten Werke des italienischen Neorealismus. Die Handlung ist angelehnt an den Roman &quot;I Malavoglia&quot; des veristischen sizilianischen Schriftstellers Giovanni Verga (1840-1922). Viscontis ursprÃƒÆ’Ã‚Â¼nglicher Plan bestand darin, eine Art Dokumentarfilm ÃƒÆ’Ã‚Â¼ber Sizilien zu drehen, der in drei Teilen die Lage der sizilianischen Fischer, der Schwefelarbeiter und der Bauern darstellen und mit dem Sieg der vereinten KrÃƒÆ’Ã‚Â¤fte des Proletariats enden sollte. Gedreht wurde allerdings nur die erste Episode, die den gemeinsamen Obertitel des Projekts, &quot;La terra trema&quot;, erhielt. Die Verwendung von Laiendarstellern entsprach dem dominierenden Stil der ersten neorealistischen Phase in Italien. &quot;Die Erde bebt&quot; wurde 1948 bei der Biennale in Venedig mit einem von drei internationalen Preisen ausgezeichnet. Regieassistenten Viscontis waren die heute berÃƒÆ’Ã‚Â¼hmten Regisseure Francesco Rosi und Franco Zeffirelli.\n\n....................................................\n\nVisit &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com/index.cgi?board=6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com/index.cgi?board=6&lt;/a&gt;\nsub-board: r_a_p_i_d_s_h_a_r_e to see my other uploads...as sonne210...","torrent":{"xt":"urn:btih:dc9e091edbcb11078b4ecd17ae8b263c0167e712","amp;dn":"VISCONTI_DIE_ERDE_BEBT_DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc9e091edbcb11078b4ecd17ae8b263c0167e712","infoHashBuffer":{"type":"Buffer","data":[220,158,9,30,219,203,17,7,139,78,205,23,174,139,38,60,1,103,231,18]},"announce":[],"urlList":[]}}