{"title":"Ron Paul, Aaron Russo related - DEAN WARWICK (R.I.P.) - Murdered","uid":4057067,"size":13047071,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:dce0cbbc57b1f294d38a75c71e66cc522b386e35&amp;dn=Ron+Paul%2C+Aaron+Russo+related+-+DEAN+WARWICK+%28R.I.P.%29+-+Murdered&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1204417765,"description":"***********************************************************\nURGENT! SEEDERS NEEDED!  PLEASE KEEP THIS TORRENT RUNNING\nIN YOUR BIT-TORRENT PROGRAM AFTER YOUR DOWNLOAD HAS\nCOMPLETED.   IF MORE PEOPLE DO NOT START SHARING THESE\nTORRENTS ARE GOING TO DIE OUT AND NO ONE WILL EVER BE ABLE\nTO GET THIS MATERIAL AGAIN.    PLEASE DO YOUR PART AND\nKEEP SEEDING THIS TORRENT FOR AS LONG AS YOU POSSIBLY CAN.\n***********************************************************\n\nFor everyone interested in the ideas of Ron Paul, Aaron Russo Alex Jones, and freedom in general, the following is a MUST-HEAR INTERVIEW.  This MP3 is the only known interview with Dean Warwick before he was murdered for revealing details of 9/11, elite human sacrifice rituals involving missing children on all continents, the Pan-Am Lockerbie crash and more.\n\nDEAN WARWICK (R.I.P.)\n\nNews Brief October 9, 2006\n\nFurther indications have come to light that Dean Warwick, alternative energy pioneer and intelligence insider did not die of natural causes.\n\nDean Warwick collapsed and died whilst addressing a packed auditorium in Blackpool last weekend. Significantly however, he said he felt a ?beam? or ?burning? at the side of his head shortly before beginning his talk.\n\nAccording to those who last spoke to him before he began his talk, Dean said: ?I think I?m going to be bumped off?.\n\nOriginally from New Zealand but now resident in Scotland, Dean had promised to make some momentous announcements at the conference.\n\nIn the weeks prior to speaking at Probe International?s conference, Dean had given Dave Starbuck a foretaste of what was coming in an interview.\n\nAmong other things, Dean promised that he would name who was behind the murder of Bobby Kennedy.\n\nHowever, he said, that would only be the beginning. For he told Dave Starbuck that he would also name the ?Anti-Christ? and blow the whistle on underground bases and missing children.\n\nIn the taped interview with Dave Starbuck, he also revealed how and why seven survivors at Lockerbie were allowed to die from hypothermia. The reason, he said, was that the survivors knew that a terrorist bombing did not bring down Pam Am Flight 103, which went down in 1988 killing 270 passengers and crew.\n\nThey were allowed to die, said Dean, because they knew that a missile not a bomb brought down the Jumbo jet and had they lived, would have been able to testify to this.\n\nSuch knowledge however, made Dean Warwick a very dangerous man to those with things to hide. Which is why questions are being asked about his sudden demise.\n\nShortly before he began his presentation conference organisers say Warwick, 62 and in good health, spoke of having a &quot;premonition&quot; that something &quot;would happen&quot;.\n\nAccording to Dave Starbuck who was at the Probe International conference when he spoke, Dean was starting to hit his stride. He got to the point when he said he was about to reveal who was behind Bobby Kennedy?s murder, the name of the ?Anti-Christ? and more besides.\n\nHe never did though. With the words, ?Bear with me for a moment? Dean leaned with his left elbow on a nearby table with his right arm across his body. Before keeling over flat on his face.\n\nHe was to all appearances dead from that moment on and despite efforts to revive him he was, according to one eyewitness, probably dead before he even hit the ground.\n\nAlthough a post mortem has yet to be conducted, the circumstances surrounding Dean?s death are highly suspicious. All the more so as those who witnessed the event and tried to telephone this website were unable to do so.\n\nAlthough we took no calls this weekend, our phone line was reportedly ?permanently engaged?. Making it seem all the more likely that Dean was &quot;taken out&quot;, possibly by a beam weapon, by a group with a vested interest in keeping the lid on what is really going on.\n\nDean Warwick was an insider who spoke with authority and who had decided to speak to a wider audience. As such he posed a real threat to the powers that be and listening to him it?s obvious why so many suspect that he was ?taken out?. Judge for yourself as he talks with Dave Starbuck about the World Trade Center collapse.\n\nOr listen to Dean as he talks about missing children and human sacrifice.\n\nIn all audio samples it's obvious that he knows what he's talking about and all samples are available as a CD from www.revelationaudiovisual.com/\n\nUpdate Friday October 13, 2006\n\nThis website recieved the following email from a reader and it ties in exactly with Dean Warwick's account of what happened at Lockerbie.\n\nHi Rixon, I have a little addition to the Dean Warwick article on Lockerbie Pan Am. I live in the region of Lockerbie and on the night in question, as I was outside getting coal for my fire, I heard what sounded like a firework, ie a whoosh followed by a bang. I had no line of sight on the noise but it appeared to be north of my position. I went in with the coal and commented to my son, that they were late with their fireworks this year. But it puzzled me too, as to who it might be, as there are very few people in that direction, just farms and the like.\n\nShortly after, it came on tv, there was a news flash telling of the Lockerbie bombing and the story unfolded as the night went on. I told my story to many people, and I believed I'd heard the plane going down. Yet it always puzzled me why it sounded as it did, ie a whoosh and a bang, but as I'd never heard an aircraft blowing up before, I accepted it, however Dean Warwicks claim that it was shot down, fits exactly with what I heard. I know it's not conclusive","torrent":{"xt":"urn:btih:dce0cbbc57b1f294d38a75c71e66cc522b386e35","amp;dn":"Ron+Paul%2C+Aaron+Russo+related+-+DEAN+WARWICK+%28R.I.P.%29+-+Murdered","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dce0cbbc57b1f294d38a75c71e66cc522b386e35","infoHashBuffer":{"type":"Buffer","data":[220,224,203,188,87,177,242,148,211,138,117,199,30,102,204,82,43,56,110,53]},"announce":[],"urlList":[]}}