{"title":"Antarctica ((Nankyoku Monogatari) DivX","uid":4031779,"size":1597015154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd6a349819324bcd0390bf224b9b78f8fc60bded&amp;dn=Antarctica+%28%28Nankyoku+Monogatari%29+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uraphake","files":1,"time":1203203481,"description":"Antarctica (Nankyoku Monogatari)\nJapanese, 1983\nIMDB: http://www.imdb.com/title/tt0085991/\nSpoken language: Japanese\nSubtitles: English and Chinese traditional (see notes below)\n\nVideo CoDec: DivX 5\nResolution: 720x480\nAspect Ratio: Anamorphic Widescreen (see notes below)\nFPS: 30\nBit Rate: 1249Kbps\nAudio: MPEG Audio 48000Hz Stereo\nBit Rate: 224Kbps\n\nDuration: 2 Hours, 23 minutes, 19 seconds\n\nFile Size: 1,523MB (1,559,586 KB)\n\nWhile I normally don\\\\\\&amp;#039;t do DVD rips, I\\\\\\&amp;#039;ve made this exception due to the rarity of the movie itself (only available in Asian markets for some reason). I originally uploaded a DVD5 version at D*e*m*o*n*o*i*d (spelled that way because TPB will strip it out otherwise) and people complained (purists) even though the quality was equivalent to the full DVD9 from which it was made. I uploaded a full DVD9 version here at The Pirate Bay to satisy the naysayers, but the size has caused dismay to many (7.15GB is a slow download without a lot of seeders).\n\nSo, in response I created this high-quality rip of the DVD9.\nNo menu, no audio setup needed, and no extras from the DVD version.\nJust the movie in all its glory! :D\n\n=-=-=\nIMPORTANT NOTES\n\nSubtitles are embedded (hard-coded) and cannot be removed!\n\nIf you have the DivX codec installed on your machine, you should be able to use any media player to view this movie -- HOWEVER...I recommend Videolan (VLC) Player for best results.\nWhen opening the file, set the aspect ratio to 16:9 to view the movie in it\\\\\\&amp;#039;s intended format, although the default fullscreen view is also fine.\n\nCuriously, if you use the official DivX Player for this, the audio will suck monkey balls!\nSo...don\\\\\\&amp;#039;t do that! I\\\\\\&amp;#039;m not kidding!\n\nIf you don\\\\\\&amp;#039;t have VLC -- get it here: &lt;a href=&quot;\nhttp://www.videolan.org/vlc/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.videolan.org/vlc/&lt;/a&gt;\n\nYou will be glad you did and perhaps discover that you may never use any other media player again. :)\n=-=-=-=-=\n \nMovie Synopsis:\n\nAntarctica (Nankyoku Monogatari or \\\\\\&quot;South Pole Story\\\\\\&quot;)\n\nIt\\\\\\&amp;#039;s a story about Japan\\\\\\&amp;#039;s first scientific expedition to the Antarctic in 1958, where Ushioda and Ochi were confronted by a severe winter with their 15 sled dogs. Later they were forced to abandon all of their sled dogs in an attempt to get back home safely. They apologized for not taking the dogs with them, but people were angry and upset that they left all those beloved dogs behind. A year later, when they returned to the Antarctic to search for the dogs, they found something incredible...two of the sled dogs were still alive, against the odds of extreme weather conditions.\n\nThis movie is for people who love dogs and like a good, true story to boot!\nEven though it is sad...this is a story you will never forget!\n\nThe music was scored by Vangelis -- you will know it when you hear it even though you may never have heard of this movie before -- it\\\\\\&amp;#039;s beautiful and fits the movie perfectly!\n\nThe original score to Nankyoku Monogatari was composed, arranged, produced and performed by Greek artist Vangelis. It was recorded at Vangelis\\\\\\&amp;#039; Nemo Studios, in London, UK, by sound engineer Raine Shine. The album was released worldwide (including Japan) as Antarctica.\n\n---\n\nDisney pathetically remade the story as \\\\\\&quot;Eight Below.\\\\\\&quot;\n\nThis, the original story is more truthful to actual events (and brutal in comparison) although the film makers increased the actual number of dogs involved from 9 to 15 according to some sources. \n\nFor more info, see http://en.wikipedia.org/wiki/Nankyoku_Monogatari\n\nIf you want the actual, full DVD9 version, go here: &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3580828/Antarctica_(Nankyoku_Monogatari)_NTSC_[DVD9]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3580828/Antarctica_(Nankyoku_Monogatari)_NTSC_[DVD9]&lt;/a&gt;\n\n=-=\nPlease -- please -- please, Do Seed this for as long as you can!\nIf you can\\\\\\&amp;#039;t seed for long stretches, keep it on your HDD and come back at intervals in the future to help keep it alive.\n\nThanks and enjoy!\n\nUraphake\n","torrent":{"xt":"urn:btih:dd6a349819324bcd0390bf224b9b78f8fc60bded","amp;dn":"Antarctica+%28%28Nankyoku+Monogatari%29+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd6a349819324bcd0390bf224b9b78f8fc60bded","infoHashBuffer":{"type":"Buffer","data":[221,106,52,152,25,50,75,205,3,144,191,34,75,155,120,248,252,96,189,237]},"announce":[],"urlList":[]}}