{"title":"ZeitGeist","uid":4270200,"size":735232358,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de724c7245966a087912ac03aea3a6bfbd8534c7&amp;dn=ZeitGeist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"devillived26","files":1,"time":1214898689,"description":"Zeitgeist, the Movie is a 2007 documentary film, produced by Peter Joseph about the Jesus myth hypothesis, the attacks of 9/11, and the Federal Reserve Bank as well as a number of conspiracy theories related to those three main topics. It was released free online via Google Video in June of 2007. A remastered version was presented as a global premiere on November 10, 2007 at the 4th Annual Artivist Film Festival &amp; Artivist Awards.\n\n\nStructure\n\nThe film starts with a speech by ChÃƒ?Ã‚Â¶gyam Trungpa about spirituality, followed by a series of musically synchronized clips of war and explosions culminating with one of the towers of World Trade Center collapsing during 9/11. The mood then changes and in contrast there follows a sequence of clips showing the horrors of war. There is a short clip that shows a hand writing \\&quot;1 + 1 = 2\\&quot; (representing logic), but is brushed away by another hand before the first finishes, and is replaced by a bible (representing religion) and an American flag (representing patriotic behaviour). After a few more war clips, the film then quotes Jordan Maxwell\\&amp;#039;s Inner World of the Occult, criticizing religious institutions, governments, and the banking cartels who \\&quot;have misled [the people] away from the true and divine presence in the universe.\\&quot; This portion ends with more images accompanied by audio of a portion of a George Carlin monologue on religion.\n\n\n\nCourtesy : http://en.wikipedia.org/wiki/Zeitgeist,_the_Movie","torrent":{"xt":"urn:btih:de724c7245966a087912ac03aea3a6bfbd8534c7","amp;dn":"ZeitGeist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de724c7245966a087912ac03aea3a6bfbd8534c7","infoHashBuffer":{"type":"Buffer","data":[222,114,76,114,69,150,106,8,121,18,172,3,174,163,166,191,189,133,52,199]},"announce":[],"urlList":[]}}