{"title":"Command &amp; Conquer Generals","uid":4262403,"size":1362903090,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:debaa0730a924f4077744f6cc333e81d0789bc2c&amp;dn=Command+%26+Conquer+Generals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kabelozov","files":3,"time":1214529749,"description":"Generals&amp;#039; fictional premise puts the USA, China, and a terrorist group called the Global Liberation Army (GLA) at odds sometime in the near future. You can play as any one of these factions in its own brief single-player campaign, in skirmishes with computer opponents, or against other players over a LAN or using the game&amp;#039;s online player-matching service. Those who played the previous two Command &amp; Conquer RTS games, Red Alert 2 and its expansion pack, Yuri&amp;#039;s Revenge, will note that Generals is highly reminiscent of those games, despite its much improved appearance and its seemingly more conventional array of infantry, tanks, and aircraft. Like in Red Alert 2, battles in Generals are often quick and decisive, largely due to the immense power of many of the game&amp;#039;s units, the presence of devastating super weapons on each side, and the generally fast pace. Also, while each faction has a good variety of units at its disposal, you&amp;#039;ll likely get the impression that the number of unit types per faction was limited so that each unit type could play an important role in most any fight--and also to leave room for an expansion pack. The lack of seafaring units in the game is a disappointing omission, given the importance of ships in most previous Command &amp; Conquer games (not to mention in actual modern warfare), but the designers have still done an excellent job of imaginatively differentiating the game&amp;#039;s three sides.\n\nDespite the fact that the game&amp;#039;s central conflict involves the USA and an obviously Middle Eastern terrorist group, the action in Generals is either over-the-top enough or abstract enough that, for better or worse, it shouldn&amp;#039;t offend anyone&amp;#039;s sensibilities. In fact, as if to drive home the sense that &quot;Hey, it&amp;#039;s just a game,&quot; there&amp;#039;s really no story at all to Generals. The motivations of the respective factions aren&amp;#039;t made clear, and their arsenals are far enough removed from reality that Generals seems much less inspired by current events and much more so by the current fascination with war in our popular culture. Movies like The Rock and Black Hawk Down certainly played a bigger part in inspiring the game&amp;#039;s look and style than anything on the nightly news. It bears mentioning that almost all the mainstays of the Command &amp; Conquer milieu can nevertheless be found in Generals--fans will be glad to see huge, double-barreled tanks, crack-shot commandos, nuclear missile silos, flamethrower tanks, and other such C&amp;C mainstays back and looking better than ever. Many of the twists added to Red Alert 2 remain intact as well, such as the ability to garrison infantry in civilian buildings and the ability of units to gain experience levels by defeating foes. ","torrent":{"xt":"urn:btih:debaa0730a924f4077744f6cc333e81d0789bc2c","amp;dn":"Command+%26+Conquer+Generals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"debaa0730a924f4077744f6cc333e81d0789bc2c","infoHashBuffer":{"type":"Buffer","data":[222,186,160,115,10,146,79,64,119,116,79,108,195,51,232,29,7,137,188,44]},"announce":[],"urlList":[]}}