{"title":"Innocent Times - Season 1 (New Crime Drama)","uid":4247213,"size":2481855868,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df0e939ef34fc0b8c858ef652ba3718ae7d8b81d&amp;dn=Innocent+Times+-+Season+1+%28New+Crime+Drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"softline","files":8,"time":1213837662,"description":"There were good times, there were bad times &amp; then there were Innocent Times.\n\nInnocent Times is part road movie, part love story and part dark comic thriller and tells a story that unfolds across the past and the present. \n\nWhen Genevieve Scott-Thomas is let out of prison after almost two decades, her son Zac is killed when he falls off a balcony. Most think it is suicide, but Gene knows differently. To her it is a sure sign that her past is catching up with her. She decides to team up with award-winning journalist Jeff Levine and takes him on a journey into her dark past. As she reflects on her life, we flash back to a landscape of the mind, a strange world where a murder spree took place.\n\nTo create this multi-layered story, the technical production team of Innocent Times spent months refining the hyper-real CGI scenes of the past, shot under the direction of Tristan Holmes. The present-day scenes were directed by Alex Yazbek who created a film-noir effect, with characters that are slightly larger than life to follow through and compliment the styles of the past. To put the scale of this production into perspective, Innocent Times is a show made up of six episodes, but contains more special effects than an entire season of the popular American series, Heroes.\n\nAccompanying the show will be a full-length, originally scored soundtrack, which was spear-headed by music legend Sean Fourie. The music video for the title track of the show, ?Sold my Soul to the Devil? has just completed filming. The song stars local rap star Pharrel and includes a host of colaborators. Also contributing to the rich collection of songs on the Innocent Times soundtrack are music legends such as Chris Chameleon and Zola. \n\nFilled with sinister twists and some shocking characters, Innocent Times promises to grip viewers from the start. The show boasts a small and stunning cast that is made up of Nina Milner (who made her debut in Ella Blue) as the young Gene, Justin Strydom (of Snitch fame), Quentin Krog as Zac Snr, Juliana Venter as the older Gene, Az Abrahams in the role of the journalist, and new-comer Matthew Lotter as Gene&amp;#039;s son Zac Jr. \n\nThe cutting-edge technological effects with which Innocent Times is infused, are both stylistically breathtaking and emotionally heart wrenching. Innocent Times is very much a love story - as twisted as the love sometimes is, it is still very real and very much the driving force of this ground-breaking show. See how the characters of Innocent Times seek to outrun their destinies and live the perfect life.\n\nPlease note: this show has a very strong content warning (mostly for violence) and is not for sensitive viewers.","torrent":{"xt":"urn:btih:df0e939ef34fc0b8c858ef652ba3718ae7d8b81d","amp;dn":"Innocent+Times+-+Season+1+%28New+Crime+Drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df0e939ef34fc0b8c858ef652ba3718ae7d8b81d","infoHashBuffer":{"type":"Buffer","data":[223,14,147,158,243,79,192,184,200,88,239,101,43,163,113,138,231,216,184,29]},"announce":[],"urlList":[]}}