{"title":"Damh The Bard - Herne's Apprentice","uid":4036446,"size":77488102,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df165da234f45427d83a79f3f47525fdff006435&amp;dn=Damh+The+Bard+-+Herne%5C%27s+Apprentice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Kunux","files":14,"time":1203456231,"description":"Damh the Bard (David Smith): Herne&amp;#039;s Apprentice\n\nAcoustic Bardic folk music by one of the UK&amp;#039;s best musical storytellers. Pagan, Wiccan, Druid folk music - songs of the sacred land, and ancient mythology.\n\n    1 Song of Awen\n    2 Obsession\n    3 Blodeuwedd\n    4 Fith Fath Song\n    5 Cloak of Feathers\n    6 Gently Johnny\n    7 Raggle Taggle Gypsies\n    8 Lughnasadh\n    9 Pipes of Pan\n    10 Learning to Fly\n    11 The Selkie\n    12 Winds of Change\n\nThis debut album from Damh the Bard was recorded between October 2001 and January 2002 and is the sum total of two years songwriting and arrangement. \n\nThe Song of Awen is a celebration of life, and looks at the inspiration that is all around us in the natural world. Often people want to escape the Middle World into less stressful and more romantic realms, but if we are open to the Awen, then the land around us shows itself to be a world of wonder and beauty. \n\nObsession is Damh&amp;#039;s idea of a love song, written for that moment when you first meet somebody, and all you can see is their face, and all you can smell is their skin. \n\nBlodeuwedd is his muse, and this is the second instalment of the story began with the song Oak Broom and Meadowsweet later recorded on the Spirit of Albion album. Often seen as a betrayer, she was conjured by Math and Gwydion to marry a man she had never met - hardly a firm basis for a lasting relationship! \n\nThe Fith Fath Song is a traditional shape-shifting song that is usually sung during a Beltane love chase. \n\nGently Johnny is one of the best and most haunting songs from the film The Wicker Man. It is only on the Director?s Cut version, and is also missing from the soundtrack. \n\nThe Pipes of Pan is another offering to Old Horny and is a ballad about the turning of the Wheel of the Year, and how the beauty of the changing seasons passes so many by unnoticed. \n\nLughnasadh tells the story of the Corn King, from his birth at the Winter Solstice, through to his sacrifice at Lughnasadh. \n\nSules Skerie is a remote island off the coast of Skye where this haunting tale of  love and tragedy originates. It tells very much of a Father?s love for his son, which I understand very well. The Selkie tells of a man?s loneliness and how he finds love within the waves of the sea, only to find it out of his reach. \n\nThe Raggle Taggle Gypsies is another one of those songs that many people have recorded including the Waterboys, the Dolman and Planxty. \n\nLearning to Fly is a song for anyone whose life has changed through relationship breakdown, and how it feels, but with a positive message. \n\nThe Cloak of Feathers concludes the Blodeuwedd trilogy with the Goddess visiting a young man and telling him her story. He listens and he understands that she is not a betrayer, but a woman who yearned to be free. It is love that changes the world. \n\nThe Winds of Change is a song of hope, for although life can take you along some very dark corridors, the power of change often lies within, and all we need to do is spread our wings and fly!\n\nDamh is a Bard whose spirituality is expressed through his music, storytelling and poetry. Drawing on the Bardic traditions his performances are both entertaining and educational, weaving a tapestry of myth, peace, and anthems that speak directly to the heart, but never without a good splash of humour. Damh works within that world of myth that cannot be proved; where the Faerie really do dance on Midsummer&amp;#039;s Eve, where the trees talk, and the Hollow Hills take you into the realms of Annwn. Where the Goddess rides her horse, guiding you to magic, and the Horned God of old calls us from the shadows of the Greenwood.\n\nOfficial Page, Lyrics:\n &lt;a href=&quot; http://www.paganmusic.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.paganmusic.co.uk/&lt;/a&gt;\nBuy or listen:\n &lt;a href=&quot; http://cdbaby.com/cd/damhbard3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://cdbaby.com/cd/damhbard3&lt;/a&gt;\nChords:\n &lt;a href=&quot; http://fss.muni.cz/~malec/divinorum/Publikace/Damh_the_Bard-Akordy.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://fss.muni.cz/~malec/divinorum/Publikace/Damh_the_Bard-Akordy.pdf&lt;/a&gt;\n","torrent":{"xt":"urn:btih:df165da234f45427d83a79f3f47525fdff006435","amp;dn":"Damh+The+Bard+-+Herne%5C%27s+Apprentice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df165da234f45427d83a79f3f47525fdff006435","infoHashBuffer":{"type":"Buffer","data":[223,22,93,162,52,244,84,39,216,58,121,243,244,117,37,253,255,0,100,53]},"announce":[],"urlList":[]}}