{"title":"Translucent Menus version 2","uid":4133557,"size":16812951,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:df364a944c491fc1cb387e15035a0bfe2f8676b0&amp;dn=Translucent+Menus+version+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"4218","files":1,"time":1208152760,"description":"Due to the bad design of the previous installer, I shall upload a new version that does not check for OS compatibility and sets the permissions the same as the originals should be. Also is an uninstallation option, rather than a separate installable package.\n\nTo extract the files without installing, use Pacifist from http://www.charlessoft.com/ It is shareware, but only in the 15-second nagware category, upon opening the program. It would be a good idea to have Pacifist anyway, as you can see what files *any* Mac OS X installation package is designed to install and you can manually check for spyware and other such things that could be installed by less honest people.\n\nThe files themselves are more difficultly posted on http://apple2pc.blogspot.com/2008/03/how-to-make-menus-transparenttranslucen.html where you have to wait to download each file and then follow a rather perilous process involving logging in as Root. The installation package is designed to avoid this and change the files whilst you are logged in as your own user.\n\nInitial seeding of this simplified installer package should begin sometime in the next 24 hours, unfortunately I do not have a computer I can leave at home seeding and during the day I am elsewhere, behind a firewall, proxys et cetera.\n\n------------\n\nAs with the old installer, this should install the translucent drop-down and contextual menus of Mac OS 10.5.1. This would appear to be at the expense of being able to turn off the Translucency of the Menu Bar in System Preferences -&gt; Desktop &amp; Screensaver. There is now also an uninstallation option called &quot;Opaque Menus&quot;. This installs the files from 10.5.2 (and would restore the ability to turn off the Translucent Menu Bar).\n\n------------\n\nSeeding should start by 2008-04-14 11:00 GMT, Internet service permitting.","torrent":{"xt":"urn:btih:df364a944c491fc1cb387e15035a0bfe2f8676b0","amp;dn":"Translucent+Menus+version+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df364a944c491fc1cb387e15035a0bfe2f8676b0","infoHashBuffer":{"type":"Buffer","data":[223,54,74,148,76,73,31,193,203,56,126,21,3,90,11,254,47,134,118,176]},"announce":[],"urlList":[]}}