{"title":"Americas Army 2.83","uid":4029831,"size":2045695788,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dfe309d6670dbc790148eea10c1df1d793b36f0d&amp;dn=Americas+Army+2.83&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"coolfdu1","files":21,"time":1203114991,"description":" Launched in July 2002 the America&amp;#039;s Army game, which is rated &quot;T&quot; for Teen by the ESRB, has become one of the most popular computer games in the world. America&amp;#039;s Army has penetrated contemporary culture and is one of the most recognizable game brands as a result of its unique inside perspective of the U.S. Army and its exciting gameplay. As the game&amp;#039;s popularity continued to grow with each of its dozens of new version releases, the Army has expanded its brand through a variety of products including console and cell phone games, America&amp;#039;s Army merchandise such as t-shirts, the Real Heroes program which tells the stories of heroic Soldiers, training applications for use within the military and government sectors, and the incredible Virtual Army Experience. In the near future, the America&amp;#039;s Army brand will expand with the launch of America&amp;#039;s Army: True Soldiers for Xbox 360 in the Fall of 2007 and America&amp;#039;s Army version 3.0 next year.\n\nIn the America&amp;#039;s Army game, players are bound by Rules of Engagement (ROE) and grow in experience as they navigate challenges in teamwork-based, multiplayer, force versus force operations. In the game, as in the Army, accomplishing missions requires a team effort and adherence to the seven Army Core Values. Through its emphasis on team play, the game demonstrates these values of loyalty, duty, respect, selfless service, honor, integrity and personal courage and makes them integral to success in America&amp;#039;s Army.\n\nIn keeping with the dynamic nature of Soldiering, the America&amp;#039;s Army game will continue to expand and will allow players to explore the Army of today, tomorrow and the future. ","torrent":{"xt":"urn:btih:dfe309d6670dbc790148eea10c1df1d793b36f0d","amp;dn":"Americas+Army+2.83","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe309d6670dbc790148eea10c1df1d793b36f0d","infoHashBuffer":{"type":"Buffer","data":[223,227,9,214,103,13,188,121,1,72,238,161,12,29,241,215,147,179,111,13]},"announce":[],"urlList":[]}}