{"title":"Big Brother USA 9 Live Feeds - 02-25&amp;26-08","uid":4049937,"size":608681171,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e056a2424ebd5dbb9dd18f7b15e927c6e5d2afac&amp;dn=Big+Brother+USA+9+Live+Feeds+-+02-25%2626-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xx2000xx","files":14,"time":1204112931,"description":"Big Brother USA Live Feeds - 02/25&amp;26/08 - xx2000xx\n\nFor youtube vids + exclusive content go to: \n &lt;a href=&quot;\nhttp://bbcouchpotatoes.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bbcouchpotatoes.blogspot.com/&lt;/a&gt;\n\nFor the first time all season there has actually been some game play! Allison flipped the house upside down and now wants to take out Alex/Amanda and teamup with Matt/Nat to take out Josh next week.\n\nI joined tons of small clips so I&amp;#039;ll try to remember as best I can. Go to my youtube/website page for more indepth descriptions of the clips I posted.\n\n02-25-08\n\nPart 1 - 19 min\nAmanda tries to work Ryan - Allison says she wants to team up with Matt and he swears to her that he will take her to the final 4 - Allison &amp; Ryan want to take a huge risk and flip the script, they now want to take out Alex/Amanda and go against C/J &amp; S/J - Allison &amp; Matt talk about their new alliance.\n\nPart 2 - 33 min\nRyan tells the HOH group that he&amp;#039;s still on track and is cool - Josh &amp; Sharon get on board the Allison hate train - Matt tells Nat what the plan is and they may actually be safe this week - Amanda &amp; Alex flirt.\n\n02-26-08\n\nPart 1 - 25 min\nJosh &amp; James corner Allison as they are afraid she is going to flip. They basically threaten her here - Josh/James are FURIOUS with Allison - Josh tells Alex/Amanda to work the house and how to stay in the game.\n\nPart 2 - 16 min\nThey now corner Ryan - Amanda hides / Josh freaks out about no pizza in the house - Allison/Ryan talk about they are sticking with their plan.\n\nPart 3 - 31 min\nThe house has a heart to heart during dinner, didn&amp;#039;t see it but I guess Alex had a great speech - Josh/Sharon spy then more Allison hate - Josh knows the house is flipping and tries to make a deal with Matt.\n\nPart 4 - 16 min\nThe house is PISSED at Allison and they make up some &quot;plan&quot; to get Allison to hate Matt.\n\nPart 5 - 30 min\nThey bring Alex up and tell him the plan for them to stay in the house - Allison comes up and she destroys Alex, she is not going to budge - Then Ryan comes up to join this big &quot;plan&quot;.\n \nPart 6 - 18 min\nMatt comes up to talk about the bad things he said against Allison and if he actually campaigned against Alex.\n\nPart 7 - 21 min\nJosh is mad that Allison flipped the house and is now running the whole show - Allison tells Sheila that she wants to take out Josh next and she goes nuts - Amanda cries to Allison trying to get her vote - Josh/Adam talk probably for the first time ever.\n\nMore mixed clips.","torrent":{"xt":"urn:btih:e056a2424ebd5dbb9dd18f7b15e927c6e5d2afac","amp;dn":"Big+Brother+USA+9+Live+Feeds+-+02-25%2626-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e056a2424ebd5dbb9dd18f7b15e927c6e5d2afac","infoHashBuffer":{"type":"Buffer","data":[224,86,162,66,78,189,93,187,157,209,143,123,21,233,39,198,229,210,175,172]},"announce":[],"urlList":[]}}