{"title":"DAMN.NFO.Viewer.v2.10.0031.RC3.WinALL - MaMuNi.rar","uid":4048788,"size":234114,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1791a79c9a302d123742bccb8588b9f4dbd4959&amp;dn=DAMN.NFO.Viewer.v2.10.0031.RC3.WinALL+-+MaMuNi.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MaMuNi","files":1,"time":1204054066,"description":"\nDAMN NFO Viewer description\nDAMN NFO Viewer - the BEST utility for viewing text files containing ASCII Art (NFO/DIZ/TXT)\nDAMN NFO Viewer is an utility designed for viewing text files containing ASCII Art (e.g. nfo files), and it proved itself to be handy.\n\nSo, if you&amp;#039;re fed up with starting some DOS-like file manager each time you need to view nfo file, or ain&amp;#039;t too happy with the viewer you use, or (worst case) use Notepad - give this little tool a try.\n\nHere are some key features of &quot;DAMN NFO Viewer&quot;:\n\nAvailable in multiple languages\nÂ· Chinese Simplified, Dutch, English, French, German, Italian, Norwegian, Portuguese, Russian, Spanish, Swedish, Turkish. You can choose the languages during installation and switch between them later via Settings dialog.\n\nHyperlinks / Email addresses autodetection\nÂ· The viewer automatically detects hyperlinks / email addresses and shows them as clickable shortcuts.\n\n\nCustomizable appearance\nÂ· You can set text/background colors, colors for hyperlinks and hovered hyperlinks, whether or not you want hyperlinks to be underlined, and choose between 3 built-in fonts, available in different sizes.\n\nWord Wrap\nÂ· You can switch between word wrap, character wrap and no wrap.\n\nShell integration\nÂ· The Viewer can be set as the default application to open files with .nfo and .diz extensions. You get fancy file icons as a bonus.\n\nSmart line breaks handling\nÂ· Unix style line breaks are supported (that is, you won&amp;#039;t notice any difference). Moreover, the Viewer correctly displays files with doubled/tripled/etc. (e.g. because of improper multiple Unix&lt;-&gt;Windows conversions) line breaks.\n\nUnicode support\nÂ· Unicode version of the program is installed automatically if the operation system supports it. Unicode version provides better support for multilingual user interface.\n\nCopy-on-Select\nÂ· When this feature is on, text gets copied to clipboard automatically after you have finished selecting it (released shift key or left mouse button). After the selected text has been copied, the selected area will flash shortly and the text will get deselected (so for those who thought it&amp;#039;s a bug: it is not).\n\nDirect Scroll mode\nÂ· In this mode there&amp;#039;s no caret so you can&amp;#039;t select text with keyboard, but you can navigate through file contents more easily (like in your browser). Turning it off makes it more like viewing a file in a text editor. and more...\nÂ· ...including Most Recently Viewed nfos list (accessible via menu or Alt+R), Drag&amp;Drop support, ... well, check for yourself.\n\n","torrent":{"xt":"urn:btih:e1791a79c9a302d123742bccb8588b9f4dbd4959","amp;dn":"DAMN.NFO.Viewer.v2.10.0031.RC3.WinALL+-+MaMuNi.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1791a79c9a302d123742bccb8588b9f4dbd4959","infoHashBuffer":{"type":"Buffer","data":[225,121,26,121,201,163,2,209,35,116,43,204,184,88,139,159,77,189,73,89]},"announce":[],"urlList":[]}}