{"title":"WinDriver x64 ","uid":4058705,"size":17283920,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1af774d91c31c59fd068aeeb3f396e4a74cb5b7&amp;dn=WinDriver+x64+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"masterseiryu","files":1,"time":1204493038,"description":"************\nThis is the 30-day fully functional free trial! I haven\\&amp;#039;t installed it or tested it; just barely downloaded it from Jungo.com. \n************\n\nWinDriver product line supports any USB/PCI device, regardless of its silicon vendor, and enables you to focus on your driver\\\\\\&amp;#039;s added-value functionality, instead of on the operating system internals. Complete support for USB, PCI, PCI Express, CardBus, CompactPCI, ISA, PMC, PCI-X, PCI-104 and PCMCIA.\n\n    *\n      Immediate Hardware Access\n      Test your hardware through a graphical user-mode application, without having to write a line of code.\n    *\n      Generation of hardware-specific access code\n      WinDriver generates a skeletal driver code, customized for the user\\\\\\&amp;#039;s hardware.\n    *\n      Field-proven quality\n      WinDriver\\\\\\&amp;#039;s technology enables you to concentrate on your core business and successfully create first-rate drivers without having to invest redundant resources in driver development from scratch.\n    *\n      User-mode programming\n      WinDriver\\\\\\&amp;#039;s architecture enables driver development in the user mode, while maintaining kernel-mode performance.\n    *\n      Samples\n      Many samples which can be used as a starting point for your own driver. Special samples for various PCI / USB chip vendors, such as PLX,  Altera, Cypress, Microchip, Philips,  Silicon Laboratories, QuickLogic, National Semiconductor, STMicroelectronics, Texas Instruments, Xilinx, Agere, PLDA and AMCC.\n    *\n      Debugging\n      Included graphical Debug Monitor to monitor kernel level activity throughout the driver development process.\n    *\n      Multiple operating system support\n      WinDriver product line supports Windows 98 / Me / 2000 / XP / XP Embedded / Server 2003, Vista, Windows NT4, Windows CE / Mobile 5.0, Linux, Solaris and VxWorks.\n    *\n      Cross operating system capabilities\n      The same driver will run under all supported operating systems without any code modifications.\n    *\n      Performance optimization\n      Use WinDriver\\\\\\&amp;#039;s Kernel PlugIn technology to develop your driver in the user-mode - then run performance critical sections of it in the Kernel Mode (Ring 0) to achieve optimal performance (more).\n    *\n      64-bit Support\n      Allow utilizing the additional bandwidth provided by 64-bit hardware and enable 64-bit data transfer on x86 platforms running 32-bit operating systems. Drivers developed with WinDriver will attain significantly better performance results than drivers written with the DDK or other driver development tools that do not support this feature.\n    *\n      FPGA Access\n      Access, control and program FPGA chips via the PCI bus. Enhanced support for FPGA vendors including Altera and Xilinx is included.\n    *\n      WHQL certifiable driver\n      Digitally sign your Windows driver by submitting it to MicrosoftÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s WHQL testing.\n    *\n      Complete .NET Framework Support\n      Easily incorporate WinDriver\\\\\\&amp;#039;s C# or VB.NET code into your existing .NET application using the powerful object oriented managed extensions for C++ library.\n\n\nTestimonials\n\n\\\\\\&quot;...In 5 minutes WinDriver generated my USB libraries that contain all the high level API calls that you need enabling me to start transferring data over USB and without compromising on performance.\\\\\\&quot;\n\nIgor Sotosek , AGB Lab |\n\n\\\\\\&quot;It only took me 10 minutes to whip up a driver for my PCI card.\\\\\\&quot;\n\nBrian Miglia, Raytheon Missile Systems |\n ","torrent":{"xt":"urn:btih:e1af774d91c31c59fd068aeeb3f396e4a74cb5b7","amp;dn":"WinDriver+x64+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1af774d91c31c59fd068aeeb3f396e4a74cb5b7","infoHashBuffer":{"type":"Buffer","data":[225,175,119,77,145,195,28,89,253,6,138,238,179,243,150,228,167,76,181,183]},"announce":[],"urlList":[]}}