{"title":"Vorkuta (2007) - Into the Chasms of Lunacy *Hungarian BM*","uid":4261461,"size":55528817,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e281dab10a5d3ea32137963099fb5bab14b4d6d2&amp;dn=Vorkuta+%282007%29+-+Into+the+Chasms+of+Lunacy+%2AHungarian+BM%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VoltaXebec1968","files":9,"time":1214499312,"description":"1.\tWarriors of Past\t01:45\t\n2.\tGargoyle\t07:46\t\n3.\tMy Flaming Soul\t05:10\t\n4.\tStardust\t05:27\t\n5.\tVorkuta\t08:33\t\n6.\tWithin The Fortress of Melancholia\t07:37\t\nTotal playing time\t36:20\n\nReview from vampire-magazine.com\n\nSince forming in 2002 under the name of Fjord, Hungarian black metal act Vorkuta have made quite a name for themselves in the black metal underground, releasing four demos and a host of splits of some of the coldest and most desolate music you are likely to hear.  Wallowing filthily in the sounds and atmospheres of the mid-nineties Norwegian variety, their debut album ?Into The Chasms Of Lunacy? evokes the black ghosts of an era past in style, aesthetic and production, where sunken guitar riffs, sparse lo-fi keyboards and screamed vocals rule supreme.  Got your attention yet?  Good.\n\nSounding like a cross between early Enslaved, Burzum and Carpathian Forest, it has to be said that Vorkuta are not the most original black metal band to have graced the planet.  Not that this really matters because what they lack in originality they more than make up for in the fact that they bring back those memories of when this music sounded exciting, dangerous and above all, real.  Done from the heart and not to just copy their mentors, tracks like ?Gargoyle?, ?Vorkuta? and the stunning dark ambient piece ?Stardust? sound as authentic as they do mind blowing, sending you back wandering those forgotten dark forests of snow and ice.  Fucking fantastic.            \n\nGiven the fact that this is a debut album, you can only imagine what dark and primitive sounds this band of corpsepainted black souls will come up with next.  Fuck evolution, fuck change and make way for black metal done the proper way.  An album for those of who long to have that tingle down your spine and that coldness in your bones once again.  \n &lt;a href=&quot;\nhttp://www.metal-archives.com/band.php?id=22342&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.metal-archives.com/band.php?id=22342&lt;/a&gt;\n\nEAC Lame 3.97 v0 VBR with log","torrent":{"xt":"urn:btih:e281dab10a5d3ea32137963099fb5bab14b4d6d2","amp;dn":"Vorkuta+%282007%29+-+Into+the+Chasms+of+Lunacy+%2AHungarian+BM%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e281dab10a5d3ea32137963099fb5bab14b4d6d2","infoHashBuffer":{"type":"Buffer","data":[226,129,218,177,10,93,62,163,33,55,150,48,153,251,91,171,20,180,214,210]},"announce":[],"urlList":[]}}