{"title":"Atomix.Virtual.DJ.Pro.v5.0.7-Nilo","uid":4137189,"size":11530246,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e357cac062d4f78c973229280dbd718f50933dbc&amp;dn=Atomix.Virtual.DJ.Pro.v5.0.7-Nilo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DjNilo","files":2,"time":1208311113,"description":"        VirtualDJ is the hottest MP3 mixing software, targeting every DJ\n           from bedroom DJs to professional superstars like Carl Cox.\n       With its breakthrough BeatLock engine, your songs will always stay\n        in the beat, and you can work your mixes incredibly faster than\n                              any other DJ could.\n       The automatic seamless loop engine and the brand new synchronised\n         sampler will let you perform astounding remixes live, with no\n                              preparation at all.\n        The visual representation and the cues allow you to clearly see\n        the song&amp;#039;s structure, and never be surprised by a break anymore.\n       The vinyl controls will let you scratch like on a real turntable,\n       except that with the beatlock engine your scratches will never end\n                                out of the beat.\n       Add to that an infinite number of cue points you can save for each\n             songs, a bunch of wonderful effects automatically beat\n                                 -synchronised.\n       Add also several interfaces to suit everybody from the beginner to\n       the professional DJ, the possibility to record your mixes to burn\n       them on CDs, to broadcast on the Internet and have your own radio\n        station, to save your CDs directly in MP3, to use a headphone to\n        preview the songs or an external mixtable to perform in a club.\n       Lastly, enter the new era of DJs by mixing video clips (DVD, DivX,\n                 MPEG...) which you can send on a giant screen.\n        Virtual DJ brings you all that, in the most easy-to-use way, and\n                         at the most affordable price.\n\n\nserial number : XXXX-XXXX-XXXX\n\ndownload this torrent to view serial nr....\n\n\ntorrent made and shared by DJ Nilo... http://www.djnilo.swedish.nu/","torrent":{"xt":"urn:btih:e357cac062d4f78c973229280dbd718f50933dbc","amp;dn":"Atomix.Virtual.DJ.Pro.v5.0.7-Nilo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e357cac062d4f78c973229280dbd718f50933dbc","infoHashBuffer":{"type":"Buffer","data":[227,87,202,192,98,212,247,140,151,50,41,40,13,189,113,143,80,147,61,188]},"announce":[],"urlList":[]}}