{"title":"77 Million Paintings","uid":4028954,"size":4414804205,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e372a26728d19620ad7110284d4412dab4f05c7d&amp;dn=77+Million+Paintings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sonic_fan1","files":48,"time":1203073012,"description":"Ladies and Gentlemen!\nThe following is a Pirate Bay exclusive (as far as I have been able to find)... I present for you, 77 Million Paintings by Brian Eno!\n\nI have uploaded the 2-disc set as .ISO files and included UltraISO in case you don&amp;#039;t want to burn the disc(s) or want to check them out before burning.\nEach disc is about 2 gigs (close to anyways), so it&amp;#039;s up to you how you want to handle them (merge them into a DVD video disc with the computer files in hybrid format on the disc or burn as two discs or whatever).\n\n\nFrom Amazon.com: Although he is perhaps more famous for his musical output, Brian Eno has had a long career as a visual artist with his work exhibited in scores of galleries across the globe for more than 25 years. The Limited Edition 77 Million Paintings features an exclusive interview DVD in which Brian Eno discusses his creation of the 77 Million Paintings software, the next evolutionary stage of his exploration into light as an artist&amp;#039;s medium and the aesthetic possibilities of &quot;generative software.&quot; The bonus software disc creates a constantly evolving, slowly changing &quot;light painting&quot; on the screen of your computer or TV with a virtually infinite number of variations accompanied by the music of Brian Eno.\n\nFrom the booklet&amp;#039;s back: 77 Million Paintings is the next evolutionary stage of Brian Eno&amp;#039;s exploration into light as an artist&amp;#039;s medium and the asthetic possibilities of &amp;#039;generative software.&amp;#039;  This piece utilizes the computers unique capacity as a generating processor to produce original visual compounds out of a large quantity of hand-painted elements.\n\n\nPlease enjoy, and remember to seed when possible!","torrent":{"xt":"urn:btih:e372a26728d19620ad7110284d4412dab4f05c7d","amp;dn":"77+Million+Paintings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e372a26728d19620ad7110284d4412dab4f05c7d","infoHashBuffer":{"type":"Buffer","data":[227,114,162,103,40,209,150,32,173,113,16,40,77,68,18,218,180,240,92,125]},"announce":[],"urlList":[]}}