{"title":"WWE Backlash HD Fatal 4 Way Elimination Match 2008-04-27 XviD-SC","uid":4161722,"size":363193170,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e37e62e0f32018a946498ca1a99100a0ab5c3f0e&amp;dn=WWE+Backlash+HD+Fatal+4+Way+Elimination+Match+2008-04-27+XviD-SC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Have_A_Nice_Day","files":27,"time":1209407725,"description":"Enjoy the main event from TPB&amp;#039;s best (re)uploader!!!\n\nWARNING: AVOID COMMENTS AS YOU KNOW JABRONIZ SPAM &amp; SPOIL!! - especially 1 prick by the alias frb2000!\n\n\nHave A Nice Day =P\n\n................................................................................\n\n\nStoneCold420 and SmackDownHotel presents another High Quality Pro Wrestling XviD release for your viewing enjoyment. This is SDH release #387 for the wrestling fans from a wrestling fan.\n\n\nWWE Backlash HD Fatal 4 Way Elimination Match 2008-04-27 XviD-SC-SDH\n\n\n1st Mariner Arena \nBaltimore, Maryland\nApril 27, 2008\n\n\nWWE Championship Fatal 4 Way Elimination title match\nTriple H\nvs\nJohn Cena\nvs\nRandy Orton\nvs\nJBL\n\n\nJim Ross, Jerry the King Lawler call the action\n\n\nDue to circumstances beyond my control (Not my fault) I can only bring you this 1 great championship match instead of the whole show due to a DirecTv Satellite broadcast problem which began at 8:03 pm and continued for 54 minutes before satellite signal returned; only to go out 3 minutes later and stay out till right after 10:00 pm. By this time I had already been on the phone with DirecTv tech support over an 90 minutes trying to get the issue resolved and by the time the show finally came in where it could be captured it was right before the beginning of this match and so here it is sorry about the rest of the show but if it makes any difference this is a 350 MB file in 16:9 widescreen from the Backlash HD Show and this is one hell of a Championship match which goes 40 minutes long.\n\n\nAnother High Quality Pro Wrestling XviD release brought to you by StoneCold420 and the SmackDownHotel DC++ Hub. Enjoy the show and that&amp;#039;s the bottomline cause StoneCold420 said so!!! This is SDH release #387 for the wrestling fans from a wrestling fan.\n\nThis Backlash match was captured with a Hauppauge WinTv HVR-1800 PCI-Express capture card from the HD PPV channel on DirecTv in high quality 12 mbps VBR mpeg 2 with 384 kbps AC3 Dolby Digital audio then converted to 512 x 384 XviD with 128 kbps mp3 audio with Auto Gordian Knot. If you wish to burn this XviD file to cd-r or dvd-r then all SDH releases are compatible with all standalone Philips DVD - DivX players. \n\n\nStoneCold420\nSmackDownHotel\nApril 27, 2008","torrent":{"xt":"urn:btih:e37e62e0f32018a946498ca1a99100a0ab5c3f0e","amp;dn":"WWE+Backlash+HD+Fatal+4+Way+Elimination+Match+2008-04-27+XviD-SC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e37e62e0f32018a946498ca1a99100a0ab5c3f0e","infoHashBuffer":{"type":"Buffer","data":[227,126,98,224,243,32,24,169,70,73,140,161,169,145,0,160,171,92,63,14]},"announce":[],"urlList":[]}}