{"title":"Wow server emulator for 2.3.3","uid":4054730,"size":80349716,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e3fcd3466f56d11776ec45a1c33e4a70d3b5b556&amp;dn=Wow+server+emulator+for+2.3.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kachetofes","files":1,"time":1204314412,"description":"Wow server emulator for 2.3.3\nIncludes Navicat for \ndatabase Modifying (like creating or modifying new weapons),\nHamachi so you allow friends to connect to your server, net framework 3.5 (you need to install this before anything).\n\n\n*****Setup*****\n1.Run and install AC_Web_Ultimate_Repack.exe and install it in your C: hardrive.\n2.Run and install dotNetFx35setup (Net framework)\n3.Now go into your Ac Web Ultimate Repack folder and open the tools folder. Choose \nenGB if you have the european version of world of warcraft or enUS if you have the\n american(if you installed AC_Web_Ultimate_Repack.exe in your C: hardrive the 2 \nfiles should be c:\\\\\\\\AC Web Ultimate Repack\\\\\\\\Tools\\\\\\\\Map Extractor enGB or c:\\\\\\\\AC Web Ultimate Repack\\\\\\\\Tools\\\\\\\\Map Extractor enUS). There should be 3 files there. Copy the files \\\\\\&quot;maps\\\\\\&quot; and \\\\\\&quot;ad\\\\\\&quot; to your world of warcraft folder (normally C:\\\\\\\\Program files\\\\\\\\World of Warcraft) and start \\\\\\&quot;ad\\\\\\&quot;. It may take a while for it to finish.\n4.After ad has finished extracting all the maps move your \\\\\\&quot;maps\\\\\\&quot; folder to the ascent folder wich you will find inside your Ac Web Ultimate Repack folder.\n5.After that start Control Panel (is inside you Ac Web Ultimate Repack folder too). You will see 4 buttons. Start with pressing MySQL (this is your database), after that Logonserver (your account database), then Ascent (Server/database) and last Apache (your website database). Now your server is up. Go to your World of warcraft folder and open the file realmlist.wtf with wordpad or notepad (if you wanna be able to still play on blizzard servers the make a backup of your realmlist.wtf) delete everything in it and type in:\n\nset realmlist 127.0.0.1\nnow save it and start Wow and login with acc:admin pass:admin\nnow you can login to your server, but your friends cant untill you have followed the steps below (hamachi).\n\n\n*****Hamachi*****\nHamachi will make it possible for up to 10 friends to be able to connect to your server.\n1. Run and install HamachiSetup-1.0.2.5-en.exe\n2. Start hamachi, press the power button and when it has connected and you see a ip adress that doesent say 0.0.0.0 press the triangel button and select create network. Now choose a network name and pass\n3. Now the hard part. Open your Ac Web Ultimate Repack folder and open the ascent folder. Open the file realms.conf with wordpad or notepad and scroll down to a section that looks like this:\n\n&lt;Realm1 Name = \\\\\\&quot;Ac Web Ultimate Repack\\\\\\&quot;\n        Address = \\\\\\&quot;127.0.0.1:8129\\\\\\&quot;\n        Icon = \\\\\\&quot;Normal\\\\\\&quot;\n        Colour = \\\\\\&quot;1\\\\\\&quot;\n        Population = \\\\\\&quot;1.0\\\\\\&quot;\n        TimeZone = \\\\\\&quot;1\\\\\\&quot;&gt;\nNow u have to change the part that says 127.0.0.1 to your hamachi ip (If u dont know what or where your hamachi ip is then open your hamachi and the ip will be on the top of the hamachi window). A hamachi ip usually starts with 5 like for exampel mine is 5.66.183.184 After you have done that it should look like this (just to show i put in my own hamachi adress):\n\n&lt;Realm1 Name = \\\\\\&quot;Ac Web Ultimate Repack\\\\\\&quot;\n        Address = \\\\\\&quot;5.66.183.184:8129\\\\\\&quot;\n        Icon = \\\\\\&quot;Normal\\\\\\&quot;\n        Colour = \\\\\\&quot;1\\\\\\&quot;\n        Population = \\\\\\&quot;1.0\\\\\\&quot;\n        TimeZone = \\\\\\&quot;1\\\\\\&quot;&gt;\nNow save your realms.conf and close it.\n4. Now to make your friends able to connect they must also install hamachi and join your hamachi server (by following step 2 except they have to press the triangel and select join server).\n5.Now your friends have to open their World of warcraft folders and Modify thier realmlist like you did but instead of writing \\\\\\&quot;set realmlist 127.0.0.1\\\\\\&quot; they must type in your hamachi ip instead of 127.0.0.1\n6.To create an account for your friends you can either logon to your gm acc and type: .account create &lt;account name&gt; &lt;password&gt; \nor you can manually make their accounts through your database, but for that you need to follow the steps below\n\n*****Database Modifying*****\nNow the most difficult part, can take a while to learn. These steps can only be done if your database is up (if MySQL is up)\n1. Start Navicat for MySQL 8.exe\n2. Press the \\\\\\&quot;Connection\\\\\\&quot; button at the top left\n3. Enter anything in connection name (i would name it Ascent)\n4. Under Host Name/Ip Adress type: localhost\n5. Port: 3306\n6. User name:root\n7. Password: Ascent\n8. Now press \\\\\\&quot;Test Connection\\\\\\&quot; and if there apears a window that says Connection Successful then your on the right track, if not read the steps above again\n9. Now press \\\\\\&quot;Ok\\\\\\&quot; and open Ascent (or whatever you named it) and you should see 6 cylinders named ascent, forum, information_schema, joomla, logon, mysql. Open the 1 named ascent. There you will find \\\\\\&quot;items\\\\\\&quot;, \\\\\\&quot;gameobject_names\\\\\\&quot; (objects like for exampel chairs), \\\\\\&quot;creature_names\\\\\\&quot; (Monsters) and much more things that you will understand later on when you start understanding more about database programing.\n10. To manually create accounts open the cylinder named \\\\\\&quot;logon\\\\\\&quot; and open \\\\\\&quot;accounts\\\\\\&quot;\nthere u will be able to create, modify and delete accounts.\n\nIf u have any more questions please comment or visit www.d3scene.com...\n\n\nGood luck","torrent":{"xt":"urn:btih:e3fcd3466f56d11776ec45a1c33e4a70d3b5b556","amp;dn":"Wow+server+emulator+for+2.3.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3fcd3466f56d11776ec45a1c33e4a70d3b5b556","infoHashBuffer":{"type":"Buffer","data":[227,252,211,70,111,86,209,23,118,236,69,161,195,62,74,112,211,181,181,86]},"announce":[],"urlList":[]}}