{"title":"Karaoke Revolution USA XBOXDVD-GAMERZ","uid":3264942,"size":2514364641,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e4aa679250bf120ca7cce28ea2dfb0e7c232248d&amp;dn=Karaoke+Revolution+USA+XBOXDVD-GAMERZ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Kabiki","files":53,"time":1102981664,"description":"Karaoke Revolution for Xbox comes bundled with a specially designed Konami-branded microphone from LogitechÂ®, and is also available as a standalone game that is compatible with the Xbox Live communicator headset and Xbox microphones. The game utilizes proprietary vocal analyzer technology to judge players on how well they hit and hold the notes in each song. Thanks to adjustable difficulty levels, gamers of all ages and levels of ability can sing along with Karaoke Revolution's diverse catalog of songs, including karaoke favorites, rock, pop, dance and R&amp;amp;B songs, as well as original Motown recordings. Adding to the excitement of Karaoke Revolution will be dynamic in-game crowds that react in real-time to a player's performance, getting on their feet and cheering to a well-sung tune or booing at a cascade of sour notes. The ultimate party video game, Karaoke Revolution features a number of exciting single and multi-player modes that support up to eight other aspiring pop stars. Showtime Mode lets players climb from the clubs to the ultimate arena, while Arcade Mode and Karaoke Mode let you sing and compete alone or with friends. In addition, several customizable characters and multiple venues make it even more fun to step up to the mic!","torrent":{"xt":"urn:btih:e4aa679250bf120ca7cce28ea2dfb0e7c232248d","amp;dn":"Karaoke+Revolution+USA+XBOXDVD-GAMERZ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4aa679250bf120ca7cce28ea2dfb0e7c232248d","infoHashBuffer":{"type":"Buffer","data":[228,170,103,146,80,191,18,12,167,204,226,142,162,223,176,231,194,50,36,141]},"announce":[],"urlList":[]}}