{"title":"DVDFab Platinum 4.1.0.0 Final-APiRATESLiFE","uid":4060277,"size":6981796,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e4d8a53de31349cc6493d42c81c686b7fe57258e&amp;dn=DVDFab+Platinum+4.1.0.0+Final-APiRATESLiFE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"apirateslifenet","files":3,"time":1204578773,"description":"DVDFab Platinum is all you need to backup DVDs. DVDFab Platinum 4 is brand new, is completely rewritten, is based on 5 years of DVD copy software development. DVDFab is simply the easiest way to copy a DVD movie.\n\nJust insert the movie and a blank DVD then press Start. Your entire movie - including menus, trailers and special features - is copied to a single DVD with just one click, and everything happens automatically. Backup your entire DVD - including menus, trailers, and special features - onto one or multiple discs.\n\nFEATURES:\n\nA. DVD to DVD\n1. 5 DVD to DVD copy mode available: Full Disc, Main Movie, Split, Customize and Clone.\n2. Full Disc: All movies, menus and trailers, is copied to a DVD with just one click.\n3. Main Movie: Just copy the movie, with specific audio/subpicture.\n4. Split: Copy a DVD-9 onto two DVD-5 discs with 100% quality, and preserve original menus on both discs. Ideal for episodic/season DVD movies, TV series, etc.\n5. Customize: Personalize your DVDs! Want to make a DVD with only your favorite titles? How about cutting out those annoying commercials? Or selecting specific audio/subpicture? No problem! You can select just your favorite titles, specify the title playback order, with or without original menus, to create a DVD with only the stuff you want!\n6. Clone: Make perfect 1:1 bit-to-bit copy of DVDs:\n--- Make perfect dual layer DVD copy by using the original layer break position.\n--- Copy data DVD disc, like PS2 DVD.\n7. Very fast copying speed, normally it&amp;#039;s about 10 - 20 minutes.\n8. Burn to any blank DVD Disc (DVD+R/RW, DVD-R/RW, DVD+R DL, DVD-R DL).\n\nB. DVD to Mobile\n1. 3 DVD to Mobile copy mode available: Generic, iPod and PSP. More devices support can be added manually.\n2. Generic: Convert DVD title to PC MPEG-4/DivX/XVID/H.264 AVI/MP4 file.\n3. iPod: Convert DVD title to Apple iPod MPEG-4/H.264 MP4 file.\n4. PSP: Convert DVD title to Sony PSP MPEG-4/H.264 MP4 file.\n\nC. Benefits\n1. Remove all DVD copy protections, like CSS, RC, RCE, APS, UOPs, ARccOS, RipGuard, FluxDVD, CORE X2, etc.\n2. Constantly updated to support latest DVD copy protections.\n3. Backup scratched/dirty disc:\n--- Even if some information (IFO) cannot be read, you can still copy Main Movie or Customize.\n--- Recovery from DVD reading (VOB) error.\n4. Constantly updated to support latest DVD burners and blank DVD discs.\n5. Constantly updated to support more mobile devices.\n6. FREE lifetime upgrade.\n7. FREE lifetime support via e-mail, worldwide.\n\nDVDFab Platinum 4.1.0.0 Updated!\nNew: Added &quot;Crop&quot; feature to remove the black bar on many widescreen movies, for &quot;DVD to Mobile&quot;.\nNew: Added option &quot;Crop automatically&quot;, and it&amp;#039;s enabled by default.\nNew: Added &quot;Advanced Resolution Settings&quot; to allow user to resize output from letterbox to pan&amp;scan, for &quot;DVD to Mobile&quot;.\nNew: Added thumbnail preview for &quot;Crop&quot; and &quot;Advanced Resolution Settings&quot; to see the real output before converting.\nNew: Preselect appropriate resolution and bitrate for better quality by default, for &quot;DVD to Mobile&quot;.\nNew: Improved compatibility with DVD Shrink for DVDs like &quot;3:10 to Yuma&quot;.\nNew: Improved DVD structure cleaning module to remove ending fake title-set.\nNew: Improved &quot;Jump to main title when disc inserted&quot; to select correct angle if it&amp;#039;s multi-angle title.\nNew: Added TV-Out profiles for iPod and PSP2000, for &quot;DVD to Mobile&quot;.\nNew: Added profile for BlackBerry cellphone, for &quot;DVD to Mobile&quot;.\nNew: Updated language files.\nFix: Option &quot;Jump to first menu when disc inserted&quot; may cause playback problem, like &quot;30 Days of Night&quot;, (US).\nFix: A playback problem on some DVD recorders/players for &quot;Split&quot; mode, finally.\nFix: A warning message &quot;Failure to initialize burn engine&quot; when choosing ImgBurn burning engine, in certain cases.\nFix: A warning message &quot;Unable to lock volume for exclusive access&quot; for ImgBurn 2.4.0.0.\nFix: Several minor problems.\n\nFully Patched Custom Installer By Me\n &lt;a href=&quot;\nhttp://www.apirateslife.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apirateslife.net&lt;/a&gt;","torrent":{"xt":"urn:btih:e4d8a53de31349cc6493d42c81c686b7fe57258e","amp;dn":"DVDFab+Platinum+4.1.0.0+Final-APiRATESLiFE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d8a53de31349cc6493d42c81c686b7fe57258e","infoHashBuffer":{"type":"Buffer","data":[228,216,165,61,227,19,73,204,100,147,212,44,129,198,134,183,254,87,37,142]},"announce":[],"urlList":[]}}