{"title":"CSSEdit 2.6 (MacHeist 2)","uid":4035522,"size":2514810,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e594f0388fca11604f44793a2fa4ae900ad08a74&amp;dn=CSSEdit+2.6+%28MacHeist+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kantijob","files":1,"time":1203413026,"description":"CSSEdit 2.6\n\nDesign beautiful, innovative and fast-loading web sites? with a beautiful, innovative and fast app. CSSEdit&amp;#039;s intuitive approach to style sheets and powerful previewing features will make you deliver awesome standards-based sites in no time!\n\n* Live Preview = Super Deluxe Extreme Ultra Pro\nCSSEdit offers unrivaled real-time styling of absolutely any web page. Even when your dynamic Web App is powered by a complex database or makes use of advanced AJAX, you can style and analyze it without the hassle of uploading or refreshing.\n\n* Selector Builder? Builds Selectors for You\nThe innovative Selector Builder lets you describe what elements to style in plain English. Advanced CSS selectors have a steep learning curve, but now there is help. Master advanced CSS without the effort of decoding cryptic selectors!\n\n* A Delightful Interface with Visual Editors\nThe coolest tabs you&amp;#039;ve ever seen. Elegant visual editors that create clean, valid styles without writing a single line of code. Extreme attention to detail. CSSEdit sports a stunning interface and is a perfect Mac OS X citizen.\n\n* Top-notch Source Editing, Intelligence Included\nMost comfortable editing source code? You can count on intelligent CodeSense. Instead of merely suggesting a list of predefined keywords, it actually analyses your Style Sheet and behavior to offer smart, context-sensitive suggestions.\n\n* X-ray Makes Complex Style Sheets Easy\nThe brand new X-ray Inspector shows you what styles apply to the web page. Add Browser Integration Bookmarklets, Extraction and Overriding, and you have the perfect tool to check out how the CSS Masters work. Don&amp;#039;t Steal Web Sites!\n\n* Validate Your Style Sheets Against W3C Standards\nUse the slick new Validation inspector to see if the World Wide Web Consortium likes your CSS. They invented Style Sheets! Catch your mistakes before the problem gets out of hand. Problems have never been so pretty.\n\n* Perform Crazy Style Experiments With Milestones\nDebugging CSS can be a dangerous task. You broke something, but when? No more worries! Keep track of your progress in the delicious Milestones interface and make big changes without any risk of losing your work.\n &lt;a href=&quot;\nhttp://macrabbit.com/cssedit/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://macrabbit.com/cssedit/&lt;/a&gt;\n\n-------------\n\nAfter mounting the .dmg file, license code is included as SN#.\n\n(Part of the MacHeist 2 bundle)","torrent":{"xt":"urn:btih:e594f0388fca11604f44793a2fa4ae900ad08a74","amp;dn":"CSSEdit+2.6+%28MacHeist+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e594f0388fca11604f44793a2fa4ae900ad08a74","infoHashBuffer":{"type":"Buffer","data":[229,148,240,56,143,202,17,96,79,68,121,58,47,164,174,144,10,208,138,116]},"announce":[],"urlList":[]}}