{"title":"The Rolling Stones - Aftermath Isolated Trax","uid":4038264,"size":979770136,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e596a4a7367b758d8809193334d03ce7290ada59&amp;dn=The+Rolling+Stones+-+Aftermath+Isolated+Trax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"magoocus","files":85,"time":1203543727,"description":"The Rolling Stones\nAftermath Isolated Trax\n\nAll tracks are outfakes derived from the London cd and other sources. \n\nRecording order isn&amp;#039;t known. Songs are sequenced with instrumental backing first, \nthen vocals, song by song in random mostly alphabetical order.\n\n4-track recording is assumed. \n\nAlso not known is whether or not any reduction mixes or internal bounces were done \n(it sounds like there had to be, on many of the songs). On all of the Dec &amp;#039;65 \nsessions, it sounds like the music on the left ch is all one complete band basic\ntake (minus Brian?) while the instruments on the right were all overdubbed.\nThe Mar &amp;#039;66 sessions sound like the basic take was recorded to two tracks split\nleft and right, with bass and drums left and guitars right. Many of these songs\nsound like an overdub has been added left or right or both, which would have\nnecessitated a reduction mix or internal bounce to accomodate the extra\ninstruments.\n\n&quot;I did all the parts on half the album that Brian normally would have done. Sure I \nwas mad. It wasn&amp;#039;t like now where you spend 4 to 6 months making an album. Those \nalbums had to be done in 10 days, plus another single. That was a fact of life... \nWith Brian becoming a dead weight on top of the work, it threw a lot of the \npressure on me.&quot; - Keith 1979\n\nThe half of the album Keith is referring to could be what was recorded in Dec 65.\n \nPhotos show that at least some monitoring was done with headphones. \n\nMixing dates aren&amp;#039;t known. No official mono or stereo mixes are included. \n\n\nDisc 1 - Sessions Dec 3-8 1965 - 70:55\n\n1.  19th Nervous Breakdown - backing rhythm track - from L ch of UM7 stereo\nmix. Some piano heard at the end. Mick&amp;#039;s vocal is double-tracked so R ch must all \nbe one take of overdubs unless there was an internal bounce. \n2.  19th Nervous Breakdown - overdub track from R ch - must be Brian on\nguitar, Keith on fuzz guitar doubling left-ch riff, bass run must be an\noverdub by Bill\n3.  19th Nervous Breakdown - alternate vocals C - might be live vocal for tv\nshow, with studio backing tracks \n4.  19th Nervous Breakdown - master vocals C\n5.  Sad Day - mono\n6.  Mother&amp;#039;s Little Helper - backing L\n7.  Mother&amp;#039;s Little Helper - overdub R - (The strange guitar sound is) a 12-string \nwith a slide on it. It&amp;#039;s played slightly Oriental-ish. The track just needed \nsomething to make it twang. Otherwise, the song was quite vaudeville in a way. I \nwanted to add some nice bite to it. And it was just one of those things where \nsomeone walked in and, Look, it&amp;#039;s an electric 12-string. It was some gashed-up job. \nNo name on it. God knows where it came from. Or where it went. But I put it together \nwith a bottleneck. Then we had a riff that tied the whole thing together. And I \nthink we overdubbed onto that. Because I played an acoustic guitar as \nwell. -Keith 2002 \n8.  Mother&amp;#039;s Little Helper - vocals C\n9.  Doncha Bother Me - backing L \n10. Doncha Bother Me - guitar overdubs R - 3 guitars in the R ch, one in the L ch.\n11. Doncha Bother Me - vocals/harmonica C\n12. Goin&amp;#039; Home - Keith speaks\n13. Goin&amp;#039; Home - false start\n14. Goin&amp;#039; Home - backing L - Mick on tambourine must mean his lvs were an\noverdub, otherwise those lvs would have bled all over this track on the\ntambourine mic.\n15. Goin&amp;#039; Home - overdubs R - lead guitar and bvs, overdubs stop at 3:10\n16. Goin&amp;#039; Home - lv overdub C\nBonus:\n17. 19th Nervous Breakdown - stereo backing LR\n18. Mother&amp;#039;s Little Helper - stereo backing LR\n19. Doncha Bother Me - stereo backing LR\n\nDisc 2 - Sessions Dec 3-8 65 and Mar 6-9 1966 - 76:05\n\n1.  Take It Or Leave It - backing L - has both koto and harpsichord, Brian is\nsupposed to be playing both. Maybe Jack Nitsche is on harps and Brian overdubs the\norgan in R ch.\n2.  Take It Or Leave It - overdubs R - bvs and organ\n3.  Take It Or Leave It - lead vocal C\n4.  Think - backing L - lv is double-tracked so everything in R ch must be\nan overdub, unless they did a reduction or internal bounce.\n5.  Think - overdubs R - sounds like 3 guitars here though: acoustic, electric\nand fuzz. Or is it fuzz bass?\n6.  Think - double-tracked vocals C\n7.  Ride On Baby - backing L - no leakage of C or R ch&amp;#039;s\n8.  Ride On Baby - overdubs R - heavy leakage of vocals on some R ch \ninstrument mics (?) might indicate lv or bv performed with inst overdubs while\nbeing recorded to another track. Or R ch overdub recorded after the vocals\n9.  Ride On Baby - vocals C\n10. Sittin&amp;#039; On A Fence - backing L - no leakage from R or C ch&amp;#039;s. \n11. Sittin&amp;#039; On A Fence - guitar R - Keith (?) overdub (?) or Brian\n12. Sittin&amp;#039; On A Fence - vocals C\n13. Paint It Black - instrumental (edited) - Black Box\n14. Paint It Black - stereo backing LR - Stictly Stereo\n15. Paint It Black - vocals C - Strictly Stereo\n16. Long Long While - mono 45\n17. Lady Jane - instrumental - Black Box\n18. Lady Jane - backing R\n19. Lady Jane - bass and harpsichord L - harpsichord overdubbed? song played live?\n20. Lady Jane - vocals C\nBonus:\n21. Take It Or Leave It - stereo vocals CR\n22. Think - stereo backing LR\n23. Ride On Baby - stereo backing LR\n24. Sittin&amp;#039; On A Fence - stereo backing LR\n25. Lady Jane - stereo backing LR\n\nDisc 3 - Sessions Mar 6-9 1966 - 62:11\n\n1.  Stupid Girl - stereo backing LR\n2.  Stupid Girl - vocals C\n3.  Flight 505 - stereo backing LR - bass and fuzz bass on L, sounds like lead\nguitar overdub on R. Maybe internal bounce of guitars to R, fuzz bass overdubbed\non 4th track panned L?\n4.  Flight 505 - vocals C\n5.  High And Dry - stereo backing LR - song performed live?\n6.  High And Dry - vocals C\n7.  I Am Waiting - stereo backing LR - vocal in R ch must be live with those\ninstruments because of double-tracked vocals in C\n8.  I Am Waiting - double-tracked Mick vocals C\n9.  If You Let Me - stereo backing LR - sounds like this song done &quot;live&quot; \n10. If You Let Me - vocals C\n11. It&amp;#039;s Not Easy - stereo backing LR - 3 guitars in R ch, the guitar solo\nmight have been overdubbed after the extra chorus vocal since it&amp;#039;s heard in\nthe R ch probably from monitor playback during tracking\n12. It&amp;#039;s Not Easy - double-tracked vocals C\n13. Out Of Time - stereo backing LR - internal bouncing? On R ch we can hear\nthe bvs but not the lv.\n14. Out Of Time - double-tracked vocals C\n15. Under My Thumb - stereo backing LR - Problem: L ch has drums, bass, marimbas\nand fuzz bass. R ch has acoustic and electric guitars and piano. Keith is supposed\nto be playing both guitars. Electric guitar and fuzz bass must be overdubs.  \n16. Under My Thumb - vocals\n17. What To Do - stereo backing LR\n18. What To Do - double-tracked vocals\n\nDisc 4 - Bonus Trax - 68:55\n\n1.  Paint It Black - L\n2.  Paint It Black - R\n3.  Stupid Girl - L\n4.  Stupid Girl - R\n5.  Flight 505 - L\n6.  Flight 505 - R\n7.  High And Dry - L\n8.  High And Dry - R\n9.  I Am Waiting - L\n10. I Am Waiting - R\n11. If You Let Me - L\n12. If You Let Me - R\n13. It&amp;#039;s Not Easy - L\n14. It&amp;#039;s Not Easy - R\n15. Out Of Time - L\n16. Out Of Time - R\n17. Under My Thumb - L\n18. Under My Thumb - R\n19. What To Do - L\n20. What To Do - R\n","torrent":{"xt":"urn:btih:e596a4a7367b758d8809193334d03ce7290ada59","amp;dn":"The+Rolling+Stones+-+Aftermath+Isolated+Trax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e596a4a7367b758d8809193334d03ce7290ada59","infoHashBuffer":{"type":"Buffer","data":[229,150,164,167,54,123,117,141,136,9,25,51,52,208,60,231,41,10,218,89]},"announce":[],"urlList":[]}}