{"title":"Pete Best: Best of the Beatles (2005) PBS-TVrip fullscreen4x3 di","uid":4275028,"size":1333993340,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e70c64d6197020f276848927cd1e63d06c20acbe&amp;dn=Pete+Best%3A+Best+of+the+Beatles+%282005%29+PBS-TVrip+fullscreen4x3+di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zelzel99","files":1,"time":1215139465,"description":"BEST OF THE BEATLES is the untold story of the world&amp;#039;s most famous band&amp;#039;s formative years &amp;#039; seen through the eyes of original Beatles drummer Pete Best. Viewers learn the facts about the Beatles&amp;#039; experiences in Liverpool and Hamburg at the time when the band redefined the vanguard. They also learn how it all went horribly wrong for the fifth Beatle, Pete Best, just as the Fab Four grasped the golden apple. BEST OF THE BEATLES airs on PBS Wednesday, September 28, 2005, 8:00-9:00 p.m. ET. Check local listings.\n\nFor the first time, viewers will hear Pete&amp;#039;s story, his pivotal role in forming the Beatles and how he survived a very public nightmare, all illustrated with a variety of music, archival material and interviews, some of which have never been seen before.\n\nPete&amp;#039;s story reveals the unlikely chain of events that led to his becoming the drummer in the Beatles in the first place: his mum, the formidable Mona, pawned all her jewelry and placed a 33-to-one bet on a horse called &quot;Never Say Die.&quot; The horse won. With her winnings, Mona bought her dream home, and sent Pete, his brothers and &quot;friends&quot; into the basement to socialize and play their music.\n\nFrom this was born the Casbah Coffee Club, which became Beatles headquarters, an intimate space that each Beatle helped to create and paint. Thus the legend began - the wild revelry of playing the clubs on the Reeperbahn in Hamburg&amp;#039;s red light district, the beginning of Beatlemania, recording for Polydor, establishing their authority as Liverpool&amp;#039;s number one group by winning the Mersey Beat Poll, signing manager Brian Epstein, the Decca Records rejection, meeting George Martin, signing for Parlophone, recording &quot;Love Me Do&quot; at Abbey Road Studios, and finally Pete&amp;#039;s dismissal from the Beatles.\n\n----------------\nbeyond TV rip from analog cable signal\n4:3 fullscreen\naudio 2 channel 48000 128kb/s MP1/MP2\nbeyond squeezed to divx 5 3000kbps\n\n120 min extended version also available on DVD: &lt;a href=&quot;\nhttp://www.shoppbs.org/sm-pbs-best-of-the-beatles-dvd--pi-2078449.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shoppbs.org/sm-pbs-best-of-the-beatles-dvd--pi-2078449.html&lt;/a&gt;\n\nand WS DVD also available out there somewhere.","torrent":{"xt":"urn:btih:e70c64d6197020f276848927cd1e63d06c20acbe","amp;dn":"Pete+Best%3A+Best+of+the+Beatles+%282005%29+PBS-TVrip+fullscreen4x3+di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e70c64d6197020f276848927cd1e63d06c20acbe","infoHashBuffer":{"type":"Buffer","data":[231,12,100,214,25,112,32,242,118,132,137,39,205,30,99,208,108,32,172,190]},"announce":[],"urlList":[]}}