{"title":"Cowboy Junkies 2001-02-11 @ Capitol Theatre - Port Hope, ON","uid":4057762,"size":471255376,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7ac1d42dface64fc515d0ac47a6a2a59d2a03fb&amp;dn=Cowboy+Junkies+2001-02-11+%40+Capitol+Theatre+-+Port+Hope%2C+ON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":26,"time":1204459083,"description":"As I wrote back in June, 2006 in the download description of show 2, I have, over the years, experimented in different ways with expanding my duties as archivist. Cowboy Junkies played three shows in Canada in February, 2001, and I blended soundboard and audience tapes of each show to achieve a rich true-sounding live recording. The mixing was done with Saw Pro, blending about 65 percent to 70 percent of the soundboard source and the rest from the audience source. By expanding the waveforms to the smallest time platform, I was able to align them perfectly, a neat trick when neither source has time-code. I had to time-align each track to compensate for &quot;drift,&quot; caused by having the audience recording about 100 feet back from the stage. The results came out quite well. Michael liked the tapes, but ultimately it was decided not to pursue this on a regular basis.\n\n \n\nI think this show, from February 11, 2001, was my favorite of the three shows the band performed that weekend. It was an interesting blend of songs. &quot;Powderfinger&quot; opened, promising a truly special evening. &quot;Close Your Eyes&quot; had just started to appear in the setlists, but it was then, and remains to this day, a rare tune for the band to play. &quot;Escape is So Simple&quot; is, of course, a song that can send me over the edge, a hauntingly beautiful tune that is one of Michael&amp;#039;s best songs. \n\n ","torrent":{"xt":"urn:btih:e7ac1d42dface64fc515d0ac47a6a2a59d2a03fb","amp;dn":"Cowboy+Junkies+2001-02-11+%40+Capitol+Theatre+-+Port+Hope%2C+ON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ac1d42dface64fc515d0ac47a6a2a59d2a03fb","infoHashBuffer":{"type":"Buffer","data":[231,172,29,66,223,172,230,79,197,21,208,172,71,166,162,165,157,42,3,251]},"announce":[],"urlList":[]}}