{"title":"the bad luck 13 riot extravaganza discography","uid":4112250,"size":202791630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e8644cb9cf60acf5db9e87d12c5654b28e4bd793&amp;dn=the+bad+luck+13+riot+extravaganza+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gtluke","files":59,"time":1207121119,"description":"BAD LUCK 13 RIOT EXTRAVAGANZA BIOGRAPHY\n\nWho ever said the image didn?t matter? Bad Luck 13 Riot Extravaganza prove that with a combination of a brutal hardcore/metal sound and a stage show that leaves the audience bewildered and wanting more, there?s still room for good old onstage antics. With a band that consists of 13 modern day Vikings as members, a Bad Luck 13 show experience is sure to not soon be forgotten. For the past 8 years they have proved that nothing is too extreme for the sake of entertainment.\n\nTo say that Bad Luck 13 goes against the grain when it comes to a show would be an extreme understatement. Unlike anything you would see in even your most terrifying nightmare, a typical Bad Luck 13 performance is composed mainly of a whole lot of wrestling, blood, and mayhem. The band?s skull-crushing set is not for the weak of stomach, but is any pyromaniac?s dream. While beating the living pulp out of their fellow band mates with blunt objects such as trash cans, ladders, and various other torture devices of the like, the band is also notorious for fire-breathing and other arsonistic stunts.\n\nIf you are too afraid to attend a Bad Luck 13 show, no worries. Bad Luck 13 have captured their incredible live performance and onstage antics on video. In 2001 they released the first of 3 home videos entitled ?Let the Riot Begin? with their own production company Homicidal Productions. &quot;Let The Riot Begin&quot; was produced/directed by Joe Frantz whose credits include CKY videos, Haggard and Viva La Bam MTV show just to name a few. They will be following up this winter 2004 with the second installment, ?The Story of an Outlawed Band? also produced and directed by Joe Frantz. This is a video surely not to miss.\n\nTheir discography includes: &quot;With Friends Like These Who Needs Enemies&quot; CD EP (Resurrection A.D. Records, 2002); a Live split CD with All Else Failed (Supermodel Records, 2001); ?We Kill Children? CD (Too Damn Hype Records, 2000) and ?Bats on the Dance Floor? CD (Temperance Records, 1998).\n\nBad Luck 13 Riot Extravaganza have been entertaining audiences with their insanity for the past eight years. The question is can you handle it?\n\n","torrent":{"xt":"urn:btih:e8644cb9cf60acf5db9e87d12c5654b28e4bd793","amp;dn":"the+bad+luck+13+riot+extravaganza+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8644cb9cf60acf5db9e87d12c5654b28e4bd793","infoHashBuffer":{"type":"Buffer","data":[232,100,76,185,207,96,172,245,219,158,135,209,44,86,84,178,142,75,215,147]},"announce":[],"urlList":[]}}