{"title":"Ekotren/ Light The Fire","uid":4102374,"size":69317563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e8ebfbf9cc356bce43320953074e5934042b1f3b&amp;dn=Ekotren%2F+Light+The+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Joe_purdy","files":1,"time":1206640758,"description":"Band Bio\n\nIt?s been said over and over again- this band blends metal with melody, reeling in legions of fans with a unique sound that fits no category.  The same faulty glaze can be lacquered onto any band?s backstory but while thousands of bands make such a claim and never live up to that glory, one band truly makes the words come alive- EkoTren.\n\nEven it its name, EkoTren falls far from standard.  Named loosely after an over-the-counter painkiller, the band is made up of 5 humble young guys with a penchant for hard-hitting hooks and heavy metal. The outfit was established in Cape Coral, FL between high schoolers John Sheldon, Keith Finnell, and Steve Chin in 2000 with Sheldon on vocals, Finnell on guitars, and Chin at turntables.  In order to expand the musical flow, Chin shifted his position to keys years later.  After a slight change in the lineup, drummer Eric Pottle joined the band in 2005 and but the final contingent was complete in 2007 with the addition of bassist Derek DeSantis.  A longtime friend of the band, DeSantis has toured with the likes of Dope, Static-X, and Ozzfest 2003 as part of acclaimed projects Twisted Method (Geffen) and Makeshift Romeo.  \n\n?Nothing?s different in the sense of already knowing the guys, I?ve been comrades with them.  It?s actually a lot better as far as work ethic is involved in the band,? explains DeSantis.  ?Everyone is this group is willing to meet up, practice, write and the whole band is self-sufficient.  It?s just a tight-knit group of people and who are open and we throw everything on the table when we need to discuss things.  As far as I?m concerned it?s the strongest line-up I?ve ever worked with.?\n\nTactful and tireless, the guys spent years flying like bats out of hell, running circuits around the state with shows ranging from Warped Tour Orlando (2006) to opening stints alongside Saliva, Flyleaf, Ankla, Diecast, and more.  It wasn?t long before the fire spread.  EkoTren amassed a following through the word-of-mouth from dedicated fans and performances packed with the melodic kick of their highly-addictive sound.\n\n?I think our musical style is pretty much universal, everyone can relate to it- everyone has problems? says Chin.\n\n?I think a lot of what separates EkoTren from other bands, especially metal, is that we use a lot of melody in our music and Sheldon?s voice is really different.  We also use a really oddball guitar tuning- we drop down to G and the only other band that I know does that is Meshuggah? adds Finnell.\n\nAs a follow-up to their premiere EP ?The Tables Have Turned,? EkoTren teamed up with renowned producer Paul Trust [Endo, Diecast, and others] in early 2007 to helm a three-song EP. The result, ?Destroying the American Dream,? features tracks ?The Light,? ?Falling,? and ?Point of View? which became instant crowd favorites on every stage they stepped foot. \n\nAfter years enduring sweat, blood, and late-night automotive blowouts, EkoTren saw their efforts rewarded when they signed a contract with ambitious indie Blind Prophecy Records in September 2007.  Despite a road schedule that could exhaust any batch of artists, EkoTren tapped into their bountiful source of creative energy to craft a new slew of songs that would make their full-length debut.  EkoTren returned to Trust?s clutches in fall 2007 to record their long-awaited album, ?Light the Fire? slated to hit stores worldwide in early 2008.\n\nWhile displaying massive growth in musicianship to old fans, EkoTren is about to throw the world their signature punch with ?Light the Fire.? ?We?re 100% stronger.  The style has changed over the years but we?re better musicians and we all meld together very well,? says Sheldon.  Steered by melody and driven by metal, the 11-song record features new tracks that will lock listeners in for a full-throttle musical experience.  Leaving no time to waste, after putting the finishing touches on the album in October 2007, EkoTren will hit the road in support of past tourmates and metal masterminds Diecast on an extensive U.S. tour.\n\nWith fire in their veins, undying ambition, and a solid work ethic, EkoTren is launching forward, eager to take listeners straight into an untainted place where metal?s never gone before.  Facing the world with musical substance, youthful vigor, and an attitude well beyond their years, ?Light the Fire? will leave no one safe from EkoTren?s wrath.\nWhile proof lies in the past and present, there?s no questioning the future ? the world awaits for these metal visionaries.\n\nEkoTren is:\nJohn Sheldon ? vocals\nKeith Finnell ? guitar\nDerek DeSantis ? bass\nSteve Chin ? keys\nEric Pottle ? drums\n\n \n\n \n\t\n\nDiscography\nLight the Fire ? 2008\nDestroying the American Dream (EP) ? 2007\nThe Tables Have Turned (EP) ? 2006","torrent":{"xt":"urn:btih:e8ebfbf9cc356bce43320953074e5934042b1f3b","amp;dn":"Ekotren%2F+Light+The+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ebfbf9cc356bce43320953074e5934042b1f3b","infoHashBuffer":{"type":"Buffer","data":[232,235,251,249,204,53,107,206,67,50,9,83,7,78,89,52,4,43,31,59]},"announce":[],"urlList":[]}}