{"title":"HandBrake for Windows 0.92","uid":4036784,"size":3537699,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e987c2f890eb9cdc9e89056055b6fab73e8001b1&amp;dn=HandBrake+for+Windows+0.92&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"z247","files":1,"time":1203466226,"description":"HandBrake is an open-source, GPL-licensed, multiplatform, multithreaded DVD to MPEG-4 converter, available for MacOS X, Linux and Windows (I am seeding the Windows version only).\n\n\nSupported sources:\nAny DVD-like source: VIDEO_TS folder, DVD image or real DVD (encrypted or unencrypted, but protection methods other than CSS are not supported and must be handled externally with third-party software), and some .VOB and .TS files\nPAL or NTSC\nAC-3, DTS, LPCM or MPEG audio tracks\n\nOutputs:\nFile format: MP4, MKV, AVI or OGM\nVideo: MPEG-4 or H.264 (1 or 2 passes or constant quantizer/rate encoding)\nAudio: AAC, MP3, Vorbis or AC-3 pass-through (supports encoding of several audio tracks)\n\nMisc features:\nChapter selection\nBasic subtitle support (burned into the picture)\nIntegrated bitrate calculator\nPicture deinterlacing, cropping and scaling\nGrayscale encoding\n\n\n\n\n\n\nThe description below is copied from freewaregenius dot com: \n\n\nDescription: Handbrake is a free program that can convert DVD?s or VOB files into video files. Supported containers are: MP4/M4V (for Ipod), AVI, OGM, and MKV, while supported video encoders are Xvid, H264, and Mpeg4.\n\nHandbrake has established a reputation as being a 1-click solution for converting DVDs to Ipod video format (MP4/M4V), but it can also be used simply for encoding to AVI/Xvid, as well as to a variety of handheld devices such as PSP, PS3, Iphone and a number of other formats (e.g. Quicktime, &quot;Apple TV&quot;). \n\nI?ve been looking at Handbrake for some time now and waiting for a version that works well on Windows; which I think is accomplished with this release (if you have problems running it, see &quot;Tools and codecs&quot; below). Here are some notes on this program: \n\nDVD sources: Handbrake will NOT convert encrypted DVDs. This means that you will need to decrypt your favorite films and TV shows and copy them to your hard drive before Handbrake can process them. This can be done using a number of freeware programs such as RipIt4Me/DVD Decrypter, DVD Shrink, or DVD FAB HD Decrypter. Once this happens you will need to point Handbrake to the VIDEO_TS folder that is copied to your hard drive as the source.\nProfiles: Handbrake comes with a number of pre-defined profiles that are very useful for getting your desired output format. If you are interested in creating a video file for the Ipod, for example, you would simply select one of the three existing Ipod profiles (Ipod High-Rez, Ipod Low-Rez, or Iphone/Ipod Touch). Or you can use these as starting points and change them to your desired settings, which you can then save as a profile (e.g. I start with Ipod High-Rez, change the encoder to Xvid, then lower the bitrate to 1000 in to get a smaller output file).\nPerformance: is simply fantastic. Using single-pass settings, I have found Handbrake to be extremely fast compared to other DVD encoding software I have used, and to generate videos that are of very high quality. I used this program to convert more than a dozen DVDs and have not experienced any audio syncing issues whatsoever.\nThe user interface: is simple and very nicely laid out with different tabs that cover the various settings/decisions that you can make.\nTools and codecs: unlike some other programs which do DVD encoding (e.g. AutoGK), Handbrake is self contained and does not need or install a handful of third party apps. And even though this is a great thing, it also does not install any of the codecs that it needs to encode your video, which means that if they?re not already installed on your machine you will have to take care of that yourself. Here?s an example on how to do this: for my configuration I use Xvid and AAC as the video and audio codecs, respectively, and its possible to simply search Google for &quot;Xvid codec download&quot; and &quot;AAC codec download&quot;. Otherwise download and install CodecInstaller and it can find the installers for you.\nWidth/Height settings: what I like immensely is that Handbrake only requires a value for the Width setting and, if height is left blank it will encode your video automatically based on the aspect ratio in the original DVD source. This relieves you from having to calculate height values and guarantees that the output video will have the correct aspect ratio. Leaving the width/height settings blank will result in a video that is encoded as per the original width/height of the source.\nOutput size: you can input the max size in megabytes of the output file if you want, and Handbrake will use this info to calculate your video?s bitrate that will result in the correct size. Very cool.\nSelecting Featured content: Handbrake will allow you to select any of the featured content on a DVD for conversion. This can be done through a pull down menu (under &quot;Title&quot;), but the only way to identify these features seems to be through their length in minutes (e.g. the feature programme will be more than an hour in length, while the bonus materials will be 10-15 mins or so, and the trailer 2-3 mins, etc). For each feature it allows you to set the range of chapters to be encoded if available.\nBatch encoding: you can set up multiple conversions in a queue for batch encoding. Very useful when you are interested in the main feature on a DVD as well as the bonus materials.\nAudio demuxing: is not available as far as I can tell (Handbrake will not allow you to skip selecting a video codec). If you are interested in demuxing audio from a DVD source use Any Audio Converter.\nOther features: subtitling support, multiple audio tracks supported (I have not tested these features myself).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:e987c2f890eb9cdc9e89056055b6fab73e8001b1","amp;dn":"HandBrake+for+Windows+0.92","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e987c2f890eb9cdc9e89056055b6fab73e8001b1","infoHashBuffer":{"type":"Buffer","data":[233,135,194,248,144,235,156,220,158,137,5,96,85,182,250,183,62,128,1,177]},"announce":[],"urlList":[]}}