{"title":"Ska Daddyz [OXNARD, California]","uid":4022791,"size":100882329,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ec689e47ecdee1cc162f20f30118c2a9f485b6ea&amp;dn=Ska+Daddyz+%5BOXNARD%2C+California%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"@strospliff","files":30,"time":1202751459,"description":"1. SKA DADDYZ - RUDE BOYZ [Release date:2005-09-01]\n2. SKA DADDYZ on MP3.com back in the dayz\n\nSkalternative, a new blend of Ska, Funk, Reggae, and Punk presented with extreme energy, best describes the sound of the Ska Daddyz. It&amp;#039;s not de-caffeinated. Perfected since their origin in 1993, their style is often compared to Sublime. The Ska Daddyz features Darren Cruz (guitar), Jess Leedy (vocals and saxophones), Billy Davis (keyboards), Alan Lomax (trumpet), David Hayes (drums), Jarred Thompson (Tenor Saxophone), and Darren Reed (bass). The band has shared venues and opened for such acts as Big Bad Voodoo Daddy, the Specials, No Doubt, Save Ferris, Wakeling, and The Untouchables. The group has played over 1600 gigs since its start-up and has developed a repertoire of over 70 songs. Band members are experienced, tour-ready, studio professionals.\n\nRooted in Ventura County, California, and having cut their teeth in local clubs such as the Bombay, the popularity of the band is steadily growing from San Diego, through Los Angeles (Viper Room, The Whiskey, The Troubadour, and the Roxy) and Santa Barbara (Calypso, University of California at Santa Barbara, San Louis Obispo), and up to Monterey in Cannery Row. As a result, the Ska Daddyz has recently been appointed the House Band for 92.9 KJEE Montecito/Santa Barbara, and is featured on live radio and at special events, such as Conejo Valley Days, the Reggae Fest at the Santa Barbara Zoo, the Santa Barbara Jazz Festival, and the Strawberry Festival. The Ska Daddyz is also currently featured in surf movies produced by the renowned moviemaker Larry Haynes in Hawaii, and a deal has also just been announced teaming the band with Timmy Curran, the reigning California Surf champion, in his upcoming movie. One of their songs will also be used in an upcoming movie featuring Dan Aykroyd entitled On the Nose.\n\nA second CD was recently released featuring eleven original songs and their famous arrangement of Hotel California. The CD is available at Salzers in Ventura, Morning Glory Music in Santa Barbara and Isla Vista, as well as on this website ([b]http://www.skadaddyz.com[/b]). Six new, original songs have recently been developed; including two skate punk hits Beat the System and Bedroom Spy. Skadaddyz have been a huge success on MP3, and the association of the Skadaddyz with MP3 has proved to be a very successful relationship. As a local band having been on the verge of being signed by a major Hollywood record label, the group was shocked when a merger in the music industry shelved hundreds of deals. Undaunted, the Skadaddyz turned to the Internet and signed with MP3, the pioneering Internet music store.\n\nWithin one month the band became a featured artist, and within two months the hit Rude Boys topped the Alternative genre charts. It&amp;#039;s Up to you then took the number 1 position, and with Hotel California, these two songs have been in the top 10 for almost Two years. In the month of May 2000, all 12 songs on the second CD hit the top 40, and on-line plays surged above 1,000,000. Popularity of the band began to grow worldwide, and rave reviews have been received from Zimbabwe to Australia. No other unsigned MP3 band has demonstrated such popularity on the charts for so long a period of time. Offers received by email on the net have come in all forms. Recording labels have renewed interest, and opportunities for distribution and film are also appearing. One person in Germany begged the band to move to her hometown. The possibilities seem to be endless. Direct sales of the CD are also growing, with early interest showing in European countries like Sweden and the Netherlands, and in Asia and South America.\n\nMP3 has proven to be a good business partner. Advertising and international exposure are most important. In addition, statistics are compiled on a daily basis, and remote access of the stats for the band management is straightforward. Payment for downloads is prompt and dependable. The Skadaddyz is proving itself as a band with global appeal and as being capable of producing marketable, original music. As a result of the exposure and success on the Internet, the band has recently signed with Ubersee records for European territory .The Skadaddyz are preparing to go into the studio to do their 3rd album, which consist of fifteen songs, and will be going into negotiations with Caroline distributions in the United States.\n\n","torrent":{"xt":"urn:btih:ec689e47ecdee1cc162f20f30118c2a9f485b6ea","amp;dn":"Ska+Daddyz+%5BOXNARD%2C+California%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec689e47ecdee1cc162f20f30118c2a9f485b6ea","infoHashBuffer":{"type":"Buffer","data":[236,104,158,71,236,222,225,204,22,47,32,243,1,24,194,169,244,133,182,234]},"announce":[],"urlList":[]}}