{"title":"Face Off DVDRip AC3.avi","uid":4268437,"size":1336681280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ecb6cdb9cd7f984fdc630c03fd9afb7a1d70a86a&amp;dn=Face+Off+DVDRip+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeacoTard","files":1,"time":1214818171,"description":"Sean Archer is a government agent who for six years has been trying to apprehend terrorist, Caster Troy, who tried to kill him but ended up killing Archer\\&amp;#039;s son instead. When Archer corners Troy, Troy tells Archer that he has planted a bomb that will go off, unless he lets him go but Archer thinks that Troy is bluffing so a fight erupts that leaves Troy comatose. But later when they go through some of his brother, Pollux\\&amp;#039;s things, they discover that Troy was telling the truth. All what they need now is to find out where it is and the only person who knows is Pollux. And the only person that he will talk to about it, is his brother, Caster but unfortunately he is a vegetable. A government official then suggests to Archer that he assume Caster\\&amp;#039;s identity and ask Pollux about the bomb. So she brings him to a doctor who has perfected a method wherein the face of one individual is removed from him and placed on another. Archer agrees. The operation is a success so Archer as Troy goes to the prison where Pollux is being held and successfully gets him to tell him where the bomb is. Meanwhile, Troy who was believed to be comatose awakens and forces the doctor who operated on Archer to place Archer\\&amp;#039;s face on him. He then goes to the prison as Archer and taunts Archer by telling him that he has destroyed all documentation of the operation and eliminated everyone who knew about it. He then takes his brother out and leaves Archer in prison. But Archer somehow manages to escape and is now trying to find someone who will believe and help him, while Troy is plotting something.\n\nFirst time at this so if I get it wrong don\\&amp;#039;t moan, offer advice.","torrent":{"xt":"urn:btih:ecb6cdb9cd7f984fdc630c03fd9afb7a1d70a86a","amp;dn":"Face+Off+DVDRip+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecb6cdb9cd7f984fdc630c03fd9afb7a1d70a86a","infoHashBuffer":{"type":"Buffer","data":[236,182,205,185,205,127,152,79,220,99,12,3,253,154,251,122,29,112,168,106]},"announce":[],"urlList":[]}}