{"title":"Setup.381.34.7.exe","uid":4024959,"size":1031616395,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ed16469c4844f9893dfb2107681a8bd178bf6ecb&amp;dn=Setup.381.34.7.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Istaria","files":1,"time":1202862771,"description":"Developed by Virtrium, the MMORPG Horizons: Empire of Istaria immerses players in an online fantasy world of magic and mystery. Istaria is a land populated by monsters, magic, heroes, and colossal cities. Horizons is the only fantasy MMORPG to offer gamers the opportunity to play as a dragon, earning skills and abilities as they grow from a hatchling to adult.\n\nKey features of Horizons: Empire of Istaria include:\n\n    * 11 playable fantasy races: Dragons, Satyrs, Dryads, Humans and Elves populate the world and offer players distinct physical, mental and magical abilities\n    * An open character class system: Learn skills from 50 schools while not being limited to one class. Players can change their characters class as often as they like with no penalty.\n    * A real-time persistent world: Build and maintain structures, from simple houses to entire towns. Create businesses, process resources and develop economies within the game world by buying, selling and trading with other players.\n    * Family-friendly gameplay: With a focus on cooperative, PvP-free gameplay, Horizons offers families a perfect place to enjoy a fantastical adventure. A friendly online community of players is always available to help new and seasoned travelers as they explore Istaria.\n    * Virtually unlimited exploration potential: Soar through the skies as a flying creature, or dig deep into the earth when building a dragons lair. Istaria is a land without zones or predetermined player movement boundaries, thus allowing adventurers to explore the entire game world without limits.\n    * Drop in play: Rather than penalize players with limited time to enjoy a game session, Horizons offers the perfect setting for quick drop in adventures for those with as little as 15 minutes available for a game session. Solo-gamer friendly gameplay doesnt require players to join parties or form guilds.\n\nCreate your trial account here: &lt;a href=&quot; https://accounts.istaria.com/signup.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://accounts.istaria.com/signup.php&lt;/a&gt;","torrent":{"xt":"urn:btih:ed16469c4844f9893dfb2107681a8bd178bf6ecb","amp;dn":"Setup.381.34.7.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed16469c4844f9893dfb2107681a8bd178bf6ecb","infoHashBuffer":{"type":"Buffer","data":[237,22,70,156,72,68,249,137,61,251,33,7,104,26,139,209,120,191,110,203]},"announce":[],"urlList":[]}}