{"title":"Men in Trees S01E09 - Ein echter Kerl (German)","uid":4022157,"size":400394240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed251078a9bd478a998e558dddcc53785f3e5c8c&amp;dn=Men+in+Trees+S01E09+-+Ein+echter+Kerl+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gwodus","files":1,"time":1202721185,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nDie New Yorker Autorin Marin Frist fuehrt beruflich und privat ein Leben, wie frau es sich nur wuenschen kann. Sie ist eine Expertin in Sachen Beziehung, und ihre Ratgeberbuecher erklimmen muehelos die Bestsellerlisten. Doch sie gibt nicht nur Tipps in Sachen Liebe, sondern geht auch selbst mit gutem Beispiel voran: Mit ihrem Verlobten Graham McCarthy fuehrt sie eine erfuellte und glueckliche Beziehung.\n\nKurz vor der Hochzeit begibt sich Marin auf eine Lesereise nach Alaska, um ihr neuestes Werk zu promoten. Waehrend sie im Flieger noch ihren verliebten Gedanken an Graham nachhaengt, stellt sie fest, dass sie statt ihres eigenen aus Versehen Grahams Laptop mitgenommen hat. Als sie das Geraet einschaltet, trifft sie fast der Schlag: Graham hat nicht nur Fotos von ihr, sondern auch von ihrer Freundin Kiki archiviert - Fotos, auf denen Kiki gemeinsam mit Graham in eindeutiger Pose zu sehen ist. Voellig aus der Fassung greift Marin zum einzig probaten Mittel gegen Liebeskummer, das im Flugzeug zu bekommen ist: einem doppelten Whiskey.\n\nBeschwipst und mit den Nerven am Ende landet sie kurze Zeit spaeter in der Kleinstadt Elmo in Alaska, die auf die Grossstaedterin wie ein fremder Planet wirkt. In dem vertraeumten Nest scheinen fast nur Maenner zu leben - eine Spezies, auf die Marin momentan nicht gut zu sprechen ist. Schnellstens entscheidet sie sich, ihre miese Stimmung mit noch ein paar Whiskeys in der einzigen Bar des Ortes aufzuheitern. Vollends betrunken, haelt sie schliesslich mit eher maessigem Erfolg einen Vortrag ueber zwischenmenschliche Beziehungen vor einem ausschliesslich maennlichen Publikum - eigentlich nicht die Zielgruppe ihrer Ratgeberliteratur.\n\nAufgrund eines schrecklichen Katers verpasst sie am naechsten Morgen den Flug nach Chicago. Zu allem Uebel ist es schier unmoeglich, in Elmo Zigaretten aufzutreiben. Auf der Suche nach einem Automaten verlaeuft sich Marin schliesslich im Wald. Irgendwann - mittlerweile ist es finstere Nacht - betritt sie, ohne es zu bemerken, einen zugefrorenen See und bricht ins Eis ein. Gluecklicherweise ist Jack, ein Wildhueter aus Elmo, in der Naehe und kann sie aus dem Eiswasser fischen. Er teilt der halberfrorenen Marin mit, dass ihre einzige Ueberlebenschance darin besteht, sich nackt auszuziehen und an ihm zu waermen. Ploetzlich findet Marin es gar nicht mehr so kalt und ungemuetlich in Alaska...","torrent":{"xt":"urn:btih:ed251078a9bd478a998e558dddcc53785f3e5c8c","amp;dn":"Men+in+Trees+S01E09+-+Ein+echter+Kerl+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed251078a9bd478a998e558dddcc53785f3e5c8c","infoHashBuffer":{"type":"Buffer","data":[237,37,16,120,169,189,71,138,153,142,85,141,221,204,83,120,95,62,92,140]},"announce":[],"urlList":[]}}