{"title":"CJ7.Blu-ray.REMUX.1080P.H264.TrueHD.@SILUHD.COM","uid":4165367,"size":20156011584,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:ed5fd4650109428d065043da56921c40c8a20f65&amp;dn=CJ7.Blu-ray.REMUX.1080P.H264.TrueHD.%40SILUHD.COM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"accpt7506_siluer","files":11,"time":1209584065,"description":"Video:           AVC/MPEG-4\n\nAspect Ratio:    2.35 : 1\n\nAudio:           Mandarin TrueHD 5.1, Cantonese TrueHD 5.1 \n\nDirector:        Stephen Chow\n\nRuntime:         86 min \n\nCountry:         Hong Kong \n\n\nTransfer Format: 1080p\n\nimdb :           &lt;a href=&quot; http://www.imdb.com/title/tt0940709/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0940709/&lt;/a&gt;\n\nPlot:             \n\nStephen Chow is a single father with a boy, and he works hard as a construction worker to support him through private school. The boy, however, constantly bullied in school by the wealthy kids, is not an exceptional student. He tries to follow the values imparted by his father- that though they are poor, they do not lie, steal, or crave what isn&amp;#039;t theirs. He saves an enormous overweight girl from bullying one day, and earns her admiration and adoration, to his future usage. In the meantime, father and son pass time by entertaining themselves killing roaches in their improvished apartment. Mr. Chow, the father, can barely afford food on the table, let alone luxuries like shoes or electric fans, but one day his son (called Dicky in English) begged and cried for a CJ1, a toy that all his schoolmates have. Not being able to afford one, Mr. Chow goes to the dumpster to try to find something. He comes home with a rubbery ball and one day, the ball turned into a fuzzy cute dog-like space alien, which befriends Dicky. It seems that the alien dog, named CJ7, has powers of regeneration, such as being able to turn a rotten apple into a fresh one. Dicky takes his pet to school, and fantasizes that with its magical powers, he can score 100 on his exams, beat up bullies, and wow his gym teachers. But matters did not turn out to his expectation as the alien dog doesn&amp;#039;t seem to be able to do much. One day, Mr. Chow suffers from a construction site accident and dies. Dicky grieved painfully and was comforted by his pretty teacher who has tried to help him many times with his schooling. He prays that his father comes back. In an expected twist of plot, the alien dog regenerates Mr. Chow&amp;#039;s body, bringing him back from death. Dicky was beside himself with joy, but the alien dog then dies and leaves. In the end, the kids stopped bullying him as much though he his life remains very much the same, but one day, a space ship lands\n\n\n\n\nYou need a powerfull computer to play AVC codec HD\nRecommended: INTEL Core2 DUO or AMD X2 4800+ and ATI 2400 PRO\n\n\nFinalcodec Player \n\ndownload                                                                     &lt;a href=&quot;\nhttp://www.siluhd.com/soft/FinalCodecs2008sp.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.siluhd.com/soft/FinalCodecs2008sp.exe&lt;/a&gt;\n\n\n\nOther movies visit                                                                          \n\n               &lt;a href=&quot;\nhttp://thepiratebay.se/user/accpt7506_siluer&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/accpt7506_siluer&lt;/a&gt;\t\n","torrent":{"xt":"urn:btih:ed5fd4650109428d065043da56921c40c8a20f65","amp;dn":"CJ7.Blu-ray.REMUX.1080P.H264.TrueHD.%40SILUHD.COM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5fd4650109428d065043da56921c40c8a20f65","infoHashBuffer":{"type":"Buffer","data":[237,95,212,101,1,9,66,141,6,80,67,218,86,146,28,64,200,162,15,101]},"announce":[],"urlList":[]}}