{"title":"Half-Life 2 Retail-VENGEANCE","uid":3260391,"size":3060185102,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eda20295b49f911357c81e01e2e67e4b1891e32b&amp;dn=Half-Life+2+Retail-VENGEANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"reefer45","files":214,"time":1101684998,"description":"HL 2 Retail need i say more!? Guess i do. Retail is store version.\n\nInstall Notes: \n\n 1. Unpack the release with WinRAR or equivalent \n 2. Burn with Nero Burning ROM, CDRWin or equivalent. \n 3. Install the game. \n 4. Use our fully automated installer found in the /VENGEANCE/ directory \n     on CD5, hl2install.exe, to apply all necessary cracks and make the \n     needed shortcuts on your desktop. \n 5. Play by double clicking the &quot;Half-Life 2&quot; shortcut found on your \n     desktop. \n\n *NOTES* \n\n   At last a 100% functional and automated retail release of the most \n   anticipated sequel in PC games history. \n\n   As you have been struggling with the 101 fixes for the EMPORiO releases \n   of this fantastic game, we have been working diligently to bring you \n   this quality release which is deserved for a title of such magnitude. \n\n   Not only does this version work, it works FASTER, giving you a much \n   better gameplay experience.  Through a custom built Steam emulator, \n   Vengeance allows you to play Half-Life 2 the way it is meant to be \n   played. Files are directly streamed from the Valve Game Cache Files (GCF), \n   allowing any Source Engine game to be played identical to the official \n   Valve Steam Client.  This means that you don't need to run Steam to play. \n\n   You can expect much shorter loading times and much smoother gameplay, \n   without the need to tweak config files or to mess around with the AI Node \n   Graph Rebuilds. Oh and did we mention, you dont have to extract 30,000+ \n   fragmented files to play? \n\n   With patience and due time, we have recreated the installation CABs with \n   the decrypted GCF files (resulting in smaller CD sizes) and modified the \n   original installer to recognize the new CABs to allow for a fully \n   autmoated installation.  Combined with our hl2install to apply the cracks, \n   extract the minimal essential game files and create the necessary \n   shortcuts, Vengeance has finally brought to you a no-hassle, no-bullshit, \n   fully working and unprecedented release of Half-Life 2. \n\n *NOTE* \n \n   Online play has been disabled, so buy this excellent title if you want to \n   play online. Valve deserves it.","torrent":{"xt":"urn:btih:eda20295b49f911357c81e01e2e67e4b1891e32b","amp;dn":"Half-Life+2+Retail-VENGEANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda20295b49f911357c81e01e2e67e4b1891e32b","infoHashBuffer":{"type":"Buffer","data":[237,162,2,149,180,159,145,19,87,200,30,1,226,230,126,75,24,145,227,43]},"announce":[],"urlList":[]}}