{"title":"Visual Hb v1.30+serial","uid":4139011,"size":10744194,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:eda37a774fe589250c3922acadc4f1eae50a7805&amp;dn=Visual+Hb+v1.30%2Bserial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tdurden1000","files":3,"time":1208396062,"description":"Converting a bunch of AVI files to a DVD shouldn&amp;#039;t require a Computer Science degree.\nGetting movies from your digital camera to your iPod shouldn&amp;#039;t take hours.\nWading through a sea of video formats shouldn&amp;#039;t pull you under.\n\nVisualHub bridges the gap between numerous complicated video formatting standards, and people that just want to get the job done - just what you would expect from the Mac.\n\nIf you&amp;#039;re looking for something a little more flexible, VisualHub&amp;#039;s up for that challenge too. An extensive Advanced panel lets you change all pre-set aspects of encoding...and then some.\n\nBased on the popular, award-winning &quot;iSquint&quot; conversion software for iPods. If you&amp;#039;ve used iSquint, you already know how to use VisualHub. If you&amp;#039;ve never used iSquint, you won&amp;#039;t have a lot of catching up to do anyway.\n\nFeatures:\n\n* Fast conversion from nearly every video format to iPod, PSP, DV, DVD, Tivo, AVI, MP4, WMV, MPEG and Flash.\n* Convert any file in three steps. Click, drag, click.\n* Fit up to 18 hours of video on one DVD. Play it in any standalone DVD player.\n* Xgrid support. Use the power of every Mac on your network for batch encoding.\n* QuickTime Pro or special plugins not required.\n* DivX/XviD AVIs, all forms of MPEG video, and many other formats QuickTime struggles with are supported.\n* Batch Processing of multiple files. Save in-place, or to a different folder.\n* Very comprehensive Advanced panel to modify every aspect of encoding.\n* Dynamic Preview - See results before beginning a long encode.\n* Stitch multiple files together to combine videos.\n* Highly detailed, informative Users Guide.\n* Universal Binary for PowerPC and Intel Macs.","torrent":{"xt":"urn:btih:eda37a774fe589250c3922acadc4f1eae50a7805","amp;dn":"Visual+Hb+v1.30%2Bserial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda37a774fe589250c3922acadc4f1eae50a7805","infoHashBuffer":{"type":"Buffer","data":[237,163,122,119,79,229,137,37,12,57,34,172,173,196,241,234,229,10,120,5]},"announce":[],"urlList":[]}}