{"title":"Einstein","uid":4057029,"size":589125605,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:edc63e513ca8dd7ae238ef5b4ae7085cb8ae79d7&amp;dn=Einstein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rh128592","files":311,"time":1204416055,"description":"Einstein: His Life and Universe [Audiobook]\nBy: Walter Isaacson\n\nBOOK: http://www.amazon.com/Einstein-Life-Universe-Walter-Isaacson/dp/0743264738\n\nAUDIOBOOK: http://www.amazon.com/Einstein-Life-Universe-Walter-Isaacson/dp/0743264738\n\nMP3, Mono, 96kbps VBR\n\n18 Discs\n\nREVIEWS\nFrom Publishers Weekly\nAcclaimed biographer Isaacson examines the remarkable life of &quot;science&amp;#039;s preeminent poster boy&quot; in this lucid account (after 2003&amp;#039;s Benjamin Franklin and 1992&amp;#039;s Kissinger). Contrary to popular myth, the German-Jewish schoolboy Albert Einstein not only excelled in math, he mastered calculus before he was 15. Young Albert&amp;#039;s dislike for rote learning, however, led him to compare his teachers to &quot;drill sergeants.&quot; That antipathy was symptomatic of Einstein&amp;#039;s love of individual and intellectual freedom, beliefs the author revisits as he relates his subject&amp;#039;s life and work in the context of world and political events that shaped both, from WWI and II and their aftermath through the Cold War. Isaacson presents Einstein&amp;#039;s research?his efforts to understand space and time, resulting in four extraordinary papers in 1905 that introduced the world to special relativity, and his later work on unified field theory?without equations and for the general reader. Isaacson focuses more on Einstein the man: charismatic and passionate, often careless about personal affairs; outspoken and unapologetic about his belief that no one should have to give up personal freedoms to support a state. Fifty years after his death, Isaacson reminds us why Einstein (1879?1955) remains one of the most celebrated figures of the 20th century. 500,000 firsr printing, 20-city author tour, first serial to Time; confirmed appearance on Good Morning America. (Apr.) \n\nAmazon.com\nAs a scientist, Albert Einstein is undoubtedly the most epic among 20th-century thinkers. Albert Einstein as a man, however, has been a much harder portrait to paint, and what we know of him as a husband, father, and friend is fragmentary at best. With Einstein: His Life and Universe, Walter Isaacson (author of the bestselling biographies Benjamin Franklin and Kissinger) brings Einstein&amp;#039;s experience of life, love, and intellectual discovery into brilliant focus. The book is the first biography to tackle Einstein&amp;#039;s enormous volume of personal correspondence that heretofore had been sealed from the public, and it&amp;#039;s hard to imagine another book that could do such a richly textured and complicated life as Einstein&amp;#039;s the same thoughtful justice. Isaacson is a master of the form and this latest opus is at once arresting and wonderfully revelatory. --Anne Bartholomew\n\nEnjoy,\n\nMook &amp; Bee\n\nPS: If you wondering &quot;WTF?  Why didn&amp;#039;t they archive these files?&quot; the reason is twofold.  #1- They won&amp;#039;t compress much. #2- Maybe you just want to check out the first CD to see if you like it or not.  Like it or not, there is logic behind the decision.","torrent":{"xt":"urn:btih:edc63e513ca8dd7ae238ef5b4ae7085cb8ae79d7","amp;dn":"Einstein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc63e513ca8dd7ae238ef5b4ae7085cb8ae79d7","infoHashBuffer":{"type":"Buffer","data":[237,198,62,81,60,168,221,122,226,56,239,91,74,231,8,92,184,174,121,215]},"announce":[],"urlList":[]}}