{"title":"Big City Adventure San Francisco [h33t][oi812heet]","uid":4053433,"size":26424869,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eddeaab3fa71fa41c43369f97e6bc40b79071ed0&amp;dn=Big+City+Adventure+San+Francisco+%5Bh33t%5D%5Boi812heet%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"killkenny101","files":3,"time":1204259199,"description":" \nBig City Adventure: San Francisco \n\n I?ve always wanted to go to San Francisco on vacation, but it hasn?t worked out. So Big City Adventure: San Francisco is as close as I can to visit this city full of rich history and fascinating sites. This hidden object game shares all kinds of facts about the city and 20 of its spots. The game contains 60 levels, so you visit the same spot a few times and pick up a new fact each time you visit. You discover your new destination by completing a mini-game and then do the hunt for hidden objects at the destination. This one nicely ties the hidden object scene and mini-games with the game?s San Francisco theme. Be warned? it starts easy, but it will get harder! Avoid any temptation to feel cocky early on like I did. The ultimate feature in this one that should be a standard in all hidden object games: Letting you know when you click something and it turns out to be nothing. Many of the games don?t always ?hear? your click and you don?t want to click again for fear you?ll lose points. Not a problem with Big City Adventure SF. The game shows an icon when you click an object that doesn?t appear on the list of things you need to find. I?m currently playing another hidden object game and too many times something I clicked earlier turn out to be one of the objects on the list.\n\nWhile the interface and graphics turned out well, I didn?t like the how the characters looked. I think it was their pose or something that didn?t win me over. When you start the game, you pick one of the characters. That character?s face appears throughout the game.\n\nIt?s no surprise the advertising for the game says it?s the first of the Big City Adventure series. I assume future versions will take place in large cities around the U.S. and perhaps, the world. Wanna bet New York, L.A., London and Paris are on the list? I look forward to the future releases. \n","torrent":{"xt":"urn:btih:eddeaab3fa71fa41c43369f97e6bc40b79071ed0","amp;dn":"Big+City+Adventure+San+Francisco+%5Bh33t%5D%5Boi812heet%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eddeaab3fa71fa41c43369f97e6bc40b79071ed0","infoHashBuffer":{"type":"Buffer","data":[237,222,170,179,250,113,250,65,196,51,105,249,126,107,196,11,121,7,30,208]},"announce":[],"urlList":[]}}