{"title":"Dio.Evil or Divine.DVDRip.XviD","uid":4044402,"size":1381248142,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ee03d94dee2422e93b830c2a7c61e6e874142bda&amp;dn=Dio.Evil+or+Divine.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"135791113","files":7,"time":1203836727,"description":"1. Killing The Dragon\n2. Egypt/Children of the Sea\n3. Push\n4. Drum Solo\n5. Stand Up and Shout\n6. Rock and Roll\n7. Don&amp;#039;t Talk to Strangers\n8. Man on the Silver Mountain\n9. Guitar Solo\n10. Long Love Rock and Roll\n11. Lord of the Last Day\n12. Fever Dream\n13. Holy Diver\n14. Heaven and Hell\n15. The Last in Line\n16. Rainbow in the Dark\n17. We Rock\n\nHis work with Rainbow, Black Sabbath, and as a solo artist with his band Dio, has made Ronnie James Dio one of heavy metal&amp;#039;s most recognizable and beloved voices. For 30 years, Dio has been enchanting audiences with his unique brand of mystical metal.\n\nCaptured on video is a 2002 performance at NYC&amp;#039;s Roseland Ballroom. Dio&amp;#039;s voice sounds as good as ever. For a man over 60, he truly looks to be in remarkable physical condition, prancing about onstage in black bellbottoms, displaying his trademark hand gestures. In support of Killing the Dragon, the band includes bass player Jimmy Bain, guitarist Doug Aldrich, keyboard player Scott Warren and drummer Simon Wright.\n\nThe presentation of the performance is straightforward and without many technical frills. Absent are multi screen views and excessive cuts. Views of the stage are mostly unobstructed, though the picture quality may not be the greatest at times. For sound, you can choose between stereo, Dolby 5.1 and DTS.\n\nThe set list includes songs that span the length of Dio&amp;#039;s distinguished career. Though favoring his early solo works, there is a bit of Rainbow, with a dash of Sabbath. The newer songs Push, Rock and Roll and Killing the Dragon fit in well with classics like Stand Up and Shout, Don&amp;#039;t Talk to Strangers and Holy Diver. Guitarist Doug Aldrich certainly deserves high praise. Playing with flair and swagger, he takes on the daunting task of incorporating the licks and tricks of players like Tommy Iommi, Ritchie Blackmore, Craig Goldy and Vivian Campbell into his own style. Sandwiched in between the Rainbow classics, Man on the Silver Mountain, and Long Live Rock and Roll is Aldrich&amp;#039;s diverse near nine minute guitar solo. Restricted to mostly playing the music of others, this is the guitarist&amp;#039;s opportunity to really cut loose. Aldrich also shines during a smoldering performance of Heaven and Hell, that is remarkably close to Sabbath&amp;#039;s original.\n\nThe arrangement of the show does have some rough spots. Just three songs into the show, a Simon Wright drum solo seems inappropriate. Despite a solid effort by Aldrich, the combo number Egypt/Children of the Sea doesn&amp;#039;t quite mesh. And some of the newer songs just aren&amp;#039;t in the same class as Dio&amp;#039;s earlier material. The plodding Lord of the Last Day drags things down to a crawl, and Fever Dreams raises the energy only slightly. These are however minor matters, as there can be no complaints about the band&amp;#039;s classic encore numbers, The Last in Line, Rainbow in the Dark, and a rousing version of We Rock.\n\nThere are some interesting bonus materials. In a too brief interview, the articulate Dio covers some fascinating subject matter. A more extended interview with one of metal&amp;#039;s bona fide icons would have been truly enlightening. A short video entitled Behind the Scenes, features events involving the band and crew, shot by Wendy Dio, wife of &quot;Ronald&quot;. A photo gallery displays shots of the band and crew with their families and the fans. Last is the very creative and cool video for Push, that features an appearance by School of Rock&amp;#039;s, Jack Black. This energetic production shows that there is, believe it or not, a &quot;fun&quot; side to Ronnie Dio.\n\nEvil or Divine captures the essence of a Dio performance, and is recommended without reservations to fans of heavy metal. Ronnie James Dio is an icon, and a true master at his craft, and shows no signs of slowing down. Guitarist Aldrich has since left the group, as has long time bass player Jimmy Bain, so this concert also serves as a record of this particular lineup of the band.","torrent":{"xt":"urn:btih:ee03d94dee2422e93b830c2a7c61e6e874142bda","amp;dn":"Dio.Evil+or+Divine.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee03d94dee2422e93b830c2a7c61e6e874142bda","infoHashBuffer":{"type":"Buffer","data":[238,3,217,77,238,36,34,233,59,131,12,42,124,97,230,232,116,20,43,218]},"announce":[],"urlList":[]}}