{"title":"Yamakasi 2 - I figli del vento","uid":4161832,"size":735670272,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ee7ad866a0f829e7ba51c0ead0f078e19bc097f9&amp;dn=Yamakasi+2+-+I+figli+del+vento&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1209411580,"description":"\nA Mortal Fighter. An Eternal Combat.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0345235/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0345235/&lt;/a&gt;\n\nAwesome Parkour displays in a so-so movie, 15 January 2007\n\nAuthor: HaemovoreRex from United Kingdom \n\nTeam Yamakazi get to display their amazing Free Running skills again in this their second feature film. Once again like the previous movie, the acrobatic abilities of these seemingly fearless individuals is guaranteed to leave ones mouth agape at the sheer spectacle on display here ? this truly is an awesome art form and one which proves to be a perfect bedfellow for the action movie genre.\n\nAdded to the crazy physical shenanigans we are also treated to some highly stylish visuals throughout especially courtesy of the stunning scenery in Thailand and a number of instances of highly imaginative and impressive visual effects such as in one scene wherein our main protagonists are seen traversing continents in one fluid take. Great stuff!\n\nUnfortunately however, despite the above glowing accolades, beneath all the surface gloss, it has to be said that when all is said and done the film in question has very little actual substance within.\n\nOne of the main problems here lay in the fact that there are simply too many sub stories running throughout. Each of our main characters has their own separate &amp;#039;adventures&amp;#039; in addition to the encompassing plot. Personal voyages of self discovery, the blossoming of love, loneliness, personal ambition and home sickness all feature here which in a much longer film might have sat more easily. However at a mere 90 or so minutes the actual effect is one of disjointedness and one that in addition actually serves to detract from the main plot. Certainly there were those who criticised the first film for the same principle, but it was not nearly as pronounced there as it is here.\n\nOn the other hand, perhaps it is redundant to judge the film on such principles. After all, as an action movie this delivers some absolutely incredible set pieces; Indeed for pure kinetic enjoyment only the works of the likes of Jackie Chan or Tony Jaa etc are going to provide the same sort of adrenaline fix.\n\nIn the final analysis then I feel that it is best to judge this film on it&amp;#039;s merits as opposed to its flaws and with this in mind I would certainly recommend it highly to fans of crazy stunts, martial arts and general urban mayhem.\n\nOverall: An entirely respectable 7 out of 10 (Just don&amp;#039;t go trying the stunts at home!)","torrent":{"xt":"urn:btih:ee7ad866a0f829e7ba51c0ead0f078e19bc097f9","amp;dn":"Yamakasi+2+-+I+figli+del+vento","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7ad866a0f829e7ba51c0ead0f078e19bc097f9","infoHashBuffer":{"type":"Buffer","data":[238,122,216,102,160,248,41,231,186,81,192,234,208,240,120,225,155,192,151,249]},"announce":[],"urlList":[]}}