{"title":"Unreported World -Brazil: The Amazon's Golden Curse 2008 04 1","uid":4133764,"size":182855680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:efd69a29eea0b655c1fdcf70b5ce0e083d34b11d&amp;dn=Unreported+World+-Brazil%3A+The+Amazon%5C%27s+Golden+Curse+2008+04+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shunster07","files":1,"time":1208169588,"description":"Unreported World -Brazil: The Amazon&amp;#039;s Golden Curse 2008 04 11 (Ch 4)\n\n(No registration) \n &lt;a href=&quot;\nhttp://www.channel4.com/news/articles/ontv/unreported_world/brazil+the+amazons+golden+curse/1996547&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/news/articles/ontv/unreported_world/brazil+the+amazons+golden+curse/1996547&lt;/a&gt;\n\n174 mgs\n24.14 mins\n\n\nUnreported World travels to the heart of the Brazilian Amazon rainforest to reveal just how some of the Earth&amp;#039;s most isolated people are being affected by the world&amp;#039;s financial crisis causing the price of gold to rise to record levels.\n\nUnreported World travels to the heart of the Brazilian Amazon rainforest to reveal just how some of the Earth&amp;#039;s most isolated people are being affected by the world&amp;#039;s financial crisis causing the price of gold to rise to record levels.\n\nAs the price of gold rises, thousands of miners are illegally mining in remote territory set aside for the indigenous Yanomami people, who have had little contact with the outside world. The miners bring disease, alcoholism and prostitution, as well as ecological devastation. Reporter Jenny Kleeman and director Paul Kittel ask whether this gold rush could mean the Yanomami tribe die out completely.\n\nKleeman and Kittel begin their journey in Boa Vista, still a thriving Amazon gold town, despite the ban on mining in the Yanomami Reserve since 1992 outlawed all gold mining in the region. But they quickly learn that the gold trade is alive and well here. Kleeman meets a miner who is currently working illegally in Yanomami territory. He says he can earn up to ten times the average monthly wage, and he has no other way support himself financially.\n\nThe team accompanies the Brazilian Airforce on a mission into the Amazon in search of illegal mines. Flying just above the treetops, the crew spot a perilous landing strip cut into the jungle by wildcat miners. The Colonel promises to report the landing strip to the Federal Police.\n\nAfter an arduous trek through the jungle, they arrive in a remote Yanomami village where a third of the villagers recently contracted malaria. Miners had diverted the course of a nearby river, leaving it stagnant and attracting mosquitoes that caused the outbreak. If medical treatment had not arrived in time, the outbreak could have spread across the region and turned into an epidemic. edit\n \nRetrack-shunster\n","torrent":{"xt":"urn:btih:efd69a29eea0b655c1fdcf70b5ce0e083d34b11d","amp;dn":"Unreported+World+-Brazil%3A+The+Amazon%5C%27s+Golden+Curse+2008+04+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efd69a29eea0b655c1fdcf70b5ce0e083d34b11d","infoHashBuffer":{"type":"Buffer","data":[239,214,154,41,238,160,182,85,193,253,207,112,181,206,14,8,61,52,177,29]},"announce":[],"urlList":[]}}