{"title":"RKS Software Products Pack (The Joker)","uid":4061526,"size":72792023,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f0ce87dfee27ce9ca3b378e19023c1b41c11fa13&amp;dn=RKS+Software+Products+Pack+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jokeri1971","files":17,"time":1204631894,"description":"I -- N -- C -- L -- U -- D -- D -- E\n\nVisual Labels v3.31\nVisual Business Cards v4.16\nSymbol Selector v2.24\nCalendar Builder v3.6\nThings To Do v2.8d\nTray Calendar v2.8g\nItsPersonal! v2.9m\nItsTime! v2.8e\nJust The Fax v2.9z\nMightyFax v3.41\nPage &amp;#039;O Labels for File Folders v2.9\nPage &amp;#039;O Labels for Mailing Labels v2.9\nPersonal Mailing List v1.5\nRKS Fax v1.23\n\n\n\n\nRKS Fax\nNew! Fax software to send and receive faxes on Windows Vista and XP.\n\nMighty Fax\nFax software to send and receive faxes right from your PC! For Windows XP Home or Professional.\n\nVisual Business Cards\nBusiness card software for creating your own great looking Business Cards. \n\nCalendar Builder\nCalendar software for printing beautiful custom calendars. \n\nVisual Labels\nLabel software for designing and printing on AveryÃ‚Â® labels. \n\nPersonal Mailing List\nMailing list software - Keep your own mailing list and print labels and reports.\n\nJust The Fax\nAn entirely self-contained fax program to send and receive faxes.\n\nThings To Do\nThings To Do is created to meet all your task-management needs.\n\nSymbol Selector\nSymbol Selector allows you use your Symbol, Wingding, and all the other TrueType fonts on your computer in completely new ways. Use fonts in new sizes, in color, bold, or italic. Copy individual symbols and characters to the Windows Clipboard in Rich Text Format (RTF) or Windows Metafile (WMF) format. Save individual symbols and characters as graphic image files in Windows Metafile (WMF) format, or Windows Bitmap (BMP) format. Paste copied and saved symbols and characters into MS Word and other Windows applications. Print any font set installed on your computer.\n\nTray Calendar\nTray Calendar will help you to keep notes by day of the month in your system tray.\n\nItsPersonal!\nItsPersonal is a journal for Windows users. It features an attractive, intuitive interface; an unlimited number of days for entries; the ability to print any or all pages; search and replace capabilities; and a spell checker.\n\nItsTime!\nItsTime is an easy to use alarm and reminder. Never miss another appointment. It&amp;#039;s Time offers you a pop-up reminder for Windows and features unlimited entries, repeat reminders, sound capabilities, and snooze buttons. It&amp;#039;s Time puts a reminder on the screen at the appointed time. The program can also play a pleasant sound with a reminder, or record your own voice to help get you going.\n\nPage Of Labels for Mailing Labels\nEasy to use mailing label software. Ideal for small mailing lists. Create one or more pages of mailing labels. Print all labels or individual labels. Works with all standard mailing labels, including Avery labels.\n\nPage O Labels for File Folders\nPage O&amp;#039; Labels for File Folders allows you to create, save and print a single page of file folder labels. You can print individual labels or all of the labels on a page. The program works with most standard file folder labels, including Avery labels.\n\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:f0ce87dfee27ce9ca3b378e19023c1b41c11fa13","amp;dn":"RKS+Software+Products+Pack+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ce87dfee27ce9ca3b378e19023c1b41c11fa13","infoHashBuffer":{"type":"Buffer","data":[240,206,135,223,238,39,206,156,163,179,120,225,144,35,193,180,28,17,250,19]},"announce":[],"urlList":[]}}