{"title":"The Pretender (Christian Movie)","uid":4272825,"size":734137349,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1567f9a89d9788adcb40e081421baf08c64b54f&amp;dn=The+Pretender+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IndianChristian","files":3,"time":1215028535,"description":"The Pretender (Christian Movie)\n\nA Christiano Brothers Film. \n\nHow does a worldly high school guy start dating an unsuspecting Christian girl? He becomes...the pretender. \n\nTHE PRETENDER is the story of a worldly high school guy who pretends to be a Christian so he can start dating an unsuspecting Christian girl.\n\nStory: In order to go out with Dana, Keith sets in motion a scheme thats worked for him in the past. Danas a Christian, Keith is not, but he pretends to be one so he can start dating her. His only intention -- to take advantage of her. THE PRETENDER shows how easy it is for anyone to fake being a Christian. As Keith states, Its not tough being a Christian, all you gotta do is learn a few Bible verses and stay out of trouble. Will Keiths scheme work again???\n\nThis film gives key principles for dating and shows how guys manipulate girls to get what they want. Christian girls should be extremely careful. But through the character of another person Frank, we see true committment to Christ, the importance of discipleship and a determination to witness.\n\nColor Approx running time 39 minutes.\n\nMy Verdict: True Story, Great Storyline, but poor Execution. Overall this movie could have been better, but was poorly executed. \n\nLanguage: English\nSubtitles: None\nYear of Release: 1986\nMy Rating: 8/10\nExecution: 5/10\nQuality: 6/10\n\nIf financially possible, please buy the CD/DVD to keep Christian films in business ......\n\nPlease seed for as long as possible. Let others also come to know that there is Salvation only in the name of Jesus Christ.\n\nUploaded by IndianChristian","torrent":{"xt":"urn:btih:f1567f9a89d9788adcb40e081421baf08c64b54f","amp;dn":"The+Pretender+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1567f9a89d9788adcb40e081421baf08c64b54f","infoHashBuffer":{"type":"Buffer","data":[241,86,127,154,137,217,120,138,220,180,14,8,20,33,186,240,140,100,181,79]},"announce":[],"urlList":[]}}