{"title":"A Nightmare On Sesame Street","uid":3346915,"size":48563,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f23dda481e8270c358c382c5ea0b23bd23d3c3dc&amp;dn=A+Nightmare+On+Sesame+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bluewizard666","files":1,"time":1119319607,"description":"Several pigeons roost on the window ledge of a small apartment in a big brick building on a very familiar street. Further observation reveals a yellow skinned man with pointy black hair, leaning out of said window, feeding the pigeons. He loved his pigeons. In fact he loved them more than anything in the world.\n\n&quot;Hey Bert, would you mind leaving your pigeons alone for a few minutes and help with the dishes? Huh, Bert?&quot; \n\n&quot;Can't you see I'm busy, Ernie?&quot; he shouts back in reply. \n\n&quot;But Bert, we have to do the dishes. It is good to keep your home neat and tidy. You know that Bert. Now leave those dirty pigeons alone and help me clean up.&quot; \n\n&quot;Dirty?&quot; he thought to himself &quot;Dirty? I'll show him whose dirty. I'm so fucking tired of him always bossing me around telling me to clean this and clean that. How dare he take me away from my pigeons.&quot; Bert then said, &quot;Ok, Ernie, you are right. I'll help you with the dishes. You wash, I'll dry.&quot;\n\nBert then joined his loving roommate and best friend by the sink to help with the dishes. After they were through, Ernie spoke: \n\n&quot;Ok Bert. Thank you for your help. Now, you clean up the rest of the apartment, while I take a bath.&quot; \n\n&quot;Ok Ernie, but let me run the bath water for you, ok? I feel bad about not helping out earlier&quot; Bert replied. \n\n&quot;Thank you, Bert, but that is unnecessary.&quot; \n\n&quot;No, no Ernie, old pal. I insist. You just gather your things from your room and when you come out, the bath will be ready for you.&quot; \n\nErnie replied, &quot;Oh thank you, Bert. You are such a good friend.&quot;\n\nErnie then headed off to the room to prepare for his bath. Bert then entered the bathroom. A few minutes later, Ernie appeared from his room and headed toward the bathroom. \n\n&quot;Bert? Bert? Have you seen my rubber ducky? You know I can't take a shower without my... AAAAaaaacCcCKK!!!!&quot;\n\nErnie's piercing shriek could be heard throughout the neighborhood. As he entered the bathroom, he found Bert with a butcher knife in his hand, stabbing Ernie's rubber ducky.\n\n\nA NIGHTMARE ON SESAME STREET... BERT GOES BAD!","torrent":{"xt":"urn:btih:f23dda481e8270c358c382c5ea0b23bd23d3c3dc","amp;dn":"A+Nightmare+On+Sesame+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23dda481e8270c358c382c5ea0b23bd23d3c3dc","infoHashBuffer":{"type":"Buffer","data":[242,61,218,72,30,130,112,195,88,195,130,197,234,11,35,189,35,211,195,220]},"announce":[],"urlList":[]}}