{"title":"XMEN Legends USA XBOX KTM","uid":3241479,"size":2439428196,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:f4e23ad1c0e148abc734215f77455e0302e258f8&amp;dn=XMEN+Legends+USA+XBOX+KTM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ktm","files":52,"time":1096036453,"description":"&lt;HTML&gt;\n&lt;p&gt;X-Men Legends&lt;p/&gt;\n\n&lt;img src=&quot;http://www.discshop.se/LIVE/shop/img/omslag/front_large/39693.jpg&quot; height=&quot;380&quot; width=&quot;280&quot; border=&quot;0&quot;&gt;\n \n&lt;p&gt;Beskrivning:\n\nX-MenTM:iLegendsTM features favorite charactersifrom the powerhouse MarvelTMifranchise in an immersiveiaction RPG. The storyibegins when the X-Menilearn that Magneto, theirigreatest adversary, has devisedia plan to giveimutants the power toireign supreme over humans.iThe X-Men are theniforced to battle Magnetoito prevent global chaosiand stop their foesifrom imprisoning the humanirace. In order toisave the world fromicertain destruction, players mustibuild the perfect X-Meniteam by recruiting newimembers and deciding howibest to upgrade theiripowers and abilities. Playersiwill need to chooseithe best combination ofiheroes to tackle eachiunique obstacle as theyiface a threat thaticould destroy all ofimankind.\n\n\n\nCustomizable Squad ? Gamersican pick their favoriteiX-Men character and upgradeieach character's attributes toicreate their perfect team.iRecruiting from 15 differentiheroes including Wolverine, Cyclops,iStorm and Jean Grey,iplayers gain experience, upgradeitheir team, characters andiunlock new abilities toiaid in the quest.i\n\n\nInteract With Favorite Charactersi? Fans control theiriX-Men characters (either individuallyior as a team)iby training and directingithem through an excitingiseries of missions. Playersicommand their team anditake on such enemiesias the Brotherhood ofiMutants, Sentinels and aniunknown enemy from theifuture. \n\n\nMultiple Gameplay Modesi? X-Men: Legends featuresia multi-branching, mission-based storylineithat allows for abundantireplay value. Players caniplay solo or cooperativelyiwith up to threeifriends as they battleievil mutants. Dynamic joiningiallows new players toibecome part of theiadventure at any timeiduring the game. \n&lt;p/&gt;\n&lt;HTML/&gt;\n","torrent":{"xt":"urn:btih:f4e23ad1c0e148abc734215f77455e0302e258f8","amp;dn":"XMEN+Legends+USA+XBOX+KTM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4e23ad1c0e148abc734215f77455e0302e258f8","infoHashBuffer":{"type":"Buffer","data":[244,226,58,209,192,225,72,171,199,52,33,95,119,69,94,3,2,226,88,248]},"announce":[],"urlList":[]}}