{"title":"FS2004-FSX - Lionheart Creations - Bellanca Super Viking V 4.1","uid":4144152,"size":97569170,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f505d32e299be70d3bba0afeaaf2139b1a2b95ec&amp;dn=FS2004-FSX+-+Lionheart+Creations+-+Bellanca+Super+Viking+V+4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Papazoff","files":1,"time":1208641128,"description":" &lt;a href=&quot;http://www.lionheartcreations.com/Viking&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.lionheartcreations.com/Viking&lt;/a&gt;\n\nThe newest updated version (V4.1) updated on April 10th 2008\n\nThis package is now available for\nFSX.  The installer will load onto\nboth FS2004 and FSX as well.\n\nThis is the famous American &amp;#039;Corvette&amp;#039; of General Aviation in the USA, the\nBellanca Super Viking.  Equipped in both regular fuel asperation, and in\nturbocharged, this aircraft could cruise at 200 MPH at 75% throttle.  The\nwings were of a wood composite construction that could take amazing\namounts of forces and featured a very smooth, rivetless, panel-less surface\n that helped the aircraft to achieve its high speeds.\n\nThese models come in 11 different liveries and feature 4 different\ninstrument panels and a multitude of various interior textures and feature\nnew soft lighting technologies for night flying.  \n\nThis package also features a custom sound file, optional &amp;#039;lady&amp;#039; pilot, custom\nhigh resolution 3D instrumentation of that era, high detail Gmax modelling,\nand some fun, good handling airfiles that give you that &amp;#039;sports car&amp;#039; feel.\n\nThis is now Build 4.0, featuring pure 100% FSX model enhancements by\nRobert Kerr.  All textures on the FSX model package are in DDS format for\nDirectX 10.  The newest build also features enhanced instrumentation\ndetails and modifications and improvements to controls in the VC.  This\npackage is for both (both) FSX &amp;#039;and&amp;#039; FS2004.  Both versions are in the same\ninstaller.\n\n\nThe Bellanca Super Viking by Lionheart Creations Ltd. comes with a full complement of \nfeatures that include;\n\n*  Two different airfile platforms, Super Viking and Turbo Viking\n*  New high resolution VC graphics with four high detail instrument panels\n*  2 Versions of Avionics stacks, Bendix and classic King variants\n*  High detail Virtual Cockpit that features fully animated controls and functioning switches\n*  Aircraft totally designed from both factory drawings and from owners of the Viking aircraft\n*  Precision airfile for true to life aircraft handling characteristics\n*  Model created in Gmax for fluid like surfaces and elaborate animation tracking\n*  Eleven different exterior paint schemes based off factory designs and existing Vikings\n*  All different interiors based both off of factory designs and real Vikings\n*  Opening passenger door and opening cargo door\n*  Tie down mode with realistic aircraft cover designed from the real thing\n*  Illuminated Instrumentation and exclusive &amp;#039;Soft Glow&amp;#039; interior\n*  Exclusive Dome Light control that isnt associated with Nav Lights command.\n*  All buttons and levers in the VC are animated including maps, manual, door handle, vents.\n*  250 MPH cruise (175 knots) @ 75% throttle with subtle landings with full flaps at 65 knots.\n*  Optional female pilot also available in the selections list\n\n\n****************************************\nEnjoy and keep seeding after downloading\n****************************************","torrent":{"xt":"urn:btih:f505d32e299be70d3bba0afeaaf2139b1a2b95ec","amp;dn":"FS2004-FSX+-+Lionheart+Creations+-+Bellanca+Super+Viking+V+4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f505d32e299be70d3bba0afeaaf2139b1a2b95ec","infoHashBuffer":{"type":"Buffer","data":[245,5,211,46,41,155,231,13,59,186,10,254,170,242,19,155,26,43,149,236]},"announce":[],"urlList":[]}}