{"title":"Slave To Love (1993)","uid":4052385,"size":1405231114,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f542263cc89cd35dbecc963147b76eec8b3272e5&amp;dn=Slave+To+Love+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kevkingO7","files":5,"time":1204222082,"description":"Slave To Love\n\nCover &amp; screens: &lt;a href=&quot;\nhttp://illux.blogbugs.org/2173199/Slave-To-Love.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://illux.blogbugs.org/2173199/Slave-To-Love.html&lt;/a&gt;\n\n\nDescription:\nEnter the darkness of the night. Sierra blossoms in the role of an innocent, whose world is transformed by the dark desires of an older, more experienced lover. Follow her on her journey to the depth of desire, the limits of sanity, and the pinnacle of pleasure. She will never be the same... neither will you. \n\n\nFemale cast:\nAngel Ash [LezOnly]\nBeatrice Valle [Facial IR]\nBrittany O&amp;#039;Connell [Anal IR]\nCash [LezOnly]\nDevan [LezOnly]\nJalynn [Anal Bald]\nKitty Yung\nSierra [Anal Facial IR]\n\nScene 1. Randy Spears, Sierra\nScene 2. Peter North, Sierra, Sean Michaels\nScene 3. Angel Ash, Cash, Devan\nScene 4. Beatrice Valle, Sean Michaels\nScene 5. Jalynn, Kitty Yung, Randy Spears\nScene 6. Brittany O&amp;#039;Connell, Randy Spears\nScene 7. Brittany O&amp;#039;Connell, Sean Michaels\nScene 8. Kitty Yung, Peter North\nScene 9. Beatrice Valle, Randy Spears\nScene 10. Jalynn, Sierra, TT Boy\nScene 11. Jamie Gillis, Sierra\n\nReview:\n &quot;Slave to Love&quot; is a 1993 feature from director Alex De Renzy. I enjoyed many of De Renzy&amp;#039;s efforts over the years, and while this one may not be in his Top Ten, it&amp;#039;s a fairly strong effort.\n\nThe story revolves around Sierra. While Sierra was never one of porn&amp;#039;s raving beauties, there were few girls as hot as she was with a dick in any orifice.\n\nShe and her co-worker in a beauty salon, Brittany O&amp;#039;Connell, are lounging on a blanket in a field one day when Randy Spears trots up on horseback. Within minutes, Spears convinces Sierra to take a ride with him, a ride that, we hear, will lead her into a &quot;life of decadence.&quot;\n\nSierra is soon in Spears&amp;#039; house being bathed by his assistant, Beatrice Valle. They do a short girl-girl in the tub before joining Spear in bed. While Beatrice watches, Spears and Sierra have an enthusiastic fuck before Spears shoots into Beatrice&amp;#039;s waiting mouth. She does a nice clean-off. Sierra is now under Spears&amp;#039; Svengali-like sexual spell.\n\nNext stop for the new couple is Spears&amp;#039; exclusive men&amp;#039;s club. All the men are in tuxes, but Peter North and Sean Michaels quickly shed their duds for a chance to romp with Sierra. Again, Sierra is volcanic and she commands her guys to &quot;fuck harder.&quot; Peter shoots a load on her gut and Sean delivers a sperm pizza to her open mouth. Meanwhile, the first of several orgies has broken out around them. Marc Wallice gets a hummer from a blonde ending in a tit cumshot.\n\nSierra grows confused by her newfound sexuality. So she does what any young woman would do - she goes to confession. The priest listening in from the other side of the screen is Jamie Gillis. Make that, listening intently. With his hands hidden from view. Get the idea?\n\nBeatrice and Sierra go to a strip club where Sierra is coaxed onto the stage to perform with a blonde in a cowboy hat. Beatrice starts sucking off Sean in the audience and, poof, we&amp;#039;ve got ourselves another orgy. Randy West, complete with a curly, long blond doo, is there, and so is Wallice. Spears jerks off in the audience while Sierra rides a chrome bar to orgasm.\n\nBack at Spears club, Sierra joins four other girls in a raucous lezout. One blonde leaves the action long enough to service Spears, who&amp;#039;s been watching. Another couple joins in. We&amp;#039;ve got bodies flying everywhere now. Spears shoots onto Asian cutie Kitty Yung&amp;#039;s back to end the fuckfest.\n\nSierra goes back to confession, and Father Jamie is all ears again. He wants to hear every single detail of her exploits, the perv!\n\nBack at the salon, Spears entices Brittany to not only join the club, but to do him right there in the barber chair. He even gets to fuck her ass before shooting on her stomach. She obliges by licking cum off her fingertips.\n\nNow that Brittany is in the fraternity, she and Sierra go the club in style, masturbating together in Spears&amp;#039; limo. Once at the club, the sex starts up quickly. Peter and Kitty pair up, as do Brittany and Sean and about a zillion other horny people. T.T. Boy makes an appearance and starts screwing a blond. But Sierra offers him her ass, so he switches. Smart man! The sex is fast and furious, but you need a scorecard to keep track of the players. Suffice to say a few girls get it in the rear and there are cumshots galore.\n\nIt&amp;#039;s time for Sierra to go back to confession. But this time she turns the table on Fr. Jamie and gets to confess his lust for her. Soon she&amp;#039;s in his confessional, on her knees, not exactly praying. She fingers and slaps her own pussy as she gnaws on Jamie&amp;#039;s crank. He christens her mug with his holy water.\n\nSomehow, Sierra interpreted this last scene as a message from God to quit her evil ways and leave Spears. End of story.\n\nIf you like your sex with multiple bodies, this is your ticket. If the whole Catholic priest thing doesn&amp;#039;t deflate you, there is a lot of heat in this one. A few anals, a few facials, and a decent-looking cast. Throw in Sierra riding off into the sunset after servicing a half dozen guys, and you&amp;#039;ve got a decent stroke film. \n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:f542263cc89cd35dbecc963147b76eec8b3272e5","amp;dn":"Slave+To+Love+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f542263cc89cd35dbecc963147b76eec8b3272e5","infoHashBuffer":{"type":"Buffer","data":[245,66,38,60,200,156,211,93,190,204,150,49,71,183,110,236,139,50,114,229]},"announce":[],"urlList":[]}}