{"title":"Larry Norman - Straight Up","uid":4165386,"size":385685846,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f54bcbc9adb2f3c74329619a0ed5c31ab3bfec3e&amp;dn=Larry+Norman+-+Straight+Up&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1209584999,"description":"Hi there..\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nAnyway: I felt a sudden urge to put together and upload a selection of songs by Larry Norman.\nThen I discovered that this kind-hearted and radical Christian had left this planet.\nHis official website says:\n\n&quot;Dear friends and fans. Larry passed away on Feb. 24th after a long battle with heart related problems.&quot;\n\nSongs included in this torrent have been selected by me, and does not appear like this on any official &quot;Best Of&quot; album. These are just samples from some of his many albums, but I hope you'll like what I've chosen. (And the name of the compilation.. :-) I also included some video clips that I hope you will like.\n\nSomebody once named him &quot;The godfather of Christian rock&quot;. But Larry wasn't about rock. He was all about doing His Master's will and reaching as many as possible with the true gospel of Jesus of Nazareth before it was too late.\nEven Bob Dylan is said to have become a Christian at least partially as a result of Larry's ministry. In Larry's words: &quot;He (Bob Dylan) became a Christian out of the Church that grew out from my Bible Study. He came to Bible Study every morning and studied and then began writing songs about two months after he became a Christian.&quot; ( Source: Shaker Music Magazine, New Zealand - 1982)\n\nBefore listening to the music I suggest you watch the video &quot;Larry Norman Shares His Heart&quot;. Respect.. \nOriginally the clip was in two parts, but I joined them. (Thanks to &quot;TheCannyShark&quot;)\n\nHe was a true warrior of Love. I truly think that he retired with honor, and was spared of the last tribulations that will soon shake this earth.\nHope you'll see me in heaven, Larry.. :-)\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;2e584b5c4748475c4b434f47426e49434f4742004d4143&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:f54bcbc9adb2f3c74329619a0ed5c31ab3bfec3e","amp;dn":"Larry+Norman+-+Straight+Up","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f54bcbc9adb2f3c74329619a0ed5c31ab3bfec3e","infoHashBuffer":{"type":"Buffer","data":[245,75,203,201,173,178,243,199,67,41,97,154,14,213,195,26,179,191,236,62]},"announce":[],"urlList":[]}}