{"title":"SILVER CITY","uid":4031040,"size":4505634861,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f565fc0540dd877264f8e5e7ee6f0cd4f891294b&amp;dn=SILVER+CITY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"suku","files":23,"time":1203176363,"description":"Add content advisory for parents\nRuntime:\n128 min\nCountry:\nUSA\nLanguage:\nEnglish / Spanish \n\nI liked this movie. I&amp;#039;m a John Sayles fan. I hope he can get some money together to make another movie, because he sure didn&amp;#039;t make much on this one. I thought Maria Bello was the best actor in this film (as the reporter, Nora). I thought Thora Birch was very good too, in her small role. Chris Cooper did as good as he could with his role as the dim-witted governor-to-be; the trouble is, his character was a little too dim-witted. No politician is quite this dim-witted - even one representing the extreme right wing. So Sayles missed the boat a bit by making the right wing a little too stupid, although George Bush isn&amp;#039;t that far removed from Chris Cooper&amp;#039;s Dickie Pilager. And I suppose this movie is a direct attack by Sayles on the Bush administration. Also, it is an explanation of why Bush has been so successful, despite being such a jerk. For it is an explanation of why the left is in it&amp;#039;s current state of disarray.Like Danny (Danny Huston), the reporter turned investigator, the left is losing the battle, and despite nothing but good intentions, only loses his job as a result. He uncovers an environmental disaster, but no one that really matters could care less. Silver City (the epitome of the American dream) will still be built, Dickie Pilager will still be elected governor, and the right wing will still persist, despite it&amp;#039;s rotting underbelly. At least Danny gets a bit of a reward in the end - he get&amp;#039;s the girl who agrees with his leftist principles, so the left will at least collect itself to fight another day. And I&amp;#039;m sorry if this gives much of the plot, but all of us who have been blindsided lately by the sanctimonious, holier-than-thou right wingers already are only too aware of this ending.","torrent":{"xt":"urn:btih:f565fc0540dd877264f8e5e7ee6f0cd4f891294b","amp;dn":"SILVER+CITY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f565fc0540dd877264f8e5e7ee6f0cd4f891294b","infoHashBuffer":{"type":"Buffer","data":[245,101,252,5,64,221,135,114,100,248,229,231,238,111,12,212,248,145,41,75]},"announce":[],"urlList":[]}}