{"title":"The Sky's Not Falling-Why It's OK To Chill About Global Wa","uid":4053152,"size":23979816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f68a5e8f7877076da9f67695a2c797559e06ee5a&amp;dn=The+Sky%5C%27s+Not+Falling-Why+It%5C%27s+OK+To+Chill+About+Global+Wa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xofokim","files":71,"time":1204244110,"description":"Double-Page Scans JPG. \n\nBook Description\n\n&quot;The Sky&amp;#039;s Not Falling: Why It&amp;#039;s OK To Chill About Global Warming&quot; is for parents sick of seeing their kids indoctrinated by has-been politicians and Hollywood stars. Unlike books written by would-be celebrities without any scientific or economics background, &quot;The Sky&amp;#039;s Not Falling&quot; is everything a book about the environment written for kids should be: fact-filled, apolitical, fun and optimistic about the future of our magnificent, ever-changing planet.\n\nIn &quot;The Sky&amp;#039;s Not Falling,&quot; author Holly Fretwell, a natural resources management expert, shows kids ages 8 and up that human ingenuity combined with an &quot;enviropreneurial&quot; spirit will lead us to a bright environmental future, not one where people ruin the earth.\n\nParents confronted by Photoshopped pictures of drowning animals and faux &quot;documentaries&quot; will embrace a book that educates rather than manipulates. Holly Fretwell brings real credentials to the debate, giving kids the scoop not just about global warming, but the real-world consequences of the Left&amp;#039;s responses to it.\n\nFrom the Publisher\n\n&quot;I&amp;#039;m scared that every time I ride in the car, I&amp;#039;m hurting polar bears and other animals.&quot;\n\n&quot;I&amp;#039;m worried that people just like me cause global warming.&quot;\n\n&quot;I&amp;#039;m afraid that my favorite outdoor places might disappear.&quot;\n\nYou&amp;#039;ve heard the claims that the earth is warming up because of cars, light bulbs, factories and the many other wonders that human ingenuity has created. But is it really true?\n\nWell, here&amp;#039;s news for the global warming Chicken Littles - the sky&amp;#039;s NOT falling!\n\nSure, our planet is changing, but it has before and will again. There&amp;#039;s lots more to the climate change story than you may have heard! Can we really adapt to a changing world in ways that help animals and the environment while keeping people working and countries growing strong? Of course we can!\n\nYes, it&amp;#039;s OK to chill about global warming. Look inside &quot;The Sky&amp;#039;s NOT Falling&quot; and find out why.","torrent":{"xt":"urn:btih:f68a5e8f7877076da9f67695a2c797559e06ee5a","amp;dn":"The+Sky%5C%27s+Not+Falling-Why+It%5C%27s+OK+To+Chill+About+Global+Wa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f68a5e8f7877076da9f67695a2c797559e06ee5a","infoHashBuffer":{"type":"Buffer","data":[246,138,94,143,120,119,7,109,169,246,118,149,162,199,151,85,158,6,238,90]},"announce":[],"urlList":[]}}