{"title":"Get Used To It","uid":4052553,"size":79573277,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6da884c9ceeee4c0276fb46944fc6d6d5c85bf2&amp;dn=Get+Used+To+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ongaswie","files":12,"time":1204226781,"description":"Get Used To It - The Return of BNH-vocalist N&amp;#039;Dea Davenport!\n\nReview from AllMusic.com:\nThe most surprising thing about Get Used to It is that the Brand New Heavies sound very much like an honest to gosh band instead of the instrumental unit with a hired frontwoman they always have been. Out of the BNH crew for a decade, vocalist N&amp;#039;Dea Davenport returns and it&amp;#039;s both familiar and just like starting over. Young upstart hunger drips out of the opening &quot;We&amp;#039;ve Got,&quot; a slinky slice of funk that introduces what&amp;#039;s going to be a mature album with more punch than ever. There are the usual horns and &quot;music turns me on&quot; type lyrics plus Davenport&amp;#039;s just perfect voice, but Get Used to It resists wandering into the musical theatrics this skillful group could be accused of overindulging in the past. While the glorious &quot;Music&quot; flirts with electronic dance music and the cool &quot;Don&amp;#039;t Know Why (I Love You)&quot; lays some unneeded strings onto its soulful groove, the majority of the album is stripped-down and wonderfully tight. The songwriting is right there, too, with Davenport delivering a handful of empowering or poignant songs that temper drummer and other main lyricist Jan Kincaid&amp;#039;s cool acid jazz anthems. As the organic and easy rolling &quot;I&amp;#039;ve Been Touched&quot; delicately comes apart and fades, it&amp;#039;s hard to recall a time this band have delivered an album so well constructed start to finish. They&amp;#039;ve traded fireworks for fire here, and no one who loves gutsy, vintage grooves should be caught without a copy.\n\nBrand New Heavies - Get Used To It - 2006\n12 tracks to enjoy :)","torrent":{"xt":"urn:btih:f6da884c9ceeee4c0276fb46944fc6d6d5c85bf2","amp;dn":"Get+Used+To+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6da884c9ceeee4c0276fb46944fc6d6d5c85bf2","infoHashBuffer":{"type":"Buffer","data":[246,218,136,76,156,238,238,76,2,118,251,70,148,79,198,214,213,200,91,242]},"announce":[],"urlList":[]}}