{"title":"Run BASIC Personal Server 1.0","uid":4103330,"size":10976292,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f6fe9ac6b7e68c8c3bc4fbef15fbd53311e0cf8b&amp;dn=Run+BASIC+Personal+Server+1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"melvin2001","files":1,"time":1206677830,"description":"Run BASIC in a Nutshell\nRun BASIC is high technology that makes web programming easy!\n\nWeb programming is much too hard. Shouldn&amp;#039;t this stuff be getting easier? Isn&amp;#039;t that the definition of technological advancement, that things over time should be getting better, simpler and more enjoyable? Run BASIC does things in a very different way from other systems so that anyone can do it.\n\nRun BASIC is not just a little easier, but a lot easier than other web programming systems. When we started testing Run BASIC, our testers told us that Run BASIC was not what they expected. It is much easier than other systems they had tried.\n\nHere are some of Run BASIC&amp;#039;s important built-in features:\n\n    * All In One System - This means that you don&amp;#039;t need to install or buy anything else to create and serve up web applications. Everything is there including a web server, a programming language, a database, and more and there&amp;#039;s no complicated configuration or special technical expertise required unlike other web programming systems!\n    * Easy BASIC language - A modern structured version of BASIC with web awareness built right in. Most web programming languages are loaded up with lots of esoteric web commands but Run BASIC is designed to be really clean and simple. Run BASIC does the hard work for you and hides the complexity of web programming.\n    * Multiuser - You can develop multiuser web applications. Run BASIC takes care of the session management for you automatically.\n    * Built in graphics - It&amp;#039;s easy to draw graphics and include them in your web applications.\n    * Database - The popular SQLite database system is built-into Run BASIC so you can create SQL database apps out of the box.\n    * HTTPGET and XML - You can fetch XML documents from all over the web and read them using the built-in XML parser.\n    * Click and deploy - Once you&amp;#039;ve created your web app, you can deploy it on your local network or on the Internet with the click of a button.\n    * Community - Run BASIC has an energetic community of users online.\n","torrent":{"xt":"urn:btih:f6fe9ac6b7e68c8c3bc4fbef15fbd53311e0cf8b","amp;dn":"Run+BASIC+Personal+Server+1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6fe9ac6b7e68c8c3bc4fbef15fbd53311e0cf8b","infoHashBuffer":{"type":"Buffer","data":[246,254,154,198,183,230,140,140,59,196,251,239,21,251,213,51,17,224,207,139]},"announce":[],"urlList":[]}}