{"title":"Eternals - Gaiman &amp; Romita  (Catseye2001) [h33t]","uid":4033763,"size":142311348,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f7090c4a766eab58a4a1ff4d1c46b0524f4086e6&amp;dn=Eternals+-+Gaiman+%26+Romita++%28Catseye2001%29+%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Catseye2001","files":11,"time":1203295768,"description":"The Eternal miniseries by Neil Gaiman and John Romita Jr.  Cleverly tagged as issues 1-5 of 6 and issues 6-7 of 7.  Also included is the Eternals sketchbook and 2 variant covers.\n\n[IMG]http://i257.photobucket.com/albums/hh201/Catseye2001/Eternals.jpg[/IMG]\n\nSnipped from Wikipedia:\nRecently, the Eternals have begun reappearing on Earth in Neil Gaiman&amp;#039;s new take on the immortal beings. Most seem to have no memory of their own history and abilities except Ikaris, and no records of their previous appearances remain. The cause of this has been ascertained to the Eternal known as Sprite. Angered at having to remain an eleven year old and unable to grow any further, he managed to induce collective amnesia on the Eternals as well as distort their perceptions of history (this can possibly be seen as Gaiman&amp;#039;s attempt to retcon the characters; early stories portrayed most of the current generation of Eternals -- such as Ikaris and Thena -- as being &quot;only&quot; several tens of thousands of years old but Gaiman&amp;#039;s run describes them as being closer to a million years old).\n\nA group of deviants manage to kidnap Makkari, using him to awaken the Dreaming Celestial (the Celestial responsible for creating the Deviants, the act of which caused him to be punished by the rest of the Celestials to imprisonment inside Earth). Upon awakening, he decides to judge humanity. The Eternals, realizing that they cannot stop him, leave him be. The Eternals then embark on a quest to go and recruit the other members who have similarly forgotten their true selves due to Sprite&amp;#039;s trickery.\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:f7090c4a766eab58a4a1ff4d1c46b0524f4086e6","amp;dn":"Eternals+-+Gaiman+%26+Romita++%28Catseye2001%29+%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7090c4a766eab58a4a1ff4d1c46b0524f4086e6","infoHashBuffer":{"type":"Buffer","data":[247,9,12,74,118,110,171,88,164,161,255,77,28,70,176,82,79,64,134,230]},"announce":[],"urlList":[]}}