{"title":"No substitute for victory (documentary)","uid":4145463,"size":3538753536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f7dfc209d91487caf3fbd45483d9db322dd54505&amp;dn=No+substitute+for+victory+%28documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"plasmaview","files":20,"time":1208709541,"description":"==This is a DVD rip.  The following text is from Amazon\\&amp;#039;s writeup on the VHS version===\n\n#  Actors: William C. Westmoreland, John Wayne, Sam Yorty, Mark W. Clark, Lowell Thomas\n# Directors: William C. Westmoreland, Robert F. Slatzer\n# Format: Black &amp; White, Color, Full length, Full Screen, NTSC\n# Rating:\n# Number of tapes: 1\n# Studio: Tapeworm\n# VHS Release Date: January 1, 1999\n# Run Time: 70 minutes\n# Average Customer Review:\n \n7 Reviews\n5 star: \t42% \t (3)\n4 star: \t28% \t (2)\n3 star: \t14% \t (1)\n2 star: \t  \t (0)\n1 star: \t14% \t (1)\n\nSee all 7 customer reviews...\n3.9 out of 5 stars 7 customer reviews (7 customer reviews)\n# ASIN: B00000JPGC\n\n\nThis video is a fascinating time capsule, with The DUKE front and center.\n\nA slanted, hard-right view of where we stood in Vietnam in 1970, and what should be done to win, this film is more heavily in favor of all-out war than a flock of hawks.\n\nDUKE hosts a strange look at the history of Communism as the film seeks to explain why we were in Vietnam, why we were not winning, and why we should continue the war at all costs, in this failed attempt to turn public opinion.\n\nThe film itself is an odd mixture of stiff, 50s-60s style documentaries, far-right flag-waving propaganda, while similar in visual style and pacing to 1970\\&amp;#039;s pseudo-science documentaries like \\&quot;The Amazing World of Psychic Phenomena\\&quot; or \\&quot;The Jupiter Menace\\&quot;. Also interesting to note are the old \\&quot;noose-style\\&quot; microphones on DUKE and the interviewees, which further dates the film.\n\nThe 70 minute film is full of many interesting (although highly biased), interviews, including cameos by newsman Lowell Thomas, USO personality Martha Raye, and famous singing soldier Barry Sadler (of \\&quot;Ballad of the Green Berets\\&quot; fame).\n\nAn attempt at a documentary-style polictical pursuasion film, the propaganda value in \\&quot;No Substitute for Victory\\&quot; is pretty high. The film manages to raise the spectre of the 1950\\&amp;#039;s Red Scare quite effectively for 1970. I would imagine many of the older folks who watched this at the time were in complete agreement with DUKE and the other interviewees after they saw this.\n\nMost telling is that, other than the two or three who were in the military, there are no young people interviewed. The majority of the \\&quot;cast\\&quot; depicted are well over forty (some peaceniks in full hippie regalia are shown, however). This makes the film a great subject for study in Political Science, History, or Communication courses, not only because it is so heavy-handed in propaganda, but because the film unintentionally highlights the great divide that existed between the gererations of the day.\n\nOn the other hand, some of the hard-right fears were realized. Politicians did interfere in our ability to wage the Vietnam War. There was an almost constant waste of the lives of American soldiers and demoralization of the troops because of it. Simply leaving Vietnam did not bring an instant peace, and once the U.S. pulled out, there were massacres throughout the region. Our prestige on the world stage did suffer, and the feeling of defeat did permeate America for years.\n\nHowever the film, for all its documentation of facts (real or imagined), comes off as rather naive in the idea that we could have won simply by dropping more bombs. DUKE was known as a hawk on the Vietnam war, and like most hawks probably did not understand why this war was different in nature than World War 2. His frustration over the events of the day is evident throughout the course of the film.\n\nStill, the film is pretty honest, at least from the perspective of the far right. While pushing for an expansion of the war effort, the film honestly portrays the reasons why the hawks felt we should do so, and what we had done wrong in waging the conflict up to that point. Given the prestige of some of the commanders and soldiers interviewed, this comes off as more than Monday-morning quarterbacking, even when viewed through the lens of thirty-plus years of history.\n\nThe quality of the transfer is not too bad, but not as crisp as it could be, hence my four-star instead of five-star rating. It was transferred in SP, so the production people get points for that.\n\nAn intersting product of the time in which it was made, \\&quot;No Substitute For Victory\\&quot; is a relatively inexpensive historical text of political sentiments in 1970. It should not be missed by anyone interested in the era or the Vietnam War. ","torrent":{"xt":"urn:btih:f7dfc209d91487caf3fbd45483d9db322dd54505","amp;dn":"No+substitute+for+victory+%28documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7dfc209d91487caf3fbd45483d9db322dd54505","infoHashBuffer":{"type":"Buffer","data":[247,223,194,9,217,20,135,202,243,251,212,84,131,217,219,50,45,213,69,5]},"announce":[],"urlList":[]}}