{"title":"Dragon Ball Z: El Super Guerrero Son Goku","uid":4134280,"size":384888832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8858583ab163a5509195e5e9c73c88a741fca24&amp;dn=Dragon+Ball+Z%3A+El+Super+Guerrero+Son+Goku&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cazomdb","files":1,"time":1208190801,"description":"Brief, el doctor de la Capsule Corporation y padre de Bulma, aquella chica inteligente, descubre que un asteroide podrÃƒÂ­a colisionar con la Tierra. Goku y Krilyn utilizan olas de energÃƒÂ­a, aunque no consiguen cambiar su trayectoria. Finalmente resulta ser una nave, la de Slug, que decide cubrir toda la Tierra de nubes. Evidentemente, el planeta queda como un cubito de hielo congelado. Los secuaces de Slug amenazaan a todos los habitantes del planeta. Slug parece ser un namekiano mÃƒÂ¡s. Por ello lee el pensamiento de Bulma y descubre la leyenda de las bolas mÃƒÂ¡gicas. Observa la bola de cuatro estrellas del sombrero de Gohan.\nFinalmente, Slug logra la juventud eterna, deseo que una vez fue concedido a Piccolo Daimaoh. Vista la situaciÃƒÂ³n, Goku consigue eliminar a Angira, Medamecha. Sin embargo, ni casi en estado de saiyan (porque todavÃƒÂ­a no lo ha alcanzado plenamente) consigue acabar con Slug, que decide aumentar varias veces el tamaÃƒÂ±o de su cuerpo.\nA Piccolo se le ocurre una maravillosa idea. Dado que el oÃƒÂ­do de los nameks puede alcanzar a oir sonidos lejanos, se arranca las orejas y pide a Gohan que silbe alguna canciÃƒÂ³n. Slug se ve debilitado y Piccolo cede su energÃƒÂ­a a Goku, que atraviesa a Slug sin problemas. Un genkidama final arreglarÃƒÂ¡ la situaciÃƒÂ³n. La paz vuelve a la Tierra y Piccolo regenera sus orejas.","torrent":{"xt":"urn:btih:f8858583ab163a5509195e5e9c73c88a741fca24","amp;dn":"Dragon+Ball+Z%3A+El+Super+Guerrero+Son+Goku","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8858583ab163a5509195e5e9c73c88a741fca24","infoHashBuffer":{"type":"Buffer","data":[248,133,133,131,171,22,58,85,9,25,94,94,156,115,200,138,116,31,202,36]},"announce":[],"urlList":[]}}