{"title":"unreported.world.russia.railway.of.bones.avi","uid":4055406,"size":182609920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f889854eb12d438e7bd3711a70c30671dd9d0795&amp;dn=unreported.world.russia.railway.of.bones.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fuctndabrain","files":1,"time":1204344706,"description":"As President Vladimir Putin prepares to hand Russia&amp;#039;s presidency to his chosen successor, Unreported World travels deep into the country&amp;#039;s Arctic North to examine his legacy. Reporter Sam Kiley and director Nick Sturdee discover a nation where political dissent is stifled, corruption is rife, and where little of Russia&amp;#039;s huge wealth reaches a population racked by poverty, alcoholism and suicide.\n\nKiley and Sturdee begin their journey in Syktyvkar, capital of the Komi Republic and 1000 miles north of Moscow. It&amp;#039;s election day for the Russian Parliament and the team has been tipped off that political parties are handing out money to buy votes. Kiley meets student activists who claim they have been offered 400 rubles to vote for President Putin&amp;#039;s United Russia Party. In dramatic scenes which support claims that polls in some electoral areas were rigged, the team films a student negotiating her payment from her United Russia contact and others queuing to sell their votes as well.\n\nThe Unreported World team boards a train to take the &quot;Railway of Bones&quot; built by Stalin&amp;#039;s Gulag prisoners northwards to Usinsk, the region&amp;#039;s oil capital. Russia now earns more than Â£75 billion a year from oil exports, but little seems to be reaching the people here. Many of the workers who built the town are housed in barracks and one of them tells Kiley that it would take nine years, without eating or paying any bills, to save enough money to buy a one-room apartment in the town they built. In this small one-industry town two oil companies own the newspapers. The leader of the opposition Other Russia movement says that oppression is in the air, and that parties not sanctioned by the Kremlin struggle.\n\nAs the team travels further north they find once wealthy logging towns like Ust Tsilma in the grip of an alcoholism pandemic. In a nation which Putin has supposedly reignited the wealth and pride of the Soviet era, Kiley meets Igor, a youth worker in the town of Izhma. He says he knows ten children and 20 adults who have killed themselves in the town, which he says has long been abandoned to its fate.\n\nAt the end of the railway is the city of Vorkuta, which was originally a Gulag labour camp. Today its residents are free but, apparently, only if they keep their mouths firmly shut. Liudmila Zhorovlia, a community activist who campaigned against local authorities over price rises in rents and services did not. Her husband Ivan shows Kiley where his wife and 19-year-old son Konstantin were slaughtered in their own home minutes after he left for work. Their killers took nothing he says, but he claims, they did erase files detailing Liudmilla&amp;#039;s campaign from her computer. He says the investigation has been closed for lack of evidence.\n\nBack in Syktyvkar, Kiley interviews Yuri Bolobonov, United Russia&amp;#039;s deputy leader for the Komi Republic. He is dismissive of the complaints of a growing one-party state in Russia and the rigging of elections, which he blames on rival parties trying to make United Russia look bad. He says Russia is a huge country and it needs a big powerful party. As the team leaves, Kiley concludes that it&amp;#039;s clear a one-party Russia might be good for business, and good for politicians, but it seems that very few ordinary citizens he&amp;#039;s encountered think it is good for Russians themselves.\n &lt;a href=&quot;\nhttp://www.channel4.com/news/articles/ontv/unreported_world/russia+railway+of+bones/1682347&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.channel4.com/news/articles/ontv/unreported_world/russia+railway+of+bones/1682347&lt;/a&gt;","torrent":{"xt":"urn:btih:f889854eb12d438e7bd3711a70c30671dd9d0795","amp;dn":"unreported.world.russia.railway.of.bones.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f889854eb12d438e7bd3711a70c30671dd9d0795","infoHashBuffer":{"type":"Buffer","data":[248,137,133,78,177,45,67,142,123,211,113,26,112,195,6,113,221,157,7,149]},"announce":[],"urlList":[]}}