{"title":"Evil Dead Redux Complete Trilogy in one EPIC FILM! DISK 2","uid":4157120,"size":6279862023,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f8e221b06a3954ba8719f806199f2cb310f7b361&amp;dn=Evil+Dead+Redux+Complete+Trilogy+in+one+EPIC+FILM%21+DISK+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"exit-reality","files":4,"time":1209200618,"description":"Split over two disk (DVD 9 Dual Layer) all three ?Evil Dead? films have been re-edited into one 4hr film. The lame re-shot back-story introductions have been completely excised from EV2 and Army of Darkness. The end of Evil Dead now seamlessly merges with EV2 and EV2 seamlessly merges with Army of Darkness.\n\nDisk One contains ?The Evil Dead? edited seamlessly with ?The Evil Dead II.? Gone is the re-shot back-story that has Ash coming to the cabin with one girl rather than a group of friends. The continuity is restored here. The only issue that could not be resolved with editing is that Ash finds the destroyed bridge in Part 1 &amp; 2 and there?s no way to remove it with the footage on the DVD. The image is uncompressed from the original DVD source, presented in 1.85:1 with DD 5.1 surround, English only, no subtitles or commentary tracks. A full, animated menu is provided as well as chapters. This will require a DVD-9 (DVD+R DL) to burn. I?ve chosen a simple ISO file, easily mountable to any virtual DVD drive as well. Disk one contains all of ?Evil Dead? and about 60 minutes of ?Evil Dead II.? \n\nDisk Two contains the conclusion of ?The Evil Dead II? up to the moment when Ash gets sucked into the vortex. The film is then edited together with ?Army of Darkness? (theatrical cut) for the scene when ash falls from the sky on until Ash obtains the ?Book of the Dead.? After escaping from the skeletons raising from the ground the films becomes ?Army of Darkness: The Directors Cut? for the extended battle sequence to the original (alternate) ending. After the movie goes to black screen, but before the credits, the ?Theatrical Cut Ending? plays.\n\nUse Alcohol 120% or Nero to burn .iso images to DVD 9 Dual Layer media. Two Disk required.\n","torrent":{"xt":"urn:btih:f8e221b06a3954ba8719f806199f2cb310f7b361","amp;dn":"Evil+Dead+Redux+Complete+Trilogy+in+one+EPIC+FILM%21+DISK+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e221b06a3954ba8719f806199f2cb310f7b361","infoHashBuffer":{"type":"Buffer","data":[248,226,33,176,106,57,84,186,135,25,248,6,25,159,44,179,16,247,179,97]},"announce":[],"urlList":[]}}