{"title":"The.Elder.Scrolls.IV.Oblivion-RELOADED","uid":4279312,"size":4491247616,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f9ff6c640a8591a0d2f0ddeefe102b19a3a6277c&amp;dn=The.Elder.Scrolls.IV.Oblivion-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"currylurva","files":1,"time":1215338611,"description":"The.Elder.Scrolls.IV.Oblivion-RELOADED\n\nAfter the mysterious and untimely death of the Emperor, desperate factions\nvie for control of Tamriel&amp;#039;s throne. With the empire ready to crumble, the\ngates of Oblivion open and demons march upon the land, laying waste to\neverything in their path. To turn the tide of darkness the player must find\nthe lost heir to the throne and unravel the sinister plot that threatens to\ndestroy all of Tamriel.\n\nFeatures:\n~~~~~~~~~\n* Return of the Elder Scrolls. The sequel to the best-selling,\nrole-playing game, The Elder Scrolls III: Morrowind.\n* Live Another Life in Another World Gamers can create and play any\ncharacter they can imagine, from the noble warrior to the sinister\nassassin to the wizened sorcerer.\n* Next Generation Graphics Pixel-shader effects and high definition\ntelevisions are fully supported to create unprecedented visuals,\nincluding lifelike towns, dungeons and the most realistic forests ever\ncreated in a game.\n* First Person Melee and Magic An all-new combat and magic system brings\nfirst person role-playing to a new level of intensity where you feel\nevery blow.\n* Radiant A Groundbreaking AI system gives Oblivion&amp;#039;s characters full 24/7\nschedules and the ability to make their own choices based on the world\naround them. Non-player characters eat, sleep and complete goals all on\ntheir own.\n* Realistic Characters Features over 1,000 non-player characters who come\nto life like never before with facial animations, lip-synching and full\nspeech. They even engage in unscripted conversations with each other.\n* Open-Ended Game Play; Short Challenges The enormous world of Oblivion is\nopen, allowing players to explore at their own pace. Players will\nencounter shorter challenges such as fighting bandits, mixing potions,\nand creating magic along the way to unraveling the main quest.\n\n\n\n1. Extract Iso\n2. Burn or mount with Daemon Tools.\n3. Install the game.\n4. Play the game.","torrent":{"xt":"urn:btih:f9ff6c640a8591a0d2f0ddeefe102b19a3a6277c","amp;dn":"The.Elder.Scrolls.IV.Oblivion-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ff6c640a8591a0d2f0ddeefe102b19a3a6277c","infoHashBuffer":{"type":"Buffer","data":[249,255,108,100,10,133,145,160,210,240,221,238,254,16,43,25,163,166,39,124]},"announce":[],"urlList":[]}}