{"title":"Sommer Sport Pack","uid":4274875,"size":274077623,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa776bd073847580a9290052c0346a90c888b8b1&amp;dn=Sommer+Sport+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"minsimak","files":6,"time":1215132096,"description":"Beach Volleyball: Slap on the sun block and head to the beach for this game! 8 Exotic locations from Brazil to Japan. 32 male and 32 female teams    from around the world. Smooth animated moves and stunning 3D graphics.    Multiplayer mode.\n\nBeach Soccer: Set for its first appearance in 2008 at the Olympics, try out this great sport game! 8 great world locations, 320 unique players from 32 international teams, golden goal and penalty shoot-outs, multiplayer mode.\n\nBody Boarding: Ride the waves 360 degrees with Mike Stewart, as you hit the surf in locations such as Hawaii and Tahiti!! 8 Characters, with hidden bonus characters as well plus 8 different body boards to choose from. With 15 tricks to master, the 3D effects of waves, water splashing ripples and spray means to will almost smell the sea!!\n\n5-a-Side Football: Head down to the park for some great football fun!! 32 teams with unique players, eight different locations, with spectacular 3D motion capturing.\n\nScooter Challenge: From Trafalgar Square in London to the Olympic stadium in Berlin, race your scooter in exciting world wide locations!! With training, single race and championship modes, and a variety of weather conditions, and multiplayer action.","torrent":{"xt":"urn:btih:fa776bd073847580a9290052c0346a90c888b8b1","amp;dn":"Sommer+Sport+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa776bd073847580a9290052c0346a90c888b8b1","infoHashBuffer":{"type":"Buffer","data":[250,119,107,208,115,132,117,128,169,41,0,82,192,52,106,144,200,136,184,177]},"announce":[],"urlList":[]}}