{"title":"Guy Klucevsek &amp; Phillip Johnston - Tales From The Cryptic","uid":4043949,"size":72043549,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa9aaff6f6a1cc1b7913c61569f4e90988985dde&amp;dn=Guy+Klucevsek+%26+Phillip+Johnston+-+Tales+From+The+Cryptic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dfcook","files":16,"time":1203809174,"description":"Recorded in France in 2002, Tales from the Cryptic is one of the most organic-sounding duet recordings to come from the jazz vanguard in years. Many of the pieces contained here were commissions for theater pieces or for the Cirque Lili in Paris, and thus, their point of origin has dictated the tight, rhythmic orientation of many of these short works. Phillip Johnston&amp;#039;s saxophone artistry is under-reported. He is a wondrous improviser on the soprano, as he melds various Eastern and Western European folk traditions into his playing. Guy Klucevsek is well-known for deconstructing everything from klezmer to pop standards in his quest for world accordion domination. Together they present a fiery, energetic duo for whom harmonic architectures are the stuff of the light fantastic; each piece feels like a dance, one that is simultaneously for the whirling dervish and the purposeful ballet acrobat. Nowhere here is there a better example of this than on the dizzying heights of &quot;Tulips Are Better Than One&quot; by Klucevsek. &quot;A Pear for Satie&quot; uses the namesake composer&amp;#039;s idea of dense, small themes and smaller variations for a tonal study in which the chording fretboard of the accordion becomes its elemental device for the melody line as well. There is no delineation made. Even as single notes are added and Johnston&amp;#039;s horn slips in the back door of the piece playing elongated though muted tones, they too are blended in not as melodic devices but further chordal extensions that add to the constricting feel of the track. The album closes with &quot;Blue Window,&quot; a radical reinvention of Strauss&amp;#039; &quot;Blue Danube Waltz.&quot; Johnston is Stan Getz to Klucevsek&amp;#039;s Lawrence Welk here, and the pulse and airiness of the tune becomes simultaneously a carnival attraction and lightly swinging jazz tune that keeps its melody intact, but striated, syncopated, and fragmenting more in each bar. Klucevsek&amp;#039;s reworking of the harmonic structure of the tune makes its break down into something that is equal parts 18th century European and postmodern jazz. This is a breathtaking recording, full of humor, warmth, tenderness, and plenty of instrumental fire that feels more like a live performance than a studio recording. Highly recommended.\n\n1 \tSpin Cycle \tKlucevsek \t4:20\n2 \tTulips Are Better Than One \tKlucevsek \t3:44\n3 \tAm-Scray \tJohnston \t4:38\n4 \tThe Gift \tKlucevsek \t5:26\n5 \tTrial By Error \tJohnston \t3:32\n6 \tPetite Ouverture a Danser \tSatie \t2:13\n7 \tA Pear for Satie \tKlucevsek \t4:28\n8 \tSlippin&amp;#039; on a Star \tJohnston \t4:56\n9 \tNo More Mr. Nice Guy \tKlucevsek \t5:21\n10 \tDer Leiermann \tSchubert \t3:07\n11 \tDiggin&amp;#039; Bones \tJohnston \t4:36\n12 \tA Goyish Kind of Blue \tKlucevsek \t4:51\n13 \tThe Road to Woy Woy \tJohnston \t4:22\n14 \tThe Needless Kiss \tJohnston \t4:40\n15 \tBlue Window \tIto, Klucevsek, Strauss \t3:50","torrent":{"xt":"urn:btih:fa9aaff6f6a1cc1b7913c61569f4e90988985dde","amp;dn":"Guy+Klucevsek+%26+Phillip+Johnston+-+Tales+From+The+Cryptic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa9aaff6f6a1cc1b7913c61569f4e90988985dde","infoHashBuffer":{"type":"Buffer","data":[250,154,175,246,246,161,204,27,121,19,198,21,105,244,233,9,136,152,93,222]},"announce":[],"urlList":[]}}