{"title":"24 Solo","uid":4100596,"size":4680841216,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fafeaff7414d32304fa1b2b0bdfc435d75ee1d75&amp;dn=24+Solo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Beetle_71","files":69,"time":1206558341,"description":"\\\\\\\\\\\\\\&quot;24 Solo\\\\\\\\\\\\\\&quot; is the latest effort by Gripped Films to cover the oftentimes wild and free-spirited world of competitive mountain biking. This effort is a race like you\\\\\\\\\\\\\\&amp;#039;ve never seen: riding a mountain bike over an 8-mile loop with 1,000 feet of climbing per lap, for 24 CONSECUTIVE hours. \n\nChris Eatough (EE-toff) won the 24 Hours of Adrenalin six years running, from 2000 to 2005. Jason Berry and his camera crews set out to cover Eatough\\\\\\\\\\\\\\&amp;#039;s training and competitive schedule leading up to the 2006 version of the race. The result is a supremely inspiring success. Using high-definition cameras, a wide selection of angles, and a helmet-mounted camera worn (or endured) by triathlete Nick Alexander, the Gripped crews manage to cover the basics of 24 hour mountain biking history, strategy, and preparation. By interviewing mountain biking legends such as Gary Fisher, Allison Dunlap, John Stamstad, and Hans Rey, Berry and company manage to convey the sense that it takes a special kind of insanity to even WANT to try this feat. \n\nOne of the setups to the race is a series of conversations with some of Eatough\\\\\\\\\\\\\\&amp;#039;s main competitors. One is particularly struck by the fact that the filmmakers interviewed Australian Craig Gordan in a hospital gown (pay attention to that fact, kids...the reason becomes apparent by the end of the film). Gripped Films obviously intended to document Eatough\\\\\\\\\\\\\\&amp;#039;s 7th consecutive victory, and thereby crown him the Lance Armstrong of his discipline. But by the end of the film, it\\\\\\\\\\\\\\&amp;#039;s obvious the race has rewritten the plot line in front of their eyes and supplied more drama than they could have hoped for (the drama is intensified skillfully by an all-original score by Haik Music). \n\nUnlike professional road cycling, where the competitors tend to be much more self-centered alpha male animals, \\\\\\\\\\\\\\&quot;24 Solo\\\\\\\\\\\\\\&quot; struck me as being about a bunch of very likable and very well-spoken young men who still have a very strong motivation to win. They understand what each other goes through, and the sheer agony of riding 24 hours straight is the bond that connects them all and allows them to respect each other\\\\\\\\\\\\\\&amp;#039;s accomplishments. You don\\\\\\\\\\\\\\&amp;#039;t HAVE to be a cycling fan to fully appreciate \\\\\\\\\\\\\\&quot;24 Solo\\\\\\\\\\\\\\&quot; (although it helps). You just have to be a fan of athletic competition and human endeavor. \n\n(PS: I won\\\\\\\\\\\\\\&amp;#039;t give away who won the race. But that individual did enough laps to have climbed Mount Everest. THAT is the most impressive feat of all).\n","torrent":{"xt":"urn:btih:fafeaff7414d32304fa1b2b0bdfc435d75ee1d75","amp;dn":"24+Solo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fafeaff7414d32304fa1b2b0bdfc435d75ee1d75","infoHashBuffer":{"type":"Buffer","data":[250,254,175,247,65,77,50,48,79,161,178,176,189,252,67,93,117,238,29,117]},"announce":[],"urlList":[]}}