{"title":"Chronicles of Narnia tt0363771 [Eng] 2005 [No PassWord] DVD .avi","uid":4044896,"size":1485714221,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb5c2532c9efab74d116c4503e2172fc867f180f&amp;dn=Chronicles+of+Narnia+tt0363771+%5BEng%5D+2005+%5BNo+PassWord%5D+DVD+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DougRH","files":7,"time":1203863368,"description":"Torrent: The Chronicles of Narnia - The Lion, the Witch and the Wardrobe\n tt0363771 (Eng) 2005 (No PassWord) DVD .avi .torrent\n\nMovie Title:  The Chronicles of Narnia - The Lion, the Witch and the Wardrobe\n \t\t\t\t\t\t\t tt0363771 [Eng] 2005 DVD .avi\n\nMovie Info:\thttp://imdb.com/title/tt0363771/\n\nGenre :\tAction / Adventure / Drama / Family / Fantasy\n\nTagLine:\tSome journeys take us far from home. \n\t\t\tSome adventures lead us to our destiny. \nRunTime :\t2:22\n\nPlot OutLine:   Four kids travel through a wardrobe to the land of Narnia and learn of their destiny to free it with the guidance of a mystical lion.  \nBased on the classic novel by &amp;#039;CS Lewis&amp;#039; . Four London children are sent to a professor&amp;#039;s country home in order for protection during World War II. There they find a magic wardrobe which leads to a mystical land called Narnia, which is being ruled by an evil witch. To defeat the witch, they must join forces with Aslan, the lion God of Narnia. Written by Brett Walter {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;aefddadccbcbdee8cfc09f9c98eecddd80cdc1c3&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt;} \nBased on the 2nd in the series of books by &amp;#039;CS Lewis&amp;#039; , &quot;The Lion, the Witch and the Wardrobe,&quot; the film tells the story of 4 children who go to live with an old professor during the war. One day, while playing hide and seek, Lucy, the youngest of the children, finds a wardrobe which leads to a magical land called Narnia. However Narnia is being ruled by the evil White Witch who has made it snow for 100 years and according to an old prophecy, Edmund, Lucy, Peter and Susan are the &quot;chosen ones&quot; who will defeat the Witch. They are assisted by the true ruler of Narnia, the lion, Aslan. With the good Narnians on their side all 4 children must now defeat the witch using all their strength and fulfill their destinies to become the new kings and queens of Narnia. Written by x_baby angel \nPeter, Susan, Edmund, and Lucy are deported from London to the house of an eccentric professor during World War II. They find life in the house extremely dull, until Lucy discovers a wardrobe that leads to a magical world called Narnia, where animals can talk and all are ruled over by the wise and benevolent lion Aslan. The others don&amp;#039;t believe her at first, but soon all of them go through the wardrobe and discover all is not well in Narnia. The land is being kept in a perpetual winter by the evil White Witch, Jadis, who turns anyone who doesn&amp;#039;t obey her into stone. The children join Aslan and the animals loyal to him in an attempt to vanquish Jadis. Written by rmlohner \nDuring the German air raids of WWII, the four Pevensie children - Peter, Susan, Edmund and Lucy - are sent out of London to take shelter at the country home of eccentric Prof. Digory Kirke, who happens to be the owner of a curious wardrobe. Peering into this wardrobe one day, Lucy finds herself in the snowy land of Narnia, which is mired in never-ending winter thanks to the magic of the evil White Witch, who has proclaimed that it will be always winter but never Christmas in the mystical land. Eventually the other Pevensies find themselves in Narnia, and the four children learn that they alone are the key to breaking the Witch&amp;#039;s eternal winter. But while three of them trudge through the snow with some helpful Beavers to join forces with Aslan, the mighty Lion, the fourth takes a more treacherous path and falls in league with the Witch... Written by mnemosyne23 \nAwards :\t12 wins including and Oscar &amp; 36 nominations.\nDirector :\tAndrew Adamson\nWriter (WGA):\t Ann Peacock (screenplay) and Andrew Adamson (screenplay) and Christopher Markus (screenplay) &amp; Stephen McFeely (screenplay)\n\n\t\n\nSeven files are included in this torrent : \n1 - The Chronicles of Narnia: The Lion, the Witch and the Wardrobe\n\t\t\t\t\t\t0363771 [Eng] 2005 DVD .avi\n2 - The Chronicles of Narnia:- The Lion, the Witch and the Wardrobe (2005) .Rtf \n\t\t\t\t\t(This file with the movie information)\n3 - Narnia- DVD disk image .jpg\n4 - Narnia- DVD case front cover .Jpg\n5 - Narnia- DVD case back cover .Jpg\n6 - Narnia- Scene Selections .Jpg\n7 - More aNuBiS Rips.nfo\n\n\nEnjoy    (&lt; 8)\n  DougRH\nPS. Time and HDD space permiting, upon a friendly request, I MAY put a complete DVD image file [*.iso, *nrg] up for you  once and then delete it if you will then continue to seed the disk image after you have it, AND if you also request that others that you seed it for continue to seed it as well.\n","torrent":{"xt":"urn:btih:fb5c2532c9efab74d116c4503e2172fc867f180f","amp;dn":"Chronicles+of+Narnia+tt0363771+%5BEng%5D+2005+%5BNo+PassWord%5D+DVD+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb5c2532c9efab74d116c4503e2172fc867f180f","infoHashBuffer":{"type":"Buffer","data":[251,92,37,50,201,239,171,116,209,22,196,80,62,33,114,252,134,127,24,15]},"announce":[],"urlList":[]}}