{"title":"Still Time - Stream of Consciousness","uid":4051039,"size":127967430,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc0da9d993739d6bd2dc6cfaa84b970646ecbb73&amp;dn=Still+Time+-+Stream+of+Consciousness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stilltime","files":16,"time":1204157811,"description":"IF YOU LIKE WHAT YOU HEAR, PLEASE SUPPORT US AT:\n\nWWW.STILLTIMEMUSIC.COM\n\n\n\nStill Time - Stream of Consciousness - Track Listing:\n\n1.  Chuck Johnson Spure\n2.  9 to 5\n3.  Power of Now\n4.  Memory Lane\n5.  High Tide\n6.  Fall and Rise\n7.  First Date\n8.  Know Your Roots\n9.  Sleep\n10. Stream Of Consciousness\n11. American Dream\n12. Uncle Sam\\&amp;#039;s Waltz\n13. People See\n14. The Fabulous Life\n\n\n\nStill Time, based out of San Luis Obispo, CA., has just begun to attract the ear of audiences around the world. Since forming in 2004, Still Time has grown from a hugely popular local band to a group that has captivated listeners worldwide with their energetic grooves, all through a grass roots and word of mouth process.\n\nCombining elements of classic rock, folk, jazz, and reggae, Still Time has enjoyed sharing their eclectic style on stage with such bands as Ziggy Marley, Robert Randolph, Steel Pulse, Pepper, Ozomatli, ALO, One Republic, David Lindley, Strung Out, and The Expendables, rocking audiences of 3,000+ at their largest venues.\n\nStill Time has also caught the attention of radio stations in Northern and Central California with their single \\&quot;High Tide\\&quot;. The song was added by San Luis Obispo radio station New Rock 107.3 and was the station\\&amp;#039;s 1 most played song for over seven weeks. \\&quot;High Tide\\&quot; has been in New Rock\\&amp;#039;s regular rotation for two years now, a feat that no other local band has achieved. In addition, Still Time has been featured on San Luis Obispo\\&amp;#039;s Coast 101.3 and the Santa Cruz radio station KPIG 107.5.\n\nThe band\\&amp;#039;s most recent catalyst has been their debut album, Stream of Consciousness released in November of 2007, which sold 1,000 copies in the first 2 months. The recent success of Still Time is a testament to the potency of their talent. It is proof of their ability to not only create great music, but to bring together people from various musical backgrounds to enjoy a positive, high energy show.\n\n\n","torrent":{"xt":"urn:btih:fc0da9d993739d6bd2dc6cfaa84b970646ecbb73","amp;dn":"Still+Time+-+Stream+of+Consciousness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc0da9d993739d6bd2dc6cfaa84b970646ecbb73","infoHashBuffer":{"type":"Buffer","data":[252,13,169,217,147,115,157,107,210,220,108,250,168,75,151,6,70,236,187,115]},"announce":[],"urlList":[]}}