{"title":"Internet_Password_Lock Full - MaMuNi.rar","uid":4048819,"size":882977,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fc1dc803db4e24fa622b64af926a421dc66beac0&amp;dn=Internet_Password_Lock+Full+-+MaMuNi.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MaMuNi","files":1,"time":1204054649,"description":"Internet Lock\nPassword protects internet connection and internet programs: Internet Explorer, Firefox, MSN Messenger, Outlook...\n\nInternet Lock is the access control and password protection solution for your internet connections and programs. By using Internet Lock, you can password protect any program from accessing internet, you also can block any internet program.\n\nInternet Lock can password protect or block any kind of internet programs from accessing internet, for example: password protects all web browsers including Internet Explorer, Firefox, AOL etc.\n\nInternet Lock provides an easy-to-use wizard to help you to protect internet connections, for example &quot;Password Protect All Web Browsers&quot;, &quot;Password Protect All Email Clients&quot;, &quot;Deny All FTP Programs&quot; etc.\n\nInternet Lock supports schedule options, supports to protect port ranges. Internet Lock works in low level driver mode, it will never slow down the connection speeds. \n\nPassword protects internet programs from accessing internet.\n\nWhen a protected program trying to connect to internet, Internet Lock pops up a password dialog box, ask user to provide the correct password. If the user can not provide the password or the password she/he entered was incorrect, Internet Lock blocks the connection and the program will be denied from accessing internet.\n\n    * Web browsers: Internet Explorer, Firefox and so on.\n    * Email clients: Outlook, Outlook Express...\n    * FTP programs.\n    * MSN Messenger, AOL Instant Messenger etc.\n    * Any other internet programs.\n\nDeny any internet program from accessing internet.\n\nNot only can it password protect internet programs, but also Internet Lock can deny those programs from accessing internet directly. A program will not be allowed to access internet if you blocked it by using Internet Lock.\n\nAny program can be protected by Internet Lock: Web browsers, Email clients, FTP programs, Instant Messengers...\nProtects any kind of internet programs.\n\nIf you want to protect the web browsers, it&amp;#039;s not enough to just protect the Internet Explorer, because users can still use other web browsers to access internet, like the Firefox. So you protect the Firefox, but what about the other web browsers (AOL, Opera...)? What about the browsers that will be released after you protected those known browsers?\n\nInternet Explorer, Firefox, AOL, Opera...Those software are all web browsers, We must have a way to simply protect them all and should never worry about the new-released browsers. The same problem also will happen to the email client programs (Outlook, Outlook Express...).\n\nInternet Lock can protect any kind of programs. If you let it to protect all web browsers, then it will protect all known and unknown, existed and coming web browser programs. If you let it to protect all email clients, then it will protect Outlook, Outlook Express, Thunderbird and so on.\nDeny all programs from accessing internet, only allow the programs you specified.\n\nBy changing its default action to &quot;deny the connection&quot;, Internet Lock will deny all internet programs from accessing internet, only the programs you allowed will be able to access internet.\n\n ","torrent":{"xt":"urn:btih:fc1dc803db4e24fa622b64af926a421dc66beac0","amp;dn":"Internet_Password_Lock+Full+-+MaMuNi.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc1dc803db4e24fa622b64af926a421dc66beac0","infoHashBuffer":{"type":"Buffer","data":[252,29,200,3,219,78,36,250,98,43,100,175,146,106,66,29,198,107,234,192]},"announce":[],"urlList":[]}}