{"title":"Fools.Gold.CAM.XViD-CAMERA","uid":4021869,"size":720815082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc92235a843b61128f674925514ad737e2bfe22c&amp;dn=Fools.Gold.CAM.XViD-CAMERA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"crrarbasuts","files":1,"time":1202696741,"description":"Fools Gold stars Matthew McConaughey as Ben Finn Finnegan, a good-natured, surf bum-turned-treasure hunter who is obsessed with finding the legendary 18th century Queens Dowry -- 40 chests of exotic treasure that was lost at sea in 1715. In his quest, Finn has sunk everything he has, including his marriage to Tess Finnegan (Kate Hudson) and his more-rusty-than-trusty salvage boat, Booty Calls. Just as Tess has begun to rebuild her life, working aboard a mega-yacht owned by billionaire Nigel Honeycutt (Donald Sutherland), Finn discovers a vital clue to the treasures whereabouts. Certain that his luck will change with the newfound information, Finn maneuvers himself aboard Nigels yacht and, using his good-natured charm, convinces the tycoon and his Blackberry-wielding, celebutante daughter, Gemma (Alexis Dziena), to join him in the pursuit of the Spanish treasure. Against Tess better judgment, the search rekindles her loveof discovery. But they are not the only ones after the treasure. Finns mentor-turned-nemesis Moe Fitch (Ray Winstone) has also set out to claim the prize. \n","torrent":{"xt":"urn:btih:fc92235a843b61128f674925514ad737e2bfe22c","amp;dn":"Fools.Gold.CAM.XViD-CAMERA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc92235a843b61128f674925514ad737e2bfe22c","infoHashBuffer":{"type":"Buffer","data":[252,146,35,90,132,59,97,18,143,103,73,37,81,74,215,55,226,191,226,44]},"announce":[],"urlList":[]}}