{"title":"Sex and the City (2008)_watch_today","uid":4275049,"size":734806571,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:fd5c7292bec7d3104989708096d2617e7183b5d3&amp;dn=Sex+and+the+City+%282008%29_watch_today&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"faxi21","files":1,"time":1215141357,"description":"Sex and the City. Watch now. After moving in together in an impossibly beautiful New York apartment, Carrie Bradshaw and Mr. Big make a rather arbitrary decision to get married. The wedding itself proves to be anything but a hasty affair--the guest list quickly blooms from 75 to 200 guests, and Carrie&amp;#039;s simple, label-less wedding gown gives way to an enormous creation that makes her look like a gigantic cream puff. An upcoming photo spread in Vogue puts the event--which will take place at the New York Public Library--squarely in the public eye. Meanwhile, Carrie&amp;#039;s girlfriends--Samantha, the sexpot; Charlotte, the sweet naÃƒÂ¯f; and Miranda, the rigid perfectionist--could not be happier. At least, they couldn&amp;#039;t be happier for Carrie. Charlotte still has the unrealized hope of getting pregnant. Samantha is finding a loving, committed relationship more grueling than she could have imagined. Miranda unwittingly lets her own unhappiness--created when Steve admits to cheating on her just once--spoil Carrie&amp;#039;s. After a heated encounter with Steve, she happens to spot Mr. Big and tells him he&amp;#039;s crazy to get married. She&amp;#039;s really only thinking of her own marriage. But her angry remark gets Mr. Big to thinking","torrent":{"xt":"urn:btih:fd5c7292bec7d3104989708096d2617e7183b5d3","amp;dn":"Sex+and+the+City+%282008%29_watch_today","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd5c7292bec7d3104989708096d2617e7183b5d3","infoHashBuffer":{"type":"Buffer","data":[253,92,114,146,190,199,211,16,73,137,112,128,150,210,97,126,113,131,181,211]},"announce":[],"urlList":[]}}