{"title":"Yager 2cd rip [WmC]","uid":3326231,"size":1162575872,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd8128a048a4de4298b98aa1af11945bd1eec9b2&amp;dn=Yager+2cd+rip+%5BWmC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WmC-PL","files":2,"time":1115333445,"description":"Title:\n\tYager *DVD-RIP* \t\nUrl:\n\thttp://www.yager.tv/\nGroup:\n\tMyth\nReleased:\n\tFriday September 26th, 2003\nSize:\n\t2 CDs\n\n\nSupport the software companies. If you play this game BUY it!\n\n    Game Notes:\n    ~~~~~~~~~~~\n\n    Yager captures your imagination as you battle for your life in\n    tomorrow's hostile skies. But is it all what it seems...? Keep\n    your wits about you, and use what you learn, as your struggle\n    evolves to become the fight against constitutional power,\n    conspiracy and control. With the genre-busting mix of 3D\n    action-adventure and air combat, coupled with the highly\n    motivating storyline and nail-biting campaigns, Yager is next\n    generation gaming at its finest.\n\n    In single-player-mode widely varied missions deriving from the\n    context of a thrilling plot, breathtaking 3D-action and elements\n    of adventure will create a unique atmosphere you can hardly escape.\n    You'll become the key figure in a complex science fiction story.\n    The storyline evolves as you advance, letting the characters you\n    meet respond to your actions and behaviour.\n\n    You play as Magnus Tide, fighter pilot. Your mission is to survive.\n    Win life-threatening dogfights against top aces, infiltrate enemy\n    hiding places, race at speed through the skies against outlaws in\n    their highly tuned machines, dive and attack your enemies... There\n    are furious battles to be fought. You will need skill, stealth and\n    sheer guts. Have you got what it takes? Do you accept the challenge?\n\n    Ripped:\n    ~~~~~~~\n\n    Movies.\n\n\n    Additional information:\n    ~~~~~~~~~~~~~~~~~~~~~~~\n\n    It's easy to say that clean images go to iso sites and ripped\n    releases go to 0day sites, but this has already been blurred\n    out in i.e. the movie scene and console scene. An iso\n    image, ripped from a dvd, doesn't belong on rip sites. The\n    game developers have given us a couple of DVD releases\n    already, and this isnt the last time they will pick DVD\n    as medium over CDs. As natural evolution brought us\n    releases on CDs, they have brought us releases on DVDs. \n    \n    Ripping DVD games to CDs is a step of this evolution, and\n    both the groups and the site will have to adjust. MYTH realizes\n    this, and hereby brings you its first DVDrip. Enjoy!\n\n    \n    Read this NFO properly!\n\n1. Unrar.\n2. Install.\n3. Start the game with ylaunch.exe\n\n    Always remember:\n    ~~~~~~~~~~~~~~~~\n    We do this just for FUN. We are against any profit or commercialisation\n    of piracy. We do not spread any release, others do that.\n    In fact, we BUY all our own games with our own hard earned and worked for\n    efforts. Which is from our own real life non-scene jobs.\n    As we love game originals. Nothing beats a quality original.\n\n    If you like this game, BUY it. We did!\n","torrent":{"xt":"urn:btih:fd8128a048a4de4298b98aa1af11945bd1eec9b2","amp;dn":"Yager+2cd+rip+%5BWmC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd8128a048a4de4298b98aa1af11945bd1eec9b2","infoHashBuffer":{"type":"Buffer","data":[253,129,40,160,72,164,222,66,152,185,138,161,175,17,148,91,209,238,201,178]},"announce":[],"urlList":[]}}