{"title":"Kaze no Tani no Naushika","uid":4106051,"size":215162299,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdbdeecc67467665231144c04fe8819be37ee3ed&amp;dn=Kaze+no+Tani+no+Naushika&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"razevedo","files":1,"time":1206812266,"description":"n the far future, a thousand years after a nuclear war left the Earth as a nuclear holocaust. The Valley of the Wind, a small kingdom ruled by King Jil struggles for survival as the community tries to defend the Valley from gigantic Ohm creatures and toxic plants that live beyond the Valley in the Sea of Decay, whilst Jil&amp;#039;s daughter and heiress to the throne, Princess Nausicaa tries to understand and feels it is wrong to destroy the toxic jungle. The Valley is attacked by the Tolmekian people who plan to destroy the Sea of Decay by using the greatest warriors that started the holocaust. After Nausicaa is taken prisoner, Nausicca escapes and goes beneath the Sea of Decay where she discovers the toxic plants are not poisoning the air and are purifying the world by draining the air of radiation and toxins. With everything at stake, Nausicaa unites with the Ohms and set out to the Valley and foil the Tolmekians plan of unleashing the Great Warrior which will start another holocaust.  Written by Daniel Williamson ","torrent":{"xt":"urn:btih:fdbdeecc67467665231144c04fe8819be37ee3ed","amp;dn":"Kaze+no+Tani+no+Naushika","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdbdeecc67467665231144c04fe8819be37ee3ed","infoHashBuffer":{"type":"Buffer","data":[253,189,238,204,103,70,118,101,35,17,68,192,79,232,129,155,227,126,227,237]},"announce":[],"urlList":[]}}