{"title":"Cowboy Junkies 2001-08-15 @ Villar Center - Beaver Creek, CO","uid":4057796,"size":619750803,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fdfab12dc970f0b7e2bbd7d0207f6032d7a03507&amp;dn=Cowboy+Junkies+2001-08-15+%40+Villar+Center+-+Beaver+Creek%2C+CO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Foolishness","files":25,"time":1204418133,"description":" This show comes from the Open tour, one of my favorite tours, and the first where I really caught a lot of shows. The band played the KBCO Kinetics show in May here in Colorado, which I went to, as well as an in-store mini-gig at Twist and Shout that I saw. In August, I and my husband decided to take our vacation on tour with the band, first driving up to Bozeman. The show at Beaver Creek was the second of the five we would see in one week.\n\nThe Beaver Creek show was a little strange. The venue was very upscale, as was the crowd attending it. The venue is right at the base of Beaver Creek ski area. After eating a wonderful fondue dinner at a Swiss restaurant, we went back into the venue, which kindly let me us in early to set up the taping gear.\n\nThe place was rather cavernous. The height from floor to ceiling must have been 50-60 feet, but the length wasn&amp;#039;t too great. I set up the gear in the first three rows and aimed the mics high, towards the monitors hanging from the ceiling, but low enough that they also got some of the sound from the stage. The tape turned out quite well.\n\nDespite my usually justified apprehensions, this show turned out to be great. The audience was whisper-quiet during the songs, unlike the following three. The band seemed energized, and the setlist they came up with was truly stunning. Opening with the River Song Trilogy, they delivered one of their finest performances of the tour, and included several rarely played songs, like &quot;Witches&quot; and &quot;Upon Still Waters.&quot;\n\nI&amp;#039;m extremely excited to present this show to my fellow llamas, and hope you enjoy it as much as I did.","torrent":{"xt":"urn:btih:fdfab12dc970f0b7e2bbd7d0207f6032d7a03507","amp;dn":"Cowboy+Junkies+2001-08-15+%40+Villar+Center+-+Beaver+Creek%2C+CO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdfab12dc970f0b7e2bbd7d0207f6032d7a03507","infoHashBuffer":{"type":"Buffer","data":[253,250,177,45,201,112,240,183,226,187,215,208,32,127,96,50,215,160,53,7]},"announce":[],"urlList":[]}}