{"title":"Pinnacle Hollywood FX Pro 5.2 (The Joker)","uid":4135176,"size":78792879,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fe4c2c806f20093921d6a5de7d13c8167d89b5e6&amp;dn=Pinnacle+Hollywood+FX+Pro+5.2+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jokeri1971","files":3,"time":1208227659,"description":"Create stunning 3D transitions, titles and animation effects with Pinnacle Hollywood FX Pro version 5, the powerful creative tool for Pinnacle Edition, Pinnacle Studio and Pinnacle Liquid Systems. Packed with over 400 exciting 3D effects and transitions, Pinnacle Hollywood FX Pro version 5 gives you more creative freedom than any other application in its class. \n\nFeatures Include:\n\nAdvanced Keyframe Editing - Hollywood FX Pro gives you full keyframe editing of flight paths and every parameter through its advanced keyframe editor. HFX Pro includes advanced shift and scale tools as well as spline curve presets. \n\nCompatible with major editing tools - Hollywood FX Pro is comaptible with all you favourite editing tools like Pinnacle Edition DV, Adobe Premiere, Avid MCXpress/Xpress/Composer/Symphony, in:sync Speed Razor, Fast Video Machine &amp; 601, Ulead Media Studio Pro, Media 100 &amp; Finish, DPS Video Action Pro/Velocity, Panasonic DVEdit &amp; NewsByte, Sony ES-3. \n\nConvenient Control - With every transition you can change flight direction, lighting, shadows, shine, motion blur, trails and antialiasing with the click of the mouse. \n\nCreate Your Own FX - Hollywood FX Pro provides a full set of tools to quickly and easily create your own FX. Use with one of over 300 FX that come with HFX Pro, or start from scratch and use advanced tools like object cloning to create incredible 3D transitions, MultiWindow FX, and 3D composites in minutes. \n\nEasy To Use - Simply drag-and-drop Hollywood FX Pro into your timeline like any other transition. The HFX dialog will appear and you can select a transition and change your options. \n\nInstant feedback - Instant feedback while designing a composite is crucial for today&amp;#039;s projects. Hollywood FX&amp;#039;s interface has been designed to allow quick alteration. You want that ball to fly off the top without re-keying, simply rotate the easy direction dial. \n\nMedia Control - In addition to transitions, Hollywood FX Pro includes a wide range of 3D MultiWindow Effects with additional video sources that can be mapped easily onto objects in HFX. \n\nOrganised - Transitions are organised into convenient categories with icons that let you find the transition you want instantly. You can even reorganise effects into your own categories. \n\nPlugin Power - Hollywood FX Pro includes a basic set of image filters and 3D warp plugins to add real power to customize any FX. Explode, peel, ripple or twist any 3D object. Use chroma key with any media. \n\nSurfaces - Surfaces of 3D objects can be mapped with video or simple colours to create an incredible variety of FX. You have full control over basic colour, luminous colour, and shine. \n\nMinimum System Requirements:\n\nWindows 95, 98, NT, 2000 \n90 Mhz Intel Pentium or faster \nCeleron, 16 or 24 bit colour display 800 x 600 \n64MB RAM (or more) \n100+ MB free hard drive space \nCD-ROM drive\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:fe4c2c806f20093921d6a5de7d13c8167d89b5e6","amp;dn":"Pinnacle+Hollywood+FX+Pro+5.2+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4c2c806f20093921d6a5de7d13c8167d89b5e6","infoHashBuffer":{"type":"Buffer","data":[254,76,44,128,111,32,9,57,33,214,165,222,125,19,200,22,125,137,181,230]},"announce":[],"urlList":[]}}