{"title":"Harry Potter and the Philosopher's Stone","uid":4273086,"size":211732098,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fe755c17d33fdfda3fbc4e22e855c56ec12af7a3&amp;dn=Harry+Potter+and+the+Philosopher%5C%27s+Stone++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kingswoodtown","files":1,"time":1215039227,"description":" Harry Potter and the Philosopher&amp;#039;s Stone\n\n\nLeave the nonmagical world behind and enroll in Hogwarts School of Witchcraft \nand Wizardry in Harry Potter \nand the Philosopher&amp;#039;s Stone for the PC. Be Harry Potter, wizard-in-training, learning to master all things \nmagical in a world filled with adventure, fun, and danger. Encounter breathtaking challenges and unforgettable \ncharacters from J.K. Rowling&amp;#039;s worldwide bestseller.\n\nPlayers take the role of Harry Potter as he enrolls in Hogwarts and embarks on a journey to unlock the \nsecrets of his own magical abilities. Along the way, Harry will explore the halls of Hogwarts and its surrounding grounds, study to be a wizard, learn Quidditch, collect objects to solve puzzles, become skilled at spells and potions, discover secret passages and locations, and interact with memorable characters from J.K. Rowling&amp;#039;s magical world.\n\nThe PC version features an array of stealth-based gameplay as well as traditional encounters \nas players guide Harry through the halls of Hogwarts, \nsneaking around to avoid confrontations with nosey characters like Filch and Peeves.\n\nMany of the adventures in the PC version are dynamic, leading to environments\nthat change over time,\nsuch as moving stairs and relocating classrooms.\nThe PC version also features a fast, arcade-style Quidditch game to further \nimmerse players in the magical world of Harry Potter. Harry Potter and the Philosopher&amp;#039;s Stone will be developed for the\n\nPC with ease of play in mind. The simple interface will consist of just the mouse and one key on \nthe keyboard. \n\nThe required system specifications will be minimal, ensuring that Harry Potter&amp;#039;s biggest fans can easily \ninstall and play his latest interactive adventure.\n\n\n\n* Fully navigable 3D environments\n* Stealth-based gameplay sneak around, avoiding unpleasant encounters and   unwanted guests\n* Interact with over twenty unforgettable characters from J.K. Rowling?s magical world\n* Lead your house to victory in a fast-paced, arcade-style Quidditch match\n* Four key types of obstacles and challenges\n* Environments change as time passes. Stairs move and classrooms relocate\n* Single-player game","torrent":{"xt":"urn:btih:fe755c17d33fdfda3fbc4e22e855c56ec12af7a3","amp;dn":"Harry+Potter+and+the+Philosopher%5C%27s+Stone++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe755c17d33fdfda3fbc4e22e855c56ec12af7a3","infoHashBuffer":{"type":"Buffer","data":[254,117,92,23,211,63,223,218,63,188,78,34,232,85,197,110,193,42,247,163]},"announce":[],"urlList":[]}}