{"title":"Battlestar Galactica - Escape Velocity.S04E04.edshrinker.AVI","uid":4156917,"size":308497432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fedadba07759ff06e73a737000ad651edaa9c8e8&amp;dn=Battlestar+Galactica+-+Escape+Velocity.S04E04.edshrinker.AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edshrinker","files":1,"time":1209188347,"description":"Battlestar Galactica - Escape Velocity.S04E04.edshrinker.avi\n\nI was in the right mood for this one after Alex&amp;#039;s execution on LOST and Cally here last week.  All I can say is, it may be fiction, but these eps cause me an overwhelming desire to pray.\n\nEnjoy Folks! \n\n\nCast and Crew\n\nWriter: \tJane Espenson\nDirector: \tEdward James Olmos\nStar: \tEdward James Olmos (William Adama),  Tricia Helfer (Number Six/Caprica Six),  James Callis (Gaius Baltar),  Katee Sackhoff (Kara &quot;Starbuck&quot; Thrace),  Grace Park (Sharon Valerii/Sharon &quot;Athena&quot; Agathon),  Jamie Bamber (Lee &quot;Apollo&quot; Adama),  Mary McDonnell (Laura Roslin)\n\nSee all Escape Velocity Cast &amp; Crew Ã‚Â»\nNotes\nThis is the third episode of the series that Edward James Olmos has directed. He also directed the Season 1 episode &quot;Tigh Me Up, Tigh Me Down&quot; and the Season 3 episode &quot;Taking a Break from All Your Worries.&quot;\n\nScore:  9.8  Superb  0 votes\n\t\nEscape Velocity\n\nEpisode Number: 65                    Season Num: 4    \nFirst Aired: Friday April 25, 2008    Prod Code: n/a\n\nCast &amp; Characters  |  Writers, Directors &amp; Crew\n\nStars\n\nJamie Bamber\nRole: Lee &quot;Apollo&quot; Adama\n\nJamie St. John Bamber Griffith Was born in Hammersmith, London, UK on April 3rd 1973. He grew up both in France and England. His father, Ralph, is a native of Detroit, Michigan. His mother, Elizabeth, is a native of Northern Ireland. Jamie has five brothers and one sister.\n\nMary McDonnell\nRole: Laura Roslin\nMary McDonnell was reknowned for her stage work on the East Coast, working with the Long Wharf Theatre Co., amongst others. It wasn&amp;#039;t until 20 years after working on the theatre stage that she had her break through role in Costner&amp;#039;s &quot;Dances With Wolves.&quot;\n\nGrace Park\nRole: Sharon Valerii/Sharon &quot;Athena&quot; Agathon\n\nThe actress Grace Park was born on March 6, 1979, in Los Angeles, California. Her family moved to Vancouver in Canada when she was 22 months old. Grace considers herself to be a Canadian, while also recognizing her Korean heritage. Before she began acting, she used to work as a model. She... Read More\n\nKatee Sackhoff\nRole: Kara &quot;Starbuck&quot; Thrace\nKatee was born Kathryn Ann Sackhoff on April 8, 1980 in Portland Oregon. At the age of six, she started participating in dance classes as well as drama classes. She later went on to star in many of her high school&amp;#039;s productions, including Bye Bye Birdie, Oliver, and Fiddler on the Roof. ... Read More\n\nTricia Helfer\nRole: Number Six/Caprica Six\nTricia was born in Donalda, Alberta, Canada, and raised there on her family&amp;#039;s grain farm. She started modeling at the age of 16 after being noticed by a modeling agency scout. while waiting in line at a movie theatre near her home. At the age of 19 she signed was to the Elite modeling agency. She... Read More\n\nJames Callis\nRole: Gaius Baltar\nJames Callis was born in London (UK) in 1971. He grew up in his birth place, where he attended Harrow school in north west London. In 1993 he graduated from University of York with a BA in English and realated litterature. He was accepted at London Academy of Music &amp; Dramatic Arts (LAMDA) and... Read More\n\nEdward James Olmos\nRole: William Adama\nEdward&amp;#039;s mother, Eleanor Huizar, met his father, Pedro Olmos, in Mexico City. They married and raised three children: Peter, Edward, and Esperanza. His parents divorced when he was eight, and Edward spent his leisure time playing baseball as a means of staying away from drugs and gang-life. ... ","torrent":{"xt":"urn:btih:fedadba07759ff06e73a737000ad651edaa9c8e8","amp;dn":"Battlestar+Galactica+-+Escape+Velocity.S04E04.edshrinker.AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fedadba07759ff06e73a737000ad651edaa9c8e8","infoHashBuffer":{"type":"Buffer","data":[254,218,219,160,119,89,255,6,231,58,115,112,0,173,101,30,218,169,200,232]},"announce":[],"urlList":[]}}